title: AWS EC2 Startup Shell Script Change
id: 1ab3c5ed-5baf-417b-bb6b-78ca33f6c3df
status: test
level: high
author: faloker
description: Detects changes to the EC2 instance startup script. The shell script
    will be executed as root/SYSTEM every time the specific instances are booted up.
references:
    - https://github.com/RhinoSecurityLabs/pacu/blob/866376cd711666c775bbfcde0524c817f2c5b181/pacu/modules/ec2__startup_shell_script/main.py#L9
falsepositives:
    - Valid changes to the startup script
tags:
    - attack.execution
    - attack.t1059.001
    - attack.t1059.003
    - attack.t1059.004
date: '2020-02-12'
modified: '2022-06-07'
logsource:
    product: aws
    service: cloudtrail
detection:
    selection_source:
        eventSource: ec2.amazonaws.com
        requestParameters.attribute: userData
        eventName: ModifyInstanceAttribute
    condition: selection_source
ocsf_mapping:
    class_name: script_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-12-04T01:39:21.416645+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-12-04T01:39:21.416645+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: script_activity
            target_field: metadata.product.name
            mapped_at: '2025-12-04T01:39:21.416660+00:00'
        -   source_field: requestParameters.attribute
            target_table: script_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:39:21.416662+00:00'
        -   source_field: eventName
            target_table: script_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:39:21.416664+00:00'
