title: Restore Public AWS RDS Instance
id: c3f265c7-ff03-4056-8ab2-d486227b4599
status: test
level: high
author: faloker
description: Detects the recovery of a new public database instance from a snapshot.
    It may be a part of data exfiltration.
references:
    - https://github.com/RhinoSecurityLabs/pacu/blob/866376cd711666c775bbfcde0524c817f2c5b181/pacu/modules/rds__explore_snapshots/main.py
falsepositives:
    - Unknown
tags:
    - attack.exfiltration
    - attack.t1020
date: '2020-02-12'
modified: '2022-10-09'
logsource:
    product: aws
    service: cloudtrail
detection:
    selection_source:
        eventSource: rds.amazonaws.com
        responseElements.publiclyAccessible: 'true'
        eventName: RestoreDBInstanceFromDBSnapshot
    condition: selection_source
ocsf_mapping:
    class_name: datastore_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-12-04T01:39:08.293472+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-12-04T01:39:08.293472+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: datastore_activity
            target_field: metadata.product.name
            mapped_at: '2025-12-04T01:39:08.293496+00:00'
        -   source_field: responseElements.publiclyAccessible
            target_table: datastore_activity
            target_field: databucket.is_public
            mapped_at: '2025-12-04T01:39:08.293498+00:00'
        -   source_field: eventName
            target_table: datastore_activity
            target_field: api.operation
            mapped_at: '2025-12-04T01:39:08.293499+00:00'
