id: db014773-b1d3-46bd-ba26-133337c0ffee
title: AWS IAM S3Browser LoginProfile Creation
status: test
level: high
description: Detects S3 Browser utility performing reconnaissance looking for existing
    IAM Users without a LoginProfile defined then (when found) creating a LoginProfile.
author: daniel.bohannon@permiso.io (@danielhbohannon)
date: '2023-05-17'
tags:
    - attack.execution
    - attack.persistence
    - attack.t1059.009
    - attack.t1078.004
references:
    - https://permiso.io/blog/s/unmasking-guivil-new-cloud-threat-actor
falsepositives:
    - Valid usage of S3 Browser for IAM LoginProfile listing and/or creation
taxonomy: sigma
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: iam.amazonaws.com
        eventName:
            - GetLoginProfile
            - CreateLoginProfile
        userAgent|contains: S3 Browser
    condition: selection
ocsf_mapping:
    class_name: api_activity
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-11-13T20:17:50.347956+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-11-13T20:17:50.347956+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: api_activity
            target_field: metadata.product.name
            mapped_at: '2025-11-13T20:17:50.347980+00:00'
        -   source_field: eventName
            target_table: api_activity
            target_field: action
            mapped_at: '2025-11-13T20:17:50.347983+00:00'
        -   source_field: userAgent
            target_table: api_activity
            target_field: http_request.user_agent
            mapped_at: '2025-11-13T20:17:50.347986+00:00'
