id: 6e61ee20-ce00-4f8d-8aee-bedd8216f7e3
title: AWS GuardDuty Important Change
status: test
level: high
description: Detects updates of the GuardDuty list of trusted IPs, perhaps to disable
    security alerts against malicious IPs.
author: faloker
date: '2020-02-11'
modified: '2022-10-09'
tags:
    - attack.defense-evasion
    - attack.t1562.001
references:
    - https://github.com/RhinoSecurityLabs/pacu/blob/866376cd711666c775bbfcde0524c817f2c5b181/pacu/modules/guardduty__whitelist_ip/main.py#L9
falsepositives:
    - Valid change in the GuardDuty (e.g. to ignore internal scanners)
taxonomy: sigma
logsource:
    product: aws
    service: cloudtrail
detection:
    selection_source:
        eventSource: guardduty.amazonaws.com
        eventName: CreateIPSet
    condition: selection_source
ocsf_mapping:
    class_name: file_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-11-26T02:22:30.227814+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-11-26T02:22:30.227814+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:22:30.227833+00:00'
        -   source_field: eventName
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:22:30.227836+00:00'
