id: abae8fec-57bd-4f87-aff6-6e3db989843d
title: AWS Snapshot Backup Exfiltration
status: test
level: medium
description: Detects the modification of an EC2 snapshot's permissions to enable access
    from another account
author: Darin Smith
date: '2021-05-17'
modified: '2021-08-19'
tags:
    - attack.exfiltration
    - attack.t1537
references:
    - https://www.justice.gov/file/1080281/download
falsepositives:
    - Valid change to a snapshot's permissions
taxonomy: sigma
logsource:
    product: aws
    service: cloudtrail
detection:
    selection_source:
        eventSource: ec2.amazonaws.com
        eventName: ModifySnapshotAttribute
    condition: selection_source
ocsf_mapping:
    class_name: file_activity
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-11-26T02:22:25.048730+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-11-26T02:22:25.048730+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:22:25.048742+00:00'
        -   source_field: eventName
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:22:25.048744+00:00'
