id: 8ad1600d-e9dc-4251-b0ee-a65268f29add
title: AWS Root Credentials
status: test
level: medium
description: Detects AWS root account usage
author: vitaliy0x1
date: '2020-01-21'
modified: '2022-10-09'
tags:
    - attack.privilege-escalation
    - attack.t1078.004
references:
    - https://docs.aws.amazon.com/IAM/latest/UserGuide/id_root-user.html
falsepositives:
    - AWS Tasks That Require AWS Account Root User Credentials https://docs.aws.amazon.com/general/latest/gr/aws_tasks-that-require-root.html
taxonomy: sigma
logsource:
    product: aws
    service: cloudtrail
detection:
    selection_usertype:
        userIdentity.type: Root
    selection_eventtype:
        eventType: AwsServiceEvent
    condition: selection_usertype and not selection_eventtype
ocsf_mapping:
    class_name: authentication
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-11-26T02:22:53.562400+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-11-26T02:22:53.562400+00:00'
    detection_fields:
        -   source_field: userIdentity.type
            target_table: authentication
            target_field: actor.user.type
            mapped_at: '2025-11-26T02:22:54.481055+00:00'
        -   source_field: eventType
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:22:54.481064+00:00'
