title: Potential Bucket Enumeration on AWS
id: f305fd62-beca-47da-ad95-7690a0620084
status: test
level: low
author: Christopher Peacock @securepeacock, SCYTHE @scythe_io
description: Looks for potential enumeration of AWS buckets via ListBuckets.
references:
    - https://github.com/Lifka/hacking-resources/blob/c2ae355d381bd0c9f0b32c4ead049f44e5b1573f/cloud-hacking-cheat-sheets.md
    - https://jamesonhacking.blogspot.com/2020/12/pivoting-to-private-aws-s3-buckets.html
    - https://securitycafe.ro/2022/12/14/aws-enumeration-part-ii-practical-enumeration/
falsepositives:
    - Administrators listing buckets, it may be necessary to filter out users who
        commonly conduct this activity.
tags:
    - attack.discovery
    - attack.t1580
date: '2023-01-06'
modified: '2024-07-10'
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: s3.amazonaws.com
        eventName: ListBuckets
    filter:
        userIdentity.type: AssumedRole
    condition: selection and not filter
related:
    -   id: 4723218f-2048-41f6-bcb0-417f2d784f61
        type: similar
ocsf_mapping:
    class_name: datastore_activity
    activity_id: 8
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-12-04T01:39:20.280607+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-12-04T01:39:20.280607+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: datastore_activity
            target_field: metadata.product.name
            mapped_at: '2025-12-04T01:39:20.280620+00:00'
        -   source_field: eventName
            target_table: datastore_activity
            target_field: api.operation
            mapped_at: '2025-12-04T01:39:20.280622+00:00'
        -   source_field: userIdentity.type
            target_table: datastore_activity
            target_field: actor.user.type
            mapped_at: '2025-12-04T01:39:20.280623+00:00'
