id: 0a5177f4-6ca9-44c2-aacf-d3f3d8b6e4d2
title: AWS IAM Backdoor Users Keys
status: test
level: medium
description: 'Detects AWS API key creation for a user by another user.

    Backdoored users can be used to obtain persistence in the AWS environment.

    Also with this alert, you can detect a flow of AWS keys in your org.

    '
author: faloker
date: '2020-02-12'
modified: '2022-10-09'
tags:
    - attack.persistence
    - attack.t1098
references:
    - https://github.com/RhinoSecurityLabs/pacu/blob/866376cd711666c775bbfcde0524c817f2c5b181/pacu/modules/iam__backdoor_users_keys/main.py
fields:
    - userIdentity.arn
    - responseElements.accessKey.userName
    - errorCode
    - errorMessage
falsepositives:
    - Adding user keys to their own accounts (the filter cannot cover all possible
        variants of user naming)
    - AWS API keys legitimate exchange workflows
taxonomy: sigma
logsource:
    product: aws
    service: cloudtrail
detection:
    selection_source:
        eventSource: iam.amazonaws.com
        eventName: CreateAccessKey
    filter:
        userIdentity.arn|contains: responseElements.accessKey.userName
    condition: selection_source and not filter
ocsf_mapping:
    class_name: account_change
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-11-26T02:22:55.026762+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-11-26T02:22:55.026762+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: account_change
            target_field: metadata.product.name
            mapped_at: '2025-11-26T02:22:55.026780+00:00'
        -   source_field: eventName
            target_table: account_change
            target_field: api.operation
            mapped_at: '2025-11-26T02:22:55.026783+00:00'
        -   source_field: userIdentity.arn
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:22:55.026785+00:00'
