id: c3f265c7-ff03-4056-8ab2-d486227b4599
title: Restore Public AWS RDS Instance
status: test
level: high
description: Detects the recovery of a new public database instance from a snapshot.
    It may be a part of data exfiltration.
author: faloker
date: '2020-02-12'
modified: '2022-10-09'
tags:
    - attack.exfiltration
    - attack.t1020
references:
    - https://github.com/RhinoSecurityLabs/pacu/blob/866376cd711666c775bbfcde0524c817f2c5b181/pacu/modules/rds__explore_snapshots/main.py
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: aws
    service: cloudtrail
detection:
    selection_source:
        eventSource: rds.amazonaws.com
        responseElements.publiclyAccessible: 'true'
        eventName: RestoreDBInstanceFromDBSnapshot
    condition: selection_source
ocsf_mapping:
    class_name: api_activity
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-11-13T20:17:51.323628+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-11-13T20:17:51.323628+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: api_activity
            target_field: metadata.product.name
            mapped_at: '2025-11-13T20:17:52.132625+00:00'
        -   source_field: responseElements.publiclyAccessible
            target_table: api_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:17:52.132634+00:00'
        -   source_field: eventName
            target_table: api_activity
            target_field: action
            mapped_at: '2025-11-13T20:17:52.132637+00:00'
