id: 33d50d03-20ec-4b74-a74e-1e65a38af1c0
title: AWS EKS Cluster Created or Deleted
status: test
level: low
description: Identifies when an EKS cluster is created or deleted.
author: Austin Songer
date: '2021-08-16'
modified: '2022-10-09'
tags:
    - attack.impact
    - attack.t1485
references:
    - https://any-api.com/amazonaws_com/eks/docs/API_Description
falsepositives:
    - EKS Cluster being created or deleted may be performed by a system administrator.
    - Verify whether the user identity, user agent, and/or hostname should be making
        changes in your environment.
    - EKS Cluster created or deleted from unfamiliar users should be investigated.
        If known behavior is causing false positives, it can be exempted from the
        rule.
taxonomy: sigma
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: eks.amazonaws.com
        eventName:
            - CreateCluster
            - DeleteCluster
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-11-13T20:18:08.627588+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-11-13T20:18:08.627588+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: file_activity
            target_field: metadata.product.name
            mapped_at: '2025-11-13T20:18:08.627615+00:00'
        -   source_field: eventName
            target_table: file_activity
            target_field: action
            mapped_at: '2025-11-13T20:18:08.627618+00:00'
