id: 97fbabf8-8e1b-47a2-b7d5-a418d2b95e3d
title: AWS Attached Malicious Lambda Layer
status: test
level: medium
description: 'Detects when an user attached a Lambda layer to an existing function
    to override a library that is in use by the function, where their malicious code
    could utilize the function''s IAM role for AWS API calls.

    This would give an adversary access to the privileges associated with the Lambda
    service role that is attached to that function.

    '
author: Austin Songer
date: '2021-09-23'
modified: '2022-10-09'
tags:
    - attack.privilege-escalation
references:
    - https://docs.aws.amazon.com/lambda/latest/dg/API_UpdateFunctionConfiguration.html
falsepositives:
    - Lambda Layer being attached may be performed by a system administrator. Verify
        whether the user identity, user agent, and/or hostname should be making changes
        in your environment.
    - Lambda Layer being attached from unfamiliar users should be investigated. If
        known behavior is causing false positives, it can be exempted from the rule.
taxonomy: sigma
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: lambda.amazonaws.com
        eventName|startswith: UpdateFunctionConfiguration
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-11-13T20:18:08.620847+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-11-13T20:18:08.620847+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: file_activity
            target_field: metadata.product.name
            mapped_at: '2025-11-13T20:18:08.620859+00:00'
        -   source_field: eventName
            target_table: file_activity
            target_field: action
            mapped_at: '2025-11-13T20:18:08.620862+00:00'
