id: a136ac98-b2bc-4189-a14d-f0d0388e57a7
title: AWS S3 Bucket Versioning Disable
status: test
level: medium
description: Detects when S3 bucket versioning is disabled. Threat actors use this
    technique during AWS ransomware incidents prior to deleting S3 objects.
author: Sean Johnstone | Unit 42
date: '2023-10-28'
tags:
    - attack.impact
    - attack.t1490
references:
    - https://invictus-ir.medium.com/ransomware-in-the-cloud-7f14805bbe82
falsepositives:
    - AWS administrator legitimately disabling bucket versioning
taxonomy: sigma
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: s3.amazonaws.com
        eventName: PutBucketVersioning
        requestParameters|contains: Suspended
    condition: selection
ocsf_mapping:
    class_name: datastore_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-11-26T02:22:46.237057+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-11-26T02:22:46.237057+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: datastore_activity
            target_field: metadata.product.name
            mapped_at: '2025-11-26T02:22:47.347934+00:00'
        -   source_field: eventName
            target_table: datastore_activity
            target_field: api.operation
            mapped_at: '2025-11-26T02:22:47.347944+00:00'
        -   source_field: requestParameters
            target_table: datastore_activity
            target_field: api.request.data
            mapped_at: '2025-11-26T02:22:47.347947+00:00'
