id: db014773-7375-4f4e-b83b-133337c0ffee
title: AWS IAM S3Browser Templated S3 Bucket Policy Creation
status: test
level: high
description: Detects S3 browser utility creating Inline IAM policy containing default
    S3 bucket name placeholder value of "<YOUR-BUCKET-NAME>".
author: daniel.bohannon@permiso.io (@danielhbohannon)
date: '2023-05-17'
modified: '2023-05-17'
tags:
    - attack.execution
    - attack.t1059.009
    - attack.persistence
    - attack.t1078.004
references:
    - https://permiso.io/blog/s/unmasking-guivil-new-cloud-threat-actor
falsepositives:
    - Valid usage of S3 browser with accidental creation of default Inline IAM policy
        without changing default S3 bucket name placeholder value
taxonomy: sigma
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: iam.amazonaws.com
        eventName: PutUserPolicy
        userAgent|contains: S3 Browser
        requestParameters|contains|all:
            - '"arn:aws:s3:::<YOUR-BUCKET-NAME>/*"'
            - '"s3:GetObject"'
            - '"Allow"'
    condition: selection
ocsf_mapping:
    class_name: api_activity
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-11-13T20:18:01.734159+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-11-13T20:18:01.734159+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: api_activity
            target_field: metadata.product.name
            mapped_at: '2025-11-13T20:18:02.643857+00:00'
        -   source_field: eventName
            target_table: api_activity
            target_field: action
            mapped_at: '2025-11-13T20:18:02.643876+00:00'
        -   source_field: userAgent
            target_table: api_activity
            target_field: http_request.user_agent
            mapped_at: '2025-11-13T20:18:02.643879+00:00'
        -   source_field: requestParameters
            target_table: api_activity
            target_field: api.request.data
            mapped_at: '2025-11-13T20:18:02.643882+00:00'
