title: AWS ElastiCache Security Group Modified or Deleted
id: 7c797da2-9cf2-4523-ba64-33b06339f0cc
status: test
level: low
author: Austin Songer @austinsonger
description: Identifies when an ElastiCache security group has been modified or deleted.
references:
    - https://github.com/elastic/detection-rules/blob/7d5efd68603f42be5e125b5a6a503b2ef3ac0f4e/rules/integrations/aws/impact_elasticache_security_group_modified_or_deleted.toml
falsepositives:
    - A ElastiCache security group deletion may be done by a system or network administrator.
        Verify whether the user identity, user agent, and/or hostname should be making
        changes in your environment. Security Group deletions from unfamiliar users
        or hosts should be investigated. If known behavior is causing false positives,
        it can be exempted from the rule.
tags:
    - attack.impact
    - attack.t1531
date: '2021-07-24'
modified: '2022-10-09'
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: elasticache.amazonaws.com
        eventName:
            - DeleteCacheSecurityGroup
            - AuthorizeCacheSecurityGroupIngress
            - RevokeCacheSecurityGroupIngress
            - AuthorizeCacheSecurityGroupEgress
            - RevokeCacheSecurityGroupEgress
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-12-04T01:39:30.565451+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-12-04T01:39:30.565451+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: file_activity
            target_field: metadata.product.name
            mapped_at: '2025-12-04T01:39:30.565470+00:00'
        -   source_field: eventName
            target_table: file_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:39:30.565472+00:00'
