id: db014773-d9d9-4792-91e5-133337c0ffee
title: AWS IAM S3Browser User or AccessKey Creation
status: test
level: high
description: Detects S3 Browser utility creating IAM User or AccessKey.
author: daniel.bohannon@permiso.io (@danielhbohannon)
date: '2023-05-17'
tags:
    - attack.execution
    - attack.persistence
    - attack.t1059.009
    - attack.t1078.004
references:
    - https://permiso.io/blog/s/unmasking-guivil-new-cloud-threat-actor
falsepositives:
    - Valid usage of S3 Browser for IAM User and/or AccessKey creation
taxonomy: sigma
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: iam.amazonaws.com
        eventName:
            - CreateUser
            - CreateAccessKey
        userAgent|contains: S3 Browser
    condition: selection
ocsf_mapping:
    class_name: api_activity
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-11-13T20:18:16.393140+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-11-13T20:18:16.393140+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: api_activity
            target_field: metadata.product.name
            mapped_at: '2025-11-13T20:18:16.393149+00:00'
        -   source_field: eventName
            target_table: api_activity
            target_field: action
            mapped_at: '2025-11-13T20:18:16.393151+00:00'
        -   source_field: userAgent
            target_table: api_activity
            target_field: http_request.user_agent
            mapped_at: '2025-11-13T20:18:16.393153+00:00'
