title: AWS EC2 Disable EBS Encryption
id: 16124c2d-e40b-4fcc-8f2c-5ab7870a2223
status: stable
level: medium
author: Sittikorn S
description: 'Identifies disabling of default Amazon Elastic Block Store (EBS) encryption
    in the current region.

    Disabling default encryption does not change the encryption status of your existing
    volumes.

    '
references:
    - https://docs.aws.amazon.com/AWSEC2/latest/APIReference/API_DisableEbsEncryptionByDefault.html
falsepositives:
    - System Administrator Activities
    - DEV, UAT, SAT environment. You should apply this rule with PROD account only.
tags:
    - attack.impact
    - attack.t1486
    - attack.t1565
date: '2021-06-29'
modified: '2021-08-20'
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: ec2.amazonaws.com
        eventName: DisableEbsEncryptionByDefault
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-12-04T01:39:17.453538+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-12-04T01:39:17.453538+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: file_activity
            target_field: metadata.product.name
            mapped_at: '2025-12-04T01:39:17.453567+00:00'
        -   source_field: eventName
            target_table: file_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:39:17.453569+00:00'
