title: AWS Attached Malicious Lambda Layer
id: 97fbabf8-8e1b-47a2-b7d5-a418d2b95e3d
status: test
level: medium
author: Austin Songer
description: 'Detects when an user attached a Lambda layer to an existing function
    to override a library that is in use by the function, where their malicious code
    could utilize the function''s IAM role for AWS API calls.

    This would give an adversary access to the privileges associated with the Lambda
    service role that is attached to that function.

    '
references:
    - https://docs.aws.amazon.com/lambda/latest/dg/API_UpdateFunctionConfiguration.html
falsepositives:
    - Lambda Layer being attached may be performed by a system administrator. Verify
        whether the user identity, user agent, and/or hostname should be making changes
        in your environment.
    - Lambda Layer being attached from unfamiliar users should be investigated. If
        known behavior is causing false positives, it can be exempted from the rule.
tags:
    - attack.privilege-escalation
date: '2021-09-23'
modified: '2022-10-09'
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: lambda.amazonaws.com
        eventName|startswith: UpdateFunctionConfiguration
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-12-04T01:39:21.949064+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-12-04T01:39:21.949064+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: file_activity
            target_field: metadata.product.name
            mapped_at: '2025-12-04T01:39:21.949108+00:00'
        -   source_field: eventName
            target_table: file_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:39:21.949111+00:00'
