id: b94bf91e-c2bf-4047-9c43-c6810f43baad
title: AWS ECS Task Definition That Queries The Credential Endpoint
status: test
level: medium
description: 'Detects when an Elastic Container Service (ECS) Task Definition includes
    a command to query the credential endpoint.

    This can indicate a potential adversary adding a backdoor to establish persistence
    or escalate privileges.

    '
author: Darin Smith
date: '2022-06-07'
modified: '2023-04-24'
tags:
    - attack.persistence
    - attack.t1525
references:
    - https://github.com/RhinoSecurityLabs/pacu/blob/866376cd711666c775bbfcde0524c817f2c5b181/pacu/modules/ecs__backdoor_task_def/main.py
    - https://docs.aws.amazon.com/AmazonECS/latest/APIReference/API_RegisterTaskDefinition.html
    - https://docs.aws.amazon.com/AmazonECS/latest/developerguide/task-iam-roles.html
falsepositives:
    - Task Definition being modified to request credentials from the Task Metadata
        Service for valid reasons
taxonomy: sigma
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: ecs.amazonaws.com
        eventName:
            - DescribeTaskDefinition
            - RegisterTaskDefinition
            - RunTask
        requestParameters.containerDefinitions.command|contains: $AWS_CONTAINER_CREDENTIALS_RELATIVE_URI
    condition: selection
ocsf_mapping:
    class_name: api_activity
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-11-26T02:22:49.376329+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-11-26T02:22:49.376329+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: api_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:22:51.003009+00:00'
        -   source_field: eventName
            target_table: api_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:22:51.003020+00:00'
        -   source_field: requestParameters.containerDefinitions.command
            target_table: api_activity
            target_field: api.request.data
            mapped_at: '2025-11-26T02:22:51.003022+00:00'
