id: 78b3756a-7804-4ef7-8555-7b9024a02e2d
title: AWS S3 Data Management Tampering
status: test
level: low
description: Detects when a user tampers with S3 data management in Amazon Web Services.
author: Austin Songer @austinsonger
date: '2021-07-24'
modified: '2022-10-09'
tags:
    - attack.exfiltration
    - attack.t1537
references:
    - https://github.com/elastic/detection-rules/pull/1145/files
    - https://docs.aws.amazon.com/AmazonS3/latest/API/API_Operations.html
    - https://docs.aws.amazon.com/AmazonS3/latest/API/API_PutBucketLogging.html
    - https://docs.aws.amazon.com/AmazonS3/latest/API/API_PutBucketWebsite.html
    - https://docs.aws.amazon.com/AmazonS3/latest/API/API_PutBucketEncryption.html
    - https://docs.aws.amazon.com/AmazonS3/latest/userguide/setting-repl-config-perm-overview.html
    - https://docs.aws.amazon.com/AmazonS3/latest/API/API_RestoreObject.html
falsepositives:
    - A S3 configuration change may be done by a system or network administrator.
        Verify whether the user identity, user agent, and/or hostname should be making
        changes in your environment. S3 configuration change from unfamiliar users
        or hosts should be investigated. If known behavior is causing false positives,
        it can be exempted from the rule.
taxonomy: sigma
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: s3.amazonaws.com
        eventName:
            - PutBucketLogging
            - PutBucketWebsite
            - PutEncryptionConfiguration
            - PutLifecycleConfiguration
            - PutReplicationConfiguration
            - ReplicateObject
            - RestoreObject
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-11-13T20:18:11.782536+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-11-13T20:18:11.782536+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: file_activity
            target_field: metadata.product.name
            mapped_at: '2025-11-13T20:18:11.782555+00:00'
        -   source_field: eventName
            target_table: file_activity
            target_field: action
            mapped_at: '2025-11-13T20:18:11.782559+00:00'
