id: 4990c2e3-f4b8-45e3-bc3c-30b14ff0ed26
title: AWS Glue Development Endpoint Activity
status: test
level: low
description: Detects possible suspicious glue development endpoint activity.
author: Austin Songer @austinsonger
date: '2021-10-03'
modified: '2022-12-18'
tags:
    - attack.privilege-escalation
references:
    - https://rhinosecuritylabs.com/aws/aws-privilege-escalation-methods-mitigation/
    - https://docs.aws.amazon.com/glue/latest/webapi/API_CreateDevEndpoint.html
falsepositives:
    - Glue Development Endpoint Activity may be performed by a system administrator.
        Verify whether the user identity, user agent, and/or hostname should be making
        changes in your environment.
    - If known behavior is causing false positives, it can be exempted from the rule.
taxonomy: sigma
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: glue.amazonaws.com
        eventName:
            - CreateDevEndpoint
            - DeleteDevEndpoint
            - UpdateDevEndpoint
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-11-13T20:18:01.128824+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-11-13T20:18:01.128824+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: file_activity
            target_field: metadata.product.name
            mapped_at: '2025-11-13T20:18:01.128833+00:00'
        -   source_field: eventName
            target_table: file_activity
            target_field: action
            mapped_at: '2025-11-13T20:18:01.128835+00:00'
