title: AWS RDS Master Password Change
id: 8a63cdd4-6207-414a-85bc-7e032bd3c1a2
status: test
level: medium
author: faloker
description: Detects the change of database master password. It may be a part of data
    exfiltration.
references:
    - https://github.com/RhinoSecurityLabs/pacu/blob/866376cd711666c775bbfcde0524c817f2c5b181/pacu/modules/rds__explore_snapshots/main.py
falsepositives:
    - Benign changes to a db instance
tags:
    - attack.exfiltration
    - attack.t1020
date: '2020-02-12'
modified: '2022-10-05'
logsource:
    product: aws
    service: cloudtrail
detection:
    selection_source:
        eventSource: rds.amazonaws.com
        responseElements.pendingModifiedValues.masterUserPassword|contains: '*'
        eventName: ModifyDBInstance
    condition: selection_source
ocsf_mapping:
    class_name: account_change
    activity_id: 3
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-12-04T01:39:27.762667+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-12-04T01:39:27.762667+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: account_change
            target_field: metadata.product.name
            mapped_at: '2025-12-04T01:39:27.762681+00:00'
        -   source_field: responseElements.pendingModifiedValues.masterUserPassword
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:39:27.762683+00:00'
        -   source_field: eventName
            target_table: account_change
            target_field: api.operation
            mapped_at: '2025-12-04T01:39:27.762684+00:00'
