id: 14f3f1c8-02d5-43a2-a191-91ffb52d3015
title: RDS Database Security Group Modification
status: test
level: medium
description: 'Detects changes to the security group entries for RDS databases.

    This can indicate that a misconfiguration has occurred which potentially exposes
    the database to the public internet, a wider audience within the VPC or that removal
    of valid rules has occurred which could impact the availability of the database
    to legitimate services and users.

    '
author: jamesc-grafana
date: '2024-07-11'
tags:
    - attack.initial-access
    - attack.t1190
references:
    - https://www.gorillastack.com/blog/real-time-events/important-aws-cloudtrail-security-events-tracking/
falsepositives:
    - Creation of a new Database that needs new security group rules
taxonomy: sigma
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: rds.amazonaws.com
        eventName:
            - AuthorizeDBSecurityGroupIngress
            - CreateDBSecurityGroup
            - DeleteDBSecurityGroup
            - RevokeDBSecurityGroupIngress
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-11-26T02:22:35.136267+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-11-26T02:22:35.136267+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:22:35.136284+00:00'
        -   source_field: eventName
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:22:35.136286+00:00'
