id: 92f84194-8d9a-4ee0-8699-c30bfac59780
title: AWS Key Pair Import Activity
status: experimental
level: medium
description: 'Detects the import of SSH key pairs into AWS EC2, which may indicate
    an attacker attempting to gain unauthorized access to instances. This activity
    could lead to initial access, persistence, or privilege escalation, potentially
    compromising sensitive data and operations.

    '
author: Ivan Saakov
date: '2024-12-19'
tags:
    - attack.initial-access
    - attack.t1078
    - attack.persistence
    - attack.privilege-escalation
references:
    - https://docs.aws.amazon.com/AWSEC2/latest/APIReference/API_ImportKeyPair.html
falsepositives:
    - Legitimate administrative actions by authorized users importing keys for valid
        purposes.
    - Automated processes for infrastructure setup may trigger this alert.
    - Verify the user identity, user agent, and source IP address to ensure they are
        expected.
taxonomy: sigma
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: ec2.amazonaws.com
        eventName: ImportKeyPair
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-11-26T02:22:07.392401+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-11-26T02:22:07.392401+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:22:07.392412+00:00'
        -   source_field: eventName
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:22:07.392414+00:00'
