id: 4ae68615-866f-4304-b24b-ba048dfa5ca7
title: AWS ElastiCache Security Group Created
status: test
level: low
description: Detects when an ElastiCache security group has been created.
author: Austin Songer @austinsonger
date: '2021-07-24'
modified: '2022-10-09'
tags:
    - attack.persistence
    - attack.t1136
    - attack.t1136.003
references:
    - https://github.com/elastic/detection-rules/blob/598f3d7e0a63221c0703ad9a0ea7e22e7bc5961e/rules/integrations/aws/persistence_elasticache_security_group_creation.toml
falsepositives:
    - A ElastiCache security group may be created by a system or network administrator.
        Verify whether the user identity, user agent, and/or hostname should be making
        changes in your environment. Security group creations from unfamiliar users
        or hosts should be investigated. If known behavior is causing false positives,
        it can be exempted from the rule.
taxonomy: sigma
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: elasticache.amazonaws.com
        eventName: CreateCacheSecurityGroup
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-11-13T20:18:16.390371+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-11-13T20:18:16.390371+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: file_activity
            target_field: metadata.product.name
            mapped_at: '2025-11-13T20:18:16.390383+00:00'
        -   source_field: eventName
            target_table: file_activity
            target_field: action
            mapped_at: '2025-11-13T20:18:16.390386+00:00'
