id: c803b2ce-c4a2-4836-beae-b112010390b1
title: New Network Route Added
status: test
level: medium
description: 'Detects the addition of a new network route to a route table in AWS.

    '
author: jamesc-grafana
date: '2024-07-11'
tags:
    - attack.initial-access
    - attack.t1190
references:
    - https://www.gorillastack.com/blog/real-time-events/important-aws-cloudtrail-security-events-tracking/
falsepositives:
    - New VPC Creation requiring setup of a new route table
    - New subnets added requiring routing setup
taxonomy: sigma
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: ec2.amazonaws.com
        eventName: CreateRoute
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-11-26T02:22:24.473970+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-11-26T02:22:24.473970+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:22:24.473981+00:00'
        -   source_field: eventName
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:22:24.473983+00:00'
