title: AWS User Login Profile Was Modified
id: 055fb148-60f8-462d-ad16-26926ce050f1
status: test
level: high
author: toffeebr33k
description: 'Detects activity when someone is changing passwords on behalf of other
    users.

    An attacker with the "iam:UpdateLoginProfile" permission on other users can change
    the password used to login to the AWS console on any user that already has a login
    profile setup.

    '
references:
    - https://github.com/RhinoSecurityLabs/AWS-IAM-Privilege-Escalation
falsepositives:
    - Legitimate user account administration
tags:
    - attack.persistence
    - attack.t1098
date: '2021-08-09'
modified: '2024-04-26'
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: iam.amazonaws.com
        eventName: UpdateLoginProfile
    filter_main_user_identity:
        userIdentity.arn|fieldref: requestParameters.userName
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: account_change
    activity_id: 3
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-12-04T01:39:09.328134+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-12-04T01:39:09.328134+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: account_change
            target_field: metadata.product.name
            mapped_at: '2025-12-04T01:39:09.328148+00:00'
        -   source_field: eventName
            target_table: account_change
            target_field: api.operation
            mapped_at: '2025-12-04T01:39:09.328149+00:00'
        -   source_field: userIdentity.arn
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:39:09.328151+00:00'
