title: AWS Suspicious SAML Activity
id: f43f5d2f-3f2a-4cc8-b1af-81fde7dbaf0e
status: test
level: medium
author: Austin Songer
description: Identifies when suspicious SAML activity has occurred in AWS. An adversary
    could gain backdoor access via SAML.
references:
    - https://docs.aws.amazon.com/IAM/latest/APIReference/API_UpdateSAMLProvider.html
    - https://docs.aws.amazon.com/STS/latest/APIReference/API_AssumeRoleWithSAML.html
falsepositives:
    - Automated processes that uses Terraform may lead to false positives.
    - SAML Provider could be updated by a system administrator. Verify whether the
        user identity, user agent, and/or hostname should be making changes in your
        environment.
    - SAML Provider being updated from unfamiliar users should be investigated. If
        known behavior is causing false positives, it can be exempted from the rule.
tags:
    - attack.initial-access
    - attack.t1078
    - attack.lateral-movement
    - attack.t1548
    - attack.privilege-escalation
    - attack.t1550
    - attack.t1550.001
date: '2021-09-22'
modified: '2022-12-18'
logsource:
    product: aws
    service: cloudtrail
detection:
    selection_sts:
        eventSource: sts.amazonaws.com
        eventName: AssumeRoleWithSAML
    selection_iam:
        eventSource: iam.amazonaws.com
        eventName: UpdateSAMLProvider
    condition: 1 of selection_*
ocsf_mapping:
    class_name: file_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-12-04T01:39:29.528724+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-12-04T01:39:29.528724+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: file_activity
            target_field: metadata.product.name
            mapped_at: '2025-12-04T01:39:29.528737+00:00'
        -   source_field: eventName
            target_table: file_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:39:29.528738+00:00'
