id: b056de1a-6e6e-4e40-a67e-97c9808cf41b
title: AWS Route 53 Domain Transferred to Another Account
status: test
level: low
description: Detects when a request has been made to transfer a Route 53 domain to
    another AWS account.
author: Elastic, Austin Songer @austinsonger
date: '2021-07-22'
modified: '2022-10-09'
tags:
    - attack.persistence
    - attack.credential-access
    - attack.t1098
references:
    - https://github.com/elastic/detection-rules/blob/c76a39796972ecde44cb1da6df47f1b6562c9770/rules/integrations/aws/persistence_route_53_domain_transferred_to_another_account.toml
falsepositives:
    - A domain may be transferred to another AWS account by a system or network administrator.
        Verify whether the user identity, user agent, and/or hostname should be making
        changes in your environment. Domain transfers from unfamiliar users or hosts
        should be investigated. If known behavior is causing false positives, it can
        be exempted from the rule.
taxonomy: sigma
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: route53.amazonaws.com
        eventName: TransferDomainToAnotherAwsAccount
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-11-26T02:22:23.463995+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-11-26T02:22:23.463995+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:22:23.464009+00:00'
        -   source_field: eventName
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:22:23.464011+00:00'
