id: 4db60cc0-36fb-42b7-9b58-a5b53019fb74
title: AWS CloudTrail Important Change
status: test
level: medium
description: Detects disabling, deleting and updating of a Trail
author: vitaliy0x1
date: '2020-01-21'
modified: '2022-10-09'
tags:
    - attack.defense-evasion
    - attack.t1562.001
references:
    - https://docs.aws.amazon.com/awscloudtrail/latest/userguide/best-practices-security.html
falsepositives:
    - Valid change in a Trail
taxonomy: sigma
logsource:
    product: aws
    service: cloudtrail
detection:
    selection_source:
        eventSource: cloudtrail.amazonaws.com
        eventName:
            - StopLogging
            - UpdateTrail
            - DeleteTrail
    condition: selection_source
ocsf_mapping:
    class_name: file_activity
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-11-26T02:22:20.742063+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-11-26T02:22:20.742063+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:22:20.742082+00:00'
        -   source_field: eventName
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:22:20.742085+00:00'
