id: 7c797da2-9cf2-4523-ba64-33b06339f0cc
title: AWS ElastiCache Security Group Modified or Deleted
status: test
level: low
description: Identifies when an ElastiCache security group has been modified or deleted.
author: Austin Songer @austinsonger
date: '2021-07-24'
modified: '2022-10-09'
tags:
    - attack.impact
    - attack.t1531
references:
    - https://github.com/elastic/detection-rules/blob/7d5efd68603f42be5e125b5a6a503b2ef3ac0f4e/rules/integrations/aws/impact_elasticache_security_group_modified_or_deleted.toml
falsepositives:
    - A ElastiCache security group deletion may be done by a system or network administrator.
        Verify whether the user identity, user agent, and/or hostname should be making
        changes in your environment. Security Group deletions from unfamiliar users
        or hosts should be investigated. If known behavior is causing false positives,
        it can be exempted from the rule.
taxonomy: sigma
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: elasticache.amazonaws.com
        eventName:
            - DeleteCacheSecurityGroup
            - AuthorizeCacheSecurityGroupIngress
            - RevokeCacheSecurityGroupIngress
            - AuthorizeCacheSecurityGroupEgress
            - RevokeCacheSecurityGroupEgress
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-11-26T02:23:00.582802+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-11-26T02:23:00.582802+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:23:00.582814+00:00'
        -   source_field: eventName
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:23:00.582816+00:00'
