title: Potential Malicious Usage of CloudTrail System Manager
id: 38e7f511-3f74-41d4-836e-f57dfa18eead
status: experimental
level: high
author: jamesc-grafana
description: 'Detect when System Manager successfully executes commands against an
    instance.

    '
references:
    - https://github.com/elastic/detection-rules/blob/main/rules/integrations/aws/initial_access_via_system_manager.toml
falsepositives:
    - There are legitimate uses of SSM to send commands to EC2 instances
    - Legitimate users may have to use SSM to perform actions against machines in
        the Cloud to update or maintain them
tags:
    - attack.privilege-escalation
    - attack.t1566
    - attack.t1566.002
date: '2024-07-11'
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventName: SendCommand
        eventSource: ssm.amazonaws.com
        responseElements.command.status: Success
    condition: selection
ocsf_mapping:
    class_name: api_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-12-04T01:39:08.863349+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-12-04T01:39:08.863349+00:00'
    detection_fields:
        -   source_field: eventName
            target_table: api_activity
            target_field: api.operation
            mapped_at: '2025-12-04T01:39:08.863362+00:00'
        -   source_field: eventSource
            target_table: api_activity
            target_field: metadata.product.name
            mapped_at: '2025-12-04T01:39:08.863363+00:00'
        -   source_field: responseElements.command.status
            target_table: api_activity
            target_field: http_response.status
            mapped_at: '2025-12-04T01:39:08.863365+00:00'
