id: 8a63cdd4-6207-414a-85bc-7e032bd3c1a2
title: AWS RDS Master Password Change
status: test
level: medium
description: Detects the change of database master password. It may be a part of data
    exfiltration.
author: faloker
date: '2020-02-12'
modified: '2022-10-05'
tags:
    - attack.exfiltration
    - attack.t1020
references:
    - https://github.com/RhinoSecurityLabs/pacu/blob/866376cd711666c775bbfcde0524c817f2c5b181/pacu/modules/rds__explore_snapshots/main.py
falsepositives:
    - Benign changes to a db instance
taxonomy: sigma
logsource:
    product: aws
    service: cloudtrail
detection:
    selection_source:
        eventSource: rds.amazonaws.com
        responseElements.pendingModifiedValues.masterUserPassword|contains: '*'
        eventName: ModifyDBInstance
    condition: selection_source
ocsf_mapping:
    class_name: account_change
    activity_id: 3
    logsource:
        product:
            source_field: product
            source_value: aws
            mapped_at: '2025-11-26T02:22:56.729017+00:00'
        service:
            source_field: service
            source_value: cloudtrail
            mapped_at: '2025-11-26T02:22:56.729017+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: account_change
            target_field: metadata.product.name
            mapped_at: '2025-11-26T02:22:57.465073+00:00'
        -   source_field: responseElements.pendingModifiedValues.masterUserPassword
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:22:57.465089+00:00'
        -   source_field: eventName
            target_table: account_change
            target_field: api.operation
            mapped_at: '2025-11-26T02:22:57.465091+00:00'
