id: a0413867-daf3-43dd-9245-734b3a787942
title: Bitlocker Key Retrieval
status: test
level: medium
description: Monitor and alert for Bitlocker key retrieval.
author: Michael Epping, '@mepples21'
date: '2022-06-28'
tags:
    - attack.defense-evasion
    - attack.t1078.004
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-devices#bitlocker-key-retrieval
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        Category: KeyManagement
        OperationName: Read BitLocker key
    condition: selection
ocsf_mapping:
    class_name: authentication
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-13T20:16:47.345629+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-11-13T20:16:47.345629+00:00'
    detection_fields:
        -   source_field: Category
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:16:47.345654+00:00'
        -   source_field: OperationName
            target_table: authentication
            target_field: api.operation
            mapped_at: '2025-11-13T20:16:47.345658+00:00'
