title: Password Reset By User Account
id: 340ee172-4b67-4fb4-832f-f961bdc1f3aa
status: test
level: medium
author: YochanaHenderson, '@Yochana-H'
description: Detect when a user has reset their password in Azure AD
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-privileged-accounts
falsepositives:
    - If this was approved by System Administrator or confirmed user action.
tags:
    - attack.persistence
    - attack.credential-access
    - attack.t1078.004
date: '2022-08-03'
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        Category: UserManagement
        Status: Success
        Initiatedby: UPN
    filter:
        Target|contains: UPN
        ActivityType|contains: Password reset
    condition: selection and filter
ocsf_mapping:
    class_name: account_change
    activity_id: 4
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:37:36.743712+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-12-04T01:37:36.743712+00:00'
    detection_fields:
        -   source_field: Category
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:37:36.743736+00:00'
        -   source_field: Status
            target_table: account_change
            target_field: status_code
            mapped_at: '2025-12-04T01:37:36.743739+00:00'
        -   source_field: Initiatedby
            target_table: account_change
            target_field: actor.user.name
            mapped_at: '2025-12-04T01:37:36.743741+00:00'
        -   source_field: Target
            target_table: account_change
            target_field: user_result.name
            mapped_at: '2025-12-04T01:37:36.743744+00:00'
        -   source_field: ActivityType
            target_table: account_change
            target_field: action
            mapped_at: '2025-12-04T01:37:36.743746+00:00'
