title: CA Policy Updated by Non Approved Actor
id: 50a3c7aa-ec29-44a4-92c1-fce229eef6fc
status: test
level: medium
author: Corissa Koopmans, '@corissalea'
description: Monitor and alert on conditional access changes. Is Initiated by (actor)
    approved to make changes? Review Modified Properties and compare "old" vs "new"
    value.
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-infrastructure#conditional-access
falsepositives:
    - Misconfigured role permissions
    - Verify whether the user identity, user agent, and/or hostname should be making
        changes in your environment.
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.t1548
    - attack.t1556
date: '2022-07-19'
modified: '2024-05-28'
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        properties.message: Update conditional access policy
    condition: selection
ocsf_mapping:
    class_name: account_change
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:37:38.379478+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-12-04T01:37:38.379478+00:00'
    detection_fields:
        -   source_field: properties.message
            target_table: account_change
            target_field: message
            mapped_at: '2025-12-04T01:37:38.379499+00:00'
