title: Invalid PIM License
id: 58af08eb-f9e1-43c8-9805-3ad9b0482bd8
status: test
level: high
author: Mark Morowczynski '@markmorow', Gloria Lee, '@gleeiamglo'
description: Identifies when an organization doesn't have the proper license for PIM
    and is out of compliance.
references:
    - https://learn.microsoft.com/en-us/entra/id-governance/privileged-identity-management/pim-how-to-configure-security-alerts#the-organization-doesnt-have-microsoft-entra-premium-p2-or-microsoft-entra-id-governance
falsepositives:
    - Investigate if licenses have expired.
tags:
    - attack.t1078
    - attack.persistence
    - attack.privilege-escalation
date: '2023-09-14'
logsource:
    product: azure
    service: pim
detection:
    selection:
        riskEventType: invalidLicenseAlertIncident
    condition: selection
ocsf_mapping:
    class_name: user_access
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:37:35.801364+00:00'
        service:
            source_field: service
            source_value: pim
            mapped_at: '2025-12-04T01:37:35.801364+00:00'
    detection_fields:
        -   source_field: riskEventType
            target_table: user_access
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:37:35.801383+00:00'
