id: d4c7758e-9417-4f2e-9109-6125d66dabef
title: User Risk and MFA Registration Policy Updated
status: experimental
level: high
description: 'Detects changes and updates to the user risk and MFA registration policy.

    Attackers can modified the policies to Bypass MFA, weaken security thresholds,
    facilitate further attacks, maintain persistence.

    '
author: Harjot Singh (@cyb3rjy0t)
date: '2024-08-13'
tags:
    - attack.persistence
references:
    - https://learn.microsoft.com/en-us/entra/id-protection/howto-identity-protection-configure-mfa-policy
    - https://learn.microsoft.com/en-us/entra/identity/monitoring-health/reference-audit-activities
falsepositives:
    - Known updates by administrators.
taxonomy: sigma
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        LoggedByService: AAD Management UX
        Category: Policy
        OperationName: Update User Risk and MFA Registration Policy
    condition: selection
ocsf_mapping:
    class_name: authentication
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-26T02:19:52.401313+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-11-26T02:19:52.401313+00:00'
    detection_fields:
        -   source_field: LoggedByService
            target_table: authentication
            target_field: service.name
            mapped_at: '2025-11-26T02:19:52.401327+00:00'
        -   source_field: Category
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:19:52.401329+00:00'
        -   source_field: OperationName
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:19:52.401331+00:00'
