title: Azure Device No Longer Managed or Compliant
id: 542b9912-c01f-4e3f-89a8-014c48cdca7d
status: test
level: medium
author: Austin Songer @austinsonger
description: Identifies when a device in azure is no longer managed or compliant
references:
    - https://learn.microsoft.com/en-us/entra/identity/monitoring-health/reference-audit-activities#core-directory
falsepositives:
    - Administrator may have forgotten to review the device.
tags:
    - attack.impact
date: '2021-09-03'
modified: '2022-10-09'
logsource:
    product: azure
    service: activitylogs
detection:
    selection:
        properties.message:
            - Device no longer compliant
            - Device no longer managed
    condition: selection
ocsf_mapping:
    class_name: account_change
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:38:16.763300+00:00'
        service:
            source_field: service
            source_value: activitylogs
            mapped_at: '2025-12-04T01:38:16.763300+00:00'
    detection_fields:
        -   source_field: properties.message
            target_table: account_change
            target_field: message
            mapped_at: '2025-12-04T01:38:16.763313+00:00'
