title: Use of Legacy Authentication Protocols
id: 60f6535a-760f-42a9-be3f-c9a0a025906e
status: test
level: high
author: Yochana Henderson, '@Yochana-H'
description: Alert on when legacy authentication has been used on an account
references:
    - https://learn.microsoft.com/en-gb/entra/architecture/security-operations-privileged-accounts
falsepositives:
    - User has been put in acception group so they can use legacy authentication
tags:
    - attack.initial-access
    - attack.credential-access
    - attack.t1078.004
    - attack.t1110
date: '2022-06-17'
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        ActivityDetails: Sign-ins
        ClientApp:
            - Other client
            - IMAP
            - POP3
            - MAPI
            - SMTP
            - Exchange ActiveSync
            - Exchange Web Services
        Username: UPN
    condition: selection
ocsf_mapping:
    class_name: authentication
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:38:08.071354+00:00'
        service:
            source_field: service
            source_value: signinlogs
            mapped_at: '2025-12-04T01:38:08.071354+00:00'
    detection_fields:
        -   source_field: ActivityDetails
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:38:08.071372+00:00'
        -   source_field: ClientApp
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:38:08.071374+00:00'
        -   source_field: Username
            target_table: authentication
            target_field: actor.user.name
            mapped_at: '2025-12-04T01:38:08.071535+00:00'
