id: 7091372f-623c-4293-bc37-20c32b3492be
title: End User Consent Blocked
status: test
level: medium
description: Detects when end user consent is blocked due to risk-based consent.
author: Bailey Bercik '@baileybercik', Mark Morowczynski '@markmorow'
date: '2022-07-10'
tags:
    - attack.credential-access
    - attack.t1528
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-applications#end-user-stopped-due-to-risk-based-consent
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        failure_status_reason: Microsoft.online.Security.userConsentBlockedForRiskyAppsExceptions
    condition: selection
ocsf_mapping:
    class_name: api_activity
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-13T20:16:29.334397+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-11-13T20:16:29.334397+00:00'
    detection_fields:
        -   source_field: failure_status_reason
            target_table: api_activity
            target_field: api.response.error
            mapped_at: '2025-11-13T20:16:30.254458+00:00'
