title: Sign-ins from Non-Compliant Devices
id: 4f77e1d7-3982-4ee0-8489-abf2d6b75284
status: test
level: high
author: Michael Epping, '@mepples21'
description: Monitor and alert for sign-ins where the device was non-compliant.
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-devices#non-compliant-device-sign-in
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1078.004
date: '2022-06-28'
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        DeviceDetail.isCompliant: 'false'
    condition: selection
ocsf_mapping:
    class_name: authentication
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:38:07.481974+00:00'
        service:
            source_field: service
            source_value: signinlogs
            mapped_at: '2025-12-04T01:38:07.481974+00:00'
    detection_fields:
        -   source_field: DeviceDetail.isCompliant
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:38:07.481986+00:00'
