id: 5aecf3d5-f8a0-48e7-99be-3a759df7358f
title: App Granted Privileged Delegated Or App Permissions
status: test
level: high
description: Detects when administrator grants either application permissions (app
    roles) or highly privileged delegated permissions
author: Bailey Bercik '@baileybercik', Mark Morowczynski '@markmorow'
date: '2022-07-28'
modified: '2023-03-29'
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1098.003
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-applications#application-granted-highly-privileged-permissions
falsepositives:
    - When the permission is legitimately needed for the app
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''ba2a7c80-027b-460f-92e2-57d113897dbc''),
    type=<SigmaRelatedType.OBSOLETE: 4>)])'
taxonomy: sigma
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        properties.message: Add app role assignment to service principal
    condition: selection
ocsf_mapping:
    class_name: account_change
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-26T02:19:43.325132+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-11-26T02:19:43.325132+00:00'
    detection_fields:
        -   source_field: properties.message
            target_table: account_change
            target_field: message
            mapped_at: '2025-11-26T02:19:43.325164+00:00'
