id: 0055ad1f-be85-4798-83cf-a6da17c993b3
title: Application URI Configuration Changes
status: test
level: high
description: 'Detects when a configuration change is made to an applications URI.

    URIs for domain names that no longer exist (dangling URIs), not using HTTPS, wildcards
    at the end of the domain, URIs that are no unique to that app, or URIs that point
    to domains you do not control should be investigated.

    '
author: Mark Morowczynski '@markmorow', Bailey Bercik '@baileybercik'
date: '2022-06-02'
tags:
    - attack.t1528
    - attack.t1078.004
    - attack.persistence
    - attack.credential-access
    - attack.privilege-escalation
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-applications#application-configuration-changes
falsepositives:
    - When and administrator is making legitimate URI configuration changes to an
        application. This should be a planned event.
taxonomy: sigma
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        properties.message: Update Application Sucess- Property Name AppAddress
    condition: selection
ocsf_mapping:
    class_name: account_change
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-13T20:16:30.273134+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-11-13T20:16:30.273134+00:00'
    detection_fields:
        -   source_field: properties.message
            target_table: account_change
            target_field: message
            mapped_at: '2025-11-13T20:16:30.273141+00:00'
