id: 258b6593-215d-4a26-a141-c8e31c1299a6
title: Anomalous User Activity
status: test
level: high
description: Indicates that there are anomalous patterns of behavior like suspicious
    changes to the directory.
author: Mark Morowczynski '@markmorow', Gloria Lee, '@gleeiamglo'
date: '2023-09-03'
tags:
    - attack.t1098
    - attack.persistence
references:
    - https://learn.microsoft.com/en-us/entra/id-protection/concept-identity-protection-risks#anomalous-user-activity
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-user-accounts#unusual-sign-ins
falsepositives:
    - We recommend investigating the sessions flagged by this detection in the context
        of other sign-ins from the user.
taxonomy: sigma
logsource:
    product: azure
    service: riskdetection
detection:
    selection:
        riskEventType: anomalousUserActivity
    condition: selection
ocsf_mapping:
    class_name: user_access
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-26T02:18:59.171359+00:00'
        service:
            source_field: service
            source_value: riskdetection
            mapped_at: '2025-11-26T02:18:59.171359+00:00'
    detection_fields:
        -   source_field: riskEventType
            target_table: user_access
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:18:59.171374+00:00'
