title: Guest Users Invited To Tenant By Non Approved Inviters
id: 4ad97bf5-a514-41a4-abd3-4f3455ad4865
status: test
level: medium
author: MikeDuddington, '@dudders1'
description: Detects guest users being invited to tenant by non-approved inviters
references:
    - https://learn.microsoft.com/en-gb/entra/architecture/security-operations-user-accounts#monitoring-external-user-sign-ins
falsepositives:
    - If this was approved by System Administrator.
tags:
    - attack.initial-access
    - attack.t1078
date: '2022-07-28'
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        Category: UserManagement
        OperationName: Invite external user
    filter:
        InitiatedBy|contains: <approved guest inviter use OR for multiple>
    condition: selection and not filter
ocsf_mapping:
    class_name: entity_management
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:37:47.809194+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-12-04T01:37:47.809194+00:00'
    detection_fields:
        -   source_field: Category
            target_table: entity_management
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:37:47.809212+00:00'
        -   source_field: OperationName
            target_table: entity_management
            target_field: api.operation
            mapped_at: '2025-12-04T01:37:47.809214+00:00'
        -   source_field: InitiatedBy
            target_table: entity_management
            target_field: actor.user.name
            mapped_at: '2025-12-04T01:37:47.809216+00:00'
