title: Privileged Account Creation
id: f7b5b004-dece-46e4-a4a5-f6fd0e1c6947
status: test
level: medium
author: Mark Morowczynski '@markmorow', Yochana Henderson, '@Yochana-H', Tim Shelton
description: Detects when a new admin is created.
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-privileged-accounts#changes-to-privileged-accounts
falsepositives:
    - A legitimate new admin account being created
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1078.004
date: '2022-08-11'
modified: '2022-08-16'
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        properties.message|contains|all:
            - Add user
            - Add member to role
        Status: Success
    condition: selection
ocsf_mapping:
    class_name: account_change
    activity_id: 1
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:37:39.063978+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-12-04T01:37:39.063978+00:00'
    detection_fields:
        -   source_field: properties.message
            target_table: account_change
            target_field: message
            mapped_at: '2025-12-04T01:37:39.064012+00:00'
        -   source_field: Status
            target_table: account_change
            target_field: status_code
            mapped_at: '2025-12-04T01:37:39.064014+00:00'
