title: Roles Activated Too Frequently
id: 645fd80d-6c07-435b-9e06-7bc1b5656cba
status: test
level: high
author: Mark Morowczynski '@markmorow', Gloria Lee, '@gleeiamglo'
description: Identifies when the same privilege role has multiple activations by the
    same user.
references:
    - https://learn.microsoft.com/en-us/entra/id-governance/privileged-identity-management/pim-how-to-configure-security-alerts#roles-are-being-activated-too-frequently
falsepositives:
    - Investigate where if active time period for a role is set too short.
tags:
    - attack.t1078
    - attack.persistence
    - attack.privilege-escalation
date: '2023-09-14'
logsource:
    product: azure
    service: pim
detection:
    selection:
        riskEventType: sequentialActivationRenewalsAlertIncident
    condition: selection
ocsf_mapping:
    class_name: user_access
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:37:31.886890+00:00'
        service:
            source_field: service
            source_value: pim
            mapped_at: '2025-12-04T01:37:31.886890+00:00'
    detection_fields:
        -   source_field: riskEventType
            target_table: user_access
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:37:31.886906+00:00'
