title: Temporary Access Pass Added To An Account
id: fa84aaf5-8142-43cd-9ec2-78cfebf878ce
status: test
level: high
author: Mark Morowczynski '@markmorow', Yochana Henderson, '@Yochana-H'
description: Detects when a temporary access pass (TAP) is added to an account. TAPs
    added to priv accounts should be investigated
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-privileged-accounts#changes-to-privileged-accounts
falsepositives:
    - Administrator adding a legitimate temporary access pass
tags:
    - attack.persistence
    - attack.t1078.004
date: '2022-08-10'
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        properties.message: Admin registered security info
        Status: Admin registered temporary access pass method for user
    condition: selection
ocsf_mapping:
    class_name: account_change
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:37:40.214613+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-12-04T01:37:40.214613+00:00'
    detection_fields:
        -   source_field: properties.message
            target_table: account_change
            target_field: message
            mapped_at: '2025-12-04T01:37:40.214652+00:00'
        -   source_field: Status
            target_table: account_change
            target_field: status_code
            mapped_at: '2025-12-04T01:37:40.214656+00:00'
