title: New Root Certificate Authority Added
id: 4bb80281-3756-4ec8-a88e-523c5a6fda9e
status: test
level: medium
author: Harjot Shah Singh, '@cyb3rjy0t'
description: Detects newly added root certificate authority to an AzureAD tenant to
    support certificate based authentication.
references:
    - https://posts.specterops.io/passwordless-persistence-and-privilege-escalation-in-azure-98a01310be3f
    - https://goodworkaround.com/2022/02/15/digging-into-azure-ad-certificate-based-authentication/
falsepositives:
    - Unknown
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1556
date: '2024-03-26'
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        OperationName: Set Company Information
        TargetResources.modifiedProperties.newValue|contains: TrustedCAsForPasswordlessAuth
    condition: selection
ocsf_mapping:
    class_name: entity_management
    activity_id: 1
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:38:00.634094+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-12-04T01:38:00.634094+00:00'
    detection_fields:
        -   source_field: OperationName
            target_table: entity_management
            target_field: api.operation
            mapped_at: '2025-12-04T01:38:00.634107+00:00'
        -   source_field: TargetResources.modifiedProperties.newValue
            target_table: entity_management
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:38:00.634108+00:00'
