id: 4d136857-6a1a-432a-82fc-5dd497ee5e7c
title: Sign-ins by Unknown Devices
status: test
level: low
description: Monitor and alert for Sign-ins by unknown devices from non-Trusted locations.
author: Michael Epping, '@mepples21'
date: '2022-06-28'
modified: '2022-10-05'
tags:
    - attack.defense-evasion
    - attack.t1078.004
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-devices#non-compliant-device-sign-in
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        AuthenticationRequirement: singleFactorAuthentication
        ResultType: 0
        NetworkLocationDetails: '[]'
        DeviceDetail.deviceId: ''
    condition: selection
ocsf_mapping:
    class_name: authentication
    activity_id: 1
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-26T02:20:04.691802+00:00'
        service:
            source_field: service
            source_value: signinlogs
            mapped_at: '2025-11-26T02:20:04.691802+00:00'
    detection_fields:
        -   source_field: AuthenticationRequirement
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:20:05.768624+00:00'
        -   source_field: ResultType
            target_table: authentication
            target_field: status_id
            mapped_at: '2025-11-26T02:20:05.768637+00:00'
        -   source_field: NetworkLocationDetails
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:20:05.768640+00:00'
        -   source_field: DeviceDetail.deviceId
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:20:05.768642+00:00'
