title: Sign-ins by Unknown Devices
id: 4d136857-6a1a-432a-82fc-5dd497ee5e7c
status: test
level: low
author: Michael Epping, '@mepples21'
description: Monitor and alert for Sign-ins by unknown devices from non-Trusted locations.
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-devices#non-compliant-device-sign-in
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1078.004
date: '2022-06-28'
modified: '2022-10-05'
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        AuthenticationRequirement: singleFactorAuthentication
        ResultType: 0
        NetworkLocationDetails: '[]'
        DeviceDetail.deviceId: ''
    condition: selection
ocsf_mapping:
    class_name: authentication
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:38:01.662937+00:00'
        service:
            source_field: service
            source_value: signinlogs
            mapped_at: '2025-12-04T01:38:01.662937+00:00'
    detection_fields:
        -   source_field: AuthenticationRequirement
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:38:01.662951+00:00'
        -   source_field: ResultType
            target_table: authentication
            target_field: status_id
            mapped_at: '2025-12-04T01:38:01.662953+00:00'
        -   source_field: NetworkLocationDetails
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:38:01.662954+00:00'
        -   source_field: DeviceDetail.deviceId
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:38:01.662955+00:00'
