title: Roles Activation Doesn't Require MFA
id: 94a66f46-5b64-46ce-80b2-75dcbe627cc0
status: test
level: high
author: Mark Morowczynski '@markmorow', Gloria Lee, '@gleeiamglo'
description: Identifies when a privilege role can be activated without performing
    mfa.
references:
    - https://learn.microsoft.com/en-us/entra/id-governance/privileged-identity-management/pim-how-to-configure-security-alerts#roles-dont-require-multi-factor-authentication-for-activation
falsepositives:
    - Investigate if user is performing MFA at sign-in.
tags:
    - attack.t1078
    - attack.persistence
    - attack.privilege-escalation
date: '2023-09-14'
logsource:
    product: azure
    service: pim
detection:
    selection:
        riskEventType: noMfaOnRoleActivationAlertIncident
    condition: selection
ocsf_mapping:
    class_name: user_access
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:37:33.042977+00:00'
        service:
            source_field: service
            source_value: pim
            mapped_at: '2025-12-04T01:37:33.042977+00:00'
    detection_fields:
        -   source_field: riskEventType
            target_table: user_access
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:37:33.042992+00:00'
