id: 49a268a4-72f4-4e38-8a7b-885be690c5b5
title: User Added To Privilege Role
status: test
level: high
description: Detects when a user is added to a privileged role.
author: Mark Morowczynski '@markmorow', Yochana Henderson, '@Yochana-H'
date: '2022-08-06'
tags:
    - attack.privilege-escalation
    - attack.defense-evasion
    - attack.t1078.004
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-privileged-identity-management#azure-ad-roles-assignment
falsepositives:
    - Legtimate administrator actions of adding members from a role
taxonomy: sigma
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        properties.message:
            - Add eligible member (permanent)
            - Add eligible member (eligible)
    condition: selection
ocsf_mapping:
    class_name: account_change
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-13T20:16:30.270715+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-11-13T20:16:30.270715+00:00'
    detection_fields:
        -   source_field: properties.message
            target_table: account_change
            target_field: message
            mapped_at: '2025-11-13T20:16:30.270722+00:00'
