id: 5f521e4b-0105-4b72-845b-2198a54487b9
title: Users Authenticating To Other Azure AD Tenants
status: test
level: medium
description: Detect when users in your Azure AD tenant are authenticating to other
    Azure AD Tenants.
author: MikeDuddington, '@dudders1'
date: '2022-06-30'
tags:
    - attack.initial-access
    - attack.t1078.004
references:
    - https://learn.microsoft.com/en-gb/entra/architecture/security-operations-user-accounts#monitoring-external-user-sign-ins
falsepositives:
    - If this was approved by System Administrator.
taxonomy: sigma
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        Status: Success
        HomeTenantId: HomeTenantID
    filter:
        ResourceTenantId|contains: HomeTenantID
    condition: selection and not filter
ocsf_mapping:
    class_name: authentication
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-13T20:17:19.897148+00:00'
        service:
            source_field: service
            source_value: signinlogs
            mapped_at: '2025-11-13T20:17:19.897148+00:00'
    detection_fields:
        -   source_field: Status
            target_table: authentication
            target_field: status_id
            mapped_at: '2025-11-13T20:17:20.940067+00:00'
        -   source_field: HomeTenantId
            target_table: authentication
            target_field: cloud.account.uid
            mapped_at: '2025-11-13T20:17:20.940078+00:00'
        -   source_field: ResourceTenantId
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:17:20.940081+00:00'
