id: 572b12d4-9062-11ed-a1eb-0242ac120002
title: Suspicious SignIns From A Non Registered Device
status: test
level: high
description: Detects risky authentication from a non AD registered device without
    MFA being required.
author: Harjot Singh, '@cyb3rjy0t'
date: '2023-01-10'
tags:
    - attack.defense-evasion
    - attack.t1078
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-devices#non-compliant-device-sign-in
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        Status: Success
        AuthenticationRequirement: singleFactorAuthentication
        DeviceDetail.trusttype: ''
        RiskState: atRisk
    condition: selection
ocsf_mapping:
    class_name: authentication
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-26T02:20:09.823223+00:00'
        service:
            source_field: service
            source_value: signinlogs
            mapped_at: '2025-11-26T02:20:09.823223+00:00'
    detection_fields:
        -   source_field: Status
            target_table: authentication
            target_field: status_code
            mapped_at: '2025-11-26T02:20:10.759950+00:00'
        -   source_field: AuthenticationRequirement
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:20:10.759961+00:00'
        -   source_field: DeviceDetail.trusttype
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:20:10.759964+00:00'
        -   source_field: RiskState
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:20:10.759965+00:00'
