title: Too Many Global Admins
id: 7bbc309f-e2b1-4eb1-8369-131a367d67d3
status: test
level: high
author: Mark Morowczynski '@markmorow', Gloria Lee, '@gleeiamglo'
description: Identifies an event where there are there are too many accounts assigned
    the Global Administrator role.
references:
    - https://learn.microsoft.com/en-us/entra/id-governance/privileged-identity-management/pim-how-to-configure-security-alerts#there-are-too-many-global-administrators
falsepositives:
    - Investigate if threshold setting in PIM is too low.
tags:
    - attack.t1078
    - attack.persistence
    - attack.privilege-escalation
date: '2023-09-14'
logsource:
    product: azure
    service: pim
detection:
    selection:
        riskEventType: tooManyGlobalAdminsAssignedToTenantAlertIncident
    condition: selection
ocsf_mapping:
    class_name: user_access
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:37:35.283072+00:00'
        service:
            source_field: service
            source_value: pim
            mapped_at: '2025-12-04T01:37:35.283072+00:00'
    detection_fields:
        -   source_field: riskEventType
            target_table: user_access
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:37:35.283088+00:00'
