title: User Added To Group With CA Policy Modification Access
id: 91c95675-1f27-46d0-bead-d1ae96b97cd3
status: test
level: medium
author: Mark Morowczynski '@markmorow', Thomas Detzner '@tdetzner'
description: Monitor and alert on group membership additions of groups that have CA
    policy modification access
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-infrastructure#conditional-access
falsepositives:
    - User removed from the group is approved
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.t1548
    - attack.t1556
date: '2022-08-04'
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        properties.message: Add member from group
    condition: selection
ocsf_mapping:
    class_name: account_change
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:37:58.889609+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-12-04T01:37:58.889609+00:00'
    detection_fields:
        -   source_field: properties.message
            target_table: account_change
            target_field: message
            mapped_at: '2025-12-04T01:37:58.889620+00:00'
