title: End User Consent
id: 9b2cc4c4-2ad4-416d-8e8e-ee6aa6f5035a
status: test
level: low
author: Bailey Bercik '@baileybercik', Mark Morowczynski '@markmorow'
description: Detects when an end user consents to an application
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-applications#end-user-consent
falsepositives:
    - Unknown
tags:
    - attack.credential-access
    - attack.t1528
date: '2022-07-28'
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        ConsentContext.IsAdminConsent: 'false'
    condition: selection
ocsf_mapping:
    class_name: user_access
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:37:48.628967+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-12-04T01:37:48.628967+00:00'
    detection_fields:
        -   source_field: ConsentContext.IsAdminConsent
            target_table: user_access
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:37:48.629295+00:00'
