id: 26e7c5e2-6545-481e-b7e6-050143459635
title: CA Policy Removed by Non Approved Actor
status: test
level: medium
description: Monitor and alert on conditional access changes where non approved actor
    removed CA Policy.
author: Corissa Koopmans, '@corissalea'
date: '2022-07-19'
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.t1548
    - attack.t1556
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-infrastructure#conditional-access
falsepositives:
    - Misconfigured role permissions
    - Verify whether the user identity, user agent, and/or hostname should be making
        changes in your environment.
taxonomy: sigma
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        properties.message: Delete conditional access policy
    condition: selection
ocsf_mapping:
    class_name: account_change
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-26T02:19:50.249564+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-11-26T02:19:50.249564+00:00'
    detection_fields:
        -   source_field: properties.message
            target_table: account_change
            target_field: message
            mapped_at: '2025-11-26T02:19:50.249583+00:00'
