id: b4a6d707-9430-4f5f-af68-0337f52d5c42
title: Sign-in Failure Due to Conditional Access Requirements Not Met
status: test
level: high
description: Define a baseline threshold for failed sign-ins due to Conditional Access
    failures
author: Yochana Henderson, '@Yochana-H'
date: '2022-06-01'
tags:
    - attack.initial-access
    - attack.credential-access
    - attack.t1110
    - attack.t1078.004
references:
    - https://learn.microsoft.com/en-gb/entra/architecture/security-operations-privileged-accounts
falsepositives:
    - Service Account misconfigured
    - Misconfigured Systems
    - Vulnerability Scanners
taxonomy: sigma
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        ResultType: 53003
        Resultdescription: Blocked by Conditional Access
    condition: selection
ocsf_mapping:
    class_name: authentication
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-13T20:16:57.391575+00:00'
        service:
            source_field: service
            source_value: signinlogs
            mapped_at: '2025-11-13T20:16:57.391575+00:00'
    detection_fields:
        -   source_field: ResultType
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:16:58.869671+00:00'
        -   source_field: Resultdescription
            target_table: authentication
            target_field: status_detail
            mapped_at: '2025-11-13T20:16:58.869689+00:00'
