id: 0ddcff6d-d262-40b0-804b-80eb592de8e3
title: Azure Service Principal Created
status: test
level: medium
description: Identifies when a service principal is created in Azure.
author: Austin Songer @austinsonger
date: '2021-09-02'
modified: '2022-10-09'
tags:
    - attack.defense-evasion
references:
    - https://learn.microsoft.com/en-us/entra/identity/monitoring-health/reference-audit-activities#application-proxy
falsepositives:
    - Service principal being created may be performed by a system administrator.
    - Verify whether the user identity, user agent, and/or hostname should be making
        changes in your environment.
    - Service principal created from unfamiliar users should be investigated. If known
        behavior is causing false positives, it can be exempted from the rule.
taxonomy: sigma
logsource:
    product: azure
    service: activitylogs
detection:
    selection:
        properties.message: Add service principal
    condition: selection
ocsf_mapping:
    class_name: account_change
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-13T20:17:29.520325+00:00'
        service:
            source_field: service
            source_value: activitylogs
            mapped_at: '2025-11-13T20:17:29.520325+00:00'
    detection_fields:
        -   source_field: properties.message
            target_table: account_change
            target_field: message
            mapped_at: '2025-11-13T20:17:29.520330+00:00'
