id: 92cc3e5d-eb57-419d-8c16-5c63f325a401
title: Azure Suppression Rule Created
status: test
level: medium
description: Identifies when a suppression rule is created in Azure. Adversary's could
    attempt this to evade detection.
author: Austin Songer
date: '2021-08-16'
modified: '2022-08-23'
tags:
    - attack.impact
references:
    - https://learn.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations
falsepositives:
    - Suppression Rule being created may be performed by a system administrator.
    - Verify whether the user identity, user agent, and/or hostname should be making
        changes in your environment.
    - Suppression Rule created from unfamiliar users should be investigated. If known
        behavior is causing false positives, it can be exempted from the rule.
taxonomy: sigma
logsource:
    product: azure
    service: activitylogs
detection:
    selection:
        operationName: MICROSOFT.SECURITY/ALERTSSUPPRESSIONRULES/WRITE
    condition: selection
ocsf_mapping:
    class_name: entity_management
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-13T20:17:29.503853+00:00'
        service:
            source_field: service
            source_value: activitylogs
            mapped_at: '2025-11-13T20:17:29.503853+00:00'
    detection_fields:
        -   source_field: operationName
            target_table: entity_management
            target_field: api.operation
            mapped_at: '2025-11-13T20:17:29.503859+00:00'
