title: Successful Authentications From Countries You Do Not Operate Out Of
id: 8c944ecb-6970-4541-8496-be554b8e2846
status: test
level: medium
author: MikeDuddington, '@dudders1'
description: Detect successful authentications from countries you do not operate out
    of.
references:
    - https://learn.microsoft.com/en-gb/entra/architecture/security-operations-user-accounts
falsepositives:
    - If this was approved by System Administrator.
tags:
    - attack.initial-access
    - attack.credential-access
    - attack.t1078.004
    - attack.t1110
date: '2022-07-28'
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        Status: Success
    filter:
        Location|contains: <Countries you DO operate out of e,g GB, use OR for multiple>
    condition: selection and not filter
ocsf_mapping:
    class_name: authentication
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:38:15.385602+00:00'
        service:
            source_field: service
            source_value: signinlogs
            mapped_at: '2025-12-04T01:38:15.385602+00:00'
    detection_fields:
        -   source_field: Status
            target_table: authentication
            target_field: status_code
            mapped_at: '2025-12-04T01:38:15.385642+00:00'
        -   source_field: Location
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:38:15.385646+00:00'
