title: Anomalous Token
id: 6555754e-5e7f-4a67-ad1c-4041c413a007
status: test
level: high
author: Mark Morowczynski '@markmorow'
description: Indicates that there are abnormal characteristics in the token such as
    an unusual token lifetime or a token that is played from an unfamiliar location.
references:
    - https://learn.microsoft.com/en-us/entra/id-protection/concept-identity-protection-risks#anomalous-token
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-user-accounts#unusual-sign-ins
falsepositives:
    - We recommend investigating the sessions flagged by this detection in the context
        of other sign-ins from the user.
tags:
    - attack.t1528
    - attack.credential-access
date: '2023-08-07'
logsource:
    product: azure
    service: riskdetection
detection:
    selection:
        riskEventType: anomalousToken
    condition: selection
ocsf_mapping:
    class_name: user_access
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:37:26.112131+00:00'
        service:
            source_field: service
            source_value: riskdetection
            mapped_at: '2025-12-04T01:37:26.112131+00:00'
    detection_fields:
        -   source_field: riskEventType
            target_table: user_access
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:37:26.112147+00:00'
