id: cdeef967-f9a1-4375-90ee-6978c5f23974
title: Azure Application Credential Modified
status: test
level: medium
description: Identifies when a application credential is modified.
author: Austin Songer @austinsonger
date: '2021-09-02'
modified: '2022-10-09'
tags:
    - attack.impact
references:
    - https://www.cloud-architekt.net/auditing-of-msi-and-service-principals/
falsepositives:
    - Application credential added may be performed by a system administrator.
    - Verify whether the user identity, user agent, and/or hostname should be making
        changes in your environment.
    - Application credential added from unfamiliar users should be investigated. If
        known behavior is causing false positives, it can be exempted from the rule.
taxonomy: sigma
logsource:
    product: azure
    service: activitylogs
detection:
    selection:
        properties.message: Update application - Certificates and secrets management
    condition: selection
ocsf_mapping:
    class_name: account_change
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-26T02:20:50.182548+00:00'
        service:
            source_field: service
            source_value: activitylogs
            mapped_at: '2025-11-26T02:20:50.182548+00:00'
    detection_fields:
        -   source_field: properties.message
            target_table: account_change
            target_field: message
            mapped_at: '2025-11-26T02:20:50.182560+00:00'
