id: 5496ff55-42ec-4369-81cb-00f417029e25
title: Multifactor Authentication Interrupted
status: test
level: medium
description: Identifies user login with multifactor authentication failures, which
    might be an indication an attacker has the password for the account but can't
    pass the MFA challenge.
author: AlertIQ
date: '2021-10-10'
modified: '2022-12-18'
tags:
    - attack.initial-access
    - attack.credential-access
    - attack.t1078.004
    - attack.t1110
    - attack.t1621
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-privileged-accounts
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: azure
    service: signinlogs
detection:
    selection_50074:
        ResultType: 50074
        ResultDescription|contains: Strong Auth required
    selection_500121:
        ResultType: 500121
        ResultDescription|contains: Authentication failed during strong authentication
            request
    condition: 1 of selection_*
ocsf_mapping:
    class_name: authentication
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-13T20:17:02.528726+00:00'
        service:
            source_field: service
            source_value: signinlogs
            mapped_at: '2025-11-13T20:17:02.528726+00:00'
    detection_fields:
        -   source_field: ResultType
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:17:03.332588+00:00'
        -   source_field: ResultDescription
            target_table: authentication
            target_field: status_detail
            mapped_at: '2025-11-13T20:17:03.332637+00:00'
