title: Application Using Device Code Authentication Flow
id: 248649b7-d64f-46f0-9fb2-a52774166fb5
status: test
level: medium
author: Mark Morowczynski '@markmorow', Bailey Bercik '@baileybercik'
description: 'Device code flow is an OAuth 2.0 protocol flow specifically for input
    constrained devices and is not used in all environments.

    If this type of flow is seen in the environment and not being used in an input
    constrained device scenario, further investigation is warranted.

    This can be a misconfigured application or potentially something malicious.

    '
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-applications#application-authentication-flows
falsepositives:
    - Applications that are input constrained will need to use device code flow and
        are valid authentications.
tags:
    - attack.t1078
    - attack.defense-evasion
    - attack.persistence
    - attack.privilege-escalation
    - attack.initial-access
date: '2022-06-01'
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        properties.message: Device Code
    condition: selection
ocsf_mapping:
    class_name: account_change
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:38:12.717870+00:00'
        service:
            source_field: service
            source_value: signinlogs
            mapped_at: '2025-12-04T01:38:12.717870+00:00'
    detection_fields:
        -   source_field: properties.message
            target_table: account_change
            target_field: message
            mapped_at: '2025-12-04T01:38:12.717883+00:00'
