title: Windows LAPS Credential Dump From Entra ID
id: a4b25073-8947-489c-a8dd-93b41c23f26d
status: experimental
level: high
author: andrewdanis
description: Detects when an account dumps the LAPS password from Entra ID.
references:
    - https://twitter.com/NathanMcNulty/status/1785051227568632263
    - https://www.cloudcoffee.ch/microsoft-365/configure-windows-laps-in-microsoft-intune/
    - https://techcommunity.microsoft.com/t5/microsoft-entra-blog/introducing-windows-local-administrator-password-solution-with/ba-p/1942487
falsepositives:
    - Approved activity performed by an Administrator.
tags:
    - attack.t1098.005
date: '2024-06-26'
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        category: Device
        activityType|contains: Recover device local administrator password
        additionalDetails.additionalInfo|contains: Successfully recovered local credential
            by device id
    condition: selection
ocsf_mapping:
    class_name: account_change
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:37:54.352434+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-12-04T01:37:54.352434+00:00'
    detection_fields:
        -   source_field: category
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:37:54.352450+00:00'
        -   source_field: activityType
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:37:54.352452+00:00'
        -   source_field: additionalDetails.additionalInfo
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:37:54.352454+00:00'
