id: 55695bc0-c8cf-461f-a379-2535f563c854
title: Applications That Are Using ROPC Authentication Flow
status: test
level: medium
description: 'Resource owner password credentials (ROPC) should be avoided if at all
    possible as this requires the user to expose their current password credentials
    to the application directly.

    The application then uses those credentials to authenticate the user against the
    identity provider.

    '
author: Mark Morowczynski '@markmorow', Bailey Bercik '@baileybercik'
date: '2022-06-01'
tags:
    - attack.t1078
    - attack.defense-evasion
    - attack.persistence
    - attack.privilege-escalation
    - attack.initial-access
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-applications#application-authentication-flows
falsepositives:
    - Applications that are being used as part of automated testing or a legacy application
        that cannot use any other modern authentication flow
taxonomy: sigma
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        properties.message: ROPC
    condition: selection
ocsf_mapping:
    class_name: account_change
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-26T02:20:36.979473+00:00'
        service:
            source_field: service
            source_value: signinlogs
            mapped_at: '2025-11-26T02:20:36.979473+00:00'
    detection_fields:
        -   source_field: properties.message
            target_table: account_change
            target_field: message
            mapped_at: '2025-11-26T02:20:36.979489+00:00'
