title: Authentications To Important Apps Using Single Factor Authentication
id: f272fb46-25f2-422c-b667-45837994980f
status: test
level: medium
author: MikeDuddington, '@dudders1'
description: Detect when authentications to important application(s) only required
    single-factor authentication
references:
    - https://learn.microsoft.com/en-gb/entra/architecture/security-operations-user-accounts
falsepositives:
    - If this was approved by System Administrator.
tags:
    - attack.initial-access
    - attack.t1078
date: '2022-07-28'
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        Status: Success
        AppId: Insert Application ID use OR for multiple
        AuthenticationRequirement: singleFactorAuthentication
    condition: selection
ocsf_mapping:
    class_name: authentication
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:38:13.915633+00:00'
        service:
            source_field: service
            source_value: signinlogs
            mapped_at: '2025-12-04T01:38:13.915633+00:00'
    detection_fields:
        -   source_field: Status
            target_table: authentication
            target_field: status_code
            mapped_at: '2025-12-04T01:38:13.915650+00:00'
        -   source_field: AppId
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:38:13.915652+00:00'
        -   source_field: AuthenticationRequirement
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:38:13.915654+00:00'
