title: Discovery Using AzureHound
id: 35b781cc-1a08-4a5a-80af-42fd7c315c6b
status: test
level: high
author: Janantha Marasinghe
description: Detects AzureHound (A BloodHound data collector for Microsoft Azure)
    activity via the default User-Agent that is used during its operation after successful
    authentication.
references:
    - https://github.com/BloodHoundAD/AzureHound
falsepositives:
    - Unknown
tags:
    - attack.discovery
    - attack.t1087.004
    - attack.t1526
date: '2022-11-27'
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        userAgent|contains: azurehound
        ResultType: 0
    condition: selection
ocsf_mapping:
    class_name: api_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:38:06.991797+00:00'
        service:
            source_field: service
            source_value: signinlogs
            mapped_at: '2025-12-04T01:38:06.991797+00:00'
    detection_fields:
        -   source_field: userAgent
            target_table: api_activity
            target_field: http_request.user_agent
            mapped_at: '2025-12-04T01:38:06.991808+00:00'
        -   source_field: ResultType
            target_table: api_activity
            target_field: api.response.code
            mapped_at: '2025-12-04T01:38:06.991810+00:00'
