id: e40f4962-b02b-4192-9bfe-245f7ece1f99
title: Multifactor Authentication Denied
status: test
level: medium
description: User has indicated they haven't instigated the MFA prompt and could indicate
    an attacker has the password for the account.
author: AlertIQ
date: '2022-03-24'
tags:
    - attack.initial-access
    - attack.credential-access
    - attack.t1078.004
    - attack.t1110
    - attack.t1621
references:
    - https://www.microsoft.com/security/blog/2022/03/22/dev-0537-criminal-actor-targeting-organizations-for-data-exfiltration-and-destruction/
falsepositives:
    - Users actually login but miss-click into the Deny button when MFA prompt.
taxonomy: sigma
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        AuthenticationRequirement: multiFactorAuthentication
        Status|contains: MFA Denied
    condition: selection
ocsf_mapping:
    class_name: authentication
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-13T20:16:56.760197+00:00'
        service:
            source_field: service
            source_value: signinlogs
            mapped_at: '2025-11-13T20:16:56.760197+00:00'
    detection_fields:
        -   source_field: AuthenticationRequirement
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:16:56.760206+00:00'
        -   source_field: Status
            target_table: authentication
            target_field: status_id
            mapped_at: '2025-11-13T20:16:56.760208+00:00'
