title: Azure Subscription Permission Elevation Via ActivityLogs
id: 09438caa-07b1-4870-8405-1dbafe3dad95
status: test
level: high
author: Austin Songer @austinsonger
description: 'Detects when a user has been elevated to manage all Azure Subscriptions.

    This change should be investigated immediately if it isn''t planned.

    This setting could allow an attacker access to Azure subscriptions in your environment.

    '
references:
    - https://learn.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations#microsoftauthorization
falsepositives:
    - If this was approved by System Administrator.
tags:
    - attack.initial-access
    - attack.t1078.004
date: '2021-11-26'
modified: '2022-08-23'
logsource:
    product: azure
    service: activitylogs
detection:
    selection:
        operationName: MICROSOFT.AUTHORIZATION/ELEVATEACCESS/ACTION
    condition: selection
ocsf_mapping:
    class_name: entity_management
    activity_id: 3
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:38:32.231916+00:00'
        service:
            source_field: service
            source_value: activitylogs
            mapped_at: '2025-12-04T01:38:32.231916+00:00'
    detection_fields:
        -   source_field: operationName
            target_table: entity_management
            target_field: api.operation
            mapped_at: '2025-12-04T01:38:32.231932+00:00'
