id: b1bc08d1-8224-4758-a0e6-fbcfc98c73bb
title: Roles Assigned Outside PIM
status: test
level: high
description: Identifies when a privilege role assignment has taken place outside of
    PIM and may indicate an attack.
author: Mark Morowczynski '@markmorow', Gloria Lee, '@gleeiamglo'
date: '2023-09-14'
tags:
    - attack.t1078
    - attack.persistence
    - attack.privilege-escalation
references:
    - https://learn.microsoft.com/en-us/entra/id-governance/privileged-identity-management/pim-how-to-configure-security-alerts#roles-are-being-assigned-outside-of-privileged-identity-management
falsepositives:
    - Investigate where users are being assigned privileged roles outside of Privileged
        Identity Management and prohibit future assignments from there.
taxonomy: sigma
logsource:
    product: azure
    service: pim
detection:
    selection:
        riskEventType: rolesAssignedOutsidePrivilegedIdentityManagementAlertConfiguration
    condition: selection
ocsf_mapping:
    class_name: user_access
    activity_id: 1
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-26T02:19:06.843840+00:00'
        service:
            source_field: service
            source_value: pim
            mapped_at: '2025-11-26T02:19:06.843840+00:00'
    detection_fields:
        -   source_field: riskEventType
            target_table: user_access
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:19:06.843864+00:00'
