id: 2b7d6fc0-71ac-4cf7-8ed1-b5788ee5257a
title: Account Lockout
status: test
level: medium
description: Identifies user account which has been locked because the user tried
    to sign in too many times with an incorrect user ID or password.
author: AlertIQ
date: '2021-10-10'
modified: '2022-12-25'
tags:
    - attack.credential-access
    - attack.t1110
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-privileged-accounts
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        ResultType: 50053
    condition: selection
ocsf_mapping:
    class_name: authentication
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-13T20:17:20.944390+00:00'
        service:
            source_field: service
            source_value: signinlogs
            mapped_at: '2025-11-13T20:17:20.944390+00:00'
    detection_fields:
        -   source_field: ResultType
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:17:20.944397+00:00'
