title: End User Consent Blocked
id: 7091372f-623c-4293-bc37-20c32b3492be
status: test
level: medium
author: Bailey Bercik '@baileybercik', Mark Morowczynski '@markmorow'
description: Detects when end user consent is blocked due to risk-based consent.
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-applications#end-user-stopped-due-to-risk-based-consent
falsepositives:
    - Unknown
tags:
    - attack.credential-access
    - attack.t1528
date: '2022-07-10'
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        failure_status_reason: Microsoft.online.Security.userConsentBlockedForRiskyAppsExceptions
    condition: selection
ocsf_mapping:
    class_name: user_access
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:37:39.551669+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-12-04T01:37:39.551669+00:00'
    detection_fields:
        -   source_field: failure_status_reason
            target_table: user_access
            target_field: status_detail
            mapped_at: '2025-12-04T01:37:39.551705+00:00'
