id: a3f55ebd-0c01-4ed6-adc0-8fb76d8cd3cd
title: Malicious IP Address Sign-In Failure Rate
status: test
level: high
description: Indicates sign-in from a malicious IP address based on high failure rates.
author: Mark Morowczynski '@markmorow', Gloria Lee, '@gleeiamglo'
date: '2023-09-07'
tags:
    - attack.t1090
    - attack.command-and-control
references:
    - https://learn.microsoft.com/en-us/entra/id-protection/concept-identity-protection-risks#malicious-ip-address
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-user-accounts#unusual-sign-ins
falsepositives:
    - We recommend investigating the sessions flagged by this detection in the context
        of other sign-ins from the user.
taxonomy: sigma
logsource:
    product: azure
    service: riskdetection
detection:
    selection:
        riskEventType: maliciousIPAddress
    condition: selection
ocsf_mapping:
    class_name: user_access
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-26T02:18:53.225878+00:00'
        service:
            source_field: service
            source_value: riskdetection
            mapped_at: '2025-11-26T02:18:53.225878+00:00'
    detection_fields:
        -   source_field: riskEventType
            target_table: user_access
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:18:53.225888+00:00'
