id: 36440e1c-5c22-467a-889b-593e66498472
title: Malicious IP Address Sign-In Suspicious
status: test
level: high
description: Indicates sign-in from a malicious IP address known to be malicious at
    time of sign-in.
author: Mark Morowczynski '@markmorow', Gloria Lee, '@gleeiamglo'
date: '2023-09-07'
tags:
    - attack.t1090
    - attack.command-and-control
references:
    - https://learn.microsoft.com/en-us/entra/id-protection/concept-identity-protection-risks#malicious-ip-address
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-user-accounts#unusual-sign-ins
falsepositives:
    - We recommend investigating the sessions flagged by this detection in the context
        of other sign-ins from the user.
taxonomy: sigma
logsource:
    product: azure
    service: riskdetection
detection:
    selection:
        riskEventType: suspiciousIPAddress
    condition: selection
ocsf_mapping:
    class_name: api_activity
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-13T20:16:23.419166+00:00'
        service:
            source_field: service
            source_value: riskdetection
            mapped_at: '2025-11-13T20:16:23.419166+00:00'
    detection_fields:
        -   source_field: riskEventType
            target_table: api_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:16:23.419187+00:00'
