title: Sign-in Failure Due to Conditional Access Requirements Not Met
id: b4a6d707-9430-4f5f-af68-0337f52d5c42
status: test
level: high
author: Yochana Henderson, '@Yochana-H'
description: Define a baseline threshold for failed sign-ins due to Conditional Access
    failures
references:
    - https://learn.microsoft.com/en-gb/entra/architecture/security-operations-privileged-accounts
falsepositives:
    - Service Account misconfigured
    - Misconfigured Systems
    - Vulnerability Scanners
tags:
    - attack.initial-access
    - attack.credential-access
    - attack.t1110
    - attack.t1078.004
date: '2022-06-01'
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        ResultType: 53003
        Resultdescription: Blocked by Conditional Access
    condition: selection
ocsf_mapping:
    class_name: authentication
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:38:02.835788+00:00'
        service:
            source_field: service
            source_value: signinlogs
            mapped_at: '2025-12-04T01:38:02.835788+00:00'
    detection_fields:
        -   source_field: ResultType
            target_table: authentication
            target_field: status_id
            mapped_at: '2025-12-04T01:38:02.835800+00:00'
        -   source_field: Resultdescription
            target_table: authentication
            target_field: status_detail
            mapped_at: '2025-12-04T01:38:02.835802+00:00'
