id: 352a54e1-74ba-4929-9d47-8193d67aba1e
title: Azure Domain Federation Settings Modified
status: test
level: medium
description: Identifies when an user or application modified the federation settings
    on the domain.
author: Austin Songer
date: '2021-09-06'
modified: '2022-06-08'
tags:
    - attack.initial-access
    - attack.t1078
references:
    - https://learn.microsoft.com/en-us/azure/active-directory/hybrid/how-to-connect-monitor-federation-changes
falsepositives:
    - Federation Settings being modified or deleted may be performed by a system administrator.
    - Verify whether the user identity, user agent, and/or hostname should be making
        changes in your environment.
    - Federation Settings modified from unfamiliar users should be investigated. If
        known behavior is causing false positives, it can be exempted from the rule.
taxonomy: sigma
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        ActivityDisplayName: Set federation settings on domain
    condition: selection
ocsf_mapping:
    class_name: account_change
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-26T02:19:41.802158+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-11-26T02:19:41.802158+00:00'
    detection_fields:
        -   source_field: ActivityDisplayName
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:19:42.791651+00:00'
