id: 0b4b72e3-4c53-4d5b-b198-2c58cfef39a9
title: Guest User Invited By Non Approved Inviters
status: test
level: medium
description: Detects when a user that doesn't have permissions to invite a guest user
    attempts to invite one.
author: Mark Morowczynski '@markmorow', Yochana Henderson, '@Yochana-H'
date: '2022-08-10'
tags:
    - attack.persistence
    - attack.defense-evasion
    - attack.t1078.004
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-privileged-accounts#things-to-monitor
falsepositives:
    - A non malicious user is unaware of the proper process
taxonomy: sigma
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        properties.message: Invite external user
        Status: failure
    condition: selection
ocsf_mapping:
    class_name: account_change
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-13T20:16:47.341980+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-11-13T20:16:47.341980+00:00'
    detection_fields:
        -   source_field: properties.message
            target_table: account_change
            target_field: message
            mapped_at: '2025-11-13T20:16:47.342006+00:00'
        -   source_field: Status
            target_table: account_change
            target_field: status_id
            mapped_at: '2025-11-13T20:16:47.342011+00:00'
