id: 74298991-9fc4-460e-a92e-511aa60baec1
title: Added Owner To Application
status: test
level: medium
description: Detects when a new owner is added to an application. This gives that
    account privileges to make modifications and configuration changes to the application.
author: Mark Morowczynski '@markmorow', Bailey Bercik '@baileybercik'
date: '2022-06-02'
tags:
    - attack.t1552
    - attack.credential-access
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-applications#new-owner
falsepositives:
    - When a new application owner is added by an administrator
taxonomy: sigma
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        properties.message: Add owner to application
    condition: selection
ocsf_mapping:
    class_name: account_change
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-13T20:16:44.396106+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-11-13T20:16:44.396106+00:00'
    detection_fields:
        -   source_field: properties.message
            target_table: account_change
            target_field: message
            mapped_at: '2025-11-13T20:16:44.396120+00:00'
