title: Azure AD Only Single Factor Authentication Required
id: 28eea407-28d7-4e42-b0be-575d5ba60b2c
status: test
level: low
author: MikeDuddington, '@dudders1'
description: Detect when users are authenticating without MFA being required.
references:
    - https://learn.microsoft.com/en-gb/entra/architecture/security-operations-user-accounts
falsepositives:
    - If this was approved by System Administrator.
tags:
    - attack.initial-access
    - attack.credential-access
    - attack.t1078.004
    - attack.t1556.006
date: '2022-07-27'
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        Status: Success
        AuthenticationRequirement: singleFactorAuthentication
    condition: selection
ocsf_mapping:
    class_name: authentication
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:38:01.000095+00:00'
        service:
            source_field: service
            source_value: signinlogs
            mapped_at: '2025-12-04T01:38:01.000095+00:00'
    detection_fields:
        -   source_field: Status
            target_table: authentication
            target_field: status_code
            mapped_at: '2025-12-04T01:38:01.000109+00:00'
        -   source_field: AuthenticationRequirement
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:38:01.000110+00:00'
