id: f272fb46-25f2-422c-b667-45837994980f
title: Authentications To Important Apps Using Single Factor Authentication
status: test
level: medium
description: Detect when authentications to important application(s) only required
    single-factor authentication
author: MikeDuddington, '@dudders1'
date: '2022-07-28'
tags:
    - attack.initial-access
    - attack.t1078
references:
    - https://learn.microsoft.com/en-gb/entra/architecture/security-operations-user-accounts
falsepositives:
    - If this was approved by System Administrator.
taxonomy: sigma
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        Status: Success
        AppId: Insert Application ID use OR for multiple
        AuthenticationRequirement: singleFactorAuthentication
    condition: selection
ocsf_mapping:
    class_name: authentication
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-13T20:17:21.631304+00:00'
        service:
            source_field: service
            source_value: signinlogs
            mapped_at: '2025-11-13T20:17:21.631304+00:00'
    detection_fields:
        -   source_field: Status
            target_table: authentication
            target_field: status_id
            mapped_at: '2025-11-13T20:17:22.611581+00:00'
        -   source_field: AppId
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:17:22.611599+00:00'
        -   source_field: AuthenticationRequirement
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:17:22.611602+00:00'
