title: Certificate-Based Authentication Enabled
id: c2496b41-16a9-4016-a776-b23f8910dc58
status: test
level: medium
author: Harjot Shah Singh, '@cyb3rjy0t'
description: Detects when certificate based authentication has been enabled in an
    Azure Active Directory tenant.
references:
    - https://posts.specterops.io/passwordless-persistence-and-privilege-escalation-in-azure-98a01310be3f
    - https://goodworkaround.com/2022/02/15/digging-into-azure-ad-certificate-based-authentication/
falsepositives:
    - Unknown
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1556
date: '2024-03-26'
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        OperationName: Authentication Methods Policy Update
        TargetResources.modifiedProperties|contains: AuthenticationMethodsPolicy
    condition: selection
ocsf_mapping:
    class_name: authentication
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:37:57.615070+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-12-04T01:37:57.615070+00:00'
    detection_fields:
        -   source_field: OperationName
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:37:57.615083+00:00'
        -   source_field: TargetResources.modifiedProperties
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:37:57.615085+00:00'
