id: 11c767ae-500b-423b-bae3-b234450736ed
title: Users Added to Global or Device Admin Roles
status: test
level: high
description: Monitor and alert for users added to device admin roles.
author: Michael Epping, '@mepples21'
date: '2022-06-28'
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1078.004
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-devices#device-administrator-roles
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        Category: RoleManagement
        OperationName|contains|all:
            - Add
            - member to role
        TargetResources|contains:
            - 7698a772-787b-4ac8-901f-60d6b08affd2
            - 62e90394-69f5-4237-9190-012177145e10
    condition: selection
ocsf_mapping:
    class_name: account_change
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-26T02:19:38.900811+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-11-26T02:19:38.900811+00:00'
    detection_fields:
        -   source_field: Category
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:19:40.013742+00:00'
        -   source_field: OperationName
            target_table: account_change
            target_field: api.operation
            mapped_at: '2025-11-26T02:19:40.013763+00:00'
        -   source_field: TargetResources
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:19:40.013765+00:00'
