id: 53acd925-2003-440d-a1f3-71a5253fe237
title: Anonymous IP Address
status: test
level: high
description: Indicates sign-ins from an anonymous IP address, for example, using an
    anonymous browser or VPN.
author: Gloria Lee, '@gleeiamglo'
date: '2023-08-22'
tags:
    - attack.t1528
    - attack.credential-access
references:
    - https://learn.microsoft.com/en-us/graph/api/resources/riskdetection?view=graph-rest-1.0
    - https://learn.microsoft.com/en-us/entra/id-protection/concept-identity-protection-risks#anonymous-ip-address
falsepositives:
    - We recommend investigating the sessions flagged by this detection in the context
        of other sign-ins
taxonomy: sigma
logsource:
    product: azure
    service: riskdetection
detection:
    selection:
        riskEventType: anonymizedIPAddress
    condition: selection
ocsf_mapping:
    class_name: user_access
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-26T02:18:50.100122+00:00'
        service:
            source_field: service
            source_value: riskdetection
            mapped_at: '2025-11-26T02:18:50.100122+00:00'
    detection_fields:
        -   source_field: riskEventType
            target_table: user_access
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:18:50.100135+00:00'
