id: 4ad97bf5-a514-41a4-abd3-4f3455ad4865
title: Guest Users Invited To Tenant By Non Approved Inviters
status: test
level: medium
description: Detects guest users being invited to tenant by non-approved inviters
author: MikeDuddington, '@dudders1'
date: '2022-07-28'
tags:
    - attack.initial-access
    - attack.t1078
references:
    - https://learn.microsoft.com/en-gb/entra/architecture/security-operations-user-accounts#monitoring-external-user-sign-ins
falsepositives:
    - If this was approved by System Administrator.
taxonomy: sigma
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        Category: UserManagement
        OperationName: Invite external user
    filter:
        InitiatedBy|contains: <approved guest inviter use OR for multiple>
    condition: selection and not filter
ocsf_mapping:
    class_name: user_access
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-13T20:16:36.511618+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-11-13T20:16:36.511618+00:00'
    detection_fields:
        -   source_field: Category
            target_table: user_access
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:16:37.479476+00:00'
        -   source_field: OperationName
            target_table: user_access
            target_field: api.operation
            mapped_at: '2025-11-13T20:16:37.479504+00:00'
        -   source_field: InitiatedBy
            target_table: user_access
            target_field: actor.user.name
            mapped_at: '2025-11-13T20:16:37.479509+00:00'
