id: 28ecba0a-c743-4690-ad29-9a8f6f25a6f9
title: Password Spray Activity
status: test
level: high
description: Indicates that a password spray attack has been successfully performed.
author: Mark Morowczynski '@markmorow', Gloria Lee, '@gleeiamglo'
date: '2023-09-03'
tags:
    - attack.t1110
    - attack.credential-access
references:
    - https://learn.microsoft.com/en-us/entra/id-protection/concept-identity-protection-risks#password-spray
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-user-accounts#unusual-sign-ins
falsepositives:
    - We recommend investigating the sessions flagged by this detection in the context
        of other sign-ins from the user.
taxonomy: sigma
logsource:
    product: azure
    service: riskdetection
detection:
    selection:
        riskEventType: passwordSpray
    condition: selection
ocsf_mapping:
    class_name: api_activity
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-13T20:16:23.454138+00:00'
        service:
            source_field: service
            source_value: riskdetection
            mapped_at: '2025-11-13T20:16:23.454138+00:00'
    detection_fields:
        -   source_field: riskEventType
            target_table: api_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:16:23.454147+00:00'
