id: 1c71e254-6655-42c1-b2d6-5e4718d7fc0a
title: Azure Kubernetes CronJob
status: test
level: medium
description: 'Identifies when a Azure Kubernetes CronJob runs in Azure Cloud. Kubernetes
    Job is a controller that creates one or more pods and ensures that a specified
    number of them successfully terminate.

    Kubernetes Job can be used to run containers that perform finite tasks for batch
    jobs. Kubernetes CronJob is used to schedule Jobs.

    An Adversary may use Kubernetes CronJob for scheduling execution of malicious
    code that would run as a container in the cluster.

    '
author: Austin Songer @austinsonger
date: '2021-11-22'
modified: '2022-12-18'
tags:
    - attack.persistence
    - attack.t1053.003
    - attack.privilege-escalation
    - attack.execution
references:
    - https://learn.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations#microsoftkubernetes
    - https://kubernetes.io/docs/concepts/workloads/controllers/cron-jobs/
    - https://kubernetes.io/docs/concepts/workloads/controllers/job/
    - https://www.microsoft.com/security/blog/2020/04/02/attack-matrix-kubernetes/
falsepositives:
    - Azure Kubernetes CronJob/Job may be done by a system administrator.
    - If known behavior is causing false positives, it can be exempted from the rule.
taxonomy: sigma
logsource:
    product: azure
    service: activitylogs
detection:
    selection:
        operationName|startswith:
            - MICROSOFT.KUBERNETES/CONNECTEDCLUSTERS/BATCH
            - MICROSOFT.CONTAINERSERVICE/MANAGEDCLUSTERS/BATCH
        operationName|endswith:
            - /CRONJOBS/WRITE
            - /JOBS/WRITE
    condition: selection
ocsf_mapping:
    class_name: entity_management
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-13T20:17:29.494594+00:00'
        service:
            source_field: service
            source_value: activitylogs
            mapped_at: '2025-11-13T20:17:29.494594+00:00'
    detection_fields:
        -   source_field: operationName
            target_table: entity_management
            target_field: api.operation
            mapped_at: '2025-11-13T20:17:29.494610+00:00'
