title: CA Policy Removed by Non Approved Actor
id: 26e7c5e2-6545-481e-b7e6-050143459635
status: test
level: medium
author: Corissa Koopmans, '@corissalea'
description: Monitor and alert on conditional access changes where non approved actor
    removed CA Policy.
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-infrastructure#conditional-access
falsepositives:
    - Misconfigured role permissions
    - Verify whether the user identity, user agent, and/or hostname should be making
        changes in your environment.
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.t1548
    - attack.t1556
date: '2022-07-19'
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        properties.message: Delete conditional access policy
    condition: selection
ocsf_mapping:
    class_name: account_change
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:37:55.504922+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-12-04T01:37:55.504922+00:00'
    detection_fields:
        -   source_field: properties.message
            target_table: account_change
            target_field: message
            mapped_at: '2025-12-04T01:37:55.504938+00:00'
