title: Account Disabled or Blocked for Sign in Attempts
id: 4afac85c-224a-4dd7-b1af-8da40e1c60bd
status: test
level: medium
author: Yochana Henderson, '@Yochana-H'
description: Detects when an account is disabled or blocked for sign in but tried
    to log in
references:
    - https://learn.microsoft.com/en-gb/entra/architecture/security-operations-privileged-accounts
falsepositives:
    - Account disabled or blocked in error
    - Automation account has been blocked or disabled
tags:
    - attack.initial-access
    - attack.t1078.004
date: '2022-06-17'
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        ResultType: 50057
        ResultDescription: Failure
    condition: selection
ocsf_mapping:
    class_name: authentication
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:38:14.992577+00:00'
        service:
            source_field: service
            source_value: signinlogs
            mapped_at: '2025-12-04T01:38:14.992577+00:00'
    detection_fields:
        -   source_field: ResultType
            target_table: authentication
            target_field: status_id
            mapped_at: '2025-12-04T01:38:14.992590+00:00'
        -   source_field: ResultDescription
            target_table: authentication
            target_field: status_detail
            mapped_at: '2025-12-04T01:38:14.992591+00:00'
