id: 9a60e676-26ac-44c3-814b-0c2a8b977adf
title: User Access Blocked by Azure Conditional Access
status: test
level: medium
description: 'Detect access has been blocked by Conditional Access policies.

    The access policy does not allow token issuance which might be sights≈ of unauthorizeed
    login to valid accounts.

    '
author: AlertIQ
date: '2021-10-10'
modified: '2022-12-25'
tags:
    - attack.credential-access
    - attack.initial-access
    - attack.t1110
    - attack.t1078.004
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-privileged-accounts
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        ResultType: 53003
    condition: selection
ocsf_mapping:
    class_name: authentication
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-13T20:17:17.036556+00:00'
        service:
            source_field: service
            source_value: signinlogs
            mapped_at: '2025-11-13T20:17:17.036556+00:00'
    detection_fields:
        -   source_field: ResultType
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:17:17.036597+00:00'
