id: 448fd1ea-2116-4c62-9cde-a92d120e0f08
title: Azure Service Principal Removed
status: test
level: medium
description: Identifies when a service principal was removed in Azure.
author: Austin Songer @austinsonger
date: '2021-09-03'
modified: '2022-10-09'
tags:
    - attack.defense-evasion
references:
    - https://learn.microsoft.com/en-us/entra/identity/monitoring-health/reference-audit-activities#application-proxy
falsepositives:
    - Service principal being removed may be performed by a system administrator.
    - Verify whether the user identity, user agent, and/or hostname should be making
        changes in your environment.
    - Service principal removed from unfamiliar users should be investigated. If known
        behavior is causing false positives, it can be exempted from the rule.
taxonomy: sigma
logsource:
    product: azure
    service: activitylogs
detection:
    selection:
        properties.message: Remove service principal
    condition: selection
ocsf_mapping:
    class_name: account_change
    activity_id: 6
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-26T02:21:09.124011+00:00'
        service:
            source_field: service
            source_value: activitylogs
            mapped_at: '2025-11-26T02:21:09.124011+00:00'
    detection_fields:
        -   source_field: properties.message
            target_table: account_change
            target_field: message
            mapped_at: '2025-11-26T02:21:09.124039+00:00'
