id: 2a7d64cf-81fa-4daf-ab1b-ab80b789c067
title: Azure Firewall Rule Configuration Modified or Deleted
status: test
level: medium
description: Identifies when a Firewall Rule Configuration is Modified or Deleted.
author: Austin Songer @austinsonger
date: '2021-08-08'
modified: '2022-08-23'
tags:
    - attack.impact
references:
    - https://learn.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations
falsepositives:
    - Firewall Rule Configuration being modified or deleted may be performed by a
        system administrator. Verify whether the user identity, user agent, and/or
        hostname should be making changes in your environment.
    - Firewall Rule Configuration modified or deleted from unfamiliar users should
        be investigated. If known behavior is causing false positives, it can be exempted
        from the rule.
taxonomy: sigma
logsource:
    product: azure
    service: activitylogs
detection:
    selection:
        operationName:
            - MICROSOFT.NETWORK/FIREWALLPOLICIES/RULECOLLECTIONGROUPS/WRITE
            - MICROSOFT.NETWORK/FIREWALLPOLICIES/RULECOLLECTIONGROUPS/DELETE
            - MICROSOFT.NETWORK/FIREWALLPOLICIES/RULEGROUPS/WRITE
            - MICROSOFT.NETWORK/FIREWALLPOLICIES/RULEGROUPS/DELETE
    condition: selection
ocsf_mapping:
    class_name: entity_management
    activity_id: 3
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-26T02:20:49.251910+00:00'
        service:
            source_field: service
            source_value: activitylogs
            mapped_at: '2025-11-26T02:20:49.251910+00:00'
    detection_fields:
        -   source_field: operationName
            target_table: entity_management
            target_field: api.operation
            mapped_at: '2025-11-26T02:20:49.251926+00:00'
