id: 8c944ecb-6970-4541-8496-be554b8e2846
title: Successful Authentications From Countries You Do Not Operate Out Of
status: test
level: medium
description: Detect successful authentications from countries you do not operate out
    of.
author: MikeDuddington, '@dudders1'
date: '2022-07-28'
tags:
    - attack.initial-access
    - attack.credential-access
    - attack.t1078.004
    - attack.t1110
references:
    - https://learn.microsoft.com/en-gb/entra/architecture/security-operations-user-accounts
falsepositives:
    - If this was approved by System Administrator.
taxonomy: sigma
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        Status: Success
    filter:
        Location|contains: <Countries you DO operate out of e,g GB, use OR for multiple>
    condition: selection and not filter
ocsf_mapping:
    class_name: authentication
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-13T20:17:22.617985+00:00'
        service:
            source_field: service
            source_value: signinlogs
            mapped_at: '2025-11-13T20:17:22.617985+00:00'
    detection_fields:
        -   source_field: Status
            target_table: authentication
            target_field: status_id
            mapped_at: '2025-11-13T20:17:22.617991+00:00'
        -   source_field: Location
            target_table: authentication
            target_field: dst_endpoint.location.city
            mapped_at: '2025-11-13T20:17:22.617993+00:00'
