title: Added Credentials to Existing Application
id: cbb67ecc-fb70-4467-9350-c910bdf7c628
status: test
level: high
author: Mark Morowczynski '@markmorow', Bailey Bercik '@baileybercik'
description: Detects when a new credential is added to an existing application. Any
    additional credentials added outside of expected processes could be a malicious
    actor using those credentials.
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-applications#application-credentials
falsepositives:
    - When credentials are added/removed as part of the normal working hours/workflows
tags:
    - attack.t1098.001
    - attack.persistence
date: '2022-05-26'
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        properties.message:
            - Update Application-Certificates and secrets management
            - Update Service principal/Update Application
    condition: selection
ocsf_mapping:
    class_name: account_change
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:37:46.332963+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-12-04T01:37:46.332963+00:00'
    detection_fields:
        -   source_field: properties.message
            target_table: account_change
            target_field: message
            mapped_at: '2025-12-04T01:37:46.332984+00:00'
