id: 91c95675-1f27-46d0-bead-d1ae96b97cd3
title: User Added To Group With CA Policy Modification Access
status: test
level: medium
description: Monitor and alert on group membership additions of groups that have CA
    policy modification access
author: Mark Morowczynski '@markmorow', Thomas Detzner '@tdetzner'
date: '2022-08-04'
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.t1548
    - attack.t1556
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-infrastructure#conditional-access
falsepositives:
    - User removed from the group is approved
taxonomy: sigma
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        properties.message: Add member from group
    condition: selection
ocsf_mapping:
    class_name: account_change
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-13T20:16:48.927308+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-11-13T20:16:48.927308+00:00'
    detection_fields:
        -   source_field: properties.message
            target_table: account_change
            target_field: message
            mapped_at: '2025-11-13T20:16:48.927316+00:00'
