title: Increased Failed Authentications Of Any Type
id: e1d02b53-c03c-4948-b11d-4d00cca49d03
status: test
level: medium
author: Mark Morowczynski '@markmorow', MikeDuddington, '@dudders1'
description: Detects when sign-ins increased by 10% or greater.
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-user-accounts#monitoring-for-failed-unusual-sign-ins
falsepositives:
    - Unlikely
tags:
    - attack.defense-evasion
    - attack.t1078
date: '2022-08-11'
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        Status: failure
        Count: <10%
    condition: selection
ocsf_mapping:
    class_name: authentication
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:38:05.431685+00:00'
        service:
            source_field: service
            source_value: signinlogs
            mapped_at: '2025-12-04T01:38:05.431685+00:00'
    detection_fields:
        -   source_field: Status
            target_table: authentication
            target_field: status_code
            mapped_at: '2025-12-04T01:38:05.431725+00:00'
        -   source_field: Count
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:38:05.431731+00:00'
