title: Azure Virtual Network Device Modified or Deleted
id: 15ef3fac-f0f0-4dc4-ada0-660aa72980b3
status: test
level: medium
author: Austin Songer @austinsonger
description: 'Identifies when a virtual network device is being modified or deleted.

    This can be a network interface, network virtual appliance, virtual hub, or virtual
    router.

    '
references:
    - https://learn.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations
falsepositives:
    - Virtual Network Device being modified or deleted may be performed by a system
        administrator. Verify whether the user identity, user agent, and/or hostname
        should be making changes in your environment.
    - Virtual Network Device modified or deleted from unfamiliar users should be investigated.
        If known behavior is causing false positives, it can be exempted from the
        rule.
tags:
    - attack.impact
date: '2021-08-08'
modified: '2022-08-23'
logsource:
    product: azure
    service: activitylogs
detection:
    selection:
        operationName:
            - MICROSOFT.NETWORK/NETWORKINTERFACES/TAPCONFIGURATIONS/WRITE
            - MICROSOFT.NETWORK/NETWORKINTERFACES/TAPCONFIGURATIONS/DELETE
            - MICROSOFT.NETWORK/NETWORKINTERFACES/WRITE
            - MICROSOFT.NETWORK/NETWORKINTERFACES/JOIN/ACTION
            - MICROSOFT.NETWORK/NETWORKINTERFACES/DELETE
            - MICROSOFT.NETWORK/NETWORKVIRTUALAPPLIANCES/DELETE
            - MICROSOFT.NETWORK/NETWORKVIRTUALAPPLIANCES/WRITE
            - MICROSOFT.NETWORK/VIRTUALHUBS/DELETE
            - MICROSOFT.NETWORK/VIRTUALHUBS/WRITE
            - MICROSOFT.NETWORK/VIRTUALROUTERS/WRITE
            - MICROSOFT.NETWORK/VIRTUALROUTERS/DELETE
    condition: selection
ocsf_mapping:
    class_name: entity_management
    activity_id: 3
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:38:19.827788+00:00'
        service:
            source_field: service
            source_value: activitylogs
            mapped_at: '2025-12-04T01:38:19.827788+00:00'
    detection_fields:
        -   source_field: operationName
            target_table: entity_management
            target_field: api.operation
            mapped_at: '2025-12-04T01:38:19.827809+00:00'
