title: Users Authenticating To Other Azure AD Tenants
id: 5f521e4b-0105-4b72-845b-2198a54487b9
status: test
level: medium
author: MikeDuddington, '@dudders1'
description: Detect when users in your Azure AD tenant are authenticating to other
    Azure AD Tenants.
references:
    - https://learn.microsoft.com/en-gb/entra/architecture/security-operations-user-accounts#monitoring-external-user-sign-ins
falsepositives:
    - If this was approved by System Administrator.
tags:
    - attack.initial-access
    - attack.t1078.004
date: '2022-06-30'
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        Status: Success
        HomeTenantId: HomeTenantID
    filter:
        ResourceTenantId|contains: HomeTenantID
    condition: selection and not filter
ocsf_mapping:
    class_name: authentication
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:38:12.157608+00:00'
        service:
            source_field: service
            source_value: signinlogs
            mapped_at: '2025-12-04T01:38:12.157608+00:00'
    detection_fields:
        -   source_field: Status
            target_table: authentication
            target_field: status_code
            mapped_at: '2025-12-04T01:38:12.157622+00:00'
        -   source_field: HomeTenantId
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:38:12.157624+00:00'
        -   source_field: ResourceTenantId
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:38:12.157626+00:00'
