id: 5afa454e-030c-4ab4-9253-a90aa7fcc581
title: Device Registration or Join Without MFA
status: test
level: medium
description: Monitor and alert for device registration or join events where MFA was
    not performed.
author: Michael Epping, '@mepples21'
date: '2022-06-28'
tags:
    - attack.defense-evasion
    - attack.t1078.004
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-devices#device-registrations-and-joins-outside-policy
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        ResourceDisplayName: Device Registration Service
        conditionalAccessStatus: success
    filter_mfa:
        AuthenticationRequirement: multiFactorAuthentication
    condition: selection and not filter_mfa
ocsf_mapping:
    class_name: authentication
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-26T02:20:25.371697+00:00'
        service:
            source_field: service
            source_value: signinlogs
            mapped_at: '2025-11-26T02:20:25.371697+00:00'
    detection_fields:
        -   source_field: ResourceDisplayName
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:20:29.841618+00:00'
        -   source_field: conditionalAccessStatus
            target_table: authentication
            target_field: actor.authorizations.decision
            mapped_at: '2025-11-26T02:20:29.841631+00:00'
        -   source_field: AuthenticationRequirement
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:20:29.841633+00:00'
