id: a84fc3b1-c9ce-4125-8e74-bdcdb24021f1
title: Primary Refresh Token Access Attempt
status: test
level: high
description: Indicates access attempt to the PRT resource which can be used to move
    laterally into an organization or perform credential theft
author: Mark Morowczynski '@markmorow', Gloria Lee, '@gleeiamglo'
date: '2023-09-07'
tags:
    - attack.t1528
    - attack.credential-access
references:
    - https://learn.microsoft.com/en-us/entra/id-protection/concept-identity-protection-risks#possible-attempt-to-access-primary-refresh-token-prt
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-user-accounts#unusual-sign-ins
falsepositives:
    - This detection is low-volume and is seen infrequently in most organizations.
        When this detection appears it's high risk, and users should be remediated.
taxonomy: sigma
logsource:
    product: azure
    service: riskdetection
detection:
    selection:
        riskEventType: attemptedPrtAccess
    condition: selection
ocsf_mapping:
    class_name: user_access
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-26T02:18:46.099892+00:00'
        service:
            source_field: service
            source_value: riskdetection
            mapped_at: '2025-11-26T02:18:46.099892+00:00'
    detection_fields:
        -   source_field: riskEventType
            target_table: user_access
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:18:46.872530+00:00'
