id: a4b25073-8947-489c-a8dd-93b41c23f26d
title: Windows LAPS Credential Dump From Entra ID
status: experimental
level: high
description: Detects when an account dumps the LAPS password from Entra ID.
author: andrewdanis
date: '2024-06-26'
tags:
    - attack.t1098.005
references:
    - https://twitter.com/NathanMcNulty/status/1785051227568632263
    - https://www.cloudcoffee.ch/microsoft-365/configure-windows-laps-in-microsoft-intune/
    - https://techcommunity.microsoft.com/t5/microsoft-entra-blog/introducing-windows-local-administrator-password-solution-with/ba-p/1942487
falsepositives:
    - Approved activity performed by an Administrator.
taxonomy: sigma
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        category: Device
        activityType|contains: Recover device local administrator password
        additionalDetails.additionalInfo|contains: Successfully recovered local credential
            by device id
    condition: selection
ocsf_mapping:
    class_name: account_change
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-26T02:19:46.268807+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-11-26T02:19:46.268807+00:00'
    detection_fields:
        -   source_field: category
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:19:47.758391+00:00'
        -   source_field: activityType
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:19:47.758431+00:00'
        -   source_field: additionalDetails.additionalInfo
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:19:47.758438+00:00'
