title: Azure Active Directory Hybrid Health AD FS Service Delete
id: 48739819-8230-4ee3-a8ea-e0289d1fb0ff
status: test
level: medium
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research), MSTIC
description: 'This detection uses azureactivity logs (Administrative category) to
    identify the deletion of an Azure AD Hybrid health AD FS service instance in a
    tenant.

    A threat actor can create a new AD Health ADFS service and create a fake server
    to spoof AD FS signing logs.

    The health AD FS service can then be deleted after it is not longer needed via
    HTTP requests to Azure.

    '
references:
    - https://o365blog.com/post/hybridhealthagent/
falsepositives:
    - Legitimate AAD Health AD FS service instances being deleted in a tenant
tags:
    - attack.defense-evasion
    - attack.t1578.003
date: '2021-08-26'
modified: '2023-10-11'
logsource:
    product: azure
    service: activitylogs
detection:
    selection:
        CategoryValue: Administrative
        ResourceProviderValue: Microsoft.ADHybridHealthService
        ResourceId|contains: AdFederationService
        OperationNameValue: Microsoft.ADHybridHealthService/services/delete
    condition: selection
ocsf_mapping:
    class_name: entity_management
    activity_id: 4
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:38:32.860958+00:00'
        service:
            source_field: service
            source_value: activitylogs
            mapped_at: '2025-12-04T01:38:32.860958+00:00'
    detection_fields:
        -   source_field: CategoryValue
            target_table: entity_management
            target_field: entity.type
            mapped_at: '2025-12-04T01:38:32.860974+00:00'
        -   source_field: ResourceProviderValue
            target_table: entity_management
            target_field: cloud.provider
            mapped_at: '2025-12-04T01:38:32.860976+00:00'
        -   source_field: ResourceId
            target_table: entity_management
            target_field: entity.uid
            mapped_at: '2025-12-04T01:38:32.860978+00:00'
        -   source_field: OperationNameValue
            target_table: entity_management
            target_field: api.operation
            mapped_at: '2025-12-04T01:38:32.860979+00:00'
