title: Application URI Configuration Changes
id: 0055ad1f-be85-4798-83cf-a6da17c993b3
status: test
level: high
author: Mark Morowczynski '@markmorow', Bailey Bercik '@baileybercik'
description: 'Detects when a configuration change is made to an applications URI.

    URIs for domain names that no longer exist (dangling URIs), not using HTTPS, wildcards
    at the end of the domain, URIs that are no unique to that app, or URIs that point
    to domains you do not control should be investigated.

    '
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-applications#application-configuration-changes
falsepositives:
    - When and administrator is making legitimate URI configuration changes to an
        application. This should be a planned event.
tags:
    - attack.t1528
    - attack.t1078.004
    - attack.persistence
    - attack.credential-access
    - attack.privilege-escalation
date: '2022-06-02'
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        properties.message: Update Application Sucess- Property Name AppAddress
    condition: selection
ocsf_mapping:
    class_name: account_change
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:37:43.825453+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-12-04T01:37:43.825453+00:00'
    detection_fields:
        -   source_field: properties.message
            target_table: account_change
            target_field: message
            mapped_at: '2025-12-04T01:37:43.825470+00:00'
