title: Multi Factor Authentication Disabled For User Account
id: b18454c8-0be3-41f7-86bc-9c614611b839
status: experimental
level: medium
author: Harjot Singh (@cyb3rjy0t)
description: 'Detects changes to the "StrongAuthenticationRequirement" value, where
    the state is set to "0" or "Disabled".

    Threat actors were seen disabling multi factor authentication for users in order
    to maintain or achieve access to the account. Also see in SIM Swap attacks.

    '
references:
    - https://www.sans.org/blog/defending-against-scattered-spider-and-the-com-with-cybercrime-intelligence/
falsepositives:
    - Legitimate authorized activity.
tags:
    - attack.credential-access
    - attack.persistence
date: '2024-08-21'
logsource:
    product: azure
    service: auditlogs
    definition: 'Requirements: The TargetResources array needs to be mapped accurately
        in order for this rule to work'
detection:
    selection:
        LoggedByService: Core Directory
        Category: UserManagement
        OperationName: Update user
        TargetResources.ModifiedProperties.DisplayName: StrongAuthenticationRequirement
        TargetResources.ModifiedProperties.NewValue|contains: State":0
    condition: selection
ocsf_mapping:
    class_name: account_change
    activity_id: 11
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:37:44.767833+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-12-04T01:37:44.767833+00:00'
    detection_fields:
        -   source_field: LoggedByService
            target_table: account_change
            target_field: metadata.log_provider
            mapped_at: '2025-12-04T01:37:44.767848+00:00'
        -   source_field: Category
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:37:44.767850+00:00'
        -   source_field: OperationName
            target_table: account_change
            target_field: api.operation
            mapped_at: '2025-12-04T01:37:44.767852+00:00'
        -   source_field: TargetResources.ModifiedProperties.DisplayName
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:37:44.767853+00:00'
        -   source_field: TargetResources.ModifiedProperties.NewValue
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:37:44.767855+00:00'
