id: 9494bff8-959f-4440-bbce-fb87a208d517
title: Changes to Device Registration Policy
status: test
level: high
description: Monitor and alert for changes to the device registration policy.
author: Michael Epping, '@mepples21'
date: '2022-06-28'
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1484
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-devices#device-registrations-and-joins-outside-policy
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        Category: Policy
        ActivityDisplayName: Set device registration policies
    condition: selection
ocsf_mapping:
    class_name: entity_management
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-13T20:16:49.463750+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-11-13T20:16:49.463750+00:00'
    detection_fields:
        -   source_field: Category
            target_table: entity_management
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:16:49.463788+00:00'
        -   source_field: ActivityDisplayName
            target_table: entity_management
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:16:49.463792+00:00'
