id: 512cf937-ea9b-4332-939c-4c2c94baadcd
title: Azure Firewall Modified or Deleted
status: test
level: medium
description: Identifies when a firewall is created, modified, or deleted.
author: Austin Songer @austinsonger
date: '2021-08-08'
modified: '2022-08-23'
tags:
    - attack.impact
    - attack.defense-evasion
    - attack.t1562.004
references:
    - https://learn.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations
falsepositives:
    - Firewall being modified or deleted may be performed by a system administrator.
        Verify whether the user identity, user agent, and/or hostname should be making
        changes in your environment.
    - Firewall modified or deleted from unfamiliar users should be investigated. If
        known behavior is causing false positives, it can be exempted from the rule.
taxonomy: sigma
logsource:
    product: azure
    service: activitylogs
detection:
    selection:
        operationName:
            - MICROSOFT.NETWORK/AZUREFIREWALLS/WRITE
            - MICROSOFT.NETWORK/AZUREFIREWALLS/DELETE
    condition: selection
ocsf_mapping:
    class_name: entity_management
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-26T02:21:03.850136+00:00'
        service:
            source_field: service
            source_value: activitylogs
            mapped_at: '2025-11-26T02:21:03.850136+00:00'
    detection_fields:
        -   source_field: operationName
            target_table: entity_management
            target_field: api.operation
            mapped_at: '2025-11-26T02:21:03.850146+00:00'
