title: Azure Network Security Configuration Modified or Deleted
id: d22b4df4-5a67-4859-a578-8c9a0b5af9df
status: test
level: medium
author: Austin Songer @austinsonger
description: Identifies when a network security configuration is modified or deleted.
references:
    - https://learn.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations
falsepositives:
    - Network Security Configuration being modified or deleted may be performed by
        a system administrator. Verify whether the user identity, user agent, and/or
        hostname should be making changes in your environment.
    - Network Security Configuration modified or deleted from unfamiliar users should
        be investigated. If known behavior is causing false positives, it can be exempted
        from the rule.
tags:
    - attack.impact
date: '2021-08-08'
modified: '2022-08-23'
logsource:
    product: azure
    service: activitylogs
detection:
    selection:
        operationName:
            - MICROSOFT.NETWORK/NETWORKSECURITYGROUPS/WRITE
            - MICROSOFT.NETWORK/NETWORKSECURITYGROUPS/DELETE
            - MICROSOFT.NETWORK/NETWORKSECURITYGROUPS/SECURITYRULES/WRITE
            - MICROSOFT.NETWORK/NETWORKSECURITYGROUPS/SECURITYRULES/DELETE
            - MICROSOFT.NETWORK/NETWORKSECURITYGROUPS/JOIN/ACTION
            - MICROSOFT.NETWORK/NETWORKSECURITYGROUPS/PROVIDERS/MICROSOFT.INSIGHTS/DIAGNOSTICSETTINGS/WRITE
    condition: selection
ocsf_mapping:
    class_name: entity_management
    activity_id: 3
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:38:39.329391+00:00'
        service:
            source_field: service
            source_value: activitylogs
            mapped_at: '2025-12-04T01:38:39.329391+00:00'
    detection_fields:
        -   source_field: operationName
            target_table: entity_management
            target_field: api.operation
            mapped_at: '2025-12-04T01:38:39.329403+00:00'
