id: f7b5b004-dece-46e4-a4a5-f6fd0e1c6947
title: Privileged Account Creation
status: test
level: medium
description: Detects when a new admin is created.
author: Mark Morowczynski '@markmorow', Yochana Henderson, '@Yochana-H', Tim Shelton
date: '2022-08-11'
modified: '2022-08-16'
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1078.004
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-privileged-accounts#changes-to-privileged-accounts
falsepositives:
    - A legitimate new admin account being created
taxonomy: sigma
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        properties.message|contains|all:
            - Add user
            - Add member to role
        Status: Success
    condition: selection
ocsf_mapping:
    class_name: account_change
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-13T20:16:28.758481+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-11-13T20:16:28.758481+00:00'
    detection_fields:
        -   source_field: properties.message
            target_table: account_change
            target_field: message
            mapped_at: '2025-11-13T20:16:28.758512+00:00'
        -   source_field: Status
            target_table: account_change
            target_field: status_id
            mapped_at: '2025-11-13T20:16:28.758516+00:00'
