title: Impossible Travel
id: b2572bf9-e20a-4594-b528-40bde666525a
status: test
level: high
author: Mark Morowczynski '@markmorow', Gloria Lee, '@gleeiamglo'
description: Identifies user activities originating from geographically distant locations
    within a time period shorter than the time it takes to travel from the first location
    to the second.
references:
    - https://learn.microsoft.com/en-us/entra/id-protection/concept-identity-protection-risks#impossible-travel
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-user-accounts#unusual-sign-ins
falsepositives:
    - Connecting to a VPN, performing activity and then dropping and performing additional
        activity.
tags:
    - attack.t1078
    - attack.persistence
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.initial-access
date: '2023-09-03'
logsource:
    product: azure
    service: riskdetection
detection:
    selection:
        riskEventType: impossibleTravel
    condition: selection
ocsf_mapping:
    class_name: user_access
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:37:26.977532+00:00'
        service:
            source_field: service
            source_value: riskdetection
            mapped_at: '2025-12-04T01:37:26.977532+00:00'
    detection_fields:
        -   source_field: riskEventType
            target_table: user_access
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:37:26.977546+00:00'
