id: 72af37e2-ec32-47dc-992b-bc288a2708cb
title: Azure New CloudShell Created
status: test
level: medium
description: Identifies when a new cloudshell is created inside of Azure portal.
author: Austin Songer
date: '2021-09-21'
modified: '2022-08-23'
tags:
    - attack.execution
    - attack.t1059
references:
    - https://learn.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations
falsepositives:
    - A new cloudshell may be created by a system administrator.
taxonomy: sigma
logsource:
    product: azure
    service: activitylogs
detection:
    selection:
        operationName: MICROSOFT.PORTAL/CONSOLES/WRITE
    condition: selection
ocsf_mapping:
    class_name: entity_management
    activity_id: 1
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-26T02:20:57.411596+00:00'
        service:
            source_field: service
            source_value: activitylogs
            mapped_at: '2025-11-26T02:20:57.411596+00:00'
    detection_fields:
        -   source_field: operationName
            target_table: entity_management
            target_field: api.operation
            mapped_at: '2025-11-26T02:20:57.411626+00:00'
