id: 60f6535a-760f-42a9-be3f-c9a0a025906e
title: Use of Legacy Authentication Protocols
status: test
level: high
description: Alert on when legacy authentication has been used on an account
author: Yochana Henderson, '@Yochana-H'
date: '2022-06-17'
tags:
    - attack.initial-access
    - attack.credential-access
    - attack.t1078.004
    - attack.t1110
references:
    - https://learn.microsoft.com/en-gb/entra/architecture/security-operations-privileged-accounts
falsepositives:
    - User has been put in acception group so they can use legacy authentication
taxonomy: sigma
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        ActivityDetails: Sign-ins
        ClientApp:
            - Other client
            - IMAP
            - POP3
            - MAPI
            - SMTP
            - Exchange ActiveSync
            - Exchange Web Services
        Username: UPN
    condition: selection
ocsf_mapping:
    class_name: authentication
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-13T20:17:10.736050+00:00'
        service:
            source_field: service
            source_value: signinlogs
            mapped_at: '2025-11-13T20:17:10.736050+00:00'
    detection_fields:
        -   source_field: ActivityDetails
            target_table: authentication
            target_field: enrichments.data
            mapped_at: '2025-11-13T20:17:12.507648+00:00'
        -   source_field: ClientApp
            target_table: authentication
            target_field: actor.process.name
            mapped_at: '2025-11-13T20:17:12.507668+00:00'
        -   source_field: Username
            target_table: authentication
            target_field: actor.user.name
            mapped_at: '2025-11-13T20:17:12.507672+00:00'
