title: Guest User Invited By Non Approved Inviters
id: 0b4b72e3-4c53-4d5b-b198-2c58cfef39a9
status: test
level: medium
author: Mark Morowczynski '@markmorow', Yochana Henderson, '@Yochana-H'
description: Detects when a user that doesn't have permissions to invite a guest user
    attempts to invite one.
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-privileged-accounts#things-to-monitor
falsepositives:
    - A non malicious user is unaware of the proper process
tags:
    - attack.persistence
    - attack.defense-evasion
    - attack.t1078.004
date: '2022-08-10'
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        properties.message: Invite external user
        Status: failure
    condition: selection
ocsf_mapping:
    class_name: account_change
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-12-04T01:37:55.927370+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-12-04T01:37:55.927370+00:00'
    detection_fields:
        -   source_field: properties.message
            target_table: account_change
            target_field: message
            mapped_at: '2025-12-04T01:37:55.927388+00:00'
        -   source_field: Status
            target_table: account_change
            target_field: status_code
            mapped_at: '2025-12-04T01:37:55.927390+00:00'
