id: 8dee7a0d-43fd-4b3c-8cd1-605e189d195e
title: User State Changed From Guest To Member
status: test
level: medium
description: Detects the change of user type from "Guest" to "Member" for potential
    elevation of privilege.
author: MikeDuddington, '@dudders1'
date: '2022-06-30'
tags:
    - attack.privilege-escalation
    - attack.initial-access
    - attack.t1078.004
references:
    - https://learn.microsoft.com/en-gb/entra/architecture/security-operations-user-accounts#monitoring-external-user-sign-ins
falsepositives:
    - If this was approved by System Administrator.
taxonomy: sigma
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        Category: UserManagement
        OperationName: Update user
        properties.message: '"displayName":"UserType","oldValue":"[\"Guest\"]","newValue":"[\"Member\"]"'
    condition: selection
ocsf_mapping:
    class_name: account_change
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-13T20:16:34.247203+00:00'
        service:
            source_field: service
            source_value: auditlogs
            mapped_at: '2025-11-13T20:16:34.247203+00:00'
    detection_fields:
        -   source_field: Category
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:16:34.247277+00:00'
        -   source_field: OperationName
            target_table: account_change
            target_field: api.operation
            mapped_at: '2025-11-13T20:16:34.247282+00:00'
        -   source_field: properties.message
            target_table: account_change
            target_field: message
            mapped_at: '2025-11-13T20:16:34.247286+00:00'
