id: 225d8b09-e714-479c-a0e4-55e6f29adf35
title: Azure Kubernetes Events Deleted
status: test
level: medium
description: Detects when Events are deleted in Azure Kubernetes. An adversary may
    delete events in Azure Kubernetes in an attempt to evade detection.
author: Austin Songer @austinsonger
date: '2021-07-24'
modified: '2022-08-23'
tags:
    - attack.defense-evasion
    - attack.t1562
    - attack.t1562.001
references:
    - https://learn.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations#microsoftkubernetes
    - https://github.com/elastic/detection-rules/blob/da3852b681cf1a33898b1535892eab1f3a76177a/rules/integrations/azure/defense_evasion_kubernetes_events_deleted.toml
falsepositives:
    - Event deletions may be done by a system or network administrator. Verify whether
        the username, hostname, and/or resource name should be making changes in your
        environment. Events deletions from unfamiliar users or hosts should be investigated.
        If known behavior is causing false positives, it can be exempted from the
        rule.
taxonomy: sigma
logsource:
    product: azure
    service: activitylogs
detection:
    selection:
        operationName: MICROSOFT.KUBERNETES/CONNECTEDCLUSTERS/EVENTS.K8S.IO/EVENTS/DELETE
    condition: selection
ocsf_mapping:
    class_name: entity_management
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-13T20:17:29.483853+00:00'
        service:
            source_field: service
            source_value: activitylogs
            mapped_at: '2025-11-13T20:17:29.483853+00:00'
    detection_fields:
        -   source_field: operationName
            target_table: entity_management
            target_field: api.operation
            mapped_at: '2025-11-13T20:17:29.483866+00:00'
