id: e402c26a-267a-45bd-9615-bd9ceda6da85
title: Stale Accounts In A Privileged Role
status: test
level: high
description: Identifies when an account hasn't signed in during the past n number
    of days.
author: Mark Morowczynski '@markmorow', Gloria Lee, '@gleeiamglo'
date: '2023-09-14'
tags:
    - attack.t1078
    - attack.persistence
    - attack.privilege-escalation
references:
    - https://learn.microsoft.com/en-us/entra/id-governance/privileged-identity-management/pim-how-to-configure-security-alerts#potential-stale-accounts-in-a-privileged-role
falsepositives:
    - Investigate if potential generic account that cannot be removed.
taxonomy: sigma
logsource:
    product: azure
    service: pim
detection:
    selection:
        riskEventType: staleSignInAlertIncident
    condition: selection
ocsf_mapping:
    class_name: user_access
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: azure
            mapped_at: '2025-11-26T02:19:03.338806+00:00'
        service:
            source_field: service
            source_value: pim
            mapped_at: '2025-11-26T02:19:03.338806+00:00'
    detection_fields:
        -   source_field: riskEventType
            target_table: user_access
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:19:03.338898+00:00'
