title: Bitbucket Global Secret Scanning Rule Deleted
id: e16cf0f0-ee88-4901-bd0b-4c8d13d9ee05
status: test
level: medium
author: Muhammad Faisal (@faisalusuf)
description: Detects Bitbucket global secret scanning rule deletion activity.
references:
    - https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
    - https://confluence.atlassian.com/bitbucketserver/secret-scanning-1157471613.html
falsepositives:
    - Legitimate user activity.
tags:
    - attack.defense-evasion
    - attack.t1562.001
date: '2024-02-25'
logsource:
    product: bitbucket
    service: audit
    definition: 'Requirements: "Basic" log level is required to receive these audit
        events.'
detection:
    selection:
        auditType.category: Global administration
        auditType.action: Global secret scanning rule deleted
    condition: selection
ocsf_mapping:
    class_name: entity_management
    activity_id: 4
    logsource:
        product:
            source_field: product
            source_value: bitbucket
            mapped_at: '2025-12-04T01:39:36.300046+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-12-04T01:39:36.300046+00:00'
    detection_fields:
        -   source_field: auditType.category
            target_table: entity_management
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:39:36.300065+00:00'
        -   source_field: auditType.action
            target_table: entity_management
            target_field: action
            mapped_at: '2025-12-04T01:39:36.300067+00:00'
