id: 87cc6698-3e07-4ba2-9b43-a85a73e151e2
title: Bitbucket User Permissions Export Attempt
status: test
level: medium
description: Detects user permission data export attempt.
author: Muhammad Faisal (@faisalusuf)
date: '2024-02-25'
tags:
    - attack.reconnaissance
    - attack.t1213
    - attack.t1082
    - attack.t1591.004
references:
    - https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
    - https://confluence.atlassian.com/bitbucketserver/users-and-groups-776640439.html
falsepositives:
    - Legitimate user activity.
taxonomy: sigma
logsource:
    product: bitbucket
    service: audit
    definition: 'Requirements: "Advance" log level is required to receive these audit
        events.'
detection:
    selection:
        auditType.category: Users and groups
        auditType.action:
            - User details export failed
            - User details export started
            - User details exported
    condition: selection
ocsf_mapping:
    class_name: entity_management
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: bitbucket
            mapped_at: '2025-11-26T02:23:06.095722+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-11-26T02:23:06.095722+00:00'
    detection_fields:
        -   source_field: auditType.category
            target_table: entity_management
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:23:06.095770+00:00'
        -   source_field: auditType.action
            target_table: entity_management
            target_field: action
            mapped_at: '2025-11-26T02:23:06.095777+00:00'
