title: Bitbucket Global Permission Changed
id: aac6c4f4-87c7-4961-96ac-c3fd3a42c310
status: test
level: medium
author: Muhammad Faisal (@faisalusuf)
description: Detects global permissions change activity.
references:
    - https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
    - https://confluence.atlassian.com/bitbucketserver/global-permissions-776640369.html
falsepositives:
    - Legitimate user activity.
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1098
date: '2024-02-25'
logsource:
    product: bitbucket
    service: audit
    definition: 'Requirements: "Advance" log level is required to receive these audit
        events.'
detection:
    selection:
        auditType.category: Permissions
        auditType.action:
            - Global permission remove request
            - Global permission removed
            - Global permission granted
            - Global permission requested
    condition: selection
ocsf_mapping:
    class_name: entity_management
    activity_id: 3
    logsource:
        product:
            source_field: product
            source_value: bitbucket
            mapped_at: '2025-12-04T01:39:39.491914+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-12-04T01:39:39.491914+00:00'
    detection_fields:
        -   source_field: auditType.category
            target_table: entity_management
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:39:39.492085+00:00'
        -   source_field: auditType.action
            target_table: entity_management
            target_field: action
            mapped_at: '2025-12-04T01:39:39.492089+00:00'
