id: e16cf0f0-ee88-4901-bd0b-4c8d13d9ee05
title: Bitbucket Global Secret Scanning Rule Deleted
status: test
level: medium
description: Detects Bitbucket global secret scanning rule deletion activity.
author: Muhammad Faisal (@faisalusuf)
date: '2024-02-25'
tags:
    - attack.defense-evasion
    - attack.t1562.001
references:
    - https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
    - https://confluence.atlassian.com/bitbucketserver/secret-scanning-1157471613.html
falsepositives:
    - Legitimate user activity.
taxonomy: sigma
logsource:
    product: bitbucket
    service: audit
    definition: 'Requirements: "Basic" log level is required to receive these audit
        events.'
detection:
    selection:
        auditType.category: Global administration
        auditType.action: Global secret scanning rule deleted
    condition: selection
ocsf_mapping:
    class_name: api_activity
    logsource:
        product:
            source_field: product
            source_value: bitbucket
            mapped_at: '2025-11-13T20:18:18.624492+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-11-13T20:18:18.624492+00:00'
    detection_fields:
        -   source_field: auditType.category
            target_table: api_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:18:18.624497+00:00'
        -   source_field: auditType.action
            target_table: api_activity
            target_field: action
            mapped_at: '2025-11-13T20:18:18.624498+00:00'
