id: 5259cbf2-0a75-48bf-b57a-c54d6fabaef3
title: Bitbucket User Details Export Attempt Detected
status: test
level: medium
description: Detects user data export activity.
author: Muhammad Faisal (@faisalusuf)
date: '2024-02-25'
tags:
    - attack.collection
    - attack.reconnaissance
    - attack.discovery
    - attack.t1213
    - attack.t1082
    - attack.t1591.004
references:
    - https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
    - https://support.atlassian.com/security-and-access-policies/docs/export-user-accounts
falsepositives:
    - Legitimate user activity.
taxonomy: sigma
logsource:
    product: bitbucket
    service: audit
    definition: 'Requirements: "Advance" log level is required to receive these audit
        events.'
detection:
    selection:
        auditType.category: Users and groups
        auditType.action:
            - User permissions export failed
            - User permissions export started
            - User permissions exported
    condition: selection
ocsf_mapping:
    class_name: api_activity
    logsource:
        product:
            source_field: product
            source_value: bitbucket
            mapped_at: '2025-11-13T20:18:18.621771+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-11-13T20:18:18.621771+00:00'
    detection_fields:
        -   source_field: auditType.category
            target_table: api_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:18:18.621778+00:00'
        -   source_field: auditType.action
            target_table: api_activity
            target_field: action
            mapped_at: '2025-11-13T20:18:18.621780+00:00'
