id: 34d81081-03c9-4a7f-91c9-5e46af625cde
title: Bitbucket Unauthorized Full Data Export Triggered
status: test
level: critical
description: Detects when full data export is attempted an unauthorized user.
author: Muhammad Faisal (@faisalusuf)
date: '2024-02-25'
tags:
    - attack.collection
    - attack.resource-development
    - attack.t1213.003
    - attack.t1586
references:
    - https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
    - https://confluence.atlassian.com/bitbucketserver/secret-scanning-1157471613.html
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    product: bitbucket
    service: audit
    definition: 'Requirements: "Advance" log level is required to receive these audit
        events.'
detection:
    selection:
        auditType.category: Data pipeline
        auditType.action: Unauthorized full data export triggered
    condition: selection
ocsf_mapping:
    class_name: api_activity
    logsource:
        product:
            source_field: product
            source_value: bitbucket
            mapped_at: '2025-11-13T20:18:18.613681+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-11-13T20:18:18.613681+00:00'
    detection_fields:
        -   source_field: auditType.category
            target_table: api_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:18:18.613691+00:00'
        -   source_field: auditType.action
            target_table: api_activity
            target_field: action
            mapped_at: '2025-11-13T20:18:18.613693+00:00'
