title: Bitbucket User Login Failure
id: 70ed1d26-0050-4b38-a599-92c53d57d45a
status: test
level: medium
author: Muhammad Faisal (@faisalusuf)
description: 'Detects user authentication failure events.

    Please note that this rule can be noisy and it is recommended to use with correlation
    based on "author.name" field.

    '
references:
    - https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
falsepositives:
    - Legitimate user wrong password attempts.
tags:
    - attack.defense-evasion
    - attack.credential-access
    - attack.t1078.004
    - attack.t1110
date: '2024-02-25'
logsource:
    product: bitbucket
    service: audit
    definition: 'Requirements: "Advance" log level is required to receive these audit
        events.'
detection:
    selection:
        auditType.category: Authentication
        auditType.action: User login failed
    condition: selection
ocsf_mapping:
    class_name: entity_management
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: bitbucket
            mapped_at: '2025-12-04T01:39:38.602407+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-12-04T01:39:38.602407+00:00'
    detection_fields:
        -   source_field: auditType.category
            target_table: entity_management
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:39:38.604984+00:00'
        -   source_field: auditType.action
            target_table: entity_management
            target_field: action
            mapped_at: '2025-12-04T01:39:38.605007+00:00'
