id: ff91e3f0-ad15-459f-9a85-1556390c138d
title: Bitbucket Secret Scanning Rule Deleted
status: test
level: low
description: Detects when secret scanning rule is deleted for the project or repository.
author: Muhammad Faisal (@faisalusuf)
date: '2024-02-25'
tags:
    - attack.defense-evasion
    - attack.t1562.001
references:
    - https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
    - https://confluence.atlassian.com/bitbucketserver/secret-scanning-1157471613.html
falsepositives:
    - Legitimate user activity.
taxonomy: sigma
logsource:
    product: bitbucket
    service: audit
    definition: 'Requirements: "Basic" log level is required to receive these audit
        events.'
detection:
    selection:
        auditType.category:
            - Projects
            - Repositories
        auditType.action:
            - Project secret scanning rule deleted
            - Repository secret scanning rule deleted
    condition: selection
ocsf_mapping:
    class_name: entity_management
    activity_id: 4
    logsource:
        product:
            source_field: product
            source_value: bitbucket
            mapped_at: '2025-11-26T02:23:09.775184+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-11-26T02:23:09.775184+00:00'
    detection_fields:
        -   source_field: auditType.category
            target_table: entity_management
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:23:09.775208+00:00'
        -   source_field: auditType.action
            target_table: entity_management
            target_field: action
            mapped_at: '2025-11-26T02:23:09.775211+00:00'
