id: 70ed1d26-0050-4b38-a599-92c53d57d45a
title: Bitbucket User Login Failure
status: test
level: medium
description: 'Detects user authentication failure events.

    Please note that this rule can be noisy and it is recommended to use with correlation
    based on "author.name" field.

    '
author: Muhammad Faisal (@faisalusuf)
date: '2024-02-25'
tags:
    - attack.defense-evasion
    - attack.credential-access
    - attack.t1078.004
    - attack.t1110
references:
    - https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
falsepositives:
    - Legitimate user wrong password attempts.
taxonomy: sigma
logsource:
    product: bitbucket
    service: audit
    definition: 'Requirements: "Advance" log level is required to receive these audit
        events.'
detection:
    selection:
        auditType.category: Authentication
        auditType.action: User login failed
    condition: selection
ocsf_mapping:
    class_name: api_activity
    logsource:
        product:
            source_field: product
            source_value: bitbucket
            mapped_at: '2025-11-13T20:18:18.627332+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-11-13T20:18:18.627332+00:00'
    detection_fields:
        -   source_field: auditType.category
            target_table: api_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:18:18.627338+00:00'
        -   source_field: auditType.action
            target_table: api_activity
            target_field: action
            mapped_at: '2025-11-13T20:18:18.627340+00:00'
