id: 195e1b9d-bfc2-4ffa-ab4e-35aef69815f8
title: Bitbucket Full Data Export Triggered
status: test
level: high
description: Detects when full data export is attempted.
author: Muhammad Faisal (@faisalusuf)
date: '2024-02-25'
tags:
    - attack.collection
    - attack.t1213.003
references:
    - https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
    - https://confluence.atlassian.com/adminjiraserver0811/importing-and-exporting-data-1019391889.html
falsepositives:
    - Legitimate user activity.
taxonomy: sigma
logsource:
    product: bitbucket
    service: audit
    definition: 'Requirements: "Advance" log level is required to receive these audit
        events.'
detection:
    selection:
        auditType.category: Data pipeline
        auditType.action: Full data export triggered
    condition: selection
ocsf_mapping:
    class_name: entity_management
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: bitbucket
            mapped_at: '2025-11-26T02:23:05.551357+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-11-26T02:23:05.551357+00:00'
    detection_fields:
        -   source_field: auditType.category
            target_table: entity_management
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:23:05.551371+00:00'
        -   source_field: auditType.action
            target_table: entity_management
            target_field: action
            mapped_at: '2025-11-26T02:23:05.551373+00:00'
