id: 7215374a-de4f-4b33-8ba5-70804c9251d3
title: Bitbucket Unauthorized Access To A Resource
status: test
level: critical
description: Detects unauthorized access attempts to a resource.
author: Muhammad Faisal (@faisalusuf)
date: '2024-02-25'
tags:
    - attack.resource-development
    - attack.t1586
references:
    - https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
falsepositives:
    - Access attempts to non-existent repositories or due to outdated plugins. Usually
        "Anonymous" user is reported in the "author.name" field in most cases.
taxonomy: sigma
logsource:
    product: bitbucket
    service: audit
    definition: 'Requirements: "Advance" log level is required to receive these audit
        events.'
detection:
    selection:
        auditType.category: Security
        auditType.action: Unauthorized access to a resource
    condition: selection
ocsf_mapping:
    class_name: entity_management
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: bitbucket
            mapped_at: '2025-11-26T02:23:07.084485+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-11-26T02:23:07.084485+00:00'
    detection_fields:
        -   source_field: auditType.category
            target_table: entity_management
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:23:07.084497+00:00'
        -   source_field: auditType.action
            target_table: entity_management
            target_field: action
            mapped_at: '2025-11-26T02:23:07.084499+00:00'
