title: Bitbucket Project Secret Scanning Allowlist Added
id: 42ccce6d-7bd3-4930-95cd-e4d83fa94a30
status: test
level: low
author: Muhammad Faisal (@faisalusuf)
description: Detects when a secret scanning allowlist rule is added for projects.
references:
    - https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
    - https://confluence.atlassian.com/bitbucketserver/secret-scanning-1157471613.html
falsepositives:
    - Legitimate user activity.
tags:
    - attack.defense-evasion
    - attack.t1562.001
date: '2024-02-25'
logsource:
    product: bitbucket
    service: audit
    definition: 'Requirements: "Basic" log level is required to receive these audit
        events.'
detection:
    selection:
        auditType.category: Projects
        auditType.action: Project secret scanning allowlist rule added
    condition: selection
ocsf_mapping:
    class_name: entity_management
    activity_id: 3
    logsource:
        product:
            source_field: product
            source_value: bitbucket
            mapped_at: '2025-12-04T01:39:32.023246+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-12-04T01:39:32.023246+00:00'
    detection_fields:
        -   source_field: auditType.category
            target_table: entity_management
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:39:32.023261+00:00'
        -   source_field: auditType.action
            target_table: entity_management
            target_field: action
            mapped_at: '2025-12-04T01:39:32.023263+00:00'
