title: Bitbucket Secret Scanning Exempt Repository Added
id: b91e8d5e-0033-44fe-973f-b730316f23a1
status: test
level: high
author: Muhammad Faisal (@faisalusuf)
description: Detects when a repository is exempted from secret scanning feature.
references:
    - https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
    - https://confluence.atlassian.com/bitbucketserver/secret-scanning-1157471613.html
falsepositives:
    - Legitimate user activity.
tags:
    - attack.defense-evasion
    - attack.t1562.001
date: '2024-02-25'
logsource:
    product: bitbucket
    service: audit
    definition: 'Requirements: "Basic" log level is required to receive these audit
        events.'
detection:
    selection:
        auditType.category: Repositories
        auditType.action: Secret scanning exempt repository added
    condition: selection
ocsf_mapping:
    class_name: entity_management
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: bitbucket
            mapped_at: '2025-12-04T01:39:40.015115+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-12-04T01:39:40.015115+00:00'
    detection_fields:
        -   source_field: auditType.category
            target_table: entity_management
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:39:40.015138+00:00'
        -   source_field: auditType.action
            target_table: entity_management
            target_field: action
            mapped_at: '2025-12-04T01:39:40.015140+00:00'
