title: Cisco Duo Successful MFA Authentication Via Bypass Code
id: 6f7e1c10-2dc9-4312-adb6-9574ff09a5c8
status: experimental
level: medium
author: Nikita Khalimonenkov
description: 'Detects when a successful MFA authentication occurs due to the use of
    a bypass code.

    A bypass code is a temporary passcode created by an administrator for a specific
    user to access a Duo-protected application. These are generally used as "backup
    codes," so that enrolled users who are having problems with their mobile devices
    (e.g., mobile service is disrupted, the device is lost or stolen, etc.) or who
    temporarily can''t use their enrolled devices (on a plane without mobile data
    services) can still access their Duo-protected systems.

    '
references:
    - https://duo.com/docs/adminapi#logs
    - https://help.duo.com/s/article/6327?language=en_US
falsepositives:
    - Legitimate user that was assigned on purpose to a bypass group
tags:
    - attack.credential-access
    - attack.defense-evasion
    - attack.initial-access
date: '2024-04-17'
logsource:
    product: cisco
    service: duo
detection:
    selection:
        event_type: authentication
        reason: bypass_user
    condition: selection
ocsf_mapping:
    class_name: authentication
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: cisco
            mapped_at: '2025-12-04T01:38:41.660720+00:00'
        service:
            source_field: service
            source_value: duo
            mapped_at: '2025-12-04T01:38:41.660720+00:00'
    detection_fields:
        -   source_field: event_type
            target_table: authentication
            target_field: action
            mapped_at: '2025-12-04T01:38:41.660735+00:00'
        -   source_field: reason
            target_table: authentication
            target_field: actor.process.session.expiration_reason
            mapped_at: '2025-12-04T01:38:41.660737+00:00'
