title: Suspicious File Download From File Sharing Websites -  File Stream
id: 52182dfb-afb7-41db-b4bc-5336cb29b464
status: experimental
level: high
author: Florian Roth (Nextron Systems)
description: Detects the download of suspicious file type from a well-known file and
    paste sharing domain
references:
    - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=90015
    - https://www.cisa.gov/uscert/ncas/alerts/aa22-321a
    - https://fabian-voith.de/2020/06/25/sysmon-v11-1-reads-alternate-data-streams/
    - https://www.microsoft.com/en-us/security/blog/2024/01/17/new-ttps-observed-in-mint-sandstorm-campaign-targeting-high-profile-individuals-at-universities-and-research-orgs/
falsepositives:
    - Some false positives might occur with binaries download via Github
tags:
    - attack.defense-evasion
    - attack.s0139
    - attack.t1564.004
date: '2022-08-24'
modified: '2024-10-21'
logsource:
    category: create_stream_hash
    product: windows
detection:
    selection_domain:
        Contents|contains:
            - .githubusercontent.com
            - anonfiles.com
            - cdn.discordapp.com
            - ddns.net
            - dl.dropboxusercontent.com
            - ghostbin.co
            - glitch.me
            - gofile.io
            - hastebin.com
            - mediafire.com
            - mega.nz
            - onrender.com
            - pages.dev
            - paste.ee
            - pastebin.com
            - pastebin.pl
            - pastetext.net
            - pixeldrain.com
            - privatlab.com
            - privatlab.net
            - send.exploit.in
            - sendspace.com
            - storage.googleapis.com
            - storjshare.io
            - supabase.co
            - temp.sh
            - transfer.sh
            - trycloudflare.com
            - ufile.io
            - w3spaces.com
            - workers.dev
    selection_extension:
        TargetFilename|contains:
            - .cpl:Zone
            - .dll:Zone
            - .exe:Zone
            - .hta:Zone
            - .lnk:Zone
            - .one:Zone
            - .vbe:Zone
            - .vbs:Zone
            - .xll:Zone
    condition: all of selection_*
related:
    -   id: ae02ed70-11aa-4a22-b397-c0d0e8f6ea99
        type: similar
ocsf_mapping:
    class_name: file_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: create_stream_hash
            mapped_at: '2025-12-04T01:51:55.362336+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:51:55.362336+00:00'
    detection_fields:
        -   source_field: Contents
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:51:55.362369+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:51:55.362374+00:00'
