id: f239b326-2f41-4d6b-9dfa-c846a60ef505
title: Password Dumper Remote Thread in LSASS
status: stable
level: high
description: 'Detects password dumper activity by monitoring remote thread creation
    EventID 8 in combination with the lsass.exe process as TargetImage.

    The process in field Process is the malicious program. A single execution can
    lead to hundreds of events.

    '
author: Thomas Patzke
date: '2017-02-19'
modified: '2021-06-21'
tags:
    - attack.credential-access
    - attack.s0005
    - attack.t1003.001
references:
    - https://jpcertcc.github.io/ToolAnalysisResultSheet/details/WCE.htm
falsepositives:
    - Antivirus products
taxonomy: sigma
logsource:
    category: create_remote_thread
    product: windows
detection:
    selection:
        TargetImage|endswith: \lsass.exe
        StartModule: ''
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 4
    logsource:
        category:
            source_field: category
            source_value: create_remote_thread
            mapped_at: '2025-11-26T02:25:02.578229+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:25:02.578229+00:00'
    detection_fields:
        -   source_field: TargetImage
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-11-26T02:25:02.578298+00:00'
        -   source_field: StartModule
            target_table: process_activity
            target_field: module.start_address
            mapped_at: '2025-11-26T02:25:02.578304+00:00'
