title: Remote Thread Creation In Uncommon Target Image
id: a1a144b7-5c9b-4853-a559-2172be8d4a03
status: experimental
level: medium
author: Florian Roth (Nextron Systems)
description: Detects uncommon target processes for remote thread creation
references:
    - https://web.archive.org/web/20220319032520/https://blog.redbluepurple.io/offensive-research/bypassing-injection-detection
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1055.003
date: '2022-03-16'
modified: '2024-07-15'
logsource:
    category: create_remote_thread
    product: windows
detection:
    selection:
        TargetImage|endswith:
            - \calc.exe
            - \calculator.exe
            - \mspaint.exe
            - \notepad.exe
            - \ping.exe
            - \sethc.exe
            - \spoolsv.exe
            - \wordpad.exe
            - \write.exe
    filter_main_csrss:
        SourceImage: C:\Windows\System32\csrss.exe
    filter_optional_aurora_1:
        StartFunction: EtwpNotificationThread
    filter_optional_aurora_2:
        SourceImage|contains: unknown process
    filter_optional_vmtoolsd:
        SourceImage: C:\Program Files\VMware\VMware Tools\vmtoolsd.exe
        StartFunction: GetCommandLineW
        TargetImage:
            - C:\Windows\System32\notepad.exe
            - C:\Windows\System32\spoolsv.exe
    filter_optional_xerox_pjems:
        SourceImage: C:\Program Files\Xerox\XeroxPrintExperience\CommonFiles\XeroxPrintJobEventManagerService.exe
        StartFunction: LoadLibraryW
        TargetImage: C:\Windows\System32\spoolsv.exe
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
related:
    -   id: f016c716-754a-467f-a39e-63c06f773987
        type: obsolete
ocsf_mapping:
    class_name: process_activity
    activity_id: 4
    logsource:
        category:
            source_field: category
            source_value: create_remote_thread
            mapped_at: '2025-12-04T01:40:46.737824+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:40:46.737824+00:00'
    detection_fields:
        -   source_field: TargetImage
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-12-04T01:40:46.737872+00:00'
        -   source_field: SourceImage
            target_table: process_activity
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:40:46.737874+00:00'
        -   source_field: StartFunction
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:40:46.737919+00:00'
