id: f239b326-2f41-4d6b-9dfa-c846a60ef505
title: Password Dumper Remote Thread in LSASS
status: stable
level: high
description: 'Detects password dumper activity by monitoring remote thread creation
    EventID 8 in combination with the lsass.exe process as TargetImage.

    The process in field Process is the malicious program. A single execution can
    lead to hundreds of events.

    '
author: Thomas Patzke
date: '2017-02-19'
modified: '2021-06-21'
tags:
    - attack.credential-access
    - attack.s0005
    - attack.t1003.001
references:
    - https://jpcertcc.github.io/ToolAnalysisResultSheet/details/WCE.htm
falsepositives:
    - Antivirus products
taxonomy: sigma
logsource:
    category: create_remote_thread
    product: windows
detection:
    selection:
        TargetImage|endswith: \lsass.exe
        StartModule: ''
    condition: selection
ocsf_mapping:
    class_name: null
    logsource:
        category:
            source_field: category
            source_value: create_remote_thread
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetImage
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: StartModule
            target_table: null
            target_field: null
            mapped_at: null
