id: c0aac16a-b1e7-4330-bab0-3c27bb4987c7
title: Remote Thread Creation In Mstsc.Exe From Suspicious Location
status: test
level: high
description: 'Detects remote thread creation in the "mstsc.exe" process by a process
    located in a potentially suspicious location.

    This technique is often used by attackers in order to hook some APIs used by DLLs
    loaded by "mstsc.exe" during RDP authentications in order to steal credentials.

    '
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-07-28'
modified: '2024-01-22'
tags:
    - attack.credential-access
references:
    - https://github.com/S12cybersecurity/RDPCredentialStealer/blob/1b8947cdd065a06c1b62e80967d3c7af895fcfed/APIHookInjectorBin/APIHookInjectorBin/Inject.h#L25
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: create_remote_thread
    product: windows
detection:
    selection:
        TargetImage|endswith: \mstsc.exe
        SourceImage|contains:
            - :\Temp\
            - :\Users\Public\
            - :\Windows\PerfLogs\
            - :\Windows\Tasks\
            - :\Windows\Temp\
            - \AppData\Local\Temp\
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: create_remote_thread
            mapped_at: '2025-11-13T20:19:38.834747+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:19:38.834747+00:00'
    detection_fields:
        -   source_field: TargetImage
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-11-13T20:19:38.834780+00:00'
        -   source_field: SourceImage
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-11-13T20:19:38.834783+00:00'
