id: 66d31e5f-52d6-40a4-9615-002d3789a119
title: Remote Thread Creation By Uncommon Source Image
status: experimental
level: medium
description: Detects uncommon processes creating remote threads.
author: Perez Diego (@darkquassar), oscd.community
date: '2019-10-27'
modified: '2024-07-15'
tags:
    - attack.privilege-escalation
    - attack.defense-evasion
    - attack.t1055
references:
    - Personal research, statistical analysis
    - https://lolbas-project.github.io
falsepositives:
    - This rule is best put in testing first in order to create a baseline that reflects
        the data in your environment.
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''02d1d718-dd13-41af-989d-ea85c7fab93f''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: create_remote_thread
    product: windows
detection:
    selection:
        SourceImage|endswith:
            - \explorer.exe
            - \iexplore.exe
            - \msiexec.exe
            - \powerpnt.exe
            - \schtasks.exe
            - \winlogon.exe
    filter_main_winlogon_1:
        SourceImage: C:\Windows\System32\winlogon.exe
        TargetImage:
            - C:\Windows\System32\services.exe
            - C:\Windows\System32\wininit.exe
            - C:\Windows\System32\csrss.exe
            - C:\Windows\System32\LogonUI.exe
    filter_main_winlogon_2:
        SourceImage: C:\Windows\System32\winlogon.exe
        TargetParentProcessId: 4
    filter_main_schtasks_conhost:
        SourceImage:
            - C:\Windows\System32\schtasks.exe
            - C:\Windows\SysWOW64\schtasks.exe
        TargetImage: C:\Windows\System32\conhost.exe
    filter_main_explorer:
        SourceImage: C:\Windows\explorer.exe
        TargetImage|startswith:
            - C:\Program Files (x86)\
            - C:\Program Files\
            - C:\Windows\System32\
            - C:\Windows\SysWOW64\
    filter_main_system:
        TargetImage: System
    filter_main_msiexec:
        SourceImage|endswith: \msiexec.exe
        TargetImage|contains:
            - \AppData\Local\
            - C:\Program Files (x86)\
            - C:\Program Files\
    filter_optional_aurora_smartconsole1:
        SourceImage: C:\Program Files\internet explorer\iexplore.exe
        SourceCommandLine|contains|all:
            - https://
            - .checkpoint.com/documents/
            - SmartConsole_OLH/
            - default.htm#cshid=
    filter_optional_aurora_smartconsole2:
        SourceImage: C:\Program Files\internet explorer\iexplore.exe
        SourceParentImage|startswith:
            - C:\Program Files\
            - C:\Program Files (x86)\
        SourceParentImage|contains|all:
            - \CheckPoint\SmartConsole\
            - \SmartConsole.exe
    filter_optional_powerpnt:
        SourceImage|contains: \Microsoft Office\
        SourceImage|endswith: \POWERPNT.EXE
        TargetImage: C:\Windows\System32\csrss.exe
    filter_main_null:
        TargetImage: null
    filter_main_empty:
        TargetImage: ''
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: create_remote_thread
            mapped_at: '2025-11-13T20:19:46.503889+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:19:46.503889+00:00'
    detection_fields:
        -   source_field: SourceImage
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-11-13T20:19:48.992912+00:00'
        -   source_field: TargetImage
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-11-13T20:19:48.992931+00:00'
        -   source_field: TargetParentProcessId
            target_table: process_activity
            target_field: process.parent_process.pid
            mapped_at: '2025-11-13T20:19:48.992934+00:00'
        -   source_field: SourceCommandLine
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:19:48.992937+00:00'
        -   source_field: SourceParentImage
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:19:48.992940+00:00'
