id: 025bd229-fd1f-4fdb-97ab-20006e1a5368
title: Unusual File Download from Direct IP Address
status: test
level: high
description: Detects the download of suspicious file type from URLs with IP
author: Nasreddine Bencherchali (Nextron Systems), Florian Roth (Nextron Systems)
date: '2022-09-07'
modified: '2023-02-10'
tags:
    - attack.defense-evasion
    - attack.t1564.004
references:
    - https://github.com/trustedsec/SysmonCommunityGuide/blob/adcdfee20999f422b974c8d4149bf4c361237db7/chapters/file-stream-creation-hash.md
    - https://labs.withsecure.com/publications/detecting-onenote-abuse
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: create_stream_hash
    product: windows
detection:
    selection:
        Contents|re: http[s]?://[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}
        TargetFilename|contains:
            - .ps1:Zone
            - .bat:Zone
            - .exe:Zone
            - .vbe:Zone
            - .vbs:Zone
            - .dll:Zone
            - .one:Zone
            - .cmd:Zone
            - .hta:Zone
            - .xll:Zone
            - .lnk:Zone
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: create_stream_hash
            mapped_at: '2025-11-13T20:21:28.222966+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:28.222966+00:00'
    detection_fields:
        -   source_field: Contents
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:21:29.274418+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:29.274438+00:00'
