id: ae02ed70-11aa-4a22-b397-c0d0e8f6ea99
title: Unusual File Download From File Sharing Websites - File Stream
status: experimental
level: medium
description: Detects the download of suspicious file type from a well-known file and
    paste sharing domain
author: Florian Roth (Nextron Systems)
date: '2022-08-24'
modified: '2024-10-21'
tags:
    - attack.defense-evasion
    - attack.s0139
    - attack.t1564.004
references:
    - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=90015
    - https://www.cisa.gov/uscert/ncas/alerts/aa22-321a
    - https://www.microsoft.com/en-us/security/blog/2024/01/17/new-ttps-observed-in-mint-sandstorm-campaign-targeting-high-profile-individuals-at-universities-and-research-orgs/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''52182dfb-afb7-41db-b4bc-5336cb29b464''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: create_stream_hash
    product: windows
detection:
    selection_domain:
        Contents|contains:
            - .githubusercontent.com
            - anonfiles.com
            - cdn.discordapp.com
            - ddns.net
            - dl.dropboxusercontent.com
            - ghostbin.co
            - glitch.me
            - gofile.io
            - hastebin.com
            - mediafire.com
            - mega.nz
            - onrender.com
            - pages.dev
            - paste.ee
            - pastebin.com
            - pastebin.pl
            - pastetext.net
            - pixeldrain.com
            - privatlab.com
            - privatlab.net
            - send.exploit.in
            - sendspace.com
            - storage.googleapis.com
            - storjshare.io
            - supabase.co
            - temp.sh
            - transfer.sh
            - trycloudflare.com
            - ufile.io
            - w3spaces.com
            - workers.dev
    selection_extension:
        TargetFilename|contains:
            - .bat:Zone
            - .cmd:Zone
            - .ps1:Zone
    condition: all of selection_*
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: create_stream_hash
            mapped_at: '2025-11-13T20:21:30.318074+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:30.318074+00:00'
    detection_fields:
        -   source_field: Contents
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:21:30.318085+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:30.318088+00:00'
