id: 6309645e-122d-4c5b-bb2b-22e4f9c2fa42
title: HackTool - Potential CobaltStrike Process Injection
status: test
level: high
description: Detects a potential remote threat creation with certain characteristics
    which are typical for Cobalt Strike beacons
author: Olaf Hartong, Florian Roth (Nextron Systems), Aleksey Potapov, oscd.community
date: '2018-11-30'
modified: '2023-05-05'
tags:
    - attack.defense-evasion
    - attack.t1055.001
references:
    - https://medium.com/@olafhartong/cobalt-strike-remote-threads-detection-206372d11d0f
    - https://blog.cobaltstrike.com/2018/04/09/cobalt-strike-3-11-the-snake-that-eats-its-tail/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: create_remote_thread
    product: windows
detection:
    selection:
        StartAddress|endswith:
            - 0B80
            - 0C7C
            - 0C88
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: create_remote_thread
            mapped_at: '2025-11-13T20:19:39.997702+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:19:39.997702+00:00'
    detection_fields:
        -   source_field: StartAddress
            target_table: process_activity
            target_field: module.start_address
            mapped_at: '2025-11-13T20:19:40.846307+00:00'
