title: Exports Registry Key To an Alternate Data Stream
id: 0d7a9363-af70-4e7b-a3b7-1a176b7fbe84
status: test
level: high
author: Oddvar Moe, Sander Wiebing, oscd.community
description: Exports the target Registry key and hides it in the specified alternate
    data stream.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Regedit/
    - https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
fields:
    - TargetFilename
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1564.004
date: '2020-10-07'
modified: '2021-11-27'
logsource:
    category: create_stream_hash
    product: windows
detection:
    selection:
        Image|endswith: \regedit.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: create_stream_hash
            mapped_at: '2025-12-04T01:51:54.824775+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:51:54.824775+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:51:54.824787+00:00'
