title: Rare Remote Thread Creation By Uncommon Source Image
id: 02d1d718-dd13-41af-989d-ea85c7fab93f
status: experimental
level: high
author: Perez Diego (@darkquassar), oscd.community
description: Detects uncommon processes creating remote threads.
references:
    - Personal research, statistical analysis
    - https://lolbas-project.github.io
falsepositives:
    - This rule is best put in testing first in order to create a baseline that reflects
        the data in your environment.
tags:
    - attack.privilege-escalation
    - attack.defense-evasion
    - attack.t1055
date: '2019-10-27'
modified: '2024-07-15'
logsource:
    category: create_remote_thread
    product: windows
detection:
    selection:
        SourceImage|endswith:
            - \bash.exe
            - \cscript.exe
            - \cvtres.exe
            - \defrag.exe
            - \dialer.exe
            - \dnx.exe
            - \esentutl.exe
            - \excel.exe
            - \expand.exe
            - \find.exe
            - \findstr.exe
            - \forfiles.exe
            - \gpupdate.exe
            - \hh.exe
            - \installutil.exe
            - \lync.exe
            - \makecab.exe
            - \mDNSResponder.exe
            - \monitoringhost.exe
            - \msbuild.exe
            - \mshta.exe
            - \mspaint.exe
            - \outlook.exe
            - \ping.exe
            - \provtool.exe
            - \python.exe
            - \regsvr32.exe
            - \robocopy.exe
            - \runonce.exe
            - \sapcimc.exe
            - \smartscreen.exe
            - \spoolsv.exe
            - \tstheme.exe
            - \userinit.exe
            - \vssadmin.exe
            - \vssvc.exe
            - \w3wp.exe
            - \winscp.exe
            - \winword.exe
            - \wmic.exe
            - \wscript.exe
    condition: selection
related:
    -   id: 66d31e5f-52d6-40a4-9615-002d3789a119
        type: derived
ocsf_mapping:
    class_name: process_activity
    activity_id: 4
    logsource:
        category:
            source_field: category
            source_value: create_remote_thread
            mapped_at: '2025-12-04T01:40:48.015873+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:40:48.015873+00:00'
    detection_fields:
        -   source_field: SourceImage
            target_table: process_activity
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:40:48.015891+00:00'
