id: 0bb4bbeb-fe52-4044-b40c-430a04577ebe
title: Potentially Suspicious File Download From ZIP TLD
status: test
level: high
description: Detects the download of a file with a potentially suspicious extension
    from a .zip top level domain.
author: Florian Roth (Nextron Systems)
date: '2023-05-18'
tags:
    - attack.defense-evasion
references:
    - https://twitter.com/cyb3rops/status/1659175181695287297
    - https://fabian-voith.de/2020/06/25/sysmon-v11-1-reads-alternate-data-streams/
falsepositives:
    - Legitimate file downloads from a websites and web services that uses the ".zip"
        top level domain.
taxonomy: sigma
logsource:
    category: create_stream_hash
    product: windows
detection:
    selection:
        Contents|contains: .zip/
        TargetFilename|contains:
            - .bat:Zone
            - .dat:Zone
            - .dll:Zone
            - .doc:Zone
            - .docm:Zone
            - .exe:Zone
            - .hta:Zone
            - .pptm:Zone
            - .ps1:Zone
            - .rar:Zone
            - .rtf:Zone
            - .sct:Zone
            - .vbe:Zone
            - .vbs:Zone
            - .ws:Zone
            - .wsf:Zone
            - .xll:Zone
            - .xls:Zone
            - .xlsm:Zone
            - .zip:Zone
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: create_stream_hash
            mapped_at: '2025-11-13T20:21:29.278957+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:29.278957+00:00'
    detection_fields:
        -   source_field: Contents
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:21:29.278980+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:29.278984+00:00'
