title: Potential Credential Dumping Attempt Via PowerShell Remote Thread
id: fb656378-f909-47c1-8747-278bf09f4f4f
status: test
level: high
author: oscd.community, Natalia Shornikova
description: Detects remote thread creation by PowerShell processes into "lsass.exe"
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
falsepositives:
    - Unknown
tags:
    - attack.credential-access
    - attack.t1003.001
date: '2020-10-06'
modified: '2022-12-18'
logsource:
    category: create_remote_thread
    product: windows
detection:
    selection:
        SourceImage|endswith:
            - \powershell.exe
            - \pwsh.exe
        TargetImage|endswith: \lsass.exe
    condition: selection
related:
    -   id: 3f07b9d1-2082-4c56-9277-613a621983cc
        type: obsolete
    -   id: 0f920ebe-7aea-4c54-b202-9aa0c609cfe5
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 4
    logsource:
        category:
            source_field: category
            source_value: create_remote_thread
            mapped_at: '2025-12-04T01:40:46.062035+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:40:46.062035+00:00'
    detection_fields:
        -   source_field: SourceImage
            target_table: process_activity
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:40:46.063793+00:00'
        -   source_field: TargetImage
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-12-04T01:40:46.063804+00:00'
