title: DNS Query To Ufile.io
id: 1cbbeaaf-3c8c-4e4c-9d72-49485b6a176b
status: test
level: low
author: yatinwad, TheDFIRReport
description: Detects DNS queries to "ufile.io", which was seen abused by malware and
    threat actors as a method for data exfiltration
references:
    - https://thedfirreport.com/2021/12/13/diavol-ransomware/
falsepositives:
    - DNS queries for "ufile" are not malicious by nature necessarily. Investigate
        the source to determine the necessary actions to take
tags:
    - attack.exfiltration
    - attack.t1567.002
date: '2022-06-23'
modified: '2023-09-18'
logsource:
    category: dns_query
    product: windows
detection:
    selection:
        QueryName|contains: ufile.io
    condition: selection
related:
    -   id: 090ffaad-c01a-4879-850c-6d57da98452d
        type: similar
ocsf_mapping:
    class_name: dns_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: dns_query
            mapped_at: '2025-12-04T01:51:17.934837+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:51:17.934837+00:00'
    detection_fields:
        -   source_field: QueryName
            target_table: dns_activity
            target_field: query.hostname
            mapped_at: '2025-12-04T01:51:17.934864+00:00'
