id: df68f791-ad95-447f-a271-640a0dab9cf8
title: DNS Query Request To OneLaunch Update Service
status: test
level: low
description: 'Detects DNS query requests to "update.onelaunch.com". This domain is
    associated with the OneLaunch adware application.

    When the OneLaunch application is installed it will attempt to get updates from
    this domain.

    '
author: Josh Nickels
date: '2024-02-26'
tags:
    - attack.collection
    - attack.t1056
references:
    - https://www.malwarebytes.com/blog/detections/pup-optional-onelaunch-silentcf
    - https://www.myantispyware.com/2020/12/14/how-to-uninstall-onelaunch-browser-removal-guide/
    - https://malware.guide/browser-hijacker/remove-onelaunch-virus/
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: dns_query
    product: windows
detection:
    selection:
        QueryName: update.onelaunch.com
        Image|endswith: \OneLaunch.exe
    condition: selection
ocsf_mapping:
    class_name: dns_activity
    logsource:
        category:
            source_field: category
            source_value: dns_query
            mapped_at: '2025-11-13T20:21:06.370382+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:06.370382+00:00'
    detection_fields:
        -   source_field: QueryName
            target_table: dns_activity
            target_field: query.hostname
            mapped_at: '2025-11-13T20:21:06.370389+00:00'
        -   source_field: Image
            target_table: dns_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:21:06.370391+00:00'
