id: b3e6418f-7c7a-4fad-993a-93b65027a9f1
title: DNS Query To Visual Studio Code Tunnels Domain
status: test
level: medium
description: 'Detects DNS query requests to Visual Studio Code tunnel domains. Attackers
    can abuse that feature to establish a reverse shell or persistence on a machine.

    '
author: citron_ninja
date: '2023-10-25'
modified: '2023-11-20'
tags:
    - attack.command-and-control
    - attack.t1071.001
references:
    - https://ipfyx.fr/post/visual-studio-code-tunnel/
    - https://badoption.eu/blog/2023/01/31/code_c2.html
    - https://cydefops.com/vscode-data-exfiltration
falsepositives:
    - Legitimate use of Visual Studio Code tunnel will also trigger this.
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''9501f8e6-8e3d-48fc-a8a6-1089dd5d7ef4''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''4b657234-038e-4ad5-997c-4be42340bce4''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''1cb0c6ce-3d00-44fc-ab9c-6d6d577bf20b''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: dns_query
    product: windows
detection:
    selection:
        QueryName|endswith: .tunnels.api.visualstudio.com
    condition: selection
ocsf_mapping:
    class_name: dns_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: dns_query
            mapped_at: '2025-11-26T02:37:34.717120+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:37:34.717120+00:00'
    detection_fields:
        -   source_field: QueryName
            target_table: dns_activity
            target_field: query.hostname
            mapped_at: '2025-11-26T02:37:35.806187+00:00'
