title: Cloudflared Tunnels Related DNS Requests
id: a1d9eec5-33b2-4177-8d24-27fe754d0812
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: 'Detects DNS requests to Cloudflared tunnels domains.

    Attackers can abuse that feature to establish a reverse shell or persistence on
    a machine.

    '
references:
    - https://www.guidepointsecurity.com/blog/tunnel-vision-cloudflared-abused-in-the-wild/
    - Internal Research
falsepositives:
    - Legitimate use of cloudflare tunnels will also trigger this.
tags:
    - attack.command-and-control
    - attack.t1071.001
date: '2023-12-20'
logsource:
    category: dns_query
    product: windows
detection:
    selection:
        QueryName|endswith:
            - .v2.argotunnel.com
            - protocol-v2.argotunnel.com
            - trycloudflare.com
            - update.argotunnel.com
    condition: selection
related:
    -   id: 7cd1dcdc-6edf-4896-86dc-d1f19ad64903
        type: similar
ocsf_mapping:
    class_name: dns_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: dns_query
            mapped_at: '2025-12-04T01:51:14.804447+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:51:14.804447+00:00'
    detection_fields:
        -   source_field: QueryName
            target_table: dns_activity
            target_field: query.hostname
            mapped_at: '2025-12-04T01:51:14.804460+00:00'
