id: 36e037c4-c228-4866-b6a3-48eb292b9955
title: DNS Query Request By Regsvr32.EXE
status: test
level: medium
description: Detects DNS queries initiated by "Regsvr32.exe"
author: Dmitriy Lifanov, oscd.community
date: '2019-10-25'
modified: '2023-09-18'
tags:
    - attack.execution
    - attack.t1559.001
    - attack.defense-evasion
    - attack.t1218.010
references:
    - https://pentestlab.blog/2017/05/11/applocker-bypass-regsvr32/
    - https://oddvar.moe/2017/12/13/applocker-case-study-how-insecure-is-it-really-part-1/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''c7e91a02-d771-4a6d-a700-42587e0b1095''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: dns_query
    product: windows
detection:
    selection:
        Image|endswith: \regsvr32.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: dns_query
            mapped_at: '2025-11-13T20:21:06.379069+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:06.379069+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:21:06.379079+00:00'
