id: a21bcd7e-38ec-49ad-b69a-9ea17e69509e
title: DNS Server Discovery Via LDAP Query
status: test
level: low
description: Detects DNS server discovery via LDAP query requests from uncommon applications
author: frack113
date: '2022-08-20'
modified: '2023-09-18'
tags:
    - attack.discovery
    - attack.t1482
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/980f3f83fd81f37c1ca9c02dccfd1c3d9f9d0841/atomics/T1016/T1016.md#atomic-test-9---dns-server-discovery-using-nslookup
    - https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-adts/7fcdce70-5205-44d6-9c3a-260e616a2f04
falsepositives:
    - Likely
taxonomy: sigma
logsource:
    category: dns_query
    product: windows
detection:
    selection:
        QueryName|startswith: _ldap.
    filter_main_generic:
        Image|contains:
            - :\Program Files\
            - :\Program Files (x86)\
            - :\Windows\
    filter_main_defender:
        Image|contains: :\ProgramData\Microsoft\Windows Defender\Platform\
        Image|endswith: \MsMpEng.exe
    filter_main_unknown:
        Image: <unknown process>
    filter_optional_azure:
        Image|startswith: C:\WindowsAzure\GuestAgent
    filter_main_null:
        Image: null
    filter_optional_browsers:
        Image|endswith:
            - \chrome.exe
            - \firefox.exe
            - \opera.exe
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: dns_activity
    logsource:
        category:
            source_field: category
            source_value: dns_query
            mapped_at: '2025-11-13T20:21:06.384808+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:06.384808+00:00'
    detection_fields:
        -   source_field: QueryName
            target_table: dns_activity
            target_field: query.hostname
            mapped_at: '2025-11-13T20:21:06.384815+00:00'
        -   source_field: Image
            target_table: dns_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:21:06.384817+00:00'
