title: DNS Query Request To OneLaunch Update Service
id: df68f791-ad95-447f-a271-640a0dab9cf8
status: test
level: low
author: Josh Nickels
description: 'Detects DNS query requests to "update.onelaunch.com". This domain is
    associated with the OneLaunch adware application.

    When the OneLaunch application is installed it will attempt to get updates from
    this domain.

    '
references:
    - https://www.malwarebytes.com/blog/detections/pup-optional-onelaunch-silentcf
    - https://www.myantispyware.com/2020/12/14/how-to-uninstall-onelaunch-browser-removal-guide/
    - https://malware.guide/browser-hijacker/remove-onelaunch-virus/
falsepositives:
    - Unlikely
tags:
    - attack.collection
    - attack.t1056
date: '2024-02-26'
logsource:
    category: dns_query
    product: windows
detection:
    selection:
        QueryName: update.onelaunch.com
        Image|endswith: \OneLaunch.exe
    condition: selection
ocsf_mapping:
    class_name: dns_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: dns_query
            mapped_at: '2025-12-04T01:51:13.618625+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:51:13.618625+00:00'
    detection_fields:
        -   source_field: QueryName
            target_table: dns_activity
            target_field: query.hostname
            mapped_at: '2025-12-04T01:51:13.618644+00:00'
        -   source_field: Image
            target_table: dns_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:51:13.618645+00:00'
