id: a1d9eec5-33b2-4177-8d24-27fe754d0812
title: Cloudflared Tunnels Related DNS Requests
status: test
level: medium
description: 'Detects DNS requests to Cloudflared tunnels domains.

    Attackers can abuse that feature to establish a reverse shell or persistence on
    a machine.

    '
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-12-20'
tags:
    - attack.command-and-control
    - attack.t1071.001
references:
    - https://www.guidepointsecurity.com/blog/tunnel-vision-cloudflared-abused-in-the-wild/
    - Internal Research
falsepositives:
    - Legitimate use of cloudflare tunnels will also trigger this.
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''7cd1dcdc-6edf-4896-86dc-d1f19ad64903''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: dns_query
    product: windows
detection:
    selection:
        QueryName|endswith:
            - .v2.argotunnel.com
            - protocol-v2.argotunnel.com
            - trycloudflare.com
            - update.argotunnel.com
    condition: selection
ocsf_mapping:
    class_name: dns_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: dns_query
            mapped_at: '2025-11-26T02:37:41.274993+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:37:41.274993+00:00'
    detection_fields:
        -   source_field: QueryName
            target_table: dns_activity
            target_field: query.hostname
            mapped_at: '2025-11-26T02:37:41.275005+00:00'
