title: Vulnerable HackSys Extreme Vulnerable Driver Load
id: 295c9289-acee-4503-a571-8eacaef36b28
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects the load of HackSys Extreme Vulnerable Driver which is an intentionally
    vulnerable Windows driver developed for security enthusiasts to learn and polish
    their exploitation skills at Kernel level and often abused by threat actors
references:
    - https://github.com/hacksysteam/HackSysExtremeVulnerableDriver
falsepositives:
    - Unlikely
tags:
    - attack.privilege-escalation
    - attack.t1543.003
date: '2022-08-18'
modified: '2024-11-23'
logsource:
    category: driver_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith: \HEVD.sys
        Hashes|contains:
            - IMPHASH=f26d0b110873a1c7d8c4f08fbeab89c5
            - IMPHASH=c46ea2e651fd5f7f716c8867c6d13594
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: driver_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Hashes
            target_table: null
            target_field: null
            mapped_at: null
