id: 67add051-9ee7-4ad3-93ba-42935615ae8d
title: PUA - Process Hacker Driver Load
status: test
level: high
description: Detects driver load of the Process Hacker tool
author: Florian Roth (Nextron Systems)
date: '2022-11-16'
modified: '2024-11-23'
tags:
    - attack.privilege-escalation
    - cve.2021-21551
    - attack.t1543
references:
    - https://processhacker.sourceforge.io/
falsepositives:
    - Legitimate use of process hacker or system informer by developers or system
        administrators
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''10cb6535-b31d-4512-9962-513dcbc42cc1''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: driver_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith: \kprocesshacker.sys
        Hashes|contains:
            - IMPHASH=821D74031D3F625BCBD0DF08B70F1E77
            - IMPHASH=F86759BB4DE4320918615DC06E998A39
            - IMPHASH=0A64EEB85419257D0CE32BD5D55C3A18
            - IMPHASH=6E7B34DFC017700B1517B230DF6FF0D0
    condition: selection
ocsf_mapping:
    class_name: null
    logsource:
        category:
            source_field: category
            source_value: driver_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Hashes
            target_table: null
            target_field: null
            mapped_at: null
