id: 1a42dfa6-6cb2-4df9-9b48-295be477e835
title: Vulnerable WinRing0 Driver Load
status: test
level: high
description: Detects the load of a signed WinRing0 driver often used by threat actors,
    crypto miners (XMRIG) or malware for privilege escalation
author: Florian Roth (Nextron Systems)
date: '2022-07-26'
modified: '2024-11-23'
tags:
    - attack.privilege-escalation
    - attack.t1543.003
references:
    - https://github.com/xmrig/xmrig/tree/master/bin/WinRing0
    - https://www.rapid7.com/blog/post/2021/12/13/driver-based-attacks-past-and-present/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: driver_load
    product: windows
detection:
    selection:
        Hashes|contains: IMPHASH=D41FA95D4642DC981F10DE36F4DC8CD7
        ImageLoaded|endswith:
            - \WinRing0x64.sys
            - \WinRing0.sys
            - \WinRing0.dll
            - \WinRing0x64.dll
            - \winring00x64.sys
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: driver_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Hashes
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
