title: LiveKD Driver Creation
id: 16fe46bb-4f64-46aa-817d-ff7bec4a2352
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects the creation of the LiveKD driver, which is used for live kernel
    debugging
references:
    - Internal Research
falsepositives:
    - Legitimate usage of LiveKD for debugging purposes will also trigger this
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
date: '2023-05-16'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename: C:\Windows\System32\drivers\LiveKdD.SYS
        Image|endswith:
            - \livekd.exe
            - \livek64.exe
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:53:09.117178+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:53:09.117178+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:53:09.117194+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:53:09.117196+00:00'
