title: Potential Initial Access via DLL Search Order Hijacking
id: dbbd9f66-2ed3-4ca2-98a4-6ea985dd1a1c
status: test
level: medium
author: Tim Rauch (rule), Elastic (idea)
description: Detects attempts to create a DLL file to a known desktop application
    dependencies folder such as Slack, Teams or OneDrive and by an unusual process.
    This may indicate an attempt to load a malicious module via DLL search order hijacking.
references:
    - https://github.com/elastic/protections-artifacts/commit/746086721fd385d9f5c6647cada1788db4aea95f#diff-5d46dd4ac6866b4337ec126be8cee0e115467b3e8703794ba6f6df6432c806bc
    - https://posts.specterops.io/automating-dll-hijack-discovery-81c4295904b0
falsepositives:
    - Unknown
tags:
    - attack.t1566
    - attack.t1566.001
    - attack.initial-access
    - attack.t1574
    - attack.t1574.001
    - attack.defense-evasion
date: '2022-10-21'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        Image|endswith:
            - \winword.exe
            - \excel.exe
            - \powerpnt.exe
            - \MSACCESS.EXE
            - \MSPUB.EXE
            - \fltldr.exe
            - \cmd.exe
            - \certutil.exe
            - \mshta.exe
            - \cscript.exe
            - \wscript.exe
            - \curl.exe
            - \powershell.exe
            - \pwsh.exe
        TargetFilename|endswith: .dll
        TargetFilename|contains|all:
            - \Users\
            - \AppData\
        TargetFilename|contains:
            - \Microsoft\OneDrive\
            - \Microsoft OneDrive\
            - \Microsoft\Teams\
            - \Local\slack\app-
            - \Local\Programs\Microsoft VS Code\
    filter:
        Image|endswith: \cmd.exe
        TargetFilename|contains|all:
            - \Users\
            - \AppData\
            - \Microsoft\OneDrive\
            - \api-ms-win-core-
    condition: selection and not filter
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:52:58.861144+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:52:58.861144+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:52:58.861160+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:52:58.861163+00:00'
