id: 3d0ed417-3d94-4963-a562-4a92c940656a
title: Creation of a Diagcab
status: test
level: medium
description: Detects the creation of diagcab file, which could be caused by some legitimate
    installer or is a sign of exploitation (review the filename and its location)
author: frack113
date: '2022-06-08'
tags:
    - attack.resource-development
references:
    - https://threadreaderapp.com/thread/1533879688141086720.html
falsepositives:
    - Legitimate microsoft diagcab
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith: .diagcab
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-13T20:21:34.645453+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:34.645453+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:34.645456+00:00'
