title: Wget Creating Files in Tmp Directory
id: 35a05c60-9012-49b6-a11f-6bab741c9f74
status: test
level: medium
author: Joseliyo Sanchez, @Joseliyo_Jstnk
description: Detects the use of wget to download content in a temporary directory
    such as "/tmp" or "/var/tmp"
references:
    - https://blogs.jpcert.or.jp/en/2023/05/gobrat.html
    - https://jstnk9.github.io/jstnk9/research/GobRAT-Malware/
    - https://www.virustotal.com/gui/file/60bcd645450e4c846238cf0e7226dc40c84c96eba99f6b2cffcd0ab4a391c8b3/detection
    - https://www.virustotal.com/gui/file/3e44c807a25a56f4068b5b8186eee5002eed6f26d665a8b791c472ad154585d1/detection
falsepositives:
    - Legitimate downloads of files in the tmp folder.
tags:
    - attack.command-and-control
    - attack.t1105
date: '2023-06-02'
logsource:
    category: file_event
    product: linux
detection:
    selection:
        Image|endswith: /wget
        TargetFilename|startswith:
            - /tmp/
            - /var/tmp/
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:35:23.902913+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:35:23.902913+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:35:23.902933+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:35:23.902935+00:00'
