title: Suspicious File Created Via OneNote Application
id: fcc6d700-68d9-4241-9a1a-06874d621b06
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects suspicious files created via the OneNote application. This could
    indicate a potential malicious ".one"/".onepkg" file was executed as seen being
    used in malware activity in the wild
references:
    - https://www.bleepingcomputer.com/news/security/hackers-now-use-microsoft-onenote-attachments-to-spread-malware/
    - https://blog.osarmor.com/319/onenote-attachment-delivers-asyncrat-malware/
    - https://twitter.com/MaD_c4t/status/1623414582382567424
    - https://labs.withsecure.com/publications/detecting-onenote-abuse
    - https://www.trustedsec.com/blog/new-attacks-old-tricks-how-onenote-malware-is-evolving/
    - https://app.any.run/tasks/17f2d378-6d11-4d6f-8340-954b04f35e83/
falsepositives:
    - False positives should be very low with the extensions list cited. Especially
        if you don't heavily utilize OneNote.
    - Occasional FPs might occur if OneNote is used internally to share different
        embedded documents
tags:
    - attack.defense-evasion
date: '2023-02-09'
modified: '2023-02-27'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        Image|endswith:
            - \onenote.exe
            - \onenotem.exe
            - \onenoteim.exe
        TargetFilename|contains: \AppData\Local\Temp\OneNote\
        TargetFilename|endswith:
            - .bat
            - .chm
            - .cmd
            - .dll
            - .exe
            - .hta
            - .htm
            - .html
            - .js
            - .lnk
            - .ps1
            - .vbe
            - .vbs
            - .wsf
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:51:57.345352+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:51:57.345352+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:51:57.345366+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:51:57.345368+00:00'
