id: 4aafb0fa-bff5-4b9d-b99e-8093e659c65f
title: Writing Local Admin Share
status: test
level: medium
description: 'Aversaries may use to interact with a remote network share using Server
    Message Block (SMB).

    This technique is used by post-exploitation frameworks.

    '
author: frack113
date: '2022-01-01'
modified: '2022-08-13'
tags:
    - attack.lateral-movement
    - attack.t1546.002
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1021.002/T1021.002.md#atomic-test-4---execute-command-writing-output-to-local-admin-share
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|contains|all:
            - \\127.0.0
            - \ADMIN$\
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 3
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-26T02:39:08.528727+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:39:08.528727+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-26T02:39:08.528759+00:00'
