title: Visual Studio Code Tunnel Remote File Creation
id: 56e05d41-ce99-4ecd-912d-93f019ee0b71
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: 'Detects the creation of file by the "node.exe" process in the ".vscode-server"
    directory. Could be a sign of remote file creation via VsCode tunnel feature

    '
references:
    - Internal Research
falsepositives:
    - Unknown
tags:
    - attack.command-and-control
date: '2023-10-25'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        Image|contains: \servers\Stable-
        Image|endswith: \server\node.exe
        TargetFilename|contains: \.vscode-server\data\User\History\
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:51:58.410208+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:51:58.410208+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:51:58.410226+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:51:58.410229+00:00'
