title: Startup Item File Created - MacOS
id: dfe8b941-4e54-4242-b674-6b613d521962
status: test
level: low
author: Alejandro Ortuno, oscd.community
description: 'Detects the creation of a startup item plist file, that automatically
    get executed at boot initialization to establish persistence.

    Adversaries may use startup items automatically executed at boot initialization
    to establish persistence.

    Startup items execute during the final phase of the boot process and contain shell
    scripts or other executable files along with configuration information used by
    the system to determine the execution order for all startup items.

    '
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1037.005/T1037.005.md
    - https://developer.apple.com/library/archive/documentation/MacOSX/Conceptual/BPSystemStartup/Chapters/StartupItems.html
falsepositives:
    - Legitimate administration activities
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1037.005
date: '2020-10-14'
modified: '2024-08-11'
logsource:
    category: file_event
    product: macos
detection:
    selection:
        TargetFilename|startswith:
            - /Library/StartupItems/
            - /System/Library/StartupItems
        TargetFilename|endswith: .plist
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:34:01.194147+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-12-04T01:34:01.194147+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:34:01.194163+00:00'
