id: e3845023-ca9a-4024-b2b2-5422156d5527
title: PowerShell Module File Created By Non-PowerShell Process
status: test
level: medium
description: Detects the creation of a new PowerShell module ".psm1", ".psd1", ".dll",
    ".ps1", etc. by a non-PowerShell process
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-05-09'
modified: '2023-10-18'
tags:
    - attack.persistence
references:
    - Internal Research
    - https://learn.microsoft.com/en-us/powershell/scripting/developer/module/understanding-a-windows-powershell-module?view=powershell-7.3
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|contains:
            - \WindowsPowerShell\Modules\
            - \PowerShell\7\Modules\
    filter_main_pwsh:
        Image|endswith:
            - :\Program Files\PowerShell\7-preview\pwsh.exe
            - :\Program Files\PowerShell\7\pwsh.exe
            - :\Windows\System32\poqexec.exe
            - :\Windows\System32\WindowsPowerShell\v1.0\powershell_ise.exe
            - :\Windows\System32\WindowsPowerShell\v1.0\powershell.exe
            - :\Windows\SysWOW64\poqexec.exe
            - :\Windows\SysWOW64\WindowsPowerShell\v1.0\powershell_ise.exe
            - :\Windows\SysWOW64\WindowsPowerShell\v1.0\powershell.exe
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-13T20:21:34.680655+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:34.680655+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:34.680660+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:21:34.680662+00:00'
