title: Suspicious desktop.ini Action
id: 81315b50-6b60-4d8f-9928-3466e1022515
status: test
level: medium
author: Maxime Thiebaut (@0xThiebaut), Tim Shelton (HAWK.IO)
description: Detects unusual processes accessing desktop.ini, which can be leveraged
    to alter how Explorer displays a folder's content (i.e. renaming files) without
    changing them on disk.
references:
    - https://isc.sans.edu/forums/diary/Desktopini+as+a+postexploitation+tool/25912/
falsepositives:
    - Operations performed through Windows SCCM or equivalent
    - Read only access list authority
tags:
    - attack.persistence
    - attack.t1547.009
date: '2020-03-19'
modified: '2022-10-07'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith: \desktop.ini
    filter_generic:
        Image|startswith:
            - C:\Windows\
            - C:\Program Files\
            - C:\Program Files (x86)\
    filter_jetbrains:
        Image|endswith: \AppData\Local\JetBrains\Toolbox\bin\7z.exe
        TargetFilename|contains: \JetBrains\apps\
    filter_upgrade:
        TargetFilename|startswith: C:\$WINDOWS.~BT\NewOS\
    condition: selection and not 1 of filter_*
ocsf_mapping:
    class_name: file_activity
    activity_id: 3
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:53:07.936318+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:53:07.936318+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:53:07.936337+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:53:07.936339+00:00'
