id: b1c50487-1967-4315-a026-6491686d860e
title: Office Macro File Creation From Suspicious Process
status: test
level: high
description: Detects the creation of a office macro file from a a suspicious process
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: '2022-01-23'
modified: '2023-02-22'
tags:
    - attack.initial-access
    - attack.t1566.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1566.001/T1566.001.md
    - https://learn.microsoft.com/en-us/deployoffice/compat/office-file-format-reference
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: file_event
    product: windows
    definition: 'Requirements: The "ParentImage" field is not available by default
        on EID 11 of Sysmon logs. To be able to use this rule to the full extent you
        need to enriche the log with additional ParentImage data'
detection:
    selection_cmd:
        Image|endswith:
            - \cscript.exe
            - \mshta.exe
            - \regsvr32.exe
            - \rundll32.exe
            - \wscript.exe
        ParentImage|endswith:
            - \cscript.exe
            - \mshta.exe
            - \regsvr32.exe
            - \rundll32.exe
            - \wscript.exe
    selection_ext:
        TargetFilename|endswith:
            - .docm
            - .dotm
            - .xlsm
            - .xltm
            - .potm
            - .pptm
    condition: all of selection_*
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-26T02:39:55.614683+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:39:55.614683+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-11-26T02:39:57.219177+00:00'
        -   source_field: ParentImage
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:39:57.219193+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-26T02:39:57.219194+00:00'
