id: 259e5a6a-b8d2-4c38-86e2-26c5e651361d
title: PsExec Service File Creation
status: test
level: low
description: Detects default PsExec service filename which indicates PsExec service
    installation and execution
author: Thomas Patzke
date: '2017-06-12'
modified: '2022-10-26'
tags:
    - attack.execution
    - attack.t1569.002
    - attack.s0029
references:
    - https://www.jpcert.or.jp/english/pub/sr/ir_research.html
    - https://jpcertcc.github.io/ToolAnalysisResultSheet
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''42c575ea-e41e-41f1-b248-8093c3e82a28''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith: \PSEXESVC.exe
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-13T20:21:37.194191+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:37.194191+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:37.194199+00:00'
