id: fccfb43e-09a7-4bd2-8b37-a5a7df33386d
title: .RDP File Created By Uncommon Application
status: test
level: high
description: 'Detects creation of a file with an ".rdp" extension by an application
    that doesn''t commonly create such files.

    '
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-04-18'
modified: '2024-11-01'
tags:
    - attack.defense-evasion
references:
    - https://www.blackhillsinfosec.com/rogue-rdp-revisiting-initial-access-methods/
    - https://web.archive.org/web/20230726144748/https://blog.thickmints.dev/mintsights/detecting-rogue-rdp/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''f748c45a-f8d3-4e6f-b617-fe176f695b8f''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith: .rdp
        Image|endswith:
            - \brave.exe
            - \CCleaner Browser\Application\CCleanerBrowser.exe
            - \chromium.exe
            - \firefox.exe
            - \Google\Chrome\Application\chrome.exe
            - \iexplore.exe
            - \microsoftedge.exe
            - \msedge.exe
            - \Opera.exe
            - \Vivaldi.exe
            - \Whale.exe
            - \olk.exe
            - \Outlook.exe
            - \RuntimeBroker.exe
            - \Thunderbird.exe
            - \Discord.exe
            - \Keybase.exe
            - \msteams.exe
            - \Slack.exe
            - \teams.exe
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-26T02:40:25.656954+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:40:25.656954+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-26T02:40:25.656982+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-11-26T02:40:25.656986+00:00'
