title: Suspicious Appended Extension
id: e3f673b3-65d1-4d80-9146-466f8b63fa99
status: test
level: medium
author: frack113
description: Detects file renames where the target filename uses an uncommon double
    extension. Could indicate potential ransomware activity renaming files and adding
    a custom extension to the encrypted files, such as ".jpg.crypted", ".docx.locky",
    etc.
references:
    - https://app.any.run/tasks/d66ead5a-faf4-4437-93aa-65785afaf9e5/
    - https://blog.cyble.com/2022/08/10/onyx-ransomware-renames-its-leak-site-to-vsop/
falsepositives:
    - Backup software
tags:
    - attack.impact
    - attack.t1486
date: '2022-07-16'
modified: '2023-11-11'
logsource:
    category: file_rename
    product: windows
    definition: 'Requirements: Microsoft-Windows-Kernel-File Provider with at least
        the KERNEL_FILE_KEYWORD_RENAME_SETLINK_PATH keyword'
detection:
    selection:
        SourceFilename|endswith:
            - .doc
            - .docx
            - .jpeg
            - .jpg
            - .lnk
            - .pdf
            - .png
            - .pst
            - .rtf
            - .xls
            - .xlsx
        TargetFilename|contains:
            - .doc.
            - .docx.
            - .jpeg.
            - .jpg.
            - .lnk.
            - .pdf.
            - .png.
            - .pst.
            - .rtf.
            - .xls.
            - .xlsx.
    filter_main_generic:
        TargetFilename|endswith:
            - .backup
            - .bak
            - .old
            - .orig
            - .temp
            - .tmp
    filter_optional_anaconda:
        TargetFilename|contains: :\ProgramData\Anaconda3\
        TargetFilename|endswith: .c~
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: file_activity
    activity_id: 5
    logsource:
        category:
            source_field: category
            source_value: file_rename
            mapped_at: '2025-12-04T01:51:56.374673+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:51:56.374673+00:00'
    detection_fields:
        -   source_field: SourceFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:51:56.374687+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:51:56.374689+00:00'
