title: Anydesk Temporary Artefact
id: 0b9ad457-2554-44c1-82c2-d56a99c42377
status: test
level: medium
author: frack113
description: 'An adversary may use legitimate desktop support and remote access software,
    such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive
    command and control channel to target systems within networks.

    These services are commonly used as legitimate technical support software, and
    may be allowed by application control within a target environment.

    Remote access tools like VNC, Ammyy, and Teamviewer are used frequently when compared
    with other legitimate software commonly used by adversaries. (Citation: Symantec
    Living off the Land)

    '
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1219/T1219.md#atomic-test-2---anydesk-files-detected-test-on-windows
falsepositives:
    - Legitimate use
tags:
    - attack.command-and-control
    - attack.t1219
date: '2022-02-11'
modified: '2024-07-20'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|contains:
            - \AppData\Roaming\AnyDesk\user.conf
            - \AppData\Roaming\AnyDesk\system.conf
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 3
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:52:58.423603+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:52:58.423603+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:52:58.423618+00:00'
