title: PCRE.NET Package Temp Files
id: 6e90ae7a-7cd3-473f-a035-4ebb72d961da
status: test
level: high
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
description: Detects processes creating temp files related to PCRE.NET package
references:
    - https://twitter.com/rbmaslen/status/1321859647091970051
    - https://twitter.com/tifkin_/status/1321916444557365248
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1059
date: '2020-10-29'
modified: '2022-10-09'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|contains: \AppData\Local\Temp\ba9ea7344a4a5f591d6e5dc32a13494b\
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:52:54.663998+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:52:54.663998+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:52:54.664013+00:00'
