title: Suspicious File Creation In Uncommon AppData Folder
id: d7b50671-d1ad-4871-aa60-5aa5b331fe04
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects the creation of suspicious files and folders inside the user's
    AppData folder but not inside any of the common and well known directories (Local,
    Romaing, LocalLow). This method could be used as a method to bypass detection
    who exclude the AppData folder in fear of FPs
references:
    - Internal Research
falsepositives:
    - Unlikely
tags:
    - attack.defense-evasion
    - attack.execution
date: '2022-08-05'
modified: '2023-02-23'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|startswith: C:\Users\
        TargetFilename|contains: \AppData\
        TargetFilename|endswith:
            - .bat
            - .cmd
            - .cpl
            - .dll
            - .exe
            - .hta
            - .iso
            - .lnk
            - .msi
            - .ps1
            - .psm1
            - .scr
            - .vbe
            - .vbs
    filter_main:
        TargetFilename|startswith: C:\Users\
        TargetFilename|contains:
            - \AppData\Local\
            - \AppData\LocalLow\
            - \AppData\Roaming\
    condition: selection and not filter_main
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:52:22.721030+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:52:22.721030+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:52:22.721068+00:00'
