title: PowerShell Console History Logs Deleted
id: ff301988-c231-4bd0-834c-ac9d73b86586
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects the deletion of the PowerShell console History logs which may
    indicate an attempt to destroy forensic evidence
references:
    - Internal Research
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1070
date: '2023-02-15'
logsource:
    category: file_delete
    product: windows
detection:
    selection:
        TargetFilename|endswith: \PSReadLine\ConsoleHost_history.txt
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 4
    logsource:
        category:
            source_field: category
            source_value: file_delete
            mapped_at: '2025-12-04T01:53:29.206216+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:53:29.206216+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:53:29.206283+00:00'
