title: TeamViewer Log File Deleted
id: b1decb61-ed83-4339-8e95-53ea51901720
status: test
level: low
author: frack113
description: Detects the deletion of the TeamViewer log files which may indicate an
    attempt to destroy forensic evidence
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.004/T1070.004.md
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1070.004
date: '2022-01-16'
modified: '2023-02-15'
logsource:
    category: file_delete
    product: windows
detection:
    selection:
        TargetFilename|contains: \TeamViewer_
        TargetFilename|endswith: .log
    filter:
        Image: C:\Windows\system32\svchost.exe
    condition: selection and not filter
ocsf_mapping:
    class_name: file_activity
    activity_id: 4
    logsource:
        category:
            source_field: category
            source_value: file_delete
            mapped_at: '2025-12-04T01:53:26.364987+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:53:26.364987+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:53:26.365005+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:53:26.365006+00:00'
