id: df6ecb8b-7822-4f4b-b412-08f524b4576c
title: Creation Of Non-Existent System DLL
status: test
level: medium
description: 'Detects the creation of system DLLs that are usually not present on
    the system (or at least not in system directories).

    Usually this technique is used to achieve DLL hijacking.

    '
author: Nasreddine Bencherchali (Nextron Systems), fornotes
date: '2022-12-01'
modified: '2024-01-10'
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1574.001
    - attack.t1574.002
references:
    - https://decoded.avast.io/martinchlumecky/png-steganography/
    - https://posts.specterops.io/lateral-movement-scm-and-dll-hijacking-primer-d2f61e8ab992
    - https://clement.notin.org/blog/2020/09/12/CVE-2020-7315-McAfee-Agent-DLL-injection/
    - https://github.com/Wh04m1001/SysmonEoP
    - https://www.hexacorn.com/blog/2013/12/08/beyond-good-ol-run-key-part-5/
    - https://github.com/blackarrowsec/redteam-research/tree/26e6fc0c0d30d364758fa11c2922064a9a7fd309/LPE%20via%20StorSvc
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''6b98b92b-4f00-4f62-b4fe-4d1920215771''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith:
            - :\Windows\System32\TSMSISrv.dll
            - :\Windows\System32\TSVIPSrv.dll
            - :\Windows\System32\wbem\wbemcomn.dll
            - :\Windows\System32\WLBSCTRL.dll
            - :\Windows\System32\wow64log.dll
            - :\Windows\System32\WptsExtensions.dll
            - \SprintCSP.dll
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-13T20:21:36.250091+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:36.250091+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:36.250099+00:00'
