title: WinSxS Executable File Creation By Non-System Process
id: 34746e8c-5fb8-415a-b135-0abc167e912a
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects the creation of binaries in the WinSxS folder by non-system processes
references:
    - https://media.defense.gov/2023/May/09/2003218554/-1/-1/0/JOINT_CSA_HUNTING_RU_INTEL_SNAKE_MALWARE_20230509.PDF
falsepositives:
    - Unknown
tags:
    - attack.execution
date: '2023-05-11'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|startswith: C:\Windows\WinSxS\
        TargetFilename|endswith: .exe
    filter_main_system_location:
        Image|startswith:
            - C:\Windows\Systems32\
            - C:\Windows\SysWOW64\
            - C:\Windows\WinSxS\
    condition: selection and not 1 of filter_main_*
related:
    -   id: 64827580-e4c3-4c64-97eb-c72325d45399
        type: derived
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:52:18.592836+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:52:18.592836+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:52:18.592851+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:52:18.592853+00:00'
