title: Assembly DLL Creation Via AspNetCompiler
id: 4c7f49ee-2638-43bb-b85b-ce676c30b260
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: 'Detects the creation of new DLL assembly files by "aspnet_compiler.exe",
    which could be a sign of "aspnet_compiler" abuse to proxy execution through a
    build provider.

    '
references:
    - Internal Research
falsepositives:
    - Legitimate assembly compilation using a build provider
tags:
    - attack.execution
date: '2023-08-14'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        Image|endswith: \aspnet_compiler.exe
        TargetFilename|contains|all:
            - \Temporary ASP.NET Files\
            - \assembly\tmp\
            - .dll
    condition: selection
related:
    -   id: 9ccba514-7cb6-4c5c-b377-700758f2f120
        type: similar
    -   id: 9f50fe98-fe5c-4a2d-86c7-fad7f63ed622
        type: similar
    -   id: a01b8329-5953-4f73-ae2d-aa01e1f35f00
        type: similar
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:52:46.003037+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:52:46.003037+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:52:46.003067+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:52:46.003069+00:00'
