title: Potentially Suspicious Self Extraction Directive File Created
id: ab90dab8-c7da-4010-9193-563528cfa347
status: test
level: medium
author: Joseliyo Sanchez, @Joseliyo_Jstnk
description: 'Detects the creation of a binary file with the ".sed" extension. The
    ".sed" extension stand for Self Extraction Directive files.

    These files are used by the "iexpress.exe" utility in order to create self extracting
    packages.

    Attackers were seen abusing this utility and creating PE files with embedded ".sed"
    entries.

    Usually ".sed" files are simple ini files and not PE binaries.

    '
references:
    - https://strontic.github.io/xcyclopedia/library/iexpress.exe-D594B2A33EFAFD0EABF09E3FDC05FCEA.html
    - https://en.wikipedia.org/wiki/IExpress
    - https://www.virustotal.com/gui/file/602f4ae507fa8de57ada079adff25a6c2a899bd25cd092d0af7e62cdb619c93c/behavior
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1218
date: '2024-02-05'
logsource:
    category: file_executable_detected
    product: windows
detection:
    selection:
        TargetFilename|endswith: .sed
    condition: selection
related:
    -   id: 760e75d8-c3b5-409b-a9bf-6130b4c4603f
        type: derived
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_executable_detected
            mapped_at: '2025-12-04T01:51:56.918430+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:51:56.918430+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:51:56.918454+00:00'
