title: EventLog EVTX File Deleted
id: 63c779ba-f638-40a0-a593-ddd45e8b1ddc
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects the deletion of the event log files which may indicate an attempt
    to destroy forensic evidence
references:
    - Internal Research
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1070
date: '2023-02-15'
logsource:
    category: file_delete
    product: windows
detection:
    selection:
        TargetFilename|startswith: C:\Windows\System32\winevt\Logs\
        TargetFilename|endswith: .evtx
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 4
    logsource:
        category:
            source_field: category
            source_value: file_delete
            mapped_at: '2025-12-04T01:53:28.156147+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:53:28.156147+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:53:28.156167+00:00'
