id: 63c779ba-f638-40a0-a593-ddd45e8b1ddc
title: EventLog EVTX File Deleted
status: test
level: medium
description: Detects the deletion of the event log files which may indicate an attempt
    to destroy forensic evidence
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-02-15'
tags:
    - attack.defense-evasion
    - attack.t1070
references:
    - Internal Research
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: file_delete
    product: windows
detection:
    selection:
        TargetFilename|startswith: C:\Windows\System32\winevt\Logs\
        TargetFilename|endswith: .evtx
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_delete
            mapped_at: '2025-11-13T20:21:39.646387+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:39.646387+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:39.646394+00:00'
