id: b5b78988-486d-4a80-b991-930eff3ff8bf
title: PowerShell Profile Modification
status: test
level: medium
description: Detects the creation or modification of a powershell profile which could
    indicate suspicious activity as the profile can be used as a mean of persistence
author: HieuTT35, Nasreddine Bencherchali (Nextron Systems)
date: '2019-10-24'
modified: '2023-10-23'
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1546.013
references:
    - https://www.welivesecurity.com/2019/05/29/turla-powershell-usage/
    - https://persistence-info.github.io/Data/powershellprofile.html
falsepositives:
    - System administrator creating Powershell profile manually
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith:
            - \Microsoft.PowerShell_profile.ps1
            - \PowerShell\profile.ps1
            - \Program Files\PowerShell\7-preview\profile.ps1
            - \Program Files\PowerShell\7\profile.ps1
            - \Windows\System32\WindowsPowerShell\v1.0\profile.ps1
            - \WindowsPowerShell\profile.ps1
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-13T20:21:36.300028+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:36.300028+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:36.300032+00:00'
