id: 602a1f13-c640-4d73-b053-be9a2fa58b96
title: HackTool - Powerup Write Hijack DLL
status: test
level: high
description: 'Powerup tool''s Write Hijack DLL exploits DLL hijacking for privilege
    escalation.

    In it''s default mode, it builds a self deleting .bat file which executes malicious
    command.

    The detection rule relies on creation of the malicious bat file (debug.bat by
    default).

    '
author: Subhash Popuri (@pbssubhash)
date: '2021-08-21'
modified: '2024-06-27'
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.defense-evasion
    - attack.t1574.001
references:
    - https://powersploit.readthedocs.io/en/latest/Privesc/Write-HijackDll/
falsepositives:
    - Any powershell script that creates bat files
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
        TargetFilename|endswith: .bat
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-13T20:21:34.627345+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:34.627345+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:21:34.627351+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:34.627352+00:00'
