title: PowerShell Module File Created
id: e36941d0-c0f0-443f-bc6f-cb2952eb69ea
status: test
level: low
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects the creation of a new PowerShell module ".psm1", ".psd1", ".dll",
    ".ps1", etc.
references:
    - Internal Research
    - https://learn.microsoft.com/en-us/powershell/scripting/developer/module/understanding-a-windows-powershell-module?view=powershell-7.3
falsepositives:
    - Likely
tags:
    - attack.persistence
date: '2023-05-09'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
        TargetFilename|contains:
            - \WindowsPowerShell\Modules\
            - \PowerShell\7\Modules\
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:53:06.949463+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:53:06.949463+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:53:06.949489+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:53:06.949492+00:00'
