id: 3a8da4e0-36c1-40d2-8b29-b3e890d5172a
title: NTDS Exfiltration Filename Patterns
status: test
level: high
description: Detects creation of files with specific name patterns seen used in various
    tools that export the NTDS.DIT for exfiltration.
author: Florian Roth (Nextron Systems)
date: '2022-03-11'
modified: '2023-05-05'
tags:
    - attack.credential-access
    - attack.t1003.003
references:
    - https://github.com/rapid7/metasploit-framework/blob/eb6535009f5fdafa954525687f09294918b5398d/modules/post/windows/gather/ntds_grabber.rb
    - https://github.com/rapid7/metasploit-framework/blob/eb6535009f5fdafa954525687f09294918b5398d/data/post/powershell/NTDSgrab.ps1
    - https://github.com/SecureAuthCorp/impacket/blob/7d2991d78836b376452ca58b3d14daa61b67cb40/impacket/examples/secretsdump.py#L2405
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith:
            - \All.cab
            - .ntds.cleartext
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-13T20:21:34.649304+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:34.649304+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:34.649308+00:00'
