id: 8c31f563-f9a7-450c-bfa8-35f8f32f1f61
title: New Outlook Macro Created
status: test
level: medium
description: Detects the creation of a macro file for Outlook.
author: '@ScoubiMtl'
date: '2021-04-05'
modified: '2023-02-08'
tags:
    - attack.persistence
    - attack.command-and-control
    - attack.t1137
    - attack.t1008
    - attack.t1546
references:
    - https://www.mdsec.co.uk/2020/11/a-fresh-outlook-on-mail-based-persistence/
falsepositives:
    - User genuinely creates a VB Macro for their email
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''117d3d3a-755c-4a61-b23e-9171146d094c''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        Image|endswith: \outlook.exe
        TargetFilename|endswith: \Microsoft\Outlook\VbaProject.OTM
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-13T20:21:36.302596+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:36.302596+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:21:36.302602+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:36.302604+00:00'
