title: Publisher Attachment File Dropped In Suspicious Location
id: 3d2a2d59-929c-4b78-8c1a-145dfe9e07b1
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects creation of files with the ".pub" extension in suspicious or
    uncommon locations. This could be a sign of attackers abusing Publisher documents
references:
    - https://twitter.com/EmericNasi/status/1623224526220804098
falsepositives:
    - Legitimate usage of ".pub" files from those locations
tags:
    - attack.defense-evasion
date: '2023-02-08'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|contains:
            - \AppData\Local\Temp\
            - \Users\Public\
            - \Windows\Temp\
            - C:\Temp\
        TargetFilename|endswith: .pub
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:53:08.367595+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:53:08.367595+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:53:08.367609+00:00'
