id: 162ab1e4-6874-4564-853c-53ec3ab8be01
title: TeamViewer Remote Session
status: test
level: medium
description: Detects the creation of log files during a TeamViewer remote session
author: Florian Roth (Nextron Systems)
date: '2022-01-30'
tags:
    - attack.command-and-control
    - attack.t1219
references:
    - https://www.teamviewer.com/en-us/
falsepositives:
    - Legitimate uses of TeamViewer in an organisation
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection1:
        TargetFilename|endswith:
            - \TeamViewer\RemotePrinting\tvprint.db
            - \TeamViewer\TVNetwork.log
    selection2:
        TargetFilename|contains|all:
            - \TeamViewer
            - _Logfile.log
    condition: 1 of selection*
ocsf_mapping:
    class_name: file_activity
    activity_id: 3
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-26T02:39:46.111073+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:39:46.111073+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-26T02:39:46.111087+00:00'
