id: 11b1ed55-154d-4e82-8ad7-83739298f720
title: NTDS.DIT Creation By Uncommon Process
status: test
level: high
description: Detects creation of a file named "ntds.dit" (Active Directory Database)
    by an uncommon process or a process located in a suspicious directory
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: '2022-01-11'
modified: '2022-07-14'
tags:
    - attack.credential-access
    - attack.t1003.002
    - attack.t1003.003
references:
    - https://stealthbits.com/blog/extracting-password-hashes-from-the-ntds-dit-file/
    - https://adsecurity.org/?p=2398
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''4e7050dd-e548-483f-b7d6-527ab4fa784d''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection_ntds:
        TargetFilename|endswith: \ntds.dit
    selection_process_img:
        Image|endswith:
            - \cmd.exe
            - \cscript.exe
            - \mshta.exe
            - \powershell.exe
            - \pwsh.exe
            - \regsvr32.exe
            - \rundll32.exe
            - \wscript.exe
            - \wsl.exe
            - \wt.exe
    selection_process_paths:
        Image|contains:
            - \AppData\
            - \Temp\
            - \Public\
            - \PerfLogs\
    condition: selection_ntds and 1 of selection_process_*
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-26T02:39:52.699320+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:39:52.699320+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-26T02:39:52.699337+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-11-26T02:39:52.699340+00:00'
