id: 6902955a-01b7-432c-b32a-6f5f81d8f625
title: LSASS Process Dump Artefact In CrashDumps Folder
status: test
level: high
description: Detects the presence of an LSASS dump file in the "CrashDumps" folder.
    This could be a sign of LSASS credential dumping. Techniques such as the LSASS
    Shtinkering have been seen abusing the Windows Error Reporting to dump said process.
author: '@pbssubhash'
date: '2022-12-08'
tags:
    - attack.credential-access
    - attack.t1003.001
references:
    - https://github.com/deepinstinct/Lsass-Shtinkering
    - https://media.defcon.org/DEF%20CON%2030/DEF%20CON%2030%20presentations/Asaf%20Gilboa%20-%20LSASS%20Shtinkering%20Abusing%20Windows%20Error%20Reporting%20to%20Dump%20LSASS.pdf
falsepositives:
    - Rare legitimate dump of the process by the operating system due to a crash of
        lsass
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|startswith: C:\Windows\System32\config\systemprofile\AppData\Local\CrashDumps\
        TargetFilename|contains: lsass.exe.
        TargetFilename|endswith: .dmp
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-13T20:21:34.607720+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:34.607720+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:34.607727+00:00'
