title: Potential Hidden Directory Creation Via NTFS INDEX_ALLOCATION Stream
id: a8f866e1-bdd4-425e-a27a-37619238d9c7
status: test
level: medium
author: Scoubi (@ScoubiMtl)
description: 'Detects the creation of hidden file/folder with the "::$index_allocation"
    stream. Which can be used as a technique to prevent access to folder and files
    from tooling such as "explorer.exe" and "powershell.exe"

    '
references:
    - https://twitter.com/pfiatde/status/1681977680688738305
    - https://soroush.me/blog/2010/12/a-dotty-salty-directory-a-secret-place-in-ntfs-for-secret-files/
    - https://sec-consult.com/blog/detail/pentesters-windows-ntfs-tricks-collection/
    - https://github.com/redcanaryco/atomic-red-team/blob/5c3b23002d2bbede3c07e7307165fc2a235a427d/atomics/T1564.004/T1564.004.md#atomic-test-5---create-hidden-directory-via-index_allocation
    - https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-fscc/c54dec26-1551-4d3a-a0ea-4fa40f848eb3
falsepositives:
    - Unlikely
tags:
    - attack.defense-evasion
    - attack.t1564.004
date: '2023-10-09'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|contains: ::$index_allocation
    condition: selection
related:
    -   id: 0900463c-b33b-49a8-be1d-552a3b553dae
        type: similar
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:52:39.750794+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:52:39.750794+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:52:39.750841+00:00'
