id: 54127bd4-f541-4ac3-afdb-ea073f63f692
title: Potential Persistence Via Notepad++ Plugins
status: test
level: medium
description: Detects creation of new ".dll" files inside the plugins directory of
    a notepad++ installation by a process other than "gup.exe". Which could indicates
    possible persistence
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-06-10'
modified: '2023-01-05'
tags:
    - attack.persistence
references:
    - https://pentestlab.blog/2022/02/14/persistence-notepad-plugins/
falsepositives:
    - Possible FPs during first installation of Notepad++
    - Legitimate use of custom plugins by users in order to enhance notepad++ functionalities
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|contains: \Notepad++\plugins\
        TargetFilename|endswith: .dll
    filter_gup:
        Image|endswith: \Notepad++\updater\gup.exe
    filter_install:
        Image|startswith: C:\Users\
        Image|contains: \AppData\Local\Temp\
        Image|endswith:
            - \target.exe
            - Installer.x64.exe
    condition: selection and not 1 of filter_*
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-26T02:39:19.844779+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:39:19.844779+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-26T02:39:19.844792+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-11-26T02:39:19.844794+00:00'
