id: 4c7f49ee-2638-43bb-b85b-ce676c30b260
title: Assembly DLL Creation Via AspNetCompiler
status: test
level: medium
description: 'Detects the creation of new DLL assembly files by "aspnet_compiler.exe",
    which could be a sign of "aspnet_compiler" abuse to proxy execution through a
    build provider.

    '
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-08-14'
tags:
    - attack.execution
references:
    - Internal Research
falsepositives:
    - Legitimate assembly compilation using a build provider
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''9ccba514-7cb6-4c5c-b377-700758f2f120''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''9f50fe98-fe5c-4a2d-86c7-fad7f63ed622''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''a01b8329-5953-4f73-ae2d-aa01e1f35f00''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        Image|endswith: \aspnet_compiler.exe
        TargetFilename|contains|all:
            - \Temporary ASP.NET Files\
            - \assembly\tmp\
            - .dll
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-13T20:21:36.237930+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:36.237930+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:21:36.237935+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:36.237937+00:00'
