id: 407aecb1-e762-4acf-8c7b-d087bcff3bb6
title: Credential Manager Access By Uncommon Applications
status: experimental
level: medium
description: 'Detects suspicious processes based on name and location that access
    the windows credential manager and vault.

    Which can be a sign of credential stealing. Example case would be usage of mimikatz
    "dpapi::cred" function

    '
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-10-11'
modified: '2024-07-29'
tags:
    - attack.t1003
    - attack.credential-access
references:
    - https://hunter2.gitbook.io/darthsidious/privilege-escalation/mimikatz
    - https://www.absolomb.com/2018-01-26-Windows-Privilege-Escalation-Guide/
falsepositives:
    - Legitimate software installed by the users for example in the "AppData" directory
        may access these files (for any reason).
taxonomy: sigma
logsource:
    category: file_access
    product: windows
    definition: 'Requirements: Microsoft-Windows-Kernel-File ETW provider'
detection:
    selection:
        FileName|contains:
            - \AppData\Local\Microsoft\Credentials\
            - \AppData\Roaming\Microsoft\Credentials\
            - \AppData\Local\Microsoft\Vault\
            - \ProgramData\Microsoft\Vault\
    filter_system_folders:
        Image|startswith:
            - C:\Program Files\
            - C:\Program Files (x86)\
            - C:\Windows\system32\
            - C:\Windows\SysWOW64\
    condition: selection and not 1 of filter_*
ocsf_mapping:
    class_name: file_activity
    activity_id: UNMAPPED
    logsource:
        category:
            source_field: category
            source_value: file_access
            mapped_at: '2025-11-26T02:40:58.612749+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:40:58.612749+00:00'
    detection_fields:
        -   source_field: FileName
            target_table: file_activity
            target_field: file.name
            mapped_at: '2025-11-26T02:40:58.612768+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-11-26T02:40:58.612771+00:00'
