id: 576426ad-0131-4001-ae01-be175da0c108
title: PowerShell Script Dropped Via PowerShell.EXE
status: test
level: low
description: Detects PowerShell creating a PowerShell file (.ps1). While often times
    this behavior is benign, sometimes it can be a sign of a dropper script trying
    to achieve persistence.
author: frack113
date: '2023-05-09'
tags:
    - attack.persistence
references:
    - https://www.zscaler.com/blogs/security-research/onenote-growing-threat-malware-distribution
falsepositives:
    - False positives will differ depending on the environment and scripts used. Apply
        additional filters accordingly.
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
        TargetFilename|endswith: .ps1
    filter_main_psscriptpolicytest:
        TargetFilename|contains: __PSScriptPolicyTest_
    filter_main_appdata:
        TargetFilename|startswith: C:\Users\
        TargetFilename|contains: \AppData\Local\Temp\
    filter_main_windows_temp:
        TargetFilename|startswith: C:\Windows\Temp\
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-13T20:21:34.685018+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:34.685018+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:21:34.685022+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:34.685024+00:00'
