title: OneNote Attachment File Dropped In Suspicious Location
id: 7fd164ba-126a-4d9c-9392-0d4f7c243df0
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects creation of files with the ".one"/".onepkg" extension in suspicious
    or uncommon locations. This could be a sign of attackers abusing OneNote attachments
references:
    - https://www.bleepingcomputer.com/news/security/hackers-now-use-microsoft-onenote-attachments-to-spread-malware/
    - https://blog.osarmor.com/319/onenote-attachment-delivers-asyncrat-malware/
falsepositives:
    - Legitimate usage of ".one" or ".onepkg" files from those locations
tags:
    - attack.defense-evasion
date: '2023-01-22'
modified: '2023-09-19'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|contains:
            - \AppData\Local\Temp\
            - \Users\Public\
            - \Windows\Temp\
            - :\Temp\
        TargetFilename|endswith:
            - .one
            - .onepkg
    filter_main_onenote:
        Image|contains: :\Program Files\Microsoft Office\
        Image|endswith: \ONENOTE.EXE
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:52:49.749487+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:52:49.749487+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:52:49.749500+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:52:49.749502+00:00'
