id: 847def9e-924d-4e90-b7c4-5f581395a2b4
title: HackTool - QuarksPwDump Dump File
status: test
level: critical
description: Detects a dump file written by QuarksPwDump password dumper
author: Florian Roth (Nextron Systems)
date: '2018-02-10'
modified: '2024-06-27'
tags:
    - attack.credential-access
    - attack.t1003.002
references:
    - https://jpcertcc.github.io/ToolAnalysisResultSheet/details/QuarksPWDump.htm
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|contains|all:
            - \AppData\Local\Temp\SAM-
            - .dmp
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-13T20:21:34.676778+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:34.676778+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:34.676782+00:00'
