title: Suspicious Creation TXT File in User Desktop
id: caf02a0a-1e1c-4552-9b48-5e070bd88d11
status: test
level: high
author: frack113
description: Ransomware create txt file in the user Desktop
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1486/T1486.md#atomic-test-5---purelocker-ransom-note
falsepositives:
    - Unknown
tags:
    - attack.impact
    - attack.t1486
date: '2021-12-26'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        Image|endswith: \cmd.exe
        TargetFilename|contains|all:
            - \Users\
            - \Desktop\
        TargetFilename|endswith: .txt
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:53:04.631062+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:53:04.631062+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:53:04.631390+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:53:04.631408+00:00'
