title: Octopus Scanner Malware
id: 805c55d9-31e6-4846-9878-c34c75054fe9
status: test
level: high
author: NVISO
description: Detects Octopus Scanner Malware.
references:
    - https://securitylab.github.com/research/octopus-scanner-malware-open-source-supply-chain
falsepositives:
    - Unknown
tags:
    - attack.t1195
    - attack.t1195.001
date: '2020-06-09'
modified: '2021-11-27'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith:
            - \AppData\Local\Microsoft\Cache134.dat
            - \AppData\Local\Microsoft\ExplorerSync.db
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 3
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:52:48.245029+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:52:48.245029+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:52:48.245054+00:00'
