title: UAC Bypass Using Windows Media Player - File
id: 68578b43-65df-4f81-9a9b-92f32711a951
status: test
level: high
author: Christian Burkard (Nextron Systems)
description: Detects the pattern of UAC Bypass using Windows Media Player osksupport.dll
    (UACMe 32)
references:
    - https://github.com/hfiref0x/UACME
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
date: '2021-08-23'
modified: '2022-10-09'
logsource:
    category: file_event
    product: windows
detection:
    selection1:
        TargetFilename|startswith: C:\Users\
        TargetFilename|endswith: \AppData\Local\Temp\OskSupport.dll
    selection2:
        Image: C:\Windows\system32\DllHost.exe
        TargetFilename: C:\Program Files\Windows Media Player\osk.exe
    condition: 1 of selection*
ocsf_mapping:
    class_name: file_activity
    activity_id: 3
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:52:00.771591+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:52:00.771591+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:52:00.771608+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:52:00.771610+00:00'
