id: 39f1f9f2-9636-45de-98f6-a4046aa8e4b9
title: Potential Webshell Creation On Static Website
status: test
level: medium
description: Detects the creation of files with certain extensions on a static web
    site. This can be indicative of potential uploads of a web shell.
author: Beyu Denis, oscd.community, Tim Shelton, Thurein Oo
date: '2019-10-22'
modified: '2023-10-15'
tags:
    - attack.persistence
    - attack.t1505.003
references:
    - PT ESC rule and personal experience
    - https://github.com/swisskyrepo/PayloadsAllTheThings/blob/c95a0a1a2855dc0cd7f7327614545fe30482a636/Upload%20Insecure%20Files/README.md
falsepositives:
    - Legitimate administrator or developer creating legitimate executable files in
        a web application folder
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection_wwwroot_path:
        TargetFilename|contains: \inetpub\wwwroot\
    selection_wwwroot_ext:
        TargetFilename|contains:
            - .ashx
            - .asp
            - .ph
            - .soap
    selection_htdocs_path:
        TargetFilename|contains:
            - \www\
            - \htdocs\
            - \html\
    selection_htdocs_ext:
        TargetFilename|contains: .ph
    filter_main_temp:
        TargetFilename|contains:
            - \AppData\Local\Temp\
            - \Windows\Temp\
    filter_main_system:
        Image: System
    filter_main_legitimate:
        TargetFilename|contains: \xampp
    condition: (all of selection_wwwroot_* or all of selection_htdocs_*) and not 1
        of filter_main_*
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-13T20:21:34.613066+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:34.613066+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:34.613071+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:21:34.613073+00:00'
