id: f0e2b768-5220-47dd-b891-d57b96fc0ec1
title: CSExec Service File Creation
status: test
level: medium
description: Detects default CSExec service filename which indicates CSExec service
    installation and execution
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-08-04'
tags:
    - attack.execution
    - attack.t1569.002
    - attack.s0029
references:
    - https://github.com/malcomvetter/CSExec
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith: \csexecsvc.exe
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-13T20:21:36.260765+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:36.260765+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:36.260769+00:00'
