id: ff301988-c231-4bd0-834c-ac9d73b86586
title: PowerShell Console History Logs Deleted
status: test
level: medium
description: Detects the deletion of the PowerShell console History logs which may
    indicate an attempt to destroy forensic evidence
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-02-15'
tags:
    - attack.defense-evasion
    - attack.t1070
references:
    - Internal Research
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: file_delete
    product: windows
detection:
    selection:
        TargetFilename|endswith: \PSReadLine\ConsoleHost_history.txt
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_delete
            mapped_at: '2025-11-13T20:21:39.648106+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:39.648106+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:39.648113+00:00'
