id: 74babdd6-a758-4549-9632-26535279e654
title: Suspicious Executable File Creation
status: test
level: high
description: 'Detect creation of suspicious executable file names.

    Some strings look for suspicious file extensions, others look for filenames that
    exploit unquoted service paths.

    '
author: frack113
date: '2022-09-05'
modified: '2023-12-11'
tags:
    - attack.defense-evasion
    - attack.t1564
references:
    - https://medium.com/@SumitVerma101/windows-privilege-escalation-part-1-unquoted-service-path-c7a011a8d8ae
    - https://app.any.run/tasks/76c69e2d-01e8-49d9-9aea-fb7cc0c4d3ad/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith:
            - :\$Recycle.Bin.exe
            - :\Documents and Settings.exe
            - :\MSOCache.exe
            - :\PerfLogs.exe
            - :\Recovery.exe
            - .bat.exe
            - .sys.exe
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-13T20:21:34.642806+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:34.642806+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:34.642811+00:00'
