id: 270185ff-5f50-4d6d-a27f-24c3b8c9fef8
title: Tomcat WebServer Logs Deleted
status: test
level: medium
description: Detects the deletion of tomcat WebServer logs which may indicate an attempt
    to destroy forensic evidence
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-02-16'
tags:
    - attack.defense-evasion
    - attack.t1070
references:
    - Internal Research
    - https://linuxhint.com/view-tomcat-logs-windows/
falsepositives:
    - During uninstallation of the tomcat server
    - During log rotation
taxonomy: sigma
logsource:
    category: file_delete
    product: windows
detection:
    selection:
        TargetFilename|contains|all:
            - \Tomcat
            - \logs\
        TargetFilename|contains:
            - catalina.
            - _access_log.
            - localhost.
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 4
    logsource:
        category:
            source_field: category
            source_value: file_delete
            mapped_at: '2025-11-26T02:40:48.959702+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:40:48.959702+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-26T02:40:48.959722+00:00'
