id: 130c9e58-28ac-4f83-8574-0a4cc913b97e
title: Potential Winnti Dropper Activity
status: test
level: high
description: Detects files dropped by Winnti as described in RedMimicry Winnti playbook
author: Alexander Rausch
date: '2020-06-24'
modified: '2023-01-05'
tags:
    - attack.defense-evasion
    - attack.t1027
references:
    - https://redmimicry.com/posts/redmimicry-winnti/#dropper
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith:
            - \gthread-3.6.dll
            - \sigcmm-2.4.dll
            - \Windows\Temp\tmp.bat
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-13T20:21:36.233780+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:36.233780+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:36.233785+00:00'
