title: Potential Persistence Via Outlook Form
id: c3edc6a5-d9d4-48d8-930e-aab518390917
status: test
level: high
author: Tobias Michalski (Nextron Systems)
description: Detects the creation of a new Outlook form which can contain malicious
    code
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=76
    - https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=79
    - https://learn.microsoft.com/en-us/office/vba/outlook/concepts/outlook-forms/create-an-outlook-form
    - https://www.slipstick.com/developer/custom-form/clean-outlooks-forms-cache/
falsepositives:
    - Legitimate use of outlook forms
tags:
    - attack.persistence
    - attack.t1137.003
date: '2021-06-10'
modified: '2023-02-22'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        Image|endswith: \outlook.exe
        TargetFilename|contains:
            - \AppData\Local\Microsoft\FORMS\IPM
            - \Local Settings\Application Data\Microsoft\Forms
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:53:12.620115+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:53:12.620115+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:53:12.620127+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:53:12.620129+00:00'
