title: PSScriptPolicyTest Creation By Uncommon Process
id: 1027d292-dd87-4a1a-8701-2abe04d7783c
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects the creation of the "PSScriptPolicyTest" PowerShell script by
    an uncommon process. This file is usually generated by Microsoft Powershell to
    test against Applocker.
references:
    - https://www.paloaltonetworks.com/blog/security-operations/stopping-powershell-without-powershell/
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
date: '2023-06-01'
modified: '2023-12-11'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|contains: __PSScriptPolicyTest_
    filter_main_generic:
        Image|endswith:
            - :\Program Files\PowerShell\7-preview\pwsh.exe
            - :\Program Files\PowerShell\7\pwsh.exe
            - :\Windows\System32\dsac.exe
            - :\Windows\System32\sdiagnhost.exe
            - :\Windows\System32\ServerManager.exe
            - :\Windows\System32\WindowsPowerShell\v1.0\powershell_ise.exe
            - :\Windows\System32\WindowsPowerShell\v1.0\powershell.exe
            - :\Windows\System32\wsmprovhost.exe
            - :\Windows\SysWOW64\sdiagnhost.exe
            - :\Windows\SysWOW64\WindowsPowerShell\v1.0\powershell_ise.exe
            - :\Windows\SysWOW64\WindowsPowerShell\v1.0\powershell.exe
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:53:08.797747+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:53:08.797747+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:53:08.797762+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:53:08.797764+00:00'
