title: Office Macro File Download
id: 0e29e3a7-1ad8-40aa-b691-9f82ecd33d66
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects the creation of a new office macro files on the systems via an
    application (browser, mail client).
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1566.001/T1566.001.md
    - https://learn.microsoft.com/en-us/deployoffice/compat/office-file-format-reference
falsepositives:
    - Legitimate macro files downloaded from the internet
    - Legitimate macro files sent as attachments via emails
tags:
    - attack.initial-access
    - attack.t1566.001
date: '2022-01-23'
modified: '2023-04-18'
logsource:
    category: file_event
    product: windows
detection:
    selection_processes:
        Image|endswith:
            - \RuntimeBroker.exe
            - \outlook.exe
            - \thunderbird.exe
            - \brave.exe
            - \chrome.exe
            - \firefox.exe
            - \iexplore.exe
            - \maxthon.exe
            - \MicrosoftEdge.exe
            - \msedge.exe
            - \msedgewebview2.exe
            - \opera.exe
            - \safari.exe
            - \seamonkey.exe
            - \vivaldi.exe
            - \whale.exe
    selection_ext:
        TargetFilename|endswith:
            - .docm
            - .dotm
            - .xlsm
            - .xltm
            - .potm
            - .pptm
        TargetFilename|contains:
            - .docm:Zone
            - .dotm:Zone
            - .xlsm:Zone
            - .xltm:Zone
            - .potm:Zone
            - .pptm:Zone
    condition: all of selection_*
related:
    -   id: 91174a41-dc8f-401b-be89-7bfc140612a0
        type: similar
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:52:26.694328+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:52:26.694328+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:52:26.694343+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:52:26.694345+00:00'
