title: DLL Search Order Hijackig Via Additional Space in Path
id: b6f91281-20aa-446a-b986-38a92813a18f
status: test
level: high
author: frack113, Nasreddine Bencherchali (Nextron Systems)
description: 'Detects when an attacker create a similar folder structure to windows
    system folders such as (Windows, Program Files...)

    but with a space in order to trick DLL load search order and perform a "DLL Search
    Order Hijacking" attack

    '
references:
    - https://twitter.com/cyb3rops/status/1552932770464292864
    - https://www.wietzebeukema.nl/blog/hijacking-dlls-in-windows
falsepositives:
    - Unknown
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.defense-evasion
    - attack.t1574.002
date: '2022-07-30'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|startswith:
            - C:\Windows \
            - C:\Program Files \
            - C:\Program Files (x86) \
        TargetFilename|endswith: .dll
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 3
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:53:10.903313+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:53:10.903313+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:53:10.903326+00:00'
