title: HackTool - Mimikatz Kirbi File Creation
id: 9e099d99-44c2-42b6-a6d8-54c3545cab29
status: test
level: critical
author: Florian Roth (Nextron Systems), David ANDRE
description: Detects the creation of files created by mimikatz such as ".kirbi", "mimilsa.log",
    etc.
references:
    - https://cobalt.io/blog/kerberoast-attack-techniques
    - https://pentestlab.blog/2019/10/21/persistence-security-support-provider/
falsepositives:
    - Unlikely
tags:
    - attack.credential-access
    - attack.t1558
date: '2021-11-08'
modified: '2024-06-27'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith:
            - .kirbi
            - mimilsa.log
    condition: selection
related:
    -   id: 034affe8-6170-11ec-844f-0f78aa0c4d66
        type: obsolete
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:53:19.898192+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:53:19.898192+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:53:19.898213+00:00'
