title: HackTool - SafetyKatz Dump Indicator
id: e074832a-eada-4fd7-94a1-10642b130e16
status: test
level: high
author: Markus Neis
description: Detects default lsass dump filename generated by SafetyKatz.
references:
    - https://github.com/GhostPack/SafetyKatz
    - https://github.com/GhostPack/SafetyKatz/blob/715b311f76eb3a4c8d00a1bd29c6cd1899e450b7/SafetyKatz/Program.cs#L63
falsepositives:
    - Rare legitimate files with similar filename structure
tags:
    - attack.credential-access
    - attack.t1003.001
date: '2018-07-24'
modified: '2024-06-27'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith: \Temp\debug.bin
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 3
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:53:12.213734+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:53:12.213734+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:53:12.213767+00:00'
