title: Wmiprvse Wbemcomn DLL Hijack - File
id: 614a7e17-5643-4d89-b6fe-f9df1a79641c
status: test
level: critical
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
description: Detects a threat actor creating a file named `wbemcomn.dll` in the `C:\Windows\System32\wbem\`
    directory over the network and loading it for a WMI DLL Hijack scenario.
references:
    - https://threathunterplaybook.com/hunts/windows/201009-RemoteWMIWbemcomnDLLHijack/notebook.html
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1047
    - attack.lateral-movement
    - attack.t1021.002
date: '2020-10-12'
modified: '2022-12-02'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        Image: System
        TargetFilename|endswith: \wbem\wbemcomn.dll
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:52:59.227673+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:52:59.227673+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:52:59.227685+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:52:59.227687+00:00'
