title: HackTool - Potential Remote Credential Dumping Activity Via CrackMapExec Or
    Impacket-Secretsdump
id: 6e2a900a-ced9-4e4a-a9c2-13e706f9518a
status: test
level: high
author: SecurityAura
description: Detects default filenames output from the execution of CrackMapExec and
    Impacket-secretsdump against an endpoint.
references:
    - https://github.com/Porchetta-Industries/CrackMapExec
    - https://github.com/SecureAuthCorp/impacket/blob/master/examples/secretsdump.py
falsepositives:
    - Unknown
tags:
    - attack.credential-access
    - attack.t1003
date: '2022-11-16'
modified: '2024-06-27'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        Image|endswith: \svchost.exe
        TargetFilename|re: \\Windows\\System32\\[a-zA-Z0-9]{8}\.tmp$
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 3
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:53:02.580622+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:53:02.580622+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:53:02.580653+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:53:02.580655+00:00'
