id: 8468111a-ef07-4654-903b-b863a80bbc95
title: VHD Image Download Via Browser
status: test
level: medium
description: 'Detects creation of ".vhd"/".vhdx" files by browser processes.

    Malware can use mountable Virtual Hard Disk ".vhd" files to encapsulate payloads
    and evade security controls.

    '
author: frack113, Christopher Peacock '@securepeacock', SCYTHE '@scythe_io'
date: '2021-10-25'
modified: '2023-05-05'
tags:
    - attack.resource-development
    - attack.t1587.001
references:
    - https://redcanary.com/blog/intelligence-insights-october-2021/
    - https://www.kaspersky.com/blog/lazarus-vhd-ransomware/36559/
    - https://securelist.com/lazarus-on-the-hunt-for-big-game/97757/
falsepositives:
    - Legitimate downloads of ".vhd" files would also trigger this
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        Image|endswith:
            - \brave.exe
            - \chrome.exe
            - \firefox.exe
            - \iexplore.exe
            - \maxthon.exe
            - \MicrosoftEdge.exe
            - \msedge.exe
            - \msedgewebview2.exe
            - \opera.exe
            - \safari.exe
            - \seamonkey.exe
            - \vivaldi.exe
            - \whale.exe
        TargetFilename|contains: .vhd
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-13T20:21:37.184281+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:37.184281+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:21:37.184288+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:37.184291+00:00'
