title: Suspicious Desktopimgdownldr Target File
id: fc4f4817-0c53-4683-a4ee-b17a64bc1039
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects a suspicious Microsoft desktopimgdownldr file creation that stores
    a file to a suspicious location or contains a file with a suspicious extension
references:
    - https://labs.sentinelone.com/living-off-windows-land-a-new-native-file-downldr/
    - https://twitter.com/SBousseaden/status/1278977301745741825
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - False positives depend on scripts and administrative tools used in the monitored
        environment
tags:
    - attack.command-and-control
    - attack.t1105
date: '2020-07-03'
modified: '2022-06-02'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        Image|endswith: \svchost.exe
        TargetFilename|contains: \Personalization\LockScreenImage\
    filter1:
        TargetFilename|contains: C:\Windows\
    filter2:
        TargetFilename|contains:
            - .jpg
            - .jpeg
            - .png
    condition: selection and not filter1 and not filter2
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:52:01.702628+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:52:01.702628+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:52:01.702640+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:52:01.702642+00:00'
