id: 8fbf3271-1ef6-4e94-8210-03c2317947f6
title: Cred Dump Tools Dropped Files
status: test
level: high
description: Files with well-known filenames (parts of credential dump software or
    files produced by them) creation
author: Teymur Kheirkhabarov, oscd.community
date: '2019-11-01'
modified: '2022-09-21'
tags:
    - attack.credential-access
    - attack.t1003.001
    - attack.t1003.002
    - attack.t1003.003
    - attack.t1003.004
    - attack.t1003.005
references:
    - https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
falsepositives:
    - Legitimate Administrator using tool for password recovery
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|contains:
            - \fgdump-log
            - \kirbi
            - \pwdump
            - \pwhashes
            - \wce_ccache
            - \wce_krbtkts
        TargetFilename|endswith:
            - \cachedump.exe
            - \cachedump64.exe
            - \DumpExt.dll
            - \DumpSvc.exe
            - \Dumpy.exe
            - \fgexec.exe
            - \lsremora.dll
            - \lsremora64.dll
            - \NTDS.out
            - \procdump64.exe
            - \pstgdump.exe
            - \pwdump.exe
            - \SAM.out
            - \SECURITY.out
            - \servpw.exe
            - \servpw64.exe
            - \SYSTEM.out
            - \test.pwd
            - \wceaux.dll
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-26T02:39:26.573035+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:39:26.573035+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-26T02:39:26.573060+00:00'
