id: d51694fe-484a-46ac-92d6-969e76d60d10
title: Access To Potentially Sensitive Sysvol Files By Uncommon Applications
status: experimental
level: medium
description: Detects file access requests to potentially sensitive files hosted on
    the Windows Sysvol share.
author: frack113
date: '2023-12-21'
modified: '2024-07-29'
tags:
    - attack.credential-access
    - attack.t1552.006
references:
    - https://github.com/vletoux/pingcastle
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''8344c19f-a023-45ff-ad63-a01c5396aea0''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: file_access
    product: windows
    definition: 'Requirements: Microsoft-Windows-Kernel-File ETW provider'
detection:
    selection:
        FileName|startswith: \
        FileName|contains|all:
            - \sysvol\
            - \Policies\
        FileName|endswith:
            - audit.csv
            - Files.xml
            - GptTmpl.inf
            - groups.xml
            - Registry.pol
            - Registry.xml
            - scheduledtasks.xml
            - scripts.ini
            - services.xml
    filter_main_generic:
        Image|startswith:
            - C:\Program Files (x86)\
            - C:\Program Files\
            - C:\Windows\system32\
            - C:\Windows\SysWOW64\
    filter_main_explorer:
        Image: C:\Windows\explorer.exe
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: file_activity
    activity_id: 2
    logsource:
        category:
            source_field: category
            source_value: file_access
            mapped_at: '2025-11-26T02:40:59.224378+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:40:59.224378+00:00'
    detection_fields:
        -   source_field: FileName
            target_table: file_activity
            target_field: file.name
            mapped_at: '2025-11-26T02:40:59.224391+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-11-26T02:40:59.224393+00:00'
