id: 409f8a98-4496-4aaa-818a-c931c0a8b832
title: Created Files by Microsoft Sync Center
status: test
level: medium
description: This rule detects suspicious files created by Microsoft Sync Center (mobsync)
author: elhoim
date: '2022-04-28'
modified: '2022-06-02'
tags:
    - attack.t1055
    - attack.t1218
    - attack.execution
    - attack.defense-evasion
references:
    - https://redcanary.com/blog/intelligence-insights-november-2021/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection_mobsync:
        Image|endswith: \mobsync.exe
    filter_created_file:
        TargetFilename|endswith:
            - .dll
            - .exe
    condition: selection_mobsync and filter_created_file
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-13T20:21:34.566308+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:34.566308+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:21:34.566339+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:34.566343+00:00'
