title: Malicious DLL File Dropped in the Teams or OneDrive Folder
id: 1908fcc1-1b92-4272-8214-0fbaf2fa5163
status: test
level: high
author: frack113
description: 'Detects creation of a malicious DLL file in the location where the OneDrive
    or Team applications

    Upon execution of the Teams or OneDrive application, the dropped malicious DLL
    file ("iphlpapi.dll") is sideloaded

    '
references:
    - https://blog.cyble.com/2022/07/27/targeted-attacks-being-carried-out-via-dll-sideloading/
falsepositives:
    - Unknown
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.defense-evasion
    - attack.t1574.002
date: '2022-08-12'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|contains|all:
            - iphlpapi.dll
            - \AppData\Local\Microsoft
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:52:30.175564+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:52:30.175564+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:52:30.175596+00:00'
