title: Potential RipZip Attack on Startup Folder
id: a6976974-ea6f-4e97-818e-ea08625c52cb
status: test
level: high
author: Greg (rule)
description: 'Detects a phishing attack which expands a ZIP file containing a malicious
    shortcut.

    If the victim expands the ZIP file via the explorer process, then the explorer
    process expands the malicious ZIP file and drops a malicious shortcut redirected
    to a backdoor into the Startup folder.

    Additionally, the file name of the malicious shortcut in Startup folder contains
    {0AFACED1-E828-11D1-9187-B532F1E9575D} meaning the folder shortcut operation.

    '
references:
    - https://twitter.com/jonasLyk/status/1549338335243534336?t=CrmPocBGLbDyE4p6zTX1cg&s=19
falsepositives:
    - Unknown
tags:
    - attack.persistence
    - attack.t1547
date: '2022-07-21'
modified: '2023-01-05'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|contains|all:
            - \Microsoft\Windows\Start Menu\Programs\Startup
            - .lnk.{0AFACED1-E828-11D1-9187-B532F1E9575D}
        Image|endswith: \explorer.exe
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 3
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:52:03.992347+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:52:03.992347+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:52:03.992371+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:52:03.992374+00:00'
