title: CSExec Service File Creation
id: f0e2b768-5220-47dd-b891-d57b96fc0ec1
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects default CSExec service filename which indicates CSExec service
    installation and execution
references:
    - https://github.com/malcomvetter/CSExec
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1569.002
    - attack.s0029
date: '2023-08-04'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith: \csexecsvc.exe
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:52:52.702024+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:52:52.702024+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:52:52.702041+00:00'
