title: Potential File Extension Spoofing Using Right-to-Left Override
id: 979baf41-ca44-4540-9d0c-4fcef3b5a3a4
status: experimental
level: high
author: Jonathan Peters (Nextron Systems), Florian Roth (Nextron Systems)
description: 'Detects suspicious filenames that contain a right-to-left override character
    and a potentially spoofed file extensions.

    '
references:
    - https://redcanary.com/blog/right-to-left-override/
    - https://www.malwarebytes.com/blog/news/2014/01/the-rtlo-method
falsepositives:
    - Filenames that contains scriptures such as arabic or hebrew might make use of
        this character
tags:
    - attack.execution
    - attack.defense-evasion
    - attack.t1036.002
date: '2024-11-17'
logsource:
    category: file_event
    product: windows
detection:
    selection_rtlo_unicode:
        TargetFilename|contains: \u202e
    selection_extensions:
        TargetFilename|contains:
            - fpd..
            - nls..
            - vsc..
            - xcod.
            - xslx.
    condition: all of selection_*
related:
    -   id: ad691d92-15f2-4181-9aa4-723c74f9ddc3
        type: derived
ocsf_mapping:
    class_name: file_activity
    activity_id: 3
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:53:00.180543+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:53:00.180543+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:53:00.180562+00:00'
