id: 46612ae6-86be-4802-bc07-39b59feb1309
title: Access To Windows DPAPI Master Keys By Uncommon Applications
status: experimental
level: medium
description: 'Detects file access requests to the the Windows Data Protection API
    Master keys by an uncommon application.

    This can be a sign of credential stealing. Example case would be usage of mimikatz
    "dpapi::masterkey" function

    '
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-10-17'
modified: '2024-07-29'
tags:
    - attack.credential-access
    - attack.t1555.004
references:
    - http://blog.harmj0y.net/redteaming/operational-guidance-for-offensive-user-dpapi-abuse/
    - https://book.hacktricks.xyz/windows-hardening/windows-local-privilege-escalation/dpapi-extracting-passwords
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: file_access
    product: windows
    definition: 'Requirements: Microsoft-Windows-Kernel-File ETW provider'
detection:
    selection:
        FileName|contains:
            - \Microsoft\Protect\S-1-5-18\
            - \Microsoft\Protect\S-1-5-21-
    filter_system_folders:
        Image|startswith:
            - C:\Program Files\
            - C:\Program Files (x86)\
            - C:\Windows\system32\
            - C:\Windows\SysWOW64\
    condition: selection and not 1 of filter_*
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_access
            mapped_at: '2025-11-13T20:21:41.337249+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:41.337249+00:00'
    detection_fields:
        -   source_field: FileName
            target_table: file_activity
            target_field: file.name
            mapped_at: '2025-11-13T20:21:41.337262+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:21:41.337265+00:00'
