id: 3109530e-ab47-4cc6-a953-cac5ebcc93ae
title: ADS Zone.Identifier Deleted By Uncommon Application
status: experimental
level: medium
description: Detects the deletion of the "Zone.Identifier" ADS by an uncommon process.
    Attackers can leverage this in order to bypass security restrictions that make
    use of the ADS such as Microsoft Office apps.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-09-04'
modified: '2024-04-26'
tags:
    - attack.defense-evasion
    - attack.t1070.004
references:
    - https://securityliterate.com/how-malware-abuses-the-zone-identifier-to-circumvent-detection-and-analysis/
    - Internal Research
falsepositives:
    - Other third party applications not listed.
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''7eac0a16-5832-4e81-865f-0268a6d19e4b''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: file_delete
    product: windows
detection:
    selection:
        TargetFilename|endswith: :Zone.Identifier
    filter_main_generic:
        Image:
            - C:\Program Files\PowerShell\7-preview\pwsh.exe
            - C:\Program Files\PowerShell\7\pwsh.exe
            - C:\Windows\explorer.exe
            - C:\Windows\System32\WindowsPowerShell\v1.0\powershell.exe
            - C:\Windows\SysWOW64\explorer.exe
            - C:\Windows\SysWOW64\WindowsPowerShell\v1.0\powershell.exe
    filter_optional_browsers_chrome:
        Image:
            - C:\Program Files (x86)\Google\Chrome\Application\chrome.exe
            - C:\Program Files\Google\Chrome\Application\chrome.exe
    filter_optional_browsers_firefox:
        Image:
            - C:\Program Files (x86)\Mozilla Firefox\firefox.exe
            - C:\Program Files\Mozilla Firefox\firefox.exe
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_delete
            mapped_at: '2025-11-13T20:21:38.773393+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:38.773393+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:38.773402+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:21:38.773405+00:00'
