title: AWL Bypass with Winrm.vbs and Malicious WsmPty.xsl/WsmTxt.xsl - File
id: d353dac0-1b41-46c2-820c-d7d2561fc6ed
status: test
level: medium
author: Julia Fomina, oscd.community
description: Detects execution of attacker-controlled WsmPty.xsl or WsmTxt.xsl via
    winrm.vbs and copied cscript.exe (can be renamed)
references:
    - https://posts.specterops.io/application-whitelisting-bypass-and-arbitrary-unsigned-code-execution-technique-in-winrm-vbs-c8c24fb40404
falsepositives:
    - Unlikely
tags:
    - attack.defense-evasion
    - attack.t1216
date: '2020-10-06'
modified: '2022-11-28'
logsource:
    category: file_event
    product: windows
detection:
    system_files:
        TargetFilename|endswith:
            - WsmPty.xsl
            - WsmTxt.xsl
    in_system_folder:
        TargetFilename|startswith:
            - C:\Windows\System32\
            - C:\Windows\SysWOW64\
    condition: system_files and not in_system_folder
related:
    -   id: 074e0ded-6ced-4ebd-8b4d-53f55908119d
        type: derived
ocsf_mapping:
    class_name: file_activity
    activity_id: 3
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:52:55.065469+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:52:55.065469+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:52:55.065486+00:00'
