id: a55349d8-9588-4c5a-8e3b-1925fe2a4ffe
title: Exchange PowerShell Cmdlet History Deleted
status: test
level: high
description: Detects the deletion of the Exchange PowerShell cmdlet History logs which
    may indicate an attempt to destroy forensic evidence
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-10-26'
modified: '2022-12-30'
tags:
    - attack.defense-evasion
    - attack.t1070
references:
    - https://m365internals.com/2022/10/07/hunting-in-on-premises-exchange-server-logs/
falsepositives:
    - Possible FP during log rotation
taxonomy: sigma
logsource:
    category: file_delete
    product: windows
detection:
    selection:
        TargetFilename|startswith: \Logging\CmdletInfra\LocalPowerShell\Cmdlet\
        TargetFilename|contains: _Cmdlet_
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_delete
            mapped_at: '2025-11-13T20:21:38.790168+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:38.790168+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:38.790173+00:00'
