id: 8e1cb247-6cf6-42fa-b440-3f27d57e9936
title: Potential Persistence Via Microsoft Office Add-In
status: test
level: high
description: Detects potential persistence activity via startup add-ins that load
    when Microsoft Office starts (.wll/.xll are simply .dll fit for Word or Excel).
author: NVISO
date: '2020-05-11'
modified: '2023-02-08'
tags:
    - attack.persistence
    - attack.t1137.006
references:
    - Internal Research
    - https://labs.withsecure.com/publications/add-in-opportunities-for-office-persistence
    - https://github.com/redcanaryco/atomic-red-team/blob/4ae9580a1a8772db87a1b6cdb0d03e5af231e966/atomics/T1137.006/T1137.006.md
falsepositives:
    - Legitimate add-ins
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection_wlldropped:
        TargetFilename|contains: \Microsoft\Word\Startup\
        TargetFilename|endswith: .wll
    selection_xlldropped:
        TargetFilename|contains: \Microsoft\Excel\Startup\
        TargetFilename|endswith: .xll
    selection_xladropped:
        TargetFilename|contains: Microsoft\Excel\XLSTART\
        TargetFilename|endswith: .xlam
    selection_generic:
        TargetFilename|contains: \Microsoft\Addins\
        TargetFilename|endswith:
            - .xlam
            - .xla
            - .ppam
    condition: 1 of selection_*
ocsf_mapping:
    class_name: file_activity
    activity_id: 3
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-26T02:39:37.811586+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:39:37.811586+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-26T02:39:37.811603+00:00'
