id: a10a2c40-2c4d-49f8-b557-1a946bc55d9d
title: Uncommon File Created In Office Startup Folder
status: test
level: high
description: Detects the creation of a file with an uncommon extension in an Office
    application startup folder
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: '2022-06-05'
modified: '2023-12-13'
tags:
    - attack.resource-development
    - attack.t1587.001
references:
    - https://app.any.run/tasks/d6fe6624-6ef8-485d-aa75-3d1bdda2a08c/
    - http://addbalance.com/word/startup.htm
    - https://answers.microsoft.com/en-us/msoffice/forum/all/document-in-word-startup-folder-doesnt-open-when/44ab0932-2917-4150-8cdc-2f2cf39e86f3
    - https://en.wikipedia.org/wiki/List_of_Microsoft_Office_filename_extensions
falsepositives:
    - False positive might stem from rare extensions used by other Office utilities.
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection_word_paths:
        TargetFilename|contains: \Microsoft\Word\STARTUP
        TargetFilename|contains|all:
            - \Office
            - \Program Files
            - \STARTUP
    filter_exclude_word_ext:
        TargetFilename|endswith:
            - .docb
            - .docm
            - .docx
            - .dotm
            - .mdb
            - .mdw
            - .pdf
            - .wll
            - .wwl
    selection_excel_paths:
        TargetFilename|contains: \Microsoft\Excel\XLSTART
        TargetFilename|contains|all:
            - \Office
            - \Program Files
            - \XLSTART
    filter_exclude_excel_ext:
        TargetFilename|endswith:
            - .xll
            - .xls
            - .xlsm
            - .xlsx
            - .xlt
            - .xltm
            - .xlw
    filter_main_office_click_to_run:
        Image|contains: :\Program Files\Common Files\Microsoft Shared\ClickToRun\
        Image|endswith: \OfficeClickToRun.exe
    filter_main_office_apps:
        Image|contains:
            - :\Program Files\Microsoft Office\
            - :\Program Files (x86)\Microsoft Office\
        Image|endswith:
            - \winword.exe
            - \excel.exe
    condition: ((selection_word_paths and not filter_exclude_word_ext) or (selection_excel_paths
        and not filter_exclude_excel_ext)) and not 1 of filter_main_*
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-26T02:39:22.867142+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:39:22.867142+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-26T02:39:22.867154+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-11-26T02:39:22.867157+00:00'
