title: WScript or CScript Dropper - File
id: 002bdb95-0cf1-46a6-9e08-d38c128a6127
status: test
level: high
author: Tim Shelton
description: Detects a file ending in jse, vbe, js, vba, vbs written by cscript.exe
    or wscript.exe
references:
    - WScript or CScript Dropper (cea72823-df4d-4567-950c-0b579eaf0846)
fields:
    - Image
    - TargetFilename
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1059.005
    - attack.t1059.007
date: '2022-01-10'
modified: '2022-12-02'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        Image|endswith:
            - \wscript.exe
            - \cscript.exe
        TargetFilename|startswith:
            - C:\Users\
            - C:\ProgramData
        TargetFilename|endswith:
            - .jse
            - .vbe
            - .js
            - .vba
            - .vbs
    condition: selection
related:
    -   id: cea72823-df4d-4567-950c-0b579eaf0846
        type: derived
ocsf_mapping:
    class_name: file_activity
    activity_id: 3
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:52:55.788563+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:52:55.788563+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:52:55.788580+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:52:55.788582+00:00'
