id: bbb7e38c-0b41-4a11-b306-d2a457b7ac2b
title: Suspicious File Created In PerfLogs
status: test
level: medium
description: Detects suspicious file based on their extension being created in "C:\PerfLogs\".
    Note that this directory mostly contains ".etl" files
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-05-05'
tags:
    - attack.execution
    - attack.t1059
references:
    - Internal Research
    - https://labs.withsecure.com/publications/fin7-target-veeam-servers
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|startswith: C:\PerfLogs\
        TargetFilename|endswith:
            - .7z
            - .bat
            - .bin
            - .chm
            - .dll
            - .exe
            - .hta
            - .lnk
            - .ps1
            - .psm1
            - .py
            - .scr
            - .sys
            - .vbe
            - .vbs
            - .zip
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-13T20:21:36.304016+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:36.304016+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:36.304020+00:00'
