id: e15b518d-b4ce-4410-a9cd-501f23ce4a18
title: Suspicious Creation with Colorcpl
status: test
level: high
description: Once executed, colorcpl.exe will copy the arbitrary file to c:\windows\system32\spool\drivers\color\
author: frack113
date: '2022-01-21'
modified: '2023-01-05'
tags:
    - attack.defense-evasion
    - attack.t1564
references:
    - https://twitter.com/eral4m/status/1480468728324231172?s=20
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        Image|endswith: \colorcpl.exe
    filter_ext:
        TargetFilename|endswith:
            - .icm
            - .gmmp
            - .cdmp
            - .camp
    condition: selection and not 1 of filter_*
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-26T02:40:10.631242+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:40:10.631242+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-11-26T02:40:10.631260+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-26T02:40:10.631264+00:00'
