id: 4358e5a5-7542-4dcb-b9f3-87667371839b
title: ISO or Image Mount Indicator in Recent Files
status: test
level: medium
description: 'Detects the creation of recent element file that points to an .ISO,
    .IMG, .VHD or .VHDX file as often used in phishing attacks.

    This can be a false positive on server systems but on workstations users should
    rarely mount .iso or .img files.

    '
author: Florian Roth (Nextron Systems)
date: '2022-02-11'
tags:
    - attack.initial-access
    - attack.t1566.001
references:
    - https://www.microsoft.com/security/blog/2021/05/27/new-sophisticated-email-based-attack-from-nobelium/
    - https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/malicious-spam-campaign-uses-iso-image-files-to-deliver-lokibot-and-nanocore
    - https://blog.emsisoft.com/en/32373/beware-new-wave-of-malware-spreads-via-iso-file-email-attachments/
    - https://insights.sei.cmu.edu/blog/the-dangers-of-vhd-and-vhdx-files/
falsepositives:
    - Cases in which a user mounts an image file for legitimate reasons
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith:
            - .iso.lnk
            - .img.lnk
            - .vhd.lnk
            - .vhdx.lnk
        TargetFilename|contains: \Microsoft\Windows\Recent\
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 12
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-26T02:39:42.601006+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:39:42.601006+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-26T02:39:42.601031+00:00'
