title: Process Monitor Driver Creation By Non-Sysinternals Binary
id: a05baa88-e922-4001-bc4d-8738135f27de
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects creation of the Process Monitor driver by processes other than
    Process Monitor (procmon) itself.
references:
    - Internal Research
falsepositives:
    - Some false positives may occur with legitimate renamed process monitor binaries
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1068
date: '2023-05-05'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|contains: \procmon
        TargetFilename|endswith: .sys
    filter_main_process_explorer:
        Image|endswith:
            - \procmon.exe
            - \procmon64.exe
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:52:02.838393+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:52:02.838393+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:52:02.838408+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:52:02.838410+00:00'
