title: Tomcat WebServer Logs Deleted
id: 270185ff-5f50-4d6d-a27f-24c3b8c9fef8
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects the deletion of tomcat WebServer logs which may indicate an attempt
    to destroy forensic evidence
references:
    - Internal Research
    - https://linuxhint.com/view-tomcat-logs-windows/
falsepositives:
    - During uninstallation of the tomcat server
    - During log rotation
tags:
    - attack.defense-evasion
    - attack.t1070
date: '2023-02-16'
logsource:
    category: file_delete
    product: windows
detection:
    selection:
        TargetFilename|contains|all:
            - \Tomcat
            - \logs\
        TargetFilename|contains:
            - catalina.
            - _access_log.
            - localhost.
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 4
    logsource:
        category:
            source_field: category
            source_value: file_delete
            mapped_at: '2025-12-04T01:53:23.037113+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:53:23.037113+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:53:23.037127+00:00'
