title: Adwind RAT / JRAT File Artifact
id: 0bcfabcb-7929-47f4-93d6-b33fb67d34d1
status: test
level: high
author: Florian Roth (Nextron Systems), Tom Ueltschi, Jonhnathan Ribeiro, oscd.community
description: Detects javaw.exe in AppData folder as used by Adwind / JRAT
references:
    - https://www.hybrid-analysis.com/sample/ba86fa0d4b6af2db0656a88b1dd29f36fe362473ae8ad04255c4e52f214a541c?environmentId=100
    - https://www.first.org/resources/papers/conf2017/Advanced-Incident-Detection-and-Threat-Hunting-using-Sysmon-and-Splunk.pdf
tags:
    - attack.execution
    - attack.t1059.005
    - attack.t1059.007
date: '2017-11-10'
modified: '2022-12-02'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|contains|all:
            - \AppData\Roaming\Oracle\bin\java
            - .exe
            - \Retrive
            - .vbs
    condition: selection
related:
    -   id: 1fac1481-2dbc-48b2-9096-753c49b4ec71
        type: derived
ocsf_mapping:
    class_name: file_activity
    activity_id: 3
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:53:15.811616+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:53:15.811616+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:53:15.811644+00:00'
