title: Wmiexec Default Output File
id: 8d5aca11-22b3-4f22-b7ba-90e60533e1fb
status: test
level: critical
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects the creation of the default output filename used by the wmiexec
    tool
references:
    - https://www.crowdstrike.com/blog/how-to-detect-and-prevent-impackets-wmiexec/
    - https://github.com/fortra/impacket/blob/f4b848fa27654ca95bc0f4c73dbba8b9c2c9f30a/examples/wmiexec.py
falsepositives:
    - Unlikely
tags:
    - attack.lateral-movement
    - attack.t1047
date: '2022-06-02'
modified: '2023-03-08'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|re|all:
            - \\Windows\\__1\d{9}\.\d{1,7}$
            - C:\\__1\d{9}\.\d{1,7}$
        TargetFilename|re: D:\\__1\d{9}\.\d{1,7}$
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:52:57.929944+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:52:57.929944+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:52:57.929964+00:00'
