title: TeamViewer Remote Session
id: 162ab1e4-6874-4564-853c-53ec3ab8be01
status: test
level: medium
author: Florian Roth (Nextron Systems)
description: Detects the creation of log files during a TeamViewer remote session
references:
    - https://www.teamviewer.com/en-us/
falsepositives:
    - Legitimate uses of TeamViewer in an organisation
tags:
    - attack.command-and-control
    - attack.t1219
date: '2022-01-30'
logsource:
    category: file_event
    product: windows
detection:
    selection1:
        TargetFilename|endswith:
            - \TeamViewer\RemotePrinting\tvprint.db
            - \TeamViewer\TVNetwork.log
    selection2:
        TargetFilename|contains|all:
            - \TeamViewer
            - _Logfile.log
    condition: 1 of selection*
ocsf_mapping:
    class_name: file_activity
    activity_id: 3
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:52:37.149637+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:52:37.149637+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:52:37.149660+00:00'
