title: Suspicious PROCEXP152.sys File Created In TMP
id: 3da70954-0f2c-4103-adff-b7440368f50e
status: test
level: medium
author: xknow (@xknow_infosec), xorxes (@xor_xes)
description: 'Detects the creation of the PROCEXP152.sys file in the application-data
    local temporary folder.

    This driver is used by Sysinternals Process Explorer but also by KDU (https://github.com/hfiref0x/KDU)
    or Ghost-In-The-Logs (https://github.com/bats3c/Ghost-In-The-Logs), which uses
    KDU.

    '
references:
    - https://web.archive.org/web/20230331181619/https://blog.dylan.codes/evading-sysmon-and-windows-event-logging/
falsepositives:
    - Other legimate tools using this driver and filename (like Sysinternals). Note
        - Clever attackers may easily bypass this detection by just renaming the driver
        filename. Therefore just Medium-level and don't rely on it.
tags:
    - attack.t1562.001
    - attack.defense-evasion
date: '2019-04-08'
modified: '2022-11-22'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|contains: \AppData\Local\Temp\
        TargetFilename|endswith: PROCEXP152.sys
    filter:
        Image|contains:
            - \procexp64.exe
            - \procexp.exe
            - \procmon64.exe
            - \procmon.exe
    condition: selection and not filter
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:52:13.097841+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:52:13.097841+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:52:13.097861+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:52:13.097865+00:00'
