title: HackTool - NPPSpy Hacktool Usage
id: cad1fe90-2406-44dc-bd03-59d0b58fe722
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects the use of NPPSpy hacktool that stores cleartext passwords of
    users that logged in to a local file
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003/T1003.md#atomic-test-2---credential-dumping-with-nppspy
    - https://twitter.com/0gtweet/status/1465282548494487554
falsepositives:
    - Unknown
tags:
    - attack.credential-access
date: '2021-11-29'
modified: '2024-06-27'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith:
            - \NPPSpy.txt
            - \NPPSpy.dll
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 3
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:52:25.342561+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:52:25.342561+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:52:25.342577+00:00'
