id: 059c5af9-5131-4d8d-92b2-de4ad6146712
title: LiveKD Driver Creation By Uncommon Process
status: test
level: high
description: Detects the creation of the LiveKD driver by a process image other than
    "livekd.exe".
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-05-16'
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
references:
    - Internal Research
falsepositives:
    - Administrators might rename LiveKD before its usage which could trigger this.
        Add additional names you use to the filter
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''16fe46bb-4f64-46aa-817d-ff7bec4a2352''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename: C:\Windows\System32\drivers\LiveKdD.SYS
    filter_main_legit_name:
        Image|endswith:
            - \livekd.exe
            - \livek64.exe
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-26T02:40:04.251977+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:40:04.251977+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-26T02:40:04.251993+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-11-26T02:40:04.251995+00:00'
