id: f92a6f1e-a512-4a15-9735-da09e78d7273
title: GatherNetworkInfo.VBS Reconnaissance Script Output
status: test
level: medium
description: Detects creation of files which are the results of executing the built-in
    reconnaissance script "C:\Windows\System32\gatherNetworkInfo.vbs".
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-02-08'
tags:
    - attack.discovery
references:
    - https://posts.slayerlabs.com/living-off-the-land/#gathernetworkinfovbs
    - https://www.mandiant.com/resources/blog/trojanized-windows-installers-ukrainian-government
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''575dce0c-8139-4e30-9295-1ee75969f7fe''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''07aa184a-870d-413d-893a-157f317f6f58''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|startswith: C:\Windows\System32\config
        TargetFilename|endswith:
            - \Hotfixinfo.txt
            - \netiostate.txt
            - \sysportslog.txt
            - \VmSwitchLog.evtx
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 3
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-26T02:40:22.928743+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:40:22.928743+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-26T02:40:22.928755+00:00'
