id: ab90dab8-c7da-4010-9193-563528cfa347
title: Potentially Suspicious Self Extraction Directive File Created
status: test
level: medium
description: 'Detects the creation of a binary file with the ".sed" extension. The
    ".sed" extension stand for Self Extraction Directive files.

    These files are used by the "iexpress.exe" utility in order to create self extracting
    packages.

    Attackers were seen abusing this utility and creating PE files with embedded ".sed"
    entries.

    Usually ".sed" files are simple ini files and not PE binaries.

    '
author: Joseliyo Sanchez, @Joseliyo_Jstnk
date: '2024-02-05'
tags:
    - attack.defense-evasion
    - attack.t1218
references:
    - https://strontic.github.io/xcyclopedia/library/iexpress.exe-D594B2A33EFAFD0EABF09E3FDC05FCEA.html
    - https://en.wikipedia.org/wiki/IExpress
    - https://www.virustotal.com/gui/file/602f4ae507fa8de57ada079adff25a6c2a899bd25cd092d0af7e62cdb619c93c/behavior
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''760e75d8-c3b5-409b-a9bf-6130b4c4603f''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: file_executable_detected
    product: windows
detection:
    selection:
        TargetFilename|endswith: .sed
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_executable_detected
            mapped_at: '2025-11-26T02:39:06.291539+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:39:06.291539+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-26T02:39:06.291561+00:00'
