id: 97aa2e88-555c-450d-85a6-229bcd87efb8
title: Suspicious Screensaver Binary File Creation
status: test
level: medium
description: 'Adversaries may establish persistence by executing malicious content
    triggered by user inactivity.

    Screensavers are programs that execute after a configurable time of user inactivity
    and consist of Portable Executable (PE) files with a .scr file extension

    '
author: frack113
date: '2021-12-29'
modified: '2022-11-08'
tags:
    - attack.persistence
    - attack.t1546.002
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.002/T1546.002.md
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith: .scr
    filter_generic:
        Image|endswith:
            - \Kindle.exe
            - \Bin\ccSvcHst.exe
    filter_tiworker:
        Image|endswith: \TiWorker.exe
        TargetFilename|endswith: \uwfservicingscr.scr
    condition: selection and not 1 of filter_*
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-26T02:40:39.359886+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:40:39.359886+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-26T02:40:39.359898+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-11-26T02:40:39.359900+00:00'
