id: 7d604714-e071-49ff-8726-edeb95a70679
title: Legitimate Application Dropped Script
status: test
level: high
description: Detects programs on a Windows system that should not write scripts to
    disk
author: frack113, Florian Roth (Nextron Systems)
date: '2022-08-21'
modified: '2023-06-22'
tags:
    - attack.defense-evasion
    - attack.t1218
references:
    - https://github.com/Neo23x0/sysmon-config/blob/3f808d9c022c507aae21a9346afba4a59dd533b9/sysmonconfig-export-block.xml#L1326
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        Image|endswith:
            - \eqnedt32.exe
            - \wordpad.exe
            - \wordview.exe
            - \certutil.exe
            - \certoc.exe
            - \CertReq.exe
            - \Desktopimgdownldr.exe
            - \esentutl.exe
            - \mshta.exe
            - \AcroRd32.exe
            - \RdrCEF.exe
            - \hh.exe
            - \finger.exe
        TargetFilename|endswith:
            - .ps1
            - .bat
            - .vbs
            - .scf
            - .wsf
            - .wsh
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-13T20:21:34.668880+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:34.668880+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:21:34.668885+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:34.668886+00:00'
