title: Suspicious Files in Default GPO Folder
id: 5f87308a-0a5b-4623-ae15-d8fa1809bc60
status: test
level: medium
author: elhoim
description: Detects the creation of copy of suspicious files (EXE/DLL) to the default
    GPO storage folder
references:
    - https://redcanary.com/blog/intelligence-insights-november-2021/
falsepositives:
    - Unknown
tags:
    - attack.t1036.005
    - attack.defense-evasion
date: '2022-04-28'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|contains: \Policies\{31B2F340-016D-11D2-945F-00C04FB984F9}\
        TargetFilename|endswith:
            - .dll
            - .exe
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:52:40.249878+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:52:40.249878+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:52:40.249952+00:00'
