id: 7fff6773-2baa-46de-a24a-b6eec1aba2d1
title: UAC Bypass Using NTFS Reparse Point - File
status: test
level: high
description: Detects the pattern of UAC Bypass using NTFS reparse point and wusa.exe
    DLL hijacking (UACMe 36)
author: Christian Burkard (Nextron Systems)
date: '2021-08-30'
modified: '2022-10-09'
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
references:
    - https://github.com/hfiref0x/UACME
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|startswith: C:\Users\
        TargetFilename|endswith: \AppData\Local\Temp\api-ms-win-core-kernel32-legacy-l1.DLL
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 3
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-26T02:39:49.137965+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:39:49.137965+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-26T02:39:49.137981+00:00'
