id: 7047d730-036f-4f40-b9d8-1c63e36d5e62
title: Potential Binary Or Script Dropper Via PowerShell
status: test
level: medium
description: Detects PowerShell creating a binary executable or a script file.
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: '2023-03-17'
modified: '2023-05-09'
tags:
    - attack.persistence
references:
    - https://www.zscaler.com/blogs/security-research/onenote-growing-threat-malware-distribution
falsepositives:
    - False positives will differ depending on the environment and scripts used. Apply
        additional filters accordingly.
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
        TargetFilename|endswith:
            - .bat
            - .chm
            - .cmd
            - .com
            - .dll
            - .exe
            - .hta
            - .jar
            - .js
            - .ocx
            - .scr
            - .sys
            - .vbe
            - .vbs
            - .wsf
    filter_main_user_temp:
        TargetFilename|startswith: C:\Users\
        TargetFilename|contains: \AppData\Local\Temp\
        TargetFilename|endswith:
            - .dll
            - .exe
    filter_main_admin_temp:
        TargetFilename|startswith: C:\Windows\Temp\
        TargetFilename|endswith:
            - .dll
            - .exe
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-26T02:39:25.433550+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:39:25.433550+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-11-26T02:39:25.433568+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-26T02:39:25.433571+00:00'
