id: f01d1f70-cd41-42ec-9c0b-26dd9c22bf29
title: Process Deletion of Its Own Executable
status: experimental
level: medium
description: 'Detects the deletion of a process''s executable by itself. This is usually
    not possible without workarounds and may be used by malware to hide its traces.

    '
author: Max Altgelt (Nextron Systems)
date: '2024-09-03'
tags:
    - attack.defense-evasion
references:
    - https://github.com/joaoviictorti/RustRedOps/tree/ce04369a246006d399e8c61d9fe0e6b34f988a49/Self_Deletion
falsepositives:
    - Some false positives are to be expected from uninstallers.
taxonomy: sigma
logsource:
    category: file_delete
    product: windows
detection:
    selection:
        TargetFilename|fieldref: Image
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_delete
            mapped_at: '2025-11-13T20:21:38.782732+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:38.782732+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:38.782741+00:00'
