id: bdd8157d-8e85-4397-bb82-f06cc9c71dbb
title: UAC Bypass Using IEInstal - File
status: test
level: high
description: Detects the pattern of UAC Bypass using IEInstal.exe (UACMe 64)
author: Christian Burkard (Nextron Systems)
date: '2021-08-30'
modified: '2022-10-09'
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
references:
    - https://github.com/hfiref0x/UACME
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        Image: C:\Program Files\Internet Explorer\IEInstal.exe
        TargetFilename|startswith: C:\Users\
        TargetFilename|contains: \AppData\Local\Temp\
        TargetFilename|endswith: consent.exe
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-13T20:21:34.593302+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:34.593302+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:21:34.593311+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:34.593313+00:00'
