id: 23c43900-e732-45a4-8354-63e4a6c187ce
title: MacOS Emond Launch Daemon
status: test
level: medium
description: Detects additions to the Emond Launch Daemon that adversaries may use
    to gain persistence and elevate privileges.
author: Alejandro Ortuno, oscd.community
date: '2020-10-23'
modified: '2021-11-27'
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1546.014
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.014/T1546.014.md
    - https://posts.specterops.io/leveraging-emond-on-macos-for-persistence-a040a2785124
falsepositives:
    - Legitimate administration activities
taxonomy: sigma
logsource:
    category: file_event
    product: macos
detection:
    selection_1:
        TargetFilename|contains: /etc/emond.d/rules/
        TargetFilename|endswith: .plist
    selection_2:
        TargetFilename|contains: /private/var/db/emondClients/
    condition: 1 of selection_*
ocsf_mapping:
    class_name: file_activity
    activity_id: 3
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-26T02:13:01.384811+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-11-26T02:13:01.384811+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-26T02:13:02.019432+00:00'
