id: 02773bed-83bf-469f-b7ff-e676e7d78bab
title: BloodHound Collection Files
status: test
level: high
description: Detects default file names outputted by the BloodHound collection tool
    SharpHound
author: C.J. May
date: '2022-08-09'
modified: '2023-03-29'
tags:
    - attack.discovery
    - attack.t1087.001
    - attack.t1087.002
    - attack.t1482
    - attack.t1069.001
    - attack.t1069.002
    - attack.execution
    - attack.t1059.001
references:
    - https://academy.hackthebox.com/course/preview/active-directory-bloodhound/bloodhound--data-collection
falsepositives:
    - Some false positives may arise in some environment and this may require some
        tuning. Add additional filters or reduce level depending on the level of noise
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith:
            - BloodHound.zip
            - _computers.json
            - _containers.json
            - _domains.json
            - _gpos.json
            - _groups.json
            - _ous.json
            - _users.json
    filter_optional_ms_winapps:
        Image|endswith: \svchost.exe
        TargetFilename|startswith: C:\Program Files\WindowsApps\Microsoft.
        TargetFilename|endswith: \pocket_containers.json
    condition: selection and not 1 of filter_optional_*
ocsf_mapping:
    class_name: file_activity
    activity_id: 3
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-26T02:40:28.357348+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:40:28.357348+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-26T02:40:28.357368+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-11-26T02:40:28.357372+00:00'
