id: 91174a41-dc8f-401b-be89-7bfc140612a0
title: Office Macro File Creation
status: test
level: low
description: Detects the creation of a new office macro files on the systems
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-01-23'
tags:
    - attack.initial-access
    - attack.t1566.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1566.001/T1566.001.md
    - https://learn.microsoft.com/en-us/deployoffice/compat/office-file-format-reference
falsepositives:
    - Very common in environments that rely heavily on macro documents
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''0e29e3a7-1ad8-40aa-b691-9f82ecd33d66''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith:
            - .docm
            - .dotm
            - .xlsm
            - .xltm
            - .potm
            - .pptm
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-13T20:21:36.321974+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:36.321974+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:36.321981+00:00'
