id: 13c02350-4177-4e45-ac17-cf7ca628ff5e
title: Files With System DLL Name In Unsuspected Locations
status: test
level: medium
description: 'Detects the creation of a file with the ".dll" extension that has the
    name of a System DLL in uncommon or unsuspected locations. (Outisde of "System32",
    "SysWOW64", etc.).

    It is highly recommended to perform an initial baseline before using this rule
    in production.

    '
author: Nasreddine Bencherchali (Nextron Systems)
date: '2024-06-24'
tags:
    - attack.defense-evasion
    - attack.t1036.005
references:
    - Internal Research
falsepositives:
    - Third party software might bundle specific versions of system DLLs.
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith:
            - \secur32.dll
            - \tdh.dll
    filter_main_generic:
        TargetFilename|contains:
            - C:\$WINDOWS.~BT\
            - C:\$WinREAgent\
            - C:\Windows\SoftwareDistribution\
            - C:\Windows\System32\
            - C:\Windows\SysWOW64\
            - C:\Windows\WinSxS\
            - C:\Windows\uus\
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-13T20:21:34.598423+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:34.598423+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:34.598429+00:00'
