title: Created Files by Microsoft Sync Center
id: 409f8a98-4496-4aaa-818a-c931c0a8b832
status: test
level: medium
author: elhoim
description: This rule detects suspicious files created by Microsoft Sync Center (mobsync)
references:
    - https://redcanary.com/blog/intelligence-insights-november-2021/
falsepositives:
    - Unknown
tags:
    - attack.t1055
    - attack.t1218
    - attack.execution
    - attack.defense-evasion
date: '2022-04-28'
modified: '2022-06-02'
logsource:
    category: file_event
    product: windows
detection:
    selection_mobsync:
        Image|endswith: \mobsync.exe
    filter_created_file:
        TargetFilename|endswith:
            - .dll
            - .exe
    condition: selection_mobsync and filter_created_file
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:51:57.809438+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:51:57.809438+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:51:57.809450+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:51:57.809452+00:00'
