id: c048f047-7e2a-4888-b302-55f509d4a91d
title: SCR File Write Event
status: test
level: medium
description: Detects the creation of screensaver files (.scr) outside of system folders.
    Attackers may execute an application as an ".SCR" file using "rundll32.exe desk.cpl,InstallScreenSaver"
    for example.
author: Christopher Peacock @securepeacock, SCYTHE @scythe_io
date: '2022-04-27'
modified: '2023-08-23'
tags:
    - attack.defense-evasion
    - attack.t1218.011
references:
    - https://lolbas-project.github.io/lolbas/Libraries/Desk/
falsepositives:
    - The installation of new screen savers by third party software
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith: .scr
    filter:
        TargetFilename|contains:
            - :\$WINDOWS.~BT\NewOS\
            - :\Windows\System32\
            - :\Windows\SysWOW64\
            - :\Windows\WinSxS\
            - :\WUDownloadCache\
    condition: selection and not filter
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-13T20:21:37.178057+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:37.178057+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:37.178065+00:00'
