title: RemCom Service File Creation
id: 7eff1a7f-dd45-4c20-877a-f21e342a7611
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects default RemCom service filename which indicates RemCom service
    installation and execution
references:
    - https://github.com/kavika13/RemCom/
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1569.002
    - attack.s0029
date: '2023-08-04'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith: \RemComSvc.exe
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:53:01.179642+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:53:01.179642+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:53:01.179656+00:00'
