title: Suspicious Get-Variable.exe Creation
id: 0c3fac91-5627-46e8-a6a8-a0d7b9b8ae1b
status: test
level: high
author: frack113
description: 'Get-Variable is a valid PowerShell cmdlet

    WindowsApps is by default in the path where PowerShell is executed.

    So when the Get-Variable command is issued on PowerShell execution, the system
    first looks for the Get-Variable executable in the path and executes the malicious
    binary instead of looking for the PowerShell cmdlet.

    '
references:
    - https://blog.malwarebytes.com/threat-intelligence/2022/04/colibri-loader-combines-task-scheduler-and-powershell-in-clever-persistence-technique/
    - https://www.joesandbox.com/analysis/465533/0/html
falsepositives:
    - Unknown
tags:
    - attack.persistence
    - attack.t1546
    - attack.defense-evasion
    - attack.t1027
date: '2022-04-23'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith: Local\Microsoft\WindowsApps\Get-Variable.exe
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:52:57.439072+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:52:57.439072+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:52:57.439123+00:00'
