id: fed85bf9-e075-4280-9159-fbe8a023d6fa
title: Advanced IP Scanner - File Event
status: test
level: medium
description: Detects the use of Advanced IP Scanner. Seems to be a popular tool for
    ransomware groups.
author: '@ROxPinTeddy'
date: '2020-05-12'
modified: '2022-11-29'
tags:
    - attack.discovery
    - attack.t1046
references:
    - https://news.sophos.com/en-us/2019/12/09/snatch-ransomware-reboots-pcs-into-safe-mode-to-bypass-protection/
    - https://www.fireeye.com/blog/threat-research/2020/05/tactics-techniques-procedures-associated-with-maze-ransomware-incidents.html
    - https://labs.f-secure.com/blog/prelude-to-ransomware-systembc
    - https://assets.documentcloud.org/documents/20444693/fbi-pin-egregor-ransomware-bc-01062021.pdf
    - https://thedfirreport.com/2021/01/18/all-that-for-a-coinminer
falsepositives:
    - Legitimate administrative use
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''bef37fa2-f205-4a7b-b484-0759bfd5f86f''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|contains: \AppData\Local\Temp\Advanced IP Scanner 2
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-13T20:21:36.243802+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:36.243802+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:36.243806+00:00'
