id: c7a74c80-ba5a-486e-9974-ab9e682bc5e4
title: File With Uncommon Extension Created By An Office Application
status: test
level: high
description: Detects the creation of files with an executable or script extension
    by an Office application.
author: Vadim Khrykov (ThreatIntel), Cyb3rEng (Rule), Nasreddine Bencherchali (Nextron
    Systems)
date: '2021-08-23'
modified: '2023-06-22'
tags:
    - attack.t1204.002
    - attack.execution
references:
    - https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
    - https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/02bcbfc2bfb8b4da601bb30de0344ae453aa1afe/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: file_event
    product: windows
detection:
    selection1:
        Image|endswith:
            - \excel.exe
            - \msaccess.exe
            - \mspub.exe
            - \powerpnt.exe
            - \visio.exe
            - \winword.exe
    selection2:
        TargetFilename|endswith:
            - .bat
            - .cmd
            - .com
            - .dll
            - .exe
            - .hta
            - .ocx
            - .proj
            - .ps1
            - .scf
            - .scr
            - .sys
            - .vbe
            - .vbs
            - .wsf
            - .wsh
    filter_optional_webservicecache:
        TargetFilename|contains|all:
            - C:\Users\
            - \AppData\Local\Microsoft\Office\
            - \WebServiceCache\AllUsers
        TargetFilename|endswith: .com
    filter_optional_webex:
        Image|endswith: \winword.exe
        TargetFilename|contains: \AppData\Local\Temp\webexdelta\
        TargetFilename|endswith:
            - .dll
            - .exe
    filter_main_localassembly:
        TargetFilename|contains: \AppData\Local\assembly\tmp\
        TargetFilename|endswith: .dll
    condition: all of selection* and not 1 of filter_main_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-11-13T20:21:34.628925+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:34.628925+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:21:34.628937+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:21:34.628938+00:00'
