title: NTDS.DIT Created
id: 0b8baa3f-575c-46ee-8715-d6f28cc7d33c
status: test
level: low
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects creation of a file named "ntds.dit" (Active Directory Database)
references:
    - Internal Research
falsepositives:
    - Unknown
tags:
    - attack.credential-access
    - attack.t1003.003
date: '2023-05-05'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith: ntds.dit
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:52:51.178272+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:52:51.178272+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:52:51.178287+00:00'
