title: PSEXEC Remote Execution File Artefact
id: 304afd73-55a5-4bb9-8c21-0b1fc84ea9e4
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects creation of the PSEXEC key file. Which is created anytime a PsExec
    command is executed. It gets written to the file system and will be recorded in
    the USN Journal on the target system
references:
    - https://aboutdfir.com/the-key-to-identify-psexec/
    - https://twitter.com/davisrichardg/status/1616518800584704028
falsepositives:
    - Unlikely
tags:
    - attack.lateral-movement
    - attack.privilege-escalation
    - attack.execution
    - attack.persistence
    - attack.t1136.002
    - attack.t1543.003
    - attack.t1570
    - attack.s0029
date: '2023-01-21'
modified: '2023-02-23'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|startswith: C:\Windows\PSEXEC-
        TargetFilename|endswith: .key
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 3
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:52:06.148453+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:52:06.148453+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:52:06.148469+00:00'
