title: Hijack Legit RDP Session to Move Laterally
id: 52753ea4-b3a0-4365-910d-36cff487b789
status: test
level: high
author: Samir Bousseaden
description: Detects the usage of tsclient share to place a backdoor on the RDP source
    machine's startup folder
references:
    - Internal Research
falsepositives:
    - Unlikely
tags:
    - attack.command-and-control
    - attack.t1219
date: '2019-02-21'
modified: '2021-11-27'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        Image|endswith: \mstsc.exe
        TargetFilename|contains: \Microsoft\Windows\Start Menu\Programs\Startup\
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 3
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:52:54.282951+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:52:54.282951+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:52:54.282971+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:52:54.282974+00:00'
