title: LiveKD Kernel Memory Dump File Created
id: 814ddeca-3d31-4265-8e07-8cc54fb44903
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects the creation of a file that has the same name as the default
    LiveKD kernel memory dump.
references:
    - Internal Research
falsepositives:
    - In rare occasions administrators might leverage LiveKD to perform live kernel
        debugging. This should not be allowed on production systems. Investigate and
        apply additional filters where necessary.
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
date: '2023-05-16'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename: C:\Windows\livekd.dmp
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:52:06.682592+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:52:06.682592+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:52:06.682606+00:00'
