title: Potential PrintNightmare Exploitation Attempt
id: 5b2bbc47-dead-4ef7-8908-0cf73fcbecbf
status: test
level: high
author: Bhabesh Raj
description: Detect DLL deletions from Spooler Service driver folder. This might be
    a potential exploitation attempt of CVE-2021-1675
references:
    - https://web.archive.org/web/20210629055600/https://github.com/hhlxf/PrintNightmare/
    - https://github.com/cube0x0/CVE-2021-1675
falsepositives:
    - Unknown
tags:
    - attack.persistence
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1574
    - cve.2021-1675
date: '2021-07-01'
modified: '2023-02-17'
logsource:
    category: file_delete
    product: windows
detection:
    selection:
        Image|endswith: \spoolsv.exe
        TargetFilename|contains: C:\Windows\System32\spool\drivers\x64\3\
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 4
    logsource:
        category:
            source_field: category
            source_value: file_delete
            mapped_at: '2025-12-04T01:53:27.825903+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:53:27.825903+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:53:27.825917+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:53:27.825918+00:00'
