title: .RDP File Created by Outlook Process
id: f748c45a-f8d3-4e6f-b617-fe176f695b8f
status: experimental
level: high
author: Florian Roth
description: 'Detects the creation of files with the ".rdp" extensions in the temporary
    directory that Outlook uses when opening attachments.

    This can be used to detect spear-phishing campaigns that use RDP files as attachments.

    '
references:
    - https://thecyberexpress.com/rogue-rdp-files-used-in-ukraine-cyberattacks/
    - https://www.microsoft.com/en-us/security/blog/2024/10/29/midnight-blizzard-conducts-large-scale-spear-phishing-campaign-using-rdp-files/
    - https://www.linkedin.com/feed/update/urn:li:ugcPost:7257437202706493443?commentUrn=urn%3Ali%3Acomment%3A%28ugcPost%3A7257437202706493443%2C7257522819985543168%29&dashCommentUrn=urn%3Ali%3Afsd_comment%3A%287257522819985543168%2Curn%3Ali%3AugcPost%3A7257437202706493443%29
falsepositives:
    - Whenever someone receives an RDP file as an email attachment and decides to
        save or open it right from the attachments
tags:
    - attack.defense-evasion
date: '2024-11-01'
modified: '2024-11-03'
logsource:
    category: file_event
    product: windows
detection:
    selection_extension:
        TargetFilename|endswith: .rdp
    selection_location:
        TargetFilename|contains:
            - \AppData\Local\Packages\Microsoft.Outlook_
            - \AppData\Local\Microsoft\Olk\Attachments\
        TargetFilename|contains|all:
            - \AppData\Local\Microsoft\Windows\
            - \Content.Outlook\
    condition: all of selection_*
related:
    -   id: fccfb43e-09a7-4bd2-8b37-a5a7df33386d
        type: derived
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:53:13.573248+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:53:13.573248+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:53:13.573260+00:00'
