title: Unusual File Modification by dns.exe
id: 9f383dc0-fdeb-4d56-acbc-9f9f4f8f20f3
status: test
level: high
author: Tim Rauch (Nextron Systems), Elastic (idea)
description: Detects an unexpected file being modified by dns.exe which my indicate
    activity related to remote code execution or other forms of exploitation as seen
    in CVE-2020-1350 (SigRed)
references:
    - https://www.elastic.co/guide/en/security/current/unusual-file-modification-by-dns-exe.html
falsepositives:
    - Unknown
tags:
    - attack.initial-access
    - attack.t1133
date: '2022-09-27'
logsource:
    category: file_change
    product: windows
detection:
    selection:
        Image|endswith: \dns.exe
    filter:
        TargetFilename|endswith: \dns.log
    condition: selection and not filter
related:
    -   id: 8f0b1fb1-9bd4-4e74-8cdf-a8de4d2adfd0
        type: similar
ocsf_mapping:
    class_name: file_activity
    activity_id: 3
    logsource:
        category:
            source_field: category
            source_value: file_change
            mapped_at: '2025-12-04T01:53:33.574882+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:53:33.574882+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:53:33.574915+00:00'
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:53:33.574918+00:00'
