title: Potential Persistence Attempt Via ErrorHandler.Cmd
id: 15904280-565c-4b73-9303-3291f964e7f9
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: 'Detects creation of a file named "ErrorHandler.cmd" in the "C:\WINDOWS\Setup\Scripts\"
    directory which could be used as a method of persistence

    The content of C:\WINDOWS\Setup\Scripts\ErrorHandler.cmd is read whenever some
    tools under C:\WINDOWS\System32\oobe\ (e.g. Setup.exe) fail to run for any reason.

    '
references:
    - https://www.hexacorn.com/blog/2022/01/16/beyond-good-ol-run-key-part-135/
    - https://github.com/last-byte/PersistenceSniper
falsepositives:
    - Unknown
tags:
    - attack.persistence
date: '2022-08-09'
modified: '2022-12-19'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith: \WINDOWS\Setup\Scripts\ErrorHandler.cmd
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:52:01.250638+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:52:01.250638+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:52:01.250665+00:00'
