title: File Deleted Via Sysinternals SDelete
id: 6ddab845-b1b8-49c2-bbf7-1a11967f64bc
status: test
level: medium
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
description: Detects the deletion of files by the Sysinternals SDelete utility. It
    looks for the common name pattern used to rename files.
references:
    - https://github.com/OTRF/detection-hackathon-apt29/issues/9
    - https://github.com/OTRF/ThreatHunter-Playbook/blob/2d4257f630f4c9770f78d0c1df059f891ffc3fec/docs/evals/apt29/detections/4.B.4_83D62033-105A-4A02-8B75-DAB52D8D51EC.md
falsepositives:
    - Legitime usage of SDelete
tags:
    - attack.defense-evasion
    - attack.t1070.004
date: '2020-05-02'
modified: '2023-02-15'
logsource:
    category: file_delete
    product: windows
detection:
    selection:
        TargetFilename|endswith:
            - .AAA
            - .ZZZ
    filter_wireshark:
        TargetFilename|endswith: \Wireshark\radius\dictionary.alcatel-lucent.aaa
    condition: selection and not 1 of filter_*
ocsf_mapping:
    class_name: file_activity
    activity_id: 4
    logsource:
        category:
            source_field: category
            source_value: file_delete
            mapped_at: '2025-12-04T01:53:25.822398+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:53:25.822398+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:53:25.822440+00:00'
