title: Linux Doas Conf File Creation
id: 00eee2a5-fdb0-4746-a21d-e43fbdea5681
status: stable
level: medium
author: Sittikorn S, Teoderick Contreras
description: Detects the creation of doas.conf file in linux host platform.
references:
    - https://research.splunk.com/endpoint/linux_doas_conf_file_creation/
    - https://www.makeuseof.com/how-to-install-and-use-doas/
falsepositives:
    - Unlikely
tags:
    - attack.privilege-escalation
    - attack.t1548
date: '2022-01-20'
modified: '2022-12-31'
logsource:
    category: file_event
    product: linux
detection:
    selection:
        TargetFilename|endswith: /etc/doas.conf
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:35:22.123596+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:35:22.123596+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:35:22.123611+00:00'
