title: UAC Bypass Using Consent and Comctl32 - File
id: 62ed5b55-f991-406a-85d9-e8e8fdf18789
status: test
level: high
author: Christian Burkard (Nextron Systems)
description: Detects the pattern of UAC Bypass using consent.exe and comctl32.dll
    (UACMe 22)
references:
    - https://github.com/hfiref0x/UACME
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
date: '2021-08-23'
modified: '2022-10-09'
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|startswith: C:\Windows\System32\consent.exe.@
        TargetFilename|endswith: \comctl32.dll
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 3
    logsource:
        category:
            source_field: category
            source_value: file_event
            mapped_at: '2025-12-04T01:52:37.541150+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:52:37.541150+00:00'
    detection_fields:
        -   source_field: TargetFilename
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:52:37.541207+00:00'
