id: 28268a8f-191f-4c17-85b2-f5aa4fa829c3
title: Google Cloud DNS Zone Modified or Deleted
status: test
level: medium
description: Identifies when a DNS Zone is modified or deleted in Google Cloud.
author: Austin Songer @austinsonger
date: '2021-08-15'
modified: '2022-10-09'
tags:
    - attack.impact
references:
    - https://cloud.google.com/dns/docs/reference/v1/managedZones
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: gcp
    service: gcp.audit
detection:
    selection:
        gcp.audit.method_name:
            - Dns.ManagedZones.Delete
            - Dns.ManagedZones.Update
            - Dns.ManagedZones.Patch
    condition: selection
ocsf_mapping:
    class_name: dns_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: gcp
            mapped_at: '2025-11-26T02:21:21.182699+00:00'
        service:
            source_field: service
            source_value: gcp.audit
            mapped_at: '2025-11-26T02:21:21.182699+00:00'
    detection_fields:
        -   source_field: gcp.audit.method_name
            target_table: dns_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:21:21.997705+00:00'
