id: 2f0bae2d-bf20-4465-be86-1311addebaa3
title: Google Cloud Kubernetes Secrets Modified or Deleted
status: test
level: medium
description: Identifies when the Secrets are Modified or Deleted.
author: Austin Songer @austinsonger
date: '2021-08-09'
modified: '2022-10-09'
tags:
    - attack.credential-access
references:
    - https://cloud.google.com/kubernetes-engine/docs/how-to/audit-logging
falsepositives:
    - Secrets being modified or deleted may be performed by a system administrator.
        Verify whether the user identity, user agent, and/or hostname should be making
        changes in your environment.
    - Secrets modified or deleted from unfamiliar users should be investigated. If
        known behavior is causing false positives, it can be exempted from the rule.
taxonomy: sigma
logsource:
    product: gcp
    service: gcp.audit
detection:
    selection:
        gcp.audit.method_name:
            - io.k8s.core.v*.secrets.create
            - io.k8s.core.v*.secrets.update
            - io.k8s.core.v*.secrets.patch
            - io.k8s.core.v*.secrets.delete
    condition: selection
ocsf_mapping:
    class_name: dns_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: gcp
            mapped_at: '2025-11-26T02:21:24.131460+00:00'
        service:
            source_field: service
            source_value: gcp.audit
            mapped_at: '2025-11-26T02:21:24.131460+00:00'
    detection_fields:
        -   source_field: gcp.audit.method_name
            target_table: dns_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:21:24.131494+00:00'
