id: bf638ef7-4d2d-44bb-a1dc-a238252e6267
title: Google Workspace Role Privilege Deleted
status: test
level: medium
description: Detects when an a role privilege is deleted in Google Workspace.
author: Austin Songer
date: '2021-08-24'
modified: '2023-10-11'
tags:
    - attack.impact
references:
    - https://cloud.google.com/logging/docs/audit/gsuite-audit-logging#3
    - https://developers.google.com/admin-sdk/reports/v1/appendix/activity/admin-delegated-admin-settings
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: gcp
    service: google_workspace.admin
detection:
    selection:
        eventService: admin.googleapis.com
        eventName: REMOVE_PRIVILEGE
    condition: selection
ocsf_mapping:
    class_name: entity_management
    activity_id: 4
    logsource:
        product:
            source_field: product
            source_value: gcp
            mapped_at: '2025-11-26T02:21:45.730238+00:00'
        service:
            source_field: service
            source_value: google_workspace.admin
            mapped_at: '2025-11-26T02:21:45.730238+00:00'
    detection_fields:
        -   source_field: eventService
            target_table: entity_management
            target_field: metadata.product.name
            mapped_at: '2025-11-26T02:21:45.730271+00:00'
        -   source_field: eventName
            target_table: entity_management
            target_field: api.operation
            mapped_at: '2025-11-26T02:21:45.730276+00:00'
