id: 4d9f2ee2-c903-48ab-b9c1-8c0f474913d0
title: Google Cloud Storage Buckets Modified or Deleted
status: test
level: medium
description: Detects when storage bucket is modified or deleted in Google Cloud.
author: Austin Songer @austinsonger
date: '2021-08-14'
modified: '2022-10-09'
tags:
    - attack.impact
references:
    - https://cloud.google.com/storage/docs/json_api/v1/buckets
falsepositives:
    - Storage Buckets being modified or deleted may be performed by a system administrator.
        Verify whether the user identity, user agent, and/or hostname should be making
        changes in your environment.
    - Storage Buckets modified or deleted from unfamiliar users should be investigated.
        If known behavior is causing false positives, it can be exempted from the
        rule.
taxonomy: sigma
logsource:
    product: gcp
    service: gcp.audit
detection:
    selection:
        gcp.audit.method_name:
            - storage.buckets.delete
            - storage.buckets.insert
            - storage.buckets.update
            - storage.buckets.patch
    condition: selection
ocsf_mapping:
    class_name: dns_activity
    logsource:
        product:
            source_field: product
            source_value: gcp
            mapped_at: '2025-11-13T20:17:41.066694+00:00'
        service:
            source_field: service
            source_value: gcp.audit
            mapped_at: '2025-11-13T20:17:41.066694+00:00'
    detection_fields:
        -   source_field: gcp.audit.method_name
            target_table: dns_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:17:41.066707+00:00'
