id: 99980a85-3a61-43d3-ac0f-b68d6b4797b1
title: Google Cloud VPN Tunnel Modified or Deleted
status: test
level: medium
description: Identifies when a VPN Tunnel Modified or Deleted in Google Cloud.
author: Austin Songer @austinsonger
date: '2021-08-16'
modified: '2022-10-09'
tags:
    - attack.impact
references:
    - https://any-api.com/googleapis_com/compute/docs/vpnTunnels
falsepositives:
    - VPN Tunnel being modified or deleted may be performed by a system administrator.
    - Verify whether the user identity, user agent, and/or hostname should be making
        changes in your environment.
    - VPN Tunnel modified or deleted from unfamiliar users should be investigated.
        If known behavior is causing false positives, it can be exempted from the
        rule.
taxonomy: sigma
logsource:
    product: gcp
    service: gcp.audit
detection:
    selection:
        gcp.audit.method_name:
            - compute.vpnTunnels.insert
            - compute.vpnTunnels.delete
    condition: selection
ocsf_mapping:
    class_name: dns_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: gcp
            mapped_at: '2025-11-26T02:21:25.668909+00:00'
        service:
            source_field: service
            source_value: gcp.audit
            mapped_at: '2025-11-26T02:21:25.668909+00:00'
    detection_fields:
        -   source_field: gcp.audit.method_name
            target_table: dns_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:21:25.668947+00:00'
