id: 76737c19-66ee-4c07-b65a-a03301d1573d
title: GCP Break-glass Container Workload Deployed
status: test
level: medium
description: 'Detects the deployment of workloads that are deployed by using the break-glass
    flag to override Binary Authorization controls.

    '
author: Bryan Lim
date: '2024-01-12'
tags:
    - attack.defense-evasion
    - attack.t1548
references:
    - https://cloud.google.com/binary-authorization
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: gcp
    service: gcp.audit
detection:
    selection:
        data.protoPayload.resource.type: k8s_cluster
        data.protoPayload.logName:
            - cloudaudit.googleapis.com/activity
            - cloudaudit.googleapis.com%2Factivity
        data.protoPayload.methodName: io.k8s.core.v1.pods.create
    keywords: image-policy.k8s.io/break-glass
    condition: selection and keywords
ocsf_mapping:
    class_name: api_activity
    logsource:
        product:
            source_field: product
            source_value: gcp
            mapped_at: '2025-11-13T20:17:39.321999+00:00'
        service:
            source_field: service
            source_value: gcp.audit
            mapped_at: '2025-11-13T20:17:39.321999+00:00'
    detection_fields:
        -   source_field: data.protoPayload.resource.type
            target_table: api_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:17:41.063065+00:00'
        -   source_field: data.protoPayload.logName
            target_table: api_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:17:41.063085+00:00'
        -   source_field: data.protoPayload.methodName
            target_table: api_activity
            target_field: api.operation
            mapped_at: '2025-11-13T20:17:41.063090+00:00'
