id: 6b67c12e-5e40-47c6-b3b0-1e6b571184cc
title: Google Cloud Service Account Modified
status: test
level: medium
description: Identifies when a service account is modified in Google Cloud.
author: Austin Songer @austinsonger
date: '2021-08-14'
modified: '2022-10-09'
tags:
    - attack.impact
references:
    - https://cloud.google.com/iam/docs/reference/rest/v1/projects.serviceAccounts
falsepositives:
    - Service Account being modified may be performed by a system administrator. Verify
        whether the user identity, user agent, and/or hostname should be making changes
        in your environment.
    - Service Account modified from unfamiliar users should be investigated. If known
        behavior is causing false positives, it can be exempted from the rule.
taxonomy: sigma
logsource:
    product: gcp
    service: gcp.audit
detection:
    selection:
        gcp.audit.method_name|endswith:
            - .serviceAccounts.patch
            - .serviceAccounts.create
            - .serviceAccounts.update
            - .serviceAccounts.enable
            - .serviceAccounts.undelete
    condition: selection
ocsf_mapping:
    class_name: dns_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: gcp
            mapped_at: '2025-11-26T02:21:36.426512+00:00'
        service:
            source_field: service
            source_value: gcp.audit
            mapped_at: '2025-11-26T02:21:36.426512+00:00'
    detection_fields:
        -   source_field: gcp.audit.method_name
            target_table: dns_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:21:36.426533+00:00'
