id: e2feb918-4e77-4608-9697-990a1aaf74c3
title: Google Cloud Storage Buckets Enumeration
status: test
level: low
description: Detects when storage bucket is enumerated in Google Cloud.
author: Austin Songer @austinsonger
date: '2021-08-14'
modified: '2022-10-09'
tags:
    - attack.discovery
references:
    - https://cloud.google.com/storage/docs/json_api/v1/buckets
falsepositives:
    - Storage Buckets being enumerated may be performed by a system administrator.
        Verify whether the user identity, user agent, and/or hostname should be making
        changes in your environment.
    - Storage Buckets enumerated from unfamiliar users should be investigated. If
        known behavior is causing false positives, it can be exempted from the rule.
taxonomy: sigma
logsource:
    product: gcp
    service: gcp.audit
detection:
    selection:
        gcp.audit.method_name:
            - storage.buckets.list
            - storage.buckets.listChannels
    condition: selection
ocsf_mapping:
    class_name: dns_activity
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: gcp
            mapped_at: '2025-11-26T02:21:35.238899+00:00'
        service:
            source_field: service
            source_value: gcp.audit
            mapped_at: '2025-11-26T02:21:35.238899+00:00'
    detection_fields:
        -   source_field: gcp.audit.method_name
            target_table: dns_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:21:35.238938+00:00'
