title: Github New Secret Created
id: f9405037-bc97-4eb7-baba-167dad399b83
status: test
level: low
author: Muhammad Faisal (@faisalusuf)
description: Detects when a user creates action secret for the organization, environment,
    codespaces or repository.
references:
    - https://docs.github.com/en/organizations/keeping-your-organization-secure/managing-security-settings-for-your-organization/reviewing-the-audit-log-for-your-organization#audit-log-actions
falsepositives:
    - This detection cloud be noisy depending on the environment. It is recommended
        to keep a check on the new secrets when created and validate the "actor".
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.privilege-escalation
    - attack.initial-access
    - attack.t1078.004
date: '2023-01-20'
logsource:
    product: github
    service: audit
    definition: 'Requirements: The audit log streaming feature must be enabled to
        be able to receive such logs. You can enable following the documentation here:
        https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/streaming-the-audit-log-for-your-enterprise#setting-up-audit-log-streaming'
detection:
    selection:
        action:
            - codespaces.create_an_org_secret
            - environment.create_actions_secret
            - org.create_actions_secret
            - repo.create_actions_secret
    condition: selection
ocsf_mapping:
    class_name: vulnerability_finding
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: github
            mapped_at: '2025-12-04T01:36:59.751155+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-12-04T01:36:59.751155+00:00'
    detection_fields:
        -   source_field: action
            target_table: vulnerability_finding
            target_field: action
            mapped_at: '2025-12-04T01:36:59.751169+00:00'
