title: Github Delete Action Invoked
id: 16a71777-0b2e-4db7-9888-9d59cb75200b
status: test
level: medium
author: Muhammad Faisal (@faisalusuf)
description: Detects delete action in the Github audit logs for codespaces, environment,
    project and repo.
references:
    - https://docs.github.com/en/organizations/keeping-your-organization-secure/managing-security-settings-for-your-organization/reviewing-the-audit-log-for-your-organization#audit-log-actions
falsepositives:
    - Validate the deletion activity is permitted. The "actor" field need to be validated.
tags:
    - attack.impact
    - attack.collection
    - attack.t1213.003
date: '2023-01-19'
logsource:
    product: github
    service: audit
    definition: 'Requirements: The audit log streaming feature must be enabled to
        be able to receive such logs. You can enable following the documentation here:
        https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/streaming-the-audit-log-for-your-enterprise#setting-up-audit-log-streaming'
detection:
    selection:
        action:
            - codespaces.delete
            - environment.delete
            - project.delete
            - repo.destroy
    condition: selection
ocsf_mapping:
    class_name: vulnerability_finding
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: github
            mapped_at: '2025-12-04T01:36:59.129225+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-12-04T01:36:59.129225+00:00'
    detection_fields:
        -   source_field: action
            target_table: vulnerability_finding
            target_field: action
            mapped_at: '2025-12-04T01:36:59.129243+00:00'
