id: 3883d9a0-fd0f-440f-afbb-445a2a799bb8
title: Github Secret Scanning Feature Disabled
status: experimental
level: high
description: Detects if the secret scanning feature is disabled for an enterprise
    or repository.
author: Muhammad Faisal (@faisalusuf)
date: '2024-03-07'
modified: '2024-07-19'
tags:
    - attack.defense-evasion
    - attack.t1562.001
references:
    - https://docs.github.com/en/enterprise-cloud@latest/code-security/secret-scanning/about-secret-scanning
falsepositives:
    - Allowed administrative activities.
taxonomy: sigma
logsource:
    product: github
    service: audit
    definition: 'Requirements: The audit log streaming feature must be enabled to
        be able to receive such logs. You can enable following the documentation here:
        https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/streaming-the-audit-log-for-your-enterprise#setting-up-audit-log-streaming'
detection:
    selection:
        action:
            - business_secret_scanning.disable
            - business_secret_scanning.disabled_for_new_repos
            - repository_secret_scanning.disable
            - secret_scanning_new_repos.disable
            - secret_scanning.disable
    condition: selection
ocsf_mapping:
    class_name: vulnerability_finding
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: github
            mapped_at: '2025-11-26T02:18:13.761905+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-11-26T02:18:13.761905+00:00'
    detection_fields:
        -   source_field: action
            target_table: vulnerability_finding
            target_field: action
            mapped_at: '2025-11-26T02:18:13.761919+00:00'
