id: 04ad83ef-1a37-4c10-b57a-81092164bf33
title: Github Repository/Organization Transferred
status: experimental
level: medium
description: Detects when a repository or an organization is being transferred to
    another location.
author: Romain Gaillard (@romain-gaillard)
date: '2024-07-29'
tags:
    - attack.persistence
    - attack.t1020
    - attack.t1537
references:
    - https://docs.github.com/en/repositories/creating-and-managing-repositories/transferring-a-repository
    - https://docs.github.com/en/organizations/managing-organization-settings/transferring-organization-ownership
    - https://docs.github.com/en/migrations
    - https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/audit-log-events-for-your-enterprise#migration
falsepositives:
    - Allowed administrative activities.
taxonomy: sigma
logsource:
    product: github
    service: audit
    definition: 'Requirements: The audit log streaming feature must be enabled to
        be able to receive such logs. You can enable following the documentation here:
        https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/streaming-the-audit-log-for-your-enterprise#setting-up-audit-log-streaming'
detection:
    selection:
        action:
            - migration.create
            - org.transfer_outgoing
            - org.transfer
            - repo.transfer_outgoing
    condition: selection
ocsf_mapping:
    class_name: vulnerability_finding
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: github
            mapped_at: '2025-11-26T02:18:12.738339+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-11-26T02:18:12.738339+00:00'
    detection_fields:
        -   source_field: action
            target_table: vulnerability_finding
            target_field: action
            mapped_at: '2025-11-26T02:18:12.738357+00:00'
