id: 02cf536a-cf21-4876-8842-4159c8aee3cc
title: Github Push Protection Bypass Detected
status: test
level: low
description: Detects when a user bypasses the push protection on a secret detected
    by secret scanning.
author: Muhammad Faisal (@faisalusuf)
date: '2024-03-07'
tags:
    - attack.defense-evasion
    - attack.t1562.001
references:
    - https://docs.github.com/en/enterprise-cloud@latest/code-security/secret-scanning/push-protection-for-repositories-and-organizations
    - https://thehackernews.com/2024/03/github-rolls-out-default-secret.html
falsepositives:
    - Allowed administrative activities.
taxonomy: sigma
logsource:
    product: github
    service: audit
    definition: 'Requirements: The audit log streaming feature must be enabled to
        be able to receive such logs. You can enable following the documentation here:
        https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/streaming-the-audit-log-for-your-enterprise#setting-up-audit-log-streaming'
detection:
    selection:
        action|contains: secret_scanning_push_protection.bypass
    condition: selection
ocsf_mapping:
    class_name: vulnerability_finding
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: github
            mapped_at: '2025-11-26T02:18:10.540301+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-11-26T02:18:10.540301+00:00'
    detection_fields:
        -   source_field: action
            target_table: vulnerability_finding
            target_field: action
            mapped_at: '2025-11-26T02:18:10.540327+00:00'
