title: Potential Mpclient.DLL Sideloading
id: 418dc89a-9808-4b87-b1d7-e5ae0cb6effc
status: test
level: high
author: Bhabesh Raj
description: Detects potential sideloading of "mpclient.dll" by Windows Defender processes
    ("MpCmdRun" and "NisSrv") from their non-default directory.
references:
    - https://www.sentinelone.com/blog/living-off-windows-defender-lockbit-ransomware-sideloads-cobalt-strike-through-microsoft-security-tool
falsepositives:
    - Unlikely
tags:
    - attack.defense-evasion
    - attack.t1574.002
date: '2022-08-02'
modified: '2023-08-04'
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith: \mpclient.dll
        Image|endswith:
            - \MpCmdRun.exe
            - \NisSrv.exe
    filter_main_known_locations:
        Image|startswith:
            - C:\Program Files (x86)\Windows Defender\
            - C:\Program Files\Microsoft Security Client\
            - C:\Program Files\Windows Defender\
            - C:\ProgramData\Microsoft\Windows Defender\Platform\
            - C:\Windows\WinSxS\
    condition: selection and not 1 of filter_main_*
related:
    -   id: 7002aa10-b8d4-47ae-b5ba-51ab07e228b9
        type: similar
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
