id: d2605a99-2218-4894-8fd3-2afb7946514d
title: Potential Mfdetours.DLL Sideloading
status: test
level: medium
description: Detects potential DLL sideloading of "mfdetours.dll". While using "mftrace.exe"
    it can be abused to attach to an arbitrary process and force load any DLL named
    "mfdetours.dll" from the current directory of execution.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-08-03'
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1574.001
    - attack.t1574.002
references:
    - Internal Research
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith: \mfdetours.dll
    filter_main_legit_path:
        ImageLoaded|contains: :\Program Files (x86)\Windows Kits\10\bin\
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
