id: 829a3bdf-34da-4051-9cf4-8ed221a8ae4f
title: Microsoft Office DLL Sideload
status: test
level: high
description: Detects DLL sideloading of DLLs that are part of Microsoft Office from
    non standard location
author: Nasreddine Bencherchali (Nextron Systems), Wietze Beukema (project and research)
date: '2022-08-17'
modified: '2023-03-15'
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1574.001
    - attack.t1574.002
references:
    - https://hijacklibs.net/
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith: \outllib.dll
    filter:
        ImageLoaded|startswith:
            - C:\Program Files\Microsoft Office\OFFICE
            - C:\Program Files (x86)\Microsoft Office\OFFICE
            - C:\Program Files\Microsoft Office\Root\OFFICE
            - C:\Program Files (x86)\Microsoft Office\Root\OFFICE
    condition: selection and not filter
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
