title: DotNet CLR DLL Loaded By Scripting Applications
id: 4508a70e-97ef-4300-b62b-ff27992990ea
status: test
level: high
author: omkar72, oscd.community
description: Detects .NET CLR DLLs being loaded by scripting applications such as
    wscript or cscript. This could be an indication of potential suspicious execution.
references:
    - https://github.com/tyranid/DotNetToJScript
    - https://thewover.github.io/Introducing-Donut/
    - https://web.archive.org/web/20230329154538/https://blog.menasec.net/2019/07/interesting-difr-traces-of-net-clr.html
    - https://web.archive.org/web/20221026202428/https://gist.github.com/code-scrap/d7f152ffcdb3e0b02f7f394f5187f008
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.privilege-escalation
    - attack.t1055
date: '2020-10-14'
modified: '2023-02-23'
logsource:
    category: image_load
    product: windows
detection:
    selection:
        Image|endswith:
            - \cmstp.exe
            - \cscript.exe
            - \mshta.exe
            - \msxsl.exe
            - \regsvr32.exe
            - \wmic.exe
            - \wscript.exe
        ImageLoaded|endswith:
            - \clr.dll
            - \mscoree.dll
            - \mscorlib.dll
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
