id: e76c8240-d68f-4773-8880-5c6f63595aaf
title: Time Travel Debugging Utility Usage - Image
status: test
level: high
description: Detects usage of Time Travel Debugging Utility. Adversaries can execute
    malicious processes and dump processes, such as lsass.exe, via tttracer.exe.
author: Ensar Şamil, @sblmsrsn, @oscd_initiative
date: '2020-10-06'
modified: '2022-12-02'
tags:
    - attack.defense-evasion
    - attack.credential-access
    - attack.t1218
    - attack.t1003.001
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Tttracer/
    - https://twitter.com/mattifestation/status/1196390321783025666
    - https://twitter.com/oulusoyum/status/1191329746069655553
falsepositives:
    - Legitimate usage by software developers/testers
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith:
            - \ttdrecord.dll
            - \ttdwriter.dll
            - \ttdloader.dll
    condition: selection
ocsf_mapping:
    class_name: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
