id: 6e78b74f-c762-4800-82ad-f66787f10c8a
title: Potential Rcdll.DLL Sideloading
status: test
level: high
description: Detects potential DLL sideloading of rcdll.dll
author: X__Junior (Nextron Systems)
date: '2023-03-13'
modified: '2023-03-15'
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1574.001
    - attack.t1574.002
references:
    - https://www.trendmicro.com/en_us/research/23/c/iron-tiger-sysupdate-adds-linux-targeting.html
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith: \rcdll.dll
    filter:
        ImageLoaded|startswith:
            - C:\Program Files (x86)\Microsoft Visual Studio\
            - C:\Program Files (x86)\Windows Kits\
    condition: selection and not filter
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
