title: Python Image Load By Non-Python Process
id: cbb56d62-4060-40f7-9466-d8aaf3123f83
status: test
level: medium
author: Patrick St. John, OTR (Open Threat Research)
description: Detects the image load of "Python Core" by a non-Python process. This
    might be indicative of a Python script bundled with Py2Exe.
references:
    - https://www.py2exe.org/
    - https://unit42.paloaltonetworks.com/unit-42-technical-analysis-seaduke/
falsepositives:
    - Legitimate Py2Exe Binaries
    - Known false positive caused with Python Anaconda
tags:
    - attack.defense-evasion
    - attack.t1027.002
date: '2020-05-03'
modified: '2023-09-18'
logsource:
    category: image_load
    product: windows
detection:
    selection:
        Description: Python Core
    filter_main_generic:
        Image|contains: Python
        Image|startswith:
            - C:\Program Files\
            - C:\Program Files (x86)\
            - C:\ProgramData\Anaconda3\
    filter_optional_aurora:
        Image: null
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: '2025-12-04T01:40:41.055769+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:40:41.055769+00:00'
    detection_fields:
        -   source_field: Description
            target_table: process_activity
            target_field: device.desc
            mapped_at: '2025-12-04T01:40:41.055783+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:40:41.055785+00:00'
