id: 2b140a5c-dc02-4bb8-b6b1-8bdb45714cde
title: System Control Panel Item Loaded From Uncommon Location
status: test
level: medium
description: Detects image load events of system control panel items (.cpl) from uncommon
    or non-system locations which might be the result of sideloading.
author: Anish Bogati
date: '2024-01-09'
tags:
    - attack.defense-evasion
    - attack.t1036
references:
    - https://www.hexacorn.com/blog/2024/01/06/1-little-known-secret-of-fondue-exe/
    - https://www.hexacorn.com/blog/2024/01/01/1-little-known-secret-of-hdwwiz-exe/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith:
            - \hdwwiz.cpl
            - \appwiz.cpl
    filter_main_legit_location:
        ImageLoaded|contains:
            - :\Windows\System32\
            - :\Windows\SysWOW64\
            - :\Windows\WinSxS\
    condition: selection and not 1 of filter_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
