title: Potential DLL Sideloading Of DBGCORE.DLL
id: 9ca2bf31-0570-44d8-a543-534c47c33ed7
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems), Wietze Beukema (project and research)
description: Detects DLL sideloading of "dbgcore.dll"
references:
    - https://hijacklibs.net/
falsepositives:
    - Legitimate applications loading their own versions of the DLL mentioned in this
        rule
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1574.001
    - attack.t1574.002
date: '2022-10-25'
modified: '2023-05-05'
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith: \dbgcore.dll
    filter_main_generic:
        ImageLoaded|startswith:
            - C:\Program Files (x86)\
            - C:\Program Files\
            - C:\Windows\SoftwareDistribution\
            - C:\Windows\System32\
            - C:\Windows\SystemTemp\
            - C:\Windows\SysWOW64\
            - C:\Windows\WinSxS\
    filter_optional_steam:
        ImageLoaded|endswith: \Steam\bin\cef\cef.win7x64\dbgcore.dll
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
