id: 9a0b8719-cd3c-4f0a-90de-765a4cb3f5ed
title: Microsoft VBA For Outlook Addin Loaded Via Outlook
status: test
level: medium
description: Detects outlvba (Microsoft VBA for Outlook Addin) DLL being loaded by
    the outlook process
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-02-08'
modified: '2024-03-12'
tags:
    - attack.execution
    - attack.t1204.002
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=58
falsepositives:
    - Legitimate macro usage. Add the appropriate filter according to your environment
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection:
        Image|endswith: \outlook.exe
        ImageLoaded|endswith: \outlvba.dll
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
