title: Remote DLL Load Via Rundll32.EXE
id: f40017b3-cb2e-4335-ab5d-3babf679c1de
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects a remote DLL load event via "rundll32.exe".
references:
    - https://github.com/gabe-k/themebleed
    - Internal Research
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1204.002
date: '2023-09-18'
logsource:
    category: image_load
    product: windows
detection:
    selection:
        Image|endswith: \rundll32.exe
        ImageLoaded|startswith: \\
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
