title: GAC DLL Loaded Via Office Applications
id: 90217a70-13fc-48e4-b3db-0d836c5824ac
status: test
level: high
author: Antonlovesdnb
description: Detects any GAC DLL being loaded by an Office Product
references:
    - https://medium.com/threatpunter/detecting-adversary-tradecraft-with-image-load-event-logging-and-eql-8de93338c16
falsepositives:
    - Legitimate macro usage. Add the appropriate filter according to your environment
tags:
    - attack.execution
    - attack.t1204.002
date: '2020-02-19'
modified: '2023-02-10'
logsource:
    category: image_load
    product: windows
detection:
    selection:
        Image|endswith:
            - \excel.exe
            - \mspub.exe
            - \onenote.exe
            - \onenoteim.exe
            - \outlook.exe
            - \powerpnt.exe
            - \winword.exe
        ImageLoaded|startswith: C:\Windows\Microsoft.NET\assembly\GAC_MSIL
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
