title: Potential AVKkid.DLL Sideloading
id: 952ed57c-8f99-453d-aee0-53a49c22f95d
status: test
level: medium
author: X__Junior (Nextron Systems)
description: Detects potential DLL sideloading of "AVKkid.dll"
references:
    - https://research.checkpoint.com/2023/beyond-the-horizon-traveling-the-world-on-camaro-dragons-usb-flash-drives/
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1574.001
    - attack.t1574.002
date: '2023-08-03'
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith: \AVKkid.dll
    filter_main_legit_path:
        Image|contains:
            - C:\Program Files (x86)\G DATA\
            - C:\Program Files\G DATA\
        Image|endswith: \AVKKid.exe
        ImageLoaded|startswith:
            - C:\Program Files (x86)\G DATA\
            - C:\Program Files\G DATA\
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
