id: 948a0953-f287-4806-bbcb-3b2e396df89f
title: Unsigned Mfdetours.DLL Sideloading
status: test
level: high
description: Detects DLL sideloading of unsigned "mfdetours.dll". Executing "mftrace.exe"
    can be abused to attach to an arbitrary process and force load any DLL named "mfdetours.dll"
    from the current directory of execution.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-08-11'
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1574.001
    - attack.t1574.002
references:
    - Internal Research
falsepositives:
    - Unlikely
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''d2605a99-2218-4894-8fd3-2afb7946514d''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith: \mfdetours.dll
    filter_main_legit_path:
        ImageLoaded|contains: :\Program Files (x86)\Windows Kits\10\bin\
        SignatureStatus: Valid
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: '2025-11-13T20:19:13.113850+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:19:13.113850+00:00'
    detection_fields:
        -   source_field: ImageLoaded
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:19:14.272845+00:00'
        -   source_field: SignatureStatus
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:19:14.272868+00:00'
