id: 75e508f7-932d-4ebc-af77-269237a84ce1
title: DLL Loaded From Suspicious Location Via Cmspt.EXE
status: test
level: high
description: Detects cmstp loading "dll" or "ocx" files from suspicious locations
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-08-30'
modified: '2023-02-17'
tags:
    - attack.defense-evasion
    - attack.t1218.003
references:
    - https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/02bcbfc2bfb8b4da601bb30de0344ae453aa1afe/TTPs/Defense%20Evasion/T1218%20-%20Signed%20Binary%20Proxy%20Execution/T1218.003%20-%20CMSTP/Procedures.yaml
falsepositives:
    - Unikely
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection:
        Image|endswith: \cmstp.exe
        ImageLoaded|contains:
            - \PerfLogs\
            - \ProgramData\
            - \Users\
            - \Windows\Temp\
            - C:\Temp\
        ImageLoaded|endswith:
            - .dll
            - .ocx
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: '2025-11-13T20:19:30.803963+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:19:30.803963+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:19:30.803971+00:00'
        -   source_field: ImageLoaded
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:19:30.803973+00:00'
