title: Aruba Network Service Potential DLL Sideloading
id: 90ae0469-0cee-4509-b67f-e5efcef040f7
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects potential DLL sideloading activity via the Aruba Networks Virtual
    Intranet Access "arubanetsvc.exe" process using DLL Search Order Hijacking
references:
    - https://twitter.com/wdormann/status/1616581559892545537?t=XLCBO9BziGzD7Bmbt8oMEQ&s=09
falsepositives:
    - Unknown
tags:
    - attack.privilege-escalation
    - attack.persistence
    - attack.t1574.001
    - attack.t1574.002
date: '2023-01-22'
modified: '2023-03-15'
logsource:
    category: image_load
    product: windows
detection:
    selection:
        Image|endswith: \arubanetsvc.exe
        ImageLoaded|endswith:
            - \wtsapi32.dll
            - \msvcr100.dll
            - \msvcp100.dll
            - \dbghelp.dll
            - \dbgcore.dll
            - \wininet.dll
            - \iphlpapi.dll
            - \version.dll
            - \cryptsp.dll
            - \cryptbase.dll
            - \wldp.dll
            - \profapi.dll
            - \sspicli.dll
            - \winsta.dll
            - \dpapi.dll
    filter:
        ImageLoaded|startswith:
            - C:\Windows\System32\
            - C:\Windows\SysWOW64\
            - C:\Windows\WinSxS\
    condition: selection and not filter
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
