id: e6ce8457-68b1-485b-9bdd-3c2b5d679aa9
title: VBA DLL Loaded Via Office Application
status: test
level: high
description: Detects VB DLL's loaded by an office application. Which could indicate
    the presence of VBA Macros.
author: Antonlovesdnb
date: '2020-02-19'
modified: '2023-02-10'
tags:
    - attack.execution
    - attack.t1204.002
references:
    - https://medium.com/threatpunter/detecting-adversary-tradecraft-with-image-load-event-logging-and-eql-8de93338c16
falsepositives:
    - Legitimate macro usage. Add the appropriate filter according to your environment
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection:
        Image|endswith:
            - \excel.exe
            - \mspub.exe
            - \onenote.exe
            - \onenoteim.exe
            - \outlook.exe
            - \powerpnt.exe
            - \winword.exe
        ImageLoaded|endswith:
            - \VBE7.DLL
            - \VBEUI.DLL
            - \VBE7INTL.DLL
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: '2025-11-13T20:19:07.853352+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:19:07.853352+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:19:07.853365+00:00'
        -   source_field: ImageLoaded
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:19:07.853369+00:00'
