title: Unsigned Mfdetours.DLL Sideloading
id: 948a0953-f287-4806-bbcb-3b2e396df89f
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects DLL sideloading of unsigned "mfdetours.dll". Executing "mftrace.exe"
    can be abused to attach to an arbitrary process and force load any DLL named "mfdetours.dll"
    from the current directory of execution.
references:
    - Internal Research
falsepositives:
    - Unlikely
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1574.001
    - attack.t1574.002
date: '2023-08-11'
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith: \mfdetours.dll
    filter_main_legit_path:
        ImageLoaded|contains: :\Program Files (x86)\Windows Kits\10\bin\
        SignatureStatus: Valid
    condition: selection and not 1 of filter_main_*
related:
    -   id: d2605a99-2218-4894-8fd3-2afb7946514d
        type: similar
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: SignatureStatus
            target_table: null
            target_field: null
            mapped_at: null
