id: 0fa66f66-e3f6-4a9c-93f8-4f2610b00171
title: Potential DLL Sideloading Using Coregen.exe
status: test
level: medium
description: Detect usage of the "coregen.exe" (Microsoft CoreCLR Native Image Generator)
    binary to sideload arbitrary DLLs.
author: frack113
date: '2022-12-31'
tags:
    - attack.defense-evasion
    - attack.t1218
    - attack.t1055
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Coregen/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection:
        Image|endswith: \coregen.exe
    filter_main_legit_paths:
        ImageLoaded|startswith:
            - C:\Program Files (x86)\Microsoft Silverlight\
            - C:\Program Files\Microsoft Silverlight\
            - C:\Windows\System32\
            - C:\Windows\SysWOW64\
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
