title: Potential CCleanerDU.DLL Sideloading
id: 1fbc0671-5596-4e17-8682-f020a0b995dc
status: test
level: medium
author: X__Junior (Nextron Systems)
description: Detects potential DLL sideloading of "CCleanerDU.dll"
references:
    - https://lab52.io/blog/2344-2/
falsepositives:
    - False positives could occur from other custom installation paths. Apply additional
        filters accordingly.
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1574.001
    - attack.t1574.002
date: '2023-07-13'
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith: \CCleanerDU.dll
    filter_main_path:
        Image|startswith:
            - C:\Program Files\CCleaner\
            - C:\Program Files (x86)\CCleaner\
        Image|endswith:
            - \CCleaner.exe
            - \CCleaner64.exe
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
