id: 06ce37c2-61ab-4f05-9ff5-b1a96d18ae32
title: WMIC Loading Scripting Libraries
status: test
level: medium
description: Detects threat actors proxy executing code and bypassing application
    controls by leveraging wmic and the `/FORMAT` argument switch to download and
    execute an XSL file (i.e js, vbs, etc).
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: '2020-10-17'
modified: '2022-10-13'
tags:
    - attack.defense-evasion
    - attack.t1220
references:
    - https://securitydatasets.com/notebooks/atomic/windows/defense_evasion/SDWIN-201017061100.html
    - https://twitter.com/dez_/status/986614411711442944
    - https://lolbas-project.github.io/lolbas/Binaries/Wmic/
falsepositives:
    - The command wmic os get lastboottuptime loads vbscript.dll
    - The command wmic os get locale loads vbscript.dll
    - Since the ImageLoad event doesn't have enough information in this case. It's
        better to look at the recent process creation events that spawned the WMIC
        process and investigate the command line and parent/child processes to get
        more insights
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection:
        Image|endswith: \wmic.exe
        ImageLoaded|endswith:
            - \jscript.dll
            - \vbscript.dll
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: '2025-11-13T20:19:31.508328+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:19:31.508328+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:19:31.508339+00:00'
        -   source_field: ImageLoaded
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:19:31.508341+00:00'
