title: Potential SmadHook.DLL Sideloading
id: 24b6cf51-6122-469e-861a-22974e9c1e5b
status: test
level: high
author: X__Junior (Nextron Systems)
description: Detects potential DLL sideloading of "SmadHook.dll", a DLL used by SmadAV
    antivirus
references:
    - https://research.checkpoint.com/2023/malware-spotlight-camaro-dragons-tinynote-backdoor/
    - https://www.qurium.org/alerts/targeted-malware-against-crph/
falsepositives:
    - Unlikely
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1574.001
    - attack.t1574.002
date: '2023-06-01'
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith:
            - \SmadHook32c.dll
            - \SmadHook64c.dll
    filter_main_legit_path:
        Image:
            - C:\Program Files (x86)\SMADAV\SmadavProtect32.exe
            - C:\Program Files (x86)\SMADAV\SmadavProtect64.exe
            - C:\Program Files\SMADAV\SmadavProtect32.exe
            - C:\Program Files\SMADAV\SmadavProtect64.exe
        ImageLoaded|startswith:
            - C:\Program Files (x86)\SMADAV\
            - C:\Program Files\SMADAV\
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
