id: f64c9b2d-b0ad-481d-9d03-7fc75020892a
title: Potential RoboForm.DLL Sideloading
status: test
level: medium
description: Detects potential DLL sideloading of "roboform.dll", a DLL used by RoboForm
    Password Manager
author: X__Junior (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: '2023-05-14'
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1574.001
    - attack.t1574.002
references:
    - https://twitter.com/StopMalvertisin/status/1648604148848549888
    - https://twitter.com/t3ft3lb/status/1656194831830401024
    - https://www.roboform.com/
falsepositives:
    - If installed on a per-user level, the path would be located in "AppData\Local".
        Add additional filters to reflect this mode of installation
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith:
            - \roboform.dll
            - \roboform-x64.dll
    filter_main_path:
        Image|startswith:
            - ' C:\Program Files (x86)\Siber Systems\AI RoboForm\'
            - ' C:\Program Files\Siber Systems\AI RoboForm\'
        Image|endswith:
            - \robotaskbaricon.exe
            - \robotaskbaricon-x64.exe
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: '2025-11-13T20:19:26.655877+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:19:26.655877+00:00'
    detection_fields:
        -   source_field: ImageLoaded
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:19:26.655896+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:19:26.655898+00:00'
