id: ff0f2b05-09db-4095-b96d-1b75ca24894a
title: DotNET Assembly DLL Loaded Via Office Application
status: test
level: medium
description: Detects any assembly DLL being loaded by an Office Product
author: Antonlovesdnb
date: '2020-02-19'
modified: '2023-03-29'
tags:
    - attack.execution
    - attack.t1204.002
references:
    - https://medium.com/threatpunter/detecting-adversary-tradecraft-with-image-load-event-logging-and-eql-8de93338c16
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection:
        Image|endswith:
            - \excel.exe
            - \mspub.exe
            - \onenote.exe
            - \onenoteim.exe
            - \outlook.exe
            - \powerpnt.exe
            - \winword.exe
        ImageLoaded|startswith: C:\Windows\assembly\
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
