id: 9ae01559-cf7e-4f8e-8e14-4c290a1b4784
title: CredUI.DLL Loaded By Uncommon Process
status: test
level: medium
description: Detects loading of "credui.dll" and related DLLs by an uncommon process.
    Attackers might leverage this DLL for potential use of "CredUIPromptForCredentials"
    or "CredUnPackAuthenticationBufferW".
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: '2020-10-20'
modified: '2023-07-28'
tags:
    - attack.credential-access
    - attack.collection
    - attack.t1056.002
references:
    - https://securitydatasets.com/notebooks/atomic/windows/credential_access/SDWIN-201020013208.html
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1056.002/T1056.002.md#atomic-test-2---powershell---prompt-user-for-password
    - https://learn.microsoft.com/en-us/windows/win32/api/wincred/nf-wincred-creduipromptforcredentialsa
    - https://github.com/S12cybersecurity/RDPCredentialStealer
falsepositives:
    - Other legitimate processes loading those DLLs in your environment.
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith:
            - \credui.dll
            - \wincredui.dll
        OriginalFileName:
            - credui.dll
            - wincredui.dll
    filter_main_generic:
        Image|startswith:
            - C:\Program Files (x86)\
            - C:\Program Files\
            - C:\Windows\System32\
            - C:\Windows\SysWOW64\
    filter_main_full:
        Image:
            - C:\Windows\explorer.exe
            - C:\Windows\ImmersiveControlPanel\SystemSettings.exe
            - C:\Windows\regedit.exe
    filter_optional_opera:
        Image|endswith: \opera_autoupdate.exe
    filter_optional_process_explorer:
        Image|endswith:
            - \procexp64.exe
            - \procexp.exe
    filter_optional_teams:
        Image|startswith: C:\Users\
        Image|contains: \AppData\Local\Microsoft\Teams\
        Image|endswith: \Teams.exe
    filter_optional_onedrive:
        Image|startswith: C:\Users\
        Image|contains: \AppData\Local\Microsoft\OneDrive\
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: '2025-11-13T20:19:26.658872+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:19:26.658872+00:00'
    detection_fields:
        -   source_field: ImageLoaded
            target_table: process_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:19:26.658881+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:19:26.658883+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:19:26.658885+00:00'
