id: 418dc89a-9808-4b87-b1d7-e5ae0cb6effc
title: Potential Mpclient.DLL Sideloading
status: test
level: high
description: Detects potential sideloading of "mpclient.dll" by Windows Defender processes
    ("MpCmdRun" and "NisSrv") from their non-default directory.
author: Bhabesh Raj
date: '2022-08-02'
modified: '2023-08-04'
tags:
    - attack.defense-evasion
    - attack.t1574.002
references:
    - https://www.sentinelone.com/blog/living-off-windows-defender-lockbit-ransomware-sideloads-cobalt-strike-through-microsoft-security-tool
falsepositives:
    - Unlikely
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''7002aa10-b8d4-47ae-b5ba-51ab07e228b9''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith: \mpclient.dll
        Image|endswith:
            - \MpCmdRun.exe
            - \NisSrv.exe
    filter_main_known_locations:
        Image|startswith:
            - C:\Program Files (x86)\Windows Defender\
            - C:\Program Files\Microsoft Security Client\
            - C:\Program Files\Windows Defender\
            - C:\ProgramData\Microsoft\Windows Defender\Platform\
            - C:\Windows\WinSxS\
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: '2025-11-13T20:19:26.662744+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:19:26.662744+00:00'
    detection_fields:
        -   source_field: ImageLoaded
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:19:26.662751+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:19:26.662753+00:00'
