id: 2092cacb-d77b-4f98-ab0d-32b32f99a054
title: Potential Vivaldi_elf.DLL Sideloading
status: test
level: medium
description: Detects potential DLL sideloading of "vivaldi_elf.dll"
author: X__Junior (Nextron Systems)
date: '2023-08-03'
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1574.001
    - attack.t1574.002
references:
    - https://research.checkpoint.com/2023/beyond-the-horizon-traveling-the-world-on-camaro-dragons-usb-flash-drives/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith: \vivaldi_elf.dll
    filter_main_legit_path:
        Image|endswith: \Vivaldi\Application\vivaldi.exe
        ImageLoaded|contains: \Vivaldi\Application\
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
