title: Potential RjvPlatform.DLL Sideloading From Default Location
id: 259dda31-b7a3-444f-b7d8-17f96e8a7d0d
status: test
level: medium
author: X__Junior (Nextron Systems)
description: Detects loading of "RjvPlatform.dll" by the "SystemResetPlatform.exe"
    binary which can be abused as a method of DLL side loading since the "$SysReset"
    directory isn't created by default.
references:
    - https://twitter.com/0gtweet/status/1666716511988330499
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1574.001
    - attack.t1574.002
date: '2023-06-09'
logsource:
    category: image_load
    product: windows
detection:
    selection:
        Image: C:\Windows\System32\SystemResetPlatform\SystemResetPlatform.exe
        ImageLoaded: C:\$SysReset\Framework\Stack\RjvPlatform.dll
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
