id: edd3ddc3-386f-4ba5-9ada-4376b2cfa7b5
title: Potential EACore.DLL Sideloading
status: test
level: high
description: Detects potential DLL sideloading of "EACore.dll"
author: X__Junior (Nextron Systems)
date: '2023-08-03'
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1574.001
    - attack.t1574.002
references:
    - https://research.checkpoint.com/2023/beyond-the-horizon-traveling-the-world-on-camaro-dragons-usb-flash-drives/
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith: \EACore.dll
    filter_main_legit_path:
        Image|contains|all:
            - C:\Program Files\Electronic Arts\EA Desktop\
            - \EACoreServer.exe
        ImageLoaded|startswith: C:\Program Files\Electronic Arts\EA Desktop\
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
