id: 6b98b92b-4f00-4f62-b4fe-4d1920215771
title: Potential DLL Sideloading Of Non-Existent DLLs From System Folders
status: test
level: high
description: 'Detects DLL sideloading of system DLLs that are not present on the system
    by default (at least not in system directories).

    Usually this technique is used to achieve UAC bypass or privilege escalation.

    '
author: Nasreddine Bencherchali (Nextron Systems), SBousseaden
date: '2022-12-09'
modified: '2024-01-10'
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1574.001
    - attack.t1574.002
references:
    - https://decoded.avast.io/martinchlumecky/png-steganography/
    - https://posts.specterops.io/lateral-movement-scm-and-dll-hijacking-primer-d2f61e8ab992
    - https://clement.notin.org/blog/2020/09/12/CVE-2020-7315-McAfee-Agent-DLL-injection/
    - https://github.com/Wh04m1001/SysmonEoP
    - https://www.hexacorn.com/blog/2013/12/08/beyond-good-ol-run-key-part-5/
    - http://remoteawesomethoughts.blogspot.com/2019/05/windows-10-task-schedulerservice.html
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''df6ecb8b-7822-4f4b-b412-08f524b4576c''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''602a1f13-c640-4d73-b053-be9a2fa58b77''),
    type=<SigmaRelatedType.OBSOLETE: 4>)])'
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith:
            - :\Windows\System32\TSMSISrv.dll
            - :\Windows\System32\TSVIPSrv.dll
            - :\Windows\System32\wbem\wbemcomn.dll
            - :\Windows\System32\WLBSCTRL.dll
            - :\Windows\System32\wow64log.dll
            - :\Windows\System32\WptsExtensions.dll
    filter_main_ms_signed:
        Signed: 'true'
        SignatureStatus: Valid
        Signature: Microsoft Windows
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: '2025-11-13T20:19:24.667638+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:19:24.667638+00:00'
    detection_fields:
        -   source_field: ImageLoaded
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:19:24.667656+00:00'
        -   source_field: Signed
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:19:24.667658+00:00'
        -   source_field: SignatureStatus
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:19:24.667659+00:00'
        -   source_field: Signature
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:19:24.667660+00:00'
