title: Suspicious Unsigned Thor Scanner Execution
id: ea5c131b-380d-49f9-aeb3-920694da4d4b
status: stable
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects loading and execution of an unsigned thor scanner binary.
references:
    - Internal Research
falsepositives:
    - Other legitimate binaries named "thor.exe" that aren't published by Nextron
        Systems
tags:
    - attack.defense-evasion
    - attack.t1574.002
date: '2023-10-29'
logsource:
    category: image_load
    product: windows
detection:
    selection:
        Image|endswith:
            - \thor.exe
            - \thor64.exe
        ImageLoaded|endswith:
            - \thor.exe
            - \thor64.exe
    filter_main:
        Signed: 'true'
        SignatureStatus: valid
        Signature: Nextron Systems GmbH
    condition: selection and not filter_main
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: '2025-12-04T01:40:34.002332+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:40:34.002332+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:40:34.002348+00:00'
        -   source_field: ImageLoaded
            target_table: process_activity
            target_field: module.file.path
            mapped_at: '2025-12-04T01:40:34.002350+00:00'
        -   source_field: Signed
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:40:34.002351+00:00'
        -   source_field: SignatureStatus
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:40:34.002353+00:00'
        -   source_field: Signature
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:40:34.002354+00:00'
