id: bb2ba6fb-95d4-4a25-89fc-30bb736c021a
title: PowerShell Core DLL Loaded Via Office Application
status: test
level: medium
description: Detects PowerShell core DLL being loaded by an Office Product
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-06-01'
tags:
    - attack.defense-evasion
references:
    - Internal Research
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection:
        Image|endswith:
            - \excel.exe
            - \mspub.exe
            - \outlook.exe
            - \onenote.exe
            - \onenoteim.exe
            - \powerpnt.exe
            - \winword.exe
        ImageLoaded|contains:
            - \System.Management.Automation.Dll
            - \System.Management.Automation.ni.Dll
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: '2025-11-13T20:19:31.510416+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:19:31.510416+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:19:31.510422+00:00'
        -   source_field: ImageLoaded
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:19:31.510423+00:00'
