title: Potential DCOM InternetExplorer.Application DLL Hijack - Image Load
id: f354eba5-623b-450f-b073-0b5b2773b6aa
status: test
level: critical
author: Roberto Rodriguez @Cyb3rWard0g, Open Threat Research (OTR), wagga
description: Detects potential DLL hijack of "iertutil.dll" found in the DCOM InternetExplorer.Application
    Class
references:
    - https://threathunterplaybook.com/hunts/windows/201009-RemoteDCOMIErtUtilDLLHijack/notebook.html
falsepositives:
    - Unknown
tags:
    - attack.lateral-movement
    - attack.t1021.002
    - attack.t1021.003
date: '2020-10-12'
modified: '2022-12-18'
logsource:
    category: image_load
    product: windows
detection:
    selection:
        Image|endswith: \Internet Explorer\iexplore.exe
        ImageLoaded|endswith: \Internet Explorer\iertutil.dll
    condition: selection
related:
    -   id: e554f142-5cf3-4e55-ace9-a1b59e0def65
        type: obsolete
    -   id: 2f7979ae-f82b-45af-ac1d-2b10e93b0baa
        type: similar
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
