title: Fax Service DLL Search Order Hijack
id: 828af599-4c53-4ed2-ba4a-a9f835c434ea
status: test
level: high
author: NVISO
description: The Fax service attempts to load ualapi.dll, which is non-existent. An
    attacker can then (side)load their own malicious DLL using this service.
references:
    - https://windows-internals.com/faxing-your-way-to-system/
falsepositives:
    - Unlikely
tags:
    - attack.persistence
    - attack.defense-evasion
    - attack.t1574.001
    - attack.t1574.002
date: '2020-05-04'
modified: '2022-06-02'
logsource:
    category: image_load
    product: windows
detection:
    selection:
        Image|endswith: \fxssvc.exe
        ImageLoaded|endswith: ualapi.dll
    filter:
        ImageLoaded|startswith: C:\Windows\WinSxS\
    condition: selection and not filter
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
