title: Potential RjvPlatform.DLL Sideloading From Non-Default Location
id: 0e0bc253-07ed-43f1-816d-e1b220fe8971
status: test
level: high
author: X__Junior (Nextron Systems)
description: Detects potential DLL sideloading of "RjvPlatform.dll" by "SystemResetPlatform.exe"
    located in a non-default location.
references:
    - https://twitter.com/0gtweet/status/1666716511988330499
falsepositives:
    - Unlikely
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1574.001
    - attack.t1574.002
date: '2023-06-09'
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith: \RjvPlatform.dll
        Image: \SystemResetPlatform.exe
    filter_main_legit_path:
        Image|startswith: C:\Windows\System32\SystemResetPlatform\
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
