title: VMGuestLib DLL Sideload
id: 70e8e9b4-6a93-4cb7-8cde-da69502e7aff
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects DLL sideloading of VMGuestLib.dll by the WmiApSrv service.
references:
    - https://decoded.avast.io/martinchlumecky/png-steganography/
falsepositives:
    - FP could occur if the legitimate version of vmGuestLib already exists on the
        system
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1574.001
    - attack.t1574.002
date: '2022-12-01'
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|contains|all:
            - \VMware\VMware Tools\vmStatsProvider\win32
            - \vmGuestLib.dll
        Image|endswith: \Windows\System32\wbem\WmiApSrv.exe
    filter:
        Signed: 'true'
    condition: selection and not filter
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Signed
            target_table: null
            target_field: null
            mapped_at: null
