id: 9313dc13-d04c-46d8-af4a-a930cc55d93b
title: Potential DLL Sideloading Via VMware Xfer
status: test
level: high
description: Detects loading of a DLL by the VMware Xfer utility from the non-default
    directory which may be an attempt to sideload arbitrary DLL
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-08-02'
modified: '2023-02-17'
tags:
    - attack.defense-evasion
    - attack.t1574.002
references:
    - https://www.sentinelone.com/labs/lockbit-ransomware-side-loads-cobalt-strike-beacon-with-legitimate-vmware-utility/
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection:
        Image|endswith: \VMwareXferlogs.exe
        ImageLoaded|endswith: \glib-2.0.dll
    filter:
        ImageLoaded|startswith: C:\Program Files\VMware\
    condition: selection and not filter
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: '2025-11-13T20:19:15.718686+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:19:15.718686+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:19:15.718700+00:00'
        -   source_field: ImageLoaded
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:19:15.718703+00:00'
