title: HackTool - SharpEvtMute DLL Load
id: 49329257-089d-46e6-af37-4afce4290685
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects the load of EvtMuteHook.dll, a key component of SharpEvtHook,
    a tool that tampers with the Windows event logs
references:
    - https://github.com/bats3c/EvtMute
falsepositives:
    - Other DLLs with the same Imphash
tags:
    - attack.defense-evasion
    - attack.t1562.002
date: '2022-09-07'
modified: '2024-11-23'
logsource:
    category: image_load
    product: windows
detection:
    selection:
        Hashes|contains: IMPHASH=330768A4F172E10ACB6287B87289D83B
    condition: selection
related:
    -   id: bedfc8ad-d1c7-4e37-a20e-e2b0dbee759c
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: '2025-12-04T01:40:33.310535+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:40:33.310535+00:00'
    detection_fields:
        -   source_field: Hashes
            target_table: process_activity
            target_field: process.file.hashes.value
            mapped_at: '2025-12-04T01:40:33.310564+00:00'
