title: HackTool - SILENTTRINITY Stager DLL Load
id: 75c505b1-711d-4f68-a357-8c3fe37dbf2d
status: test
level: high
author: Aleksey Potapov, oscd.community
description: Detects SILENTTRINITY stager dll loading activity
references:
    - https://github.com/byt3bl33d3r/SILENTTRINITY
falsepositives:
    - Unlikely
tags:
    - attack.command-and-control
    - attack.t1071
date: '2019-10-22'
modified: '2023-02-17'
logsource:
    category: image_load
    product: windows
detection:
    selection:
        Description|contains: st2stager
    condition: selection
related:
    -   id: 03552375-cc2c-4883-bbe4-7958d5a980be
        type: derived
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Description
            target_table: null
            target_field: null
            mapped_at: null
