id: 9e9a9002-56c4-40fd-9eff-e4b09bfa5f6c
title: DLL Load By System Process From Suspicious Locations
status: test
level: medium
description: Detects when a system process (i.e. located in system32, syswow64, etc.)
    loads a DLL from a suspicious location or a location with permissive permissions
    such as "C:\Users\Public"
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-07-17'
modified: '2023-09-18'
tags:
    - attack.defense-evasion
    - attack.t1070
references:
    - https://github.com/hackerhouse-opensource/iscsicpl_bypassUAC (Idea)
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection:
        Image|startswith: C:\Windows\
        ImageLoaded|startswith:
            - C:\Users\Public\
            - C:\PerfLogs\
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
