id: 828af599-4c53-4ed2-ba4a-a9f835c434ea
title: Fax Service DLL Search Order Hijack
status: test
level: high
description: The Fax service attempts to load ualapi.dll, which is non-existent. An
    attacker can then (side)load their own malicious DLL using this service.
author: NVISO
date: '2020-05-04'
modified: '2022-06-02'
tags:
    - attack.persistence
    - attack.defense-evasion
    - attack.t1574.001
    - attack.t1574.002
references:
    - https://windows-internals.com/faxing-your-way-to-system/
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection:
        Image|endswith: \fxssvc.exe
        ImageLoaded|endswith: ualapi.dll
    filter:
        ImageLoaded|startswith: C:\Windows\WinSxS\
    condition: selection and not filter
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: '2025-11-13T20:19:25.853151+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:19:25.853151+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:19:25.853162+00:00'
        -   source_field: ImageLoaded
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:19:25.853165+00:00'
