id: f9df325d-d7bc-4a32-8a1a-2cc61dcefc63
title: Third Party Software DLL Sideloading
status: test
level: medium
description: Detects DLL sideloading of DLLs that are part of third party software
    (zoom, discord....etc)
author: Nasreddine Bencherchali (Nextron Systems), Wietze Beukema (project and research)
date: '2022-08-17'
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1574.001
    - attack.t1574.002
references:
    - https://hijacklibs.net/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection_lenovo:
        ImageLoaded|endswith: \commfunc.dll
    filter_lenovo:
        ImageLoaded|contains: \AppData\local\Google\Chrome\Application\
        ImageLoaded|startswith:
            - C:\Program Files\Lenovo\Communications Utility\
            - C:\Program Files (x86)\Lenovo\Communications Utility\
    selection_toshiba:
        ImageLoaded|endswith: \tosbtkbd.dll
    filter_toshiba:
        ImageLoaded|startswith:
            - C:\Program Files\Toshiba\Bluetooth Toshiba Stack\
            - C:\Program Files (x86)\Toshiba\Bluetooth Toshiba Stack\
    condition: (selection_lenovo and not filter_lenovo) or (selection_toshiba and
        not filter_toshiba)
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
