id: db77ce78-7e28-4188-9337-cf30e2b3ba9f
title: Potential Wazuh Security Platform DLL Sideloading
status: test
level: medium
description: Detects potential DLL side loading of DLLs that are part of the Wazuh
    security platform
author: X__Junior (Nextron Systems)
date: '2023-03-13'
modified: '2023-05-12'
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1574.001
    - attack.t1574.002
references:
    - https://www.trendmicro.com/en_us/research/23/c/iron-tiger-sysupdate-adds-linux-targeting.html
falsepositives:
    - Many legitimate applications leverage this DLL. (Visual Studio, JetBrains, Ruby,
        Anaconda, GithubDesktop, etc.)
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith:
            - \libwazuhshared.dll
            - \libwinpthread-1.dll
    filter_main_generic:
        ImageLoaded|startswith:
            - C:\Program Files\
            - C:\Program Files (x86)\
    filter_optional_mingw64:
        ImageLoaded|contains:
            - \AppData\Local\
            - \ProgramData\
        ImageLoaded|endswith: \mingw64\bin\libwinpthread-1.dll
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
