id: b6188d2f-b3c4-4d2c-a17d-9706e0851af0
title: Potential Goopdate.DLL Sideloading
status: test
level: medium
description: Detects potential DLL sideloading of "goopdate.dll", a DLL used by googleupdate.exe
author: X__Junior (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: '2023-05-15'
modified: '2023-05-20'
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1574.001
    - attack.t1574.002
references:
    - https://www.ncsc.gov.uk/static-assets/documents/malware-analysis-reports/goofy-guineapig/NCSC-MAR-Goofy-Guineapig.pdf
falsepositives:
    - False positives are expected from Google Chrome installations running from user
        locations (AppData) and other custom locations. Apply additional filters accordingly.
    - Other third party chromium browsers located in AppData
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith: \goopdate.dll
    filter_main_generic:
        ImageLoaded|startswith:
            - C:\Program Files (x86)\
            - C:\Program Files\
    filter_optional_dropbox_installer_temp:
        Image|contains|all:
            - \AppData\Local\Temp\GUM
            - .tmp\Dropbox
        ImageLoaded|contains|all:
            - \AppData\Local\Temp\GUM
            - .tmp\goopdate.dll
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: '2025-11-13T20:19:31.502242+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:19:31.502242+00:00'
    detection_fields:
        -   source_field: ImageLoaded
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:19:31.502256+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:19:31.502259+00:00'
