title: PowerShell Core DLL Loaded Via Office Application
id: bb2ba6fb-95d4-4a25-89fc-30bb736c021a
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects PowerShell core DLL being loaded by an Office Product
references:
    - Internal Research
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
date: '2023-06-01'
logsource:
    category: image_load
    product: windows
detection:
    selection:
        Image|endswith:
            - \excel.exe
            - \mspub.exe
            - \outlook.exe
            - \onenote.exe
            - \onenoteim.exe
            - \powerpnt.exe
            - \winword.exe
        ImageLoaded|contains:
            - \System.Management.Automation.Dll
            - \System.Management.Automation.ni.Dll
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
