id: bdc64095-d59a-42a2-8588-71fd9c9d9abc
title: Suspicious Unsigned Dbghelp/Dbgcore DLL Loaded
status: test
level: high
description: 'Detects the load of dbghelp/dbgcore DLL (used to make memory dumps)
    by suspicious processes.

    Tools like ProcessHacker and some attacker tradecract use MiniDumpWriteDump API
    found in dbghelp.dll or dbgcore.dll.

    As an example, SilentTrynity C2 Framework has a module that leverages this API
    to dump the contents of Lsass.exe and transfer it over the network back to the
    attacker''s machine.

    '
author: Perez Diego (@darkquassar), oscd.community, Ecco
date: '2019-10-27'
modified: '2022-12-09'
tags:
    - attack.credential-access
    - attack.t1003.001
references:
    - https://learn.microsoft.com/en-us/windows/win32/api/minidumpapiset/nf-minidumpapiset-minidumpwritedump
    - https://www.pinvoke.net/default.aspx/dbghelp/MiniDumpWriteDump.html
    - https://medium.com/@fsx30/bypass-edrs-memory-protection-introduction-to-hooking-2efb21acffd6
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''0e277796-5f23-4e49-a490-483131d4f6e1''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith:
            - \dbghelp.dll
            - \dbgcore.dll
        Signed: 'false'
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Signed
            target_table: null
            target_field: null
            mapped_at: null
