title: Unsigned DLL Loaded by Windows Utility
id: b5de0c9a-6f19-43e0-af4e-55ad01f550af
status: test
level: medium
author: Swachchhanda Shrawan Poudel
description: 'Detects windows utilities loading an unsigned or untrusted DLL.

    Adversaries often abuse those programs to proxy execution of malicious code.

    '
references:
    - https://www.elastic.co/security-labs/Hunting-for-Suspicious-Windows-Libraries-for-Execution-and-Evasion
    - https://akhere.hashnode.dev/hunting-unsigned-dlls-using-kql
    - https://unit42.paloaltonetworks.com/unsigned-dlls/?web_view=true
falsepositives:
    - Unknown
tags:
    - attack.t1218.011
    - attack.t1218.010
    - attack.defense-evasion
date: '2024-02-28'
modified: '2024-03-07'
logsource:
    category: image_load
    product: windows
detection:
    selection:
        Image|endswith:
            - \InstallUtil.exe
            - \RegAsm.exe
            - \RegSvcs.exe
            - \regsvr32.exe
            - \rundll32.exe
    filter_main_signed:
        Signed: 'true'
    filter_main_sig_status:
        SignatureStatus:
            - errorChaining
            - errorCode_endpoint
            - errorExpired
            - trusted
    filter_main_signed_null:
        Signed: null
    filter_main_signed_empty:
        Signed:
            - ''
            - '-'
    filter_main_sig_status_null:
        SignatureStatus: null
    filter_main_sig_status_empty:
        SignatureStatus:
            - ''
            - '-'
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: '2025-12-04T01:40:36.005777+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:40:36.005777+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:40:36.005801+00:00'
        -   source_field: Signed
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:40:36.005803+00:00'
        -   source_field: SignatureStatus
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:40:36.005805+00:00'
