id: ec8c4047-fad9-416a-8c81-0f479353d7f6
title: Diagnostic Library Sdiageng.DLL Loaded By Msdt.EXE
status: test
level: high
description: Detects both of CVE-2022-30190 (Follina) and DogWalk vulnerabilities
    exploiting msdt.exe binary to load the "sdiageng.dll" library
author: Greg (rule)
date: '2022-06-17'
modified: '2023-02-17'
tags:
    - attack.defense-evasion
    - attack.t1202
    - cve.2022-30190
references:
    - https://www.securonix.com/blog/detecting-microsoft-msdt-dogwalk/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection:
        Image|endswith: \msdt.exe
        ImageLoaded|endswith: \sdiageng.dll
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: '2025-11-13T20:19:32.512421+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:19:32.512421+00:00'
    detection_fields:
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:19:32.512437+00:00'
        -   source_field: ImageLoaded
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:19:32.512440+00:00'
