id: 952ed57c-8f99-453d-aee0-53a49c22f95d
title: Potential AVKkid.DLL Sideloading
status: test
level: medium
description: Detects potential DLL sideloading of "AVKkid.dll"
author: X__Junior (Nextron Systems)
date: '2023-08-03'
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1574.001
    - attack.t1574.002
references:
    - https://research.checkpoint.com/2023/beyond-the-horizon-traveling-the-world-on-camaro-dragons-usb-flash-drives/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith: \AVKkid.dll
    filter_main_legit_path:
        Image|contains:
            - C:\Program Files (x86)\G DATA\
            - C:\Program Files\G DATA\
        Image|endswith: \AVKKid.exe
        ImageLoaded|startswith:
            - C:\Program Files (x86)\G DATA\
            - C:\Program Files\G DATA\
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: '2025-11-13T20:19:36.194063+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:19:36.194063+00:00'
    detection_fields:
        -   source_field: ImageLoaded
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:19:36.194073+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:19:36.194075+00:00'
