id: d2451be2-b582-4e15-8701-4196ac180260
title: Potential DLL Sideloading Of KeyScramblerIE.DLL Via KeyScrambler.EXE
status: experimental
level: high
description: 'Detects potential DLL side loading of "KeyScramblerIE.dll" by "KeyScrambler.exe".

    Various threat actors and malware have been found side loading a masqueraded "KeyScramblerIE.dll"
    through "KeyScrambler.exe".

    '
author: Swachchhanda Shrawan Poudel
date: '2024-04-15'
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1574.001
    - attack.t1574.002
references:
    - https://thehackernews.com/2024/03/two-chinese-apt-groups-ramp-up-cyber.html
    - https://csirt-cti.net/2024/02/01/stately-taurus-continued-new-information-on-cyberespionage-attacks-against-myanmar-military-junta/
    - https://bazaar.abuse.ch/sample/5cb9876681f78d3ee8a01a5aaa5d38b05ec81edc48b09e3865b75c49a2187831/
    - https://twitter.com/Max_Mal_/status/1775222576639291859
    - https://twitter.com/DTCERT/status/1712785426895839339
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''ca5583e9-8f80-46ac-ab91-7f314d13b984''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection:
        Image|endswith:
            - \KeyScrambler.exe
            - \KeyScramblerLogon.exe
        ImageLoaded|endswith: \KeyScramblerIE.dll
    filter_main_legitimate_path:
        Image|contains:
            - C:\Program Files (x86)\KeyScrambler\
            - C:\Program Files\KeyScrambler\
        ImageLoaded|contains:
            - C:\Program Files (x86)\KeyScrambler\
            - C:\Program Files\KeyScrambler\
    filter_main_signature:
        Signature: QFX Software Corporation
        SignatureStatus: Valid
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: '2025-11-13T20:19:31.497363+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:19:31.497363+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:19:31.497381+00:00'
        -   source_field: ImageLoaded
            target_table: process_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:19:31.497383+00:00'
        -   source_field: Signature
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:19:31.497385+00:00'
        -   source_field: SignatureStatus
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:19:31.497387+00:00'
