id: 0e0bc253-07ed-43f1-816d-e1b220fe8971
title: Potential RjvPlatform.DLL Sideloading From Non-Default Location
status: test
level: high
description: Detects potential DLL sideloading of "RjvPlatform.dll" by "SystemResetPlatform.exe"
    located in a non-default location.
author: X__Junior (Nextron Systems)
date: '2023-06-09'
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1574.001
    - attack.t1574.002
references:
    - https://twitter.com/0gtweet/status/1666716511988330499
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith: \RjvPlatform.dll
        Image: \SystemResetPlatform.exe
    filter_main_legit_path:
        Image|startswith: C:\Windows\System32\SystemResetPlatform\
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: '2025-11-13T20:19:25.871978+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:19:25.871978+00:00'
    detection_fields:
        -   source_field: ImageLoaded
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:19:25.871985+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:19:25.871987+00:00'
