title: DLL Sideloading Of ShellChromeAPI.DLL
id: ee4c5d06-3abc-48cc-8885-77f1c20f4451
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: 'Detects processes loading the non-existent DLL "ShellChromeAPI". One
    known example is the "DeviceEnroller" binary in combination with the "PhoneDeepLink"
    flag tries to load this DLL.

    Adversaries can drop their own renamed DLL and execute it via DeviceEnroller.exe
    using this parameter

    '
references:
    - https://mobile.twitter.com/0gtweet/status/1564131230941122561
    - https://strontic.github.io/xcyclopedia/library/DeviceEnroller.exe-24BEF0D6B0ECED36BB41831759FDE18D.html
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1574.001
    - attack.t1574.002
date: '2022-12-01'
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith: \ShellChromeAPI.dll
    condition: selection
related:
    -   id: e173ad47-4388-4012-ae62-bd13f71c18a8
        type: similar
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
