id: caa02837-f659-466f-bca6-48bde2826ab4
title: Potential DLL Sideloading Via ClassicExplorer32.dll
status: test
level: medium
description: Detects potential DLL sideloading using ClassicExplorer32.dll from the
    Classic Shell software
author: frack113
date: '2022-12-13'
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1574.001
    - attack.t1574.002
references:
    - https://blogs.blackberry.com/en/2022/12/mustang-panda-uses-the-russian-ukrainian-war-to-attack-europe-and-asia-pacific-targets
    - https://app.any.run/tasks/6d8cabb0-dcda-44b6-8050-28d6ce281687/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection_classicexplorer:
        ImageLoaded|endswith: \ClassicExplorer32.dll
    filter_classicexplorer:
        ImageLoaded|startswith: C:\Program Files\Classic Shell\
    condition: selection_classicexplorer and not filter_classicexplorer
ocsf_mapping:
    class_name: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
