id: b439f47d-ef52-4b29-9a2f-57d8a96cb6b8
title: WMI ActiveScriptEventConsumers Activity Via Scrcons.EXE DLL Load
status: test
level: medium
description: Detects signs of the WMI script host process "scrcons.exe" loading scripting
    DLLs which could indicates WMI ActiveScriptEventConsumers EventConsumers activity.
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: '2020-09-02'
modified: '2023-02-22'
tags:
    - attack.lateral-movement
    - attack.privilege-escalation
    - attack.persistence
    - attack.t1546.003
references:
    - https://twitter.com/HunterPlaybook/status/1301207718355759107
    - https://www.mdsec.co.uk/2020/09/i-like-to-move-it-windows-lateral-movement-part-1-wmi-event-subscription/
    - https://threathunterplaybook.com/hunts/windows/200902-RemoteWMIActiveScriptEventConsumers/notebook.html
falsepositives:
    - Legitimate event consumers
    - Dell computers on some versions register an event consumer that is known to
        cause false positives when brightness is changed by the corresponding keyboard
        button
taxonomy: sigma
logsource:
    category: image_load
    product: windows
detection:
    selection:
        Image|endswith: \scrcons.exe
        ImageLoaded|endswith:
            - \vbscript.dll
            - \wbemdisp.dll
            - \wshom.ocx
            - \scrrun.dll
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
