title: VMMap Unsigned Dbghelp.DLL Potential Sideloading
id: 273a8dd8-3742-4302-bcc7-7df5a80fe425
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects potential DLL sideloading of an unsigned dbghelp.dll by the Sysinternals
    VMMap.
references:
    - https://techcommunity.microsoft.com/t5/sysinternals-blog/zoomit-v7-1-procdump-2-0-for-linux-process-explorer-v17-05/ba-p/3884766
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1574.001
    - attack.t1574.002
date: '2023-07-28'
modified: '2023-09-05'
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|contains: C:\Debuggers\dbghelp.dll
        Image|endswith:
            - \vmmap.exe
            - \vmmap64.exe
    filter_main_signed:
        Signed: 'true'
    condition: selection and not 1 of filter_main_*
related:
    -   id: 98ffaed4-aec2-4e04-9b07-31492fe68b3d
        type: similar
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Signed
            target_table: null
            target_field: null
            mapped_at: null
