title: Abusable DLL Potential Sideloading From Suspicious Location
id: 799a5f48-0ac1-4e0f-9152-71d137d48c2a
status: test
level: high
author: X__Junior (Nextron Systems)
description: Detects potential DLL sideloading of DLLs that are known to be abused
    from suspicious locations
references:
    - https://www.trendmicro.com/en_us/research/23/f/behind-the-scenes-unveiling-the-hidden-workings-of-earth-preta.html
    - https://research.checkpoint.com/2023/beyond-the-horizon-traveling-the-world-on-camaro-dragons-usb-flash-drives/
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1059
date: '2023-07-11'
logsource:
    category: image_load
    product: windows
detection:
    selection_dll:
        ImageLoaded|endswith:
            - \coreclr.dll
            - \facesdk.dll
            - \HPCustPartUI.dll
            - \libcef.dll
            - \ZIPDLL.dll
    selection_folders_1:
        ImageLoaded|contains:
            - :\Perflogs\
            - :\Users\Public\
            - \Temporary Internet
            - \Windows\Temp\
    selection_folders_2:
        ImageLoaded|contains|all:
            - :\Users\
            - \Favorites\
            - :\Users\
            - \Favourites\
            - :\Users\
            - \Contacts\
            - :\Users\
            - \Pictures\
    condition: selection_dll and 1 of selection_folders_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
