title: Potential Chrome Frame Helper DLL Sideloading
id: 72ca7c75-bf85-45cd-aca7-255d360e423c
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems), Wietze Beukema (project and research)
description: Detects potential DLL sideloading of "chrome_frame_helper.dll"
references:
    - https://hijacklibs.net/entries/3rd_party/google/chrome_frame_helper.html
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1574.001
    - attack.t1574.002
date: '2022-08-17'
modified: '2023-05-15'
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith: \chrome_frame_helper.dll
    filter_main_path:
        ImageLoaded|startswith:
            - C:\Program Files\Google\Chrome\Application\
            - C:\Program Files (x86)\Google\Chrome\Application\
    filter_optional_user_path:
        ImageLoaded|contains: \AppData\local\Google\Chrome\Application\
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: image_load
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: ImageLoaded
            target_table: null
            target_field: null
            mapped_at: null
