title: Kubernetes CronJob/Job Modification
id: 0c9b3bda-41a6-4442-9345-356ae86343dc
status: experimental
level: medium
author: kelnage
description: 'Detects when a Kubernetes CronJob or Job is created or modified.

    A Kubernetes Job creates one or more pods to accomplish a specific task, and a
    CronJob creates Jobs on a recurring schedule.

    An adversary can take advantage of this Kubernetes object to schedule Jobs to
    run containers that execute malicious code within a cluster, allowing them to
    achieve persistence.

    '
references:
    - https://kubernetes.io/docs/reference/config-api/apiserver-audit.v1/
    - https://www.redhat.com/en/blog/protecting-kubernetes-against-mitre-attck-persistence#technique-33-kubernetes-cronjob
falsepositives:
    - Modifying a Kubernetes Job or CronJob may need to be done by a system administrator.
    - Automated processes may need to take these actions and may need to be filtered.
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.execution
date: '2024-07-11'
logsource:
    product: kubernetes
    service: audit
detection:
    selection:
        objectRef.apiGroup: batch
        objectRef.resource:
            - cronjobs
            - jobs
        verb:
            - create
            - delete
            - patch
            - replace
            - update
    condition: selection
related:
    -   id: cd3a808c-c7b7-4c50-a2f3-f4cfcd436435
        type: similar
ocsf_mapping:
    class_name: scheduled_job_activity
    activity_id: 2
    logsource:
        product:
            source_field: product
            source_value: kubernetes
            mapped_at: '2025-12-04T01:39:58.999828+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-12-04T01:39:58.999828+00:00'
    detection_fields:
        -   source_field: objectRef.apiGroup
            target_table: scheduled_job_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:39:58.999842+00:00'
        -   source_field: objectRef.resource
            target_table: scheduled_job_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:39:58.999844+00:00'
        -   source_field: verb
            target_table: scheduled_job_activity
            target_field: action
            mapped_at: '2025-12-04T01:39:58.999845+00:00'
