id: 40967487-139b-4811-81d9-c9767a92aa5a
title: Deployment Deleted From Kubernetes Cluster
status: experimental
level: low
description: 'Detects the removal of a deployment from a Kubernetes cluster.

    This could indicate disruptive activity aiming to impact business operations.

    '
author: Leo Tsaousis (@laripping)
date: '2024-03-26'
tags:
    - attack.t1498
references:
    - https://microsoft.github.io/Threat-Matrix-for-Kubernetes/techniques/Data%20destruction/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: application
    product: kubernetes
    service: audit
detection:
    selection:
        verb: delete
        objectRef.resource: deployments
    condition: selection
ocsf_mapping:
    class_name: api_activity
    logsource:
        category:
            source_field: category
            source_value: application
            mapped_at: '2025-11-13T20:18:39.641629+00:00'
        product:
            source_field: product
            source_value: kubernetes
            mapped_at: '2025-11-13T20:18:39.641629+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-11-13T20:18:39.641629+00:00'
    detection_fields:
        -   source_field: verb
            target_table: api_activity
            target_field: action
            mapped_at: '2025-11-13T20:18:39.641657+00:00'
        -   source_field: objectRef.resource
            target_table: api_activity
            target_field: job.name
            mapped_at: '2025-11-13T20:18:39.641660+00:00'
