id: 3132570d-cab2-4561-9ea6-1743644b2290
title: Kubernetes Events Deleted
status: experimental
level: medium
description: 'Detects when events are deleted in Kubernetes.

    An adversary may delete Kubernetes events in an attempt to evade detection.

    '
author: Leo Tsaousis (@laripping)
date: '2024-03-26'
tags:
    - attack.t1070
references:
    - https://microsoft.github.io/Threat-Matrix-for-Kubernetes/techniques/Delete%20K8S%20events/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''225d8b09-e714-479c-a0e4-55e6f29adf35''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: application
    product: kubernetes
    service: audit
detection:
    selection:
        verb: delete
        objectRef.resource: events
    condition: selection
ocsf_mapping:
    class_name: api_activity
    activity_id: 4
    logsource:
        category:
            source_field: category
            source_value: application
            mapped_at: '2025-11-26T02:23:43.950480+00:00'
        product:
            source_field: product
            source_value: kubernetes
            mapped_at: '2025-11-26T02:23:43.950480+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-11-26T02:23:43.950480+00:00'
    detection_fields:
        -   source_field: verb
            target_table: api_activity
            target_field: api.operation
            mapped_at: '2025-11-26T02:23:43.950494+00:00'
        -   source_field: objectRef.resource
            target_table: api_activity
            target_field: resources.name
            mapped_at: '2025-11-26T02:23:43.950495+00:00'
