title: Kubernetes Secrets Modified or Deleted
id: 58d31a75-a4f8-4c40-985b-373d58162ca2
status: experimental
level: medium
author: kelnage
description: 'Detects when Kubernetes Secrets are Modified or Deleted.

    '
references:
    - https://kubernetes.io/docs/reference/config-api/apiserver-audit.v1/
    - https://commandk.dev/blog/guide-to-audit-k8s-secrets-for-compliance/
falsepositives:
    - Secrets being modified or deleted may be performed by a system administrator.
    - Automated processes may need to take these actions and may need to be filtered.
tags:
    - attack.credential-access
date: '2024-07-11'
logsource:
    product: kubernetes
    service: audit
detection:
    selection:
        objectRef.resource: secrets
        verb:
            - create
            - delete
            - patch
            - replace
            - update
    condition: selection
related:
    -   id: 2f0bae2d-bf20-4465-be86-1311addebaa3
        type: similar
ocsf_mapping:
    class_name: api_activity
    activity_id: 3
    logsource:
        product:
            source_field: product
            source_value: kubernetes
            mapped_at: '2025-12-04T01:40:03.161843+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-12-04T01:40:03.161843+00:00'
    detection_fields:
        -   source_field: objectRef.resource
            target_table: api_activity
            target_field: resources.name
            mapped_at: '2025-12-04T01:40:03.161859+00:00'
        -   source_field: verb
            target_table: api_activity
            target_field: api.operation
            mapped_at: '2025-12-04T01:40:03.161861+00:00'
