title: Kubernetes Unauthorized or Unauthenticated Access
id: 0d933542-1f1f-420d-97d4-21b2c3c492d9
status: experimental
level: low
author: kelnage
description: 'Detects when a request to the Kubernetes API is rejected due to lack
    of authorization or due to an expired authentication token being used.

    This may indicate an attacker attempting to leverage credentials they have obtained.

    '
references:
    - https://kubernetes.io/docs/reference/config-api/apiserver-audit.v1/
    - https://www.datadoghq.com/blog/monitor-kubernetes-audit-logs/#monitor-api-authentication-issues
falsepositives:
    - A misconfigured RBAC policy, a mistake by a valid user, or a wider issue with
        authentication tokens can also generate these errors.
tags:
    - attack.privilege-escalation
date: '2024-04-12'
logsource:
    product: kubernetes
    service: audit
detection:
    selection:
        responseStatus.code:
            - 401
            - 403
    condition: selection
ocsf_mapping:
    class_name: user_access
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: kubernetes
            mapped_at: '2025-12-04T01:40:04.057596+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-12-04T01:40:04.057596+00:00'
    detection_fields:
        -   source_field: responseStatus.code
            target_table: user_access
            target_field: api.response.code
            mapped_at: '2025-12-04T01:40:04.057626+00:00'
