title: RBAC Permission Enumeration Attempt
id: 84b777bd-c946-4d17-aa2e-c39f5a454325
status: experimental
level: low
author: Leo Tsaousis (@laripping)
description: 'Detects identities attempting to enumerate their Kubernetes RBAC permissions.

    In the early stages of a breach, attackers will aim to list the permissions they
    have within the compromised environment.

    In a Kubernetes cluster, this can be achieved by interacting with the API server,
    and querying the SelfSubjectAccessReview API via e.g. a "kubectl auth can-i --list"
    command.

    This will enumerate the Role-Based Access Controls (RBAC) rules defining the compromised
    user''s authorization.

    '
references:
    - https://www.elastic.co/guide/en/security/current/kubernetes-suspicious-self-subject-review.html
falsepositives:
    - Unknown
tags:
    - attack.t1069.003
    - attack.t1087.004
date: '2024-03-26'
logsource:
    category: application
    product: kubernetes
    service: audit
detection:
    selection:
        verb: create
        apiGroup: authorization.k8s.io
        objectRef.resource: selfsubjectrulesreviews
    condition: selection
ocsf_mapping:
    class_name: api_activity
    activity_id: 2
    logsource:
        category:
            source_field: category
            source_value: application
            mapped_at: '2025-12-04T01:40:02.704018+00:00'
        product:
            source_field: product
            source_value: kubernetes
            mapped_at: '2025-12-04T01:40:02.704018+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-12-04T01:40:02.704018+00:00'
    detection_fields:
        -   source_field: verb
            target_table: api_activity
            target_field: api.operation
            mapped_at: '2025-12-04T01:40:02.704031+00:00'
        -   source_field: apiGroup
            target_table: api_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:40:02.704033+00:00'
        -   source_field: objectRef.resource
            target_table: api_activity
            target_field: resources.name
            mapped_at: '2025-12-04T01:40:02.704035+00:00'
