title: Kubernetes Secrets Enumeration
id: eeb3e9e1-b685-44e4-9232-6bb701f925b5
status: experimental
level: low
author: Leo Tsaousis (@laripping)
description: Detects enumeration of Kubernetes secrets.
references:
    - https://microsoft.github.io/Threat-Matrix-for-Kubernetes/techniques/List%20K8S%20secrets/
falsepositives:
    - The Kubernetes dashboard occasionally accesses the kubernetes-dashboard-key-holder
        secret
tags:
    - attack.t1552.007
date: '2024-03-26'
logsource:
    category: application
    product: kubernetes
    service: audit
detection:
    selection:
        verb: list
        objectRef.resource: secrets
    condition: selection
related:
    -   id: 7ee0b4aa-d8d4-4088-b661-20efdf41a04c
        type: derived
ocsf_mapping:
    class_name: api_activity
    activity_id: 2
    logsource:
        category:
            source_field: category
            source_value: application
            mapped_at: '2025-12-04T01:40:00.392379+00:00'
        product:
            source_field: product
            source_value: kubernetes
            mapped_at: '2025-12-04T01:40:00.392379+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-12-04T01:40:00.392379+00:00'
    detection_fields:
        -   source_field: verb
            target_table: api_activity
            target_field: api.operation
            mapped_at: '2025-12-04T01:40:00.392391+00:00'
        -   source_field: objectRef.resource
            target_table: api_activity
            target_field: resources.name
            mapped_at: '2025-12-04T01:40:00.392393+00:00'
