id: eeb3e9e1-b685-44e4-9232-6bb701f925b5
title: Kubernetes Secrets Enumeration
status: experimental
level: low
description: Detects enumeration of Kubernetes secrets.
author: Leo Tsaousis (@laripping)
date: '2024-03-26'
tags:
    - attack.t1552.007
references:
    - https://microsoft.github.io/Threat-Matrix-for-Kubernetes/techniques/List%20K8S%20secrets/
falsepositives:
    - The Kubernetes dashboard occasionally accesses the kubernetes-dashboard-key-holder
        secret
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''7ee0b4aa-d8d4-4088-b661-20efdf41a04c''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: application
    product: kubernetes
    service: audit
detection:
    selection:
        verb: list
        objectRef.resource: secrets
    condition: selection
ocsf_mapping:
    class_name: api_activity
    activity_id: 2
    logsource:
        category:
            source_field: category
            source_value: application
            mapped_at: '2025-11-26T02:23:40.490397+00:00'
        product:
            source_field: product
            source_value: kubernetes
            mapped_at: '2025-11-26T02:23:40.490397+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-11-26T02:23:40.490397+00:00'
    detection_fields:
        -   source_field: verb
            target_table: api_activity
            target_field: api.operation
            mapped_at: '2025-11-26T02:23:40.490457+00:00'
        -   source_field: objectRef.resource
            target_table: api_activity
            target_field: resources.name
            mapped_at: '2025-11-26T02:23:40.490461+00:00'
