title: New Kubernetes Service Account Created
id: e31bae15-83ed-473e-bf31-faf4f8a17d36
status: experimental
level: low
author: Leo Tsaousis (@laripping)
description: 'Detects creation of new Kubernetes service account, which could indicate
    an attacker''s attempt to persist within a cluster.

    '
references:
    - https://microsoft.github.io/Threat-Matrix-for-Kubernetes/techniques/container%20service%20account/
falsepositives:
    - Unknown
tags:
    - attack.t1136
date: '2024-03-26'
logsource:
    category: application
    product: kubernetes
    service: audit
detection:
    selection:
        verb: create
        objectRef.resource: serviceaccounts
    condition: selection
related:
    -   id: 12d027c3-b48c-4d9d-8bb6-a732200034b2
        type: derived
ocsf_mapping:
    class_name: api_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: application
            mapped_at: '2025-12-04T01:40:04.602364+00:00'
        product:
            source_field: product
            source_value: kubernetes
            mapped_at: '2025-12-04T01:40:04.602364+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-12-04T01:40:04.602364+00:00'
    detection_fields:
        -   source_field: verb
            target_table: api_activity
            target_field: api.operation
            mapped_at: '2025-12-04T01:40:04.602376+00:00'
        -   source_field: objectRef.resource
            target_table: api_activity
            target_field: resources.name
            mapped_at: '2025-12-04T01:40:04.602378+00:00'
