title: Kubernetes Admission Controller Modification
id: eed82177-38f5-4299-8a76-098d50d225ab
status: experimental
level: medium
author: kelnage
description: 'Detects when a modification (create, update or replace) action is taken
    that affects mutating or validating webhook configurations, as they can be used
    by an adversary to achieve persistence or exfiltrate access credentials.

    '
references:
    - https://kubernetes.io/docs/reference/config-api/apiserver-audit.v1/
    - https://security.padok.fr/en/blog/kubernetes-webhook-attackers
falsepositives:
    - Modifying the Kubernetes Admission Controller may need to be done by a system
        administrator.
    - Automated processes may need to take these actions and may need to be filtered.
tags:
    - attack.persistence
    - attack.t1078
    - attack.credential-access
    - attack.t1552
    - attack.t1552.007
date: '2024-07-11'
logsource:
    product: kubernetes
    service: audit
detection:
    selection:
        objectRef.apiGroup: admissionregistration.k8s.io
        objectRef.resource:
            - mutatingwebhookconfigurations
            - validatingwebhookconfigurations
        verb:
            - create
            - delete
            - patch
            - replace
            - update
    condition: selection
related:
    -   id: 6ad91e31-53df-4826-bd27-0166171c8040
        type: similar
ocsf_mapping:
    class_name: scheduled_job_activity
    activity_id: 3
    logsource:
        product:
            source_field: product
            source_value: kubernetes
            mapped_at: '2025-12-04T01:40:03.658970+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-12-04T01:40:03.658970+00:00'
    detection_fields:
        -   source_field: objectRef.apiGroup
            target_table: scheduled_job_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:40:03.659014+00:00'
        -   source_field: objectRef.resource
            target_table: scheduled_job_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:40:03.659019+00:00'
        -   source_field: verb
            target_table: scheduled_job_activity
            target_field: action
            mapped_at: '2025-12-04T01:40:03.659023+00:00'
