title: Kubernetes Events Deleted
id: 3132570d-cab2-4561-9ea6-1743644b2290
status: experimental
level: medium
author: Leo Tsaousis (@laripping)
description: 'Detects when events are deleted in Kubernetes.

    An adversary may delete Kubernetes events in an attempt to evade detection.

    '
references:
    - https://microsoft.github.io/Threat-Matrix-for-Kubernetes/techniques/Delete%20K8S%20events/
falsepositives:
    - Unknown
tags:
    - attack.t1070
date: '2024-03-26'
logsource:
    category: application
    product: kubernetes
    service: audit
detection:
    selection:
        verb: delete
        objectRef.resource: events
    condition: selection
related:
    -   id: 225d8b09-e714-479c-a0e4-55e6f29adf35
        type: derived
ocsf_mapping:
    class_name: api_activity
    activity_id: 4
    logsource:
        category:
            source_field: category
            source_value: application
            mapped_at: '2025-12-04T01:40:01.376354+00:00'
        product:
            source_field: product
            source_value: kubernetes
            mapped_at: '2025-12-04T01:40:01.376354+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-12-04T01:40:01.376354+00:00'
    detection_fields:
        -   source_field: verb
            target_table: api_activity
            target_field: api.operation
            mapped_at: '2025-12-04T01:40:01.376371+00:00'
        -   source_field: objectRef.resource
            target_table: api_activity
            target_field: resources.name
            mapped_at: '2025-12-04T01:40:01.376373+00:00'
