id: 0c9b3bda-41a6-4442-9345-356ae86343dc
title: Kubernetes CronJob/Job Modification
status: experimental
level: medium
description: 'Detects when a Kubernetes CronJob or Job is created or modified.

    A Kubernetes Job creates one or more pods to accomplish a specific task, and a
    CronJob creates Jobs on a recurring schedule.

    An adversary can take advantage of this Kubernetes object to schedule Jobs to
    run containers that execute malicious code within a cluster, allowing them to
    achieve persistence.

    '
author: kelnage
date: '2024-07-11'
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.execution
references:
    - https://kubernetes.io/docs/reference/config-api/apiserver-audit.v1/
    - https://www.redhat.com/en/blog/protecting-kubernetes-against-mitre-attck-persistence#technique-33-kubernetes-cronjob
falsepositives:
    - Modifying a Kubernetes Job or CronJob may need to be done by a system administrator.
    - Automated processes may need to take these actions and may need to be filtered.
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''cd3a808c-c7b7-4c50-a2f3-f4cfcd436435''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    product: kubernetes
    service: audit
detection:
    selection:
        objectRef.apiGroup: batch
        objectRef.resource:
            - cronjobs
            - jobs
        verb:
            - create
            - delete
            - patch
            - replace
            - update
    condition: selection
ocsf_mapping:
    class_name: scheduled_job_activity
    logsource:
        product:
            source_field: product
            source_value: kubernetes
            mapped_at: '2025-11-13T20:18:25.688154+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-11-13T20:18:25.688154+00:00'
    detection_fields:
        -   source_field: objectRef.apiGroup
            target_table: scheduled_job_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:18:27.537287+00:00'
        -   source_field: objectRef.resource
            target_table: scheduled_job_activity
            target_field: job.name
            mapped_at: '2025-11-13T20:18:27.537304+00:00'
        -   source_field: verb
            target_table: scheduled_job_activity
            target_field: action
            mapped_at: '2025-11-13T20:18:27.537308+00:00'
