id: c5cd1b20-36bb-488d-8c05-486be3d0cb97
title: Privileged Container Deployed
status: experimental
level: low
description: 'Detects the creation of a "privileged" container, an action which could
    be indicative of a threat actor mounting a container breakout attacks.

    A privileged container is a container that can access the host with all of the
    root capabilities of the host machine. This allows it to view, interact and modify
    processes, network operations, IPC calls, the file system, mount points, SELinux
    configurations etc. as the root user on the host.

    Various versions of "privileged" containers can be specified, e.g. by setting
    the securityContext.privileged flag in the resource specification, setting non-standard
    Linux capabilities, or configuring the hostNetwork/hostPID fields

    '
author: Leo Tsaousis (@laripping)
date: '2024-03-26'
tags:
    - attack.t1611
references:
    - https://microsoft.github.io/Threat-Matrix-for-Kubernetes/techniques/Privileged%20container/
    - https://docs.aws.amazon.com/guardduty/latest/ug/guardduty_finding-types-kubernetes.html#privilegeescalation-kubernetes-privilegedcontainer
    - https://www.elastic.co/guide/en/security/current/kubernetes-pod-created-with-hostnetwork.html
    - https://www.elastic.co/guide/en/security/current/kubernetes-container-created-with-excessive-linux-capabilities.html
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: application
    product: kubernetes
    service: audit
detection:
    selection:
        verb: create
        objectRef.resource: pods
        capabilities: '*'
    condition: selection
ocsf_mapping:
    class_name: api_activity
    logsource:
        category:
            source_field: category
            source_value: application
            mapped_at: '2025-11-13T20:18:34.895355+00:00'
        product:
            source_field: product
            source_value: kubernetes
            mapped_at: '2025-11-13T20:18:34.895355+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-11-13T20:18:34.895355+00:00'
    detection_fields:
        -   source_field: verb
            target_table: api_activity
            target_field: action
            mapped_at: '2025-11-13T20:18:35.669234+00:00'
        -   source_field: objectRef.resource
            target_table: api_activity
            target_field: job.name
            mapped_at: '2025-11-13T20:18:35.669253+00:00'
        -   source_field: capabilities
            target_table: api_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:18:35.669257+00:00'
