id: 0d933542-1f1f-420d-97d4-21b2c3c492d9
title: Kubernetes Unauthorized or Unauthenticated Access
status: experimental
level: low
description: 'Detects when a request to the Kubernetes API is rejected due to lack
    of authorization or due to an expired authentication token being used.

    This may indicate an attacker attempting to leverage credentials they have obtained.

    '
author: kelnage
date: '2024-04-12'
tags:
    - attack.privilege-escalation
references:
    - https://kubernetes.io/docs/reference/config-api/apiserver-audit.v1/
    - https://www.datadoghq.com/blog/monitor-kubernetes-audit-logs/#monitor-api-authentication-issues
falsepositives:
    - A misconfigured RBAC policy, a mistake by a valid user, or a wider issue with
        authentication tokens can also generate these errors.
taxonomy: sigma
logsource:
    product: kubernetes
    service: audit
detection:
    selection:
        responseStatus.code:
            - 401
            - 403
    condition: selection
ocsf_mapping:
    class_name: authentication
    logsource:
        product:
            source_field: product
            source_value: kubernetes
            mapped_at: '2025-11-13T20:18:38.677331+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-11-13T20:18:38.677331+00:00'
    detection_fields:
        -   source_field: responseStatus.code
            target_table: authentication
            target_field: status_code
            mapped_at: '2025-11-13T20:18:39.633359+00:00'
