id: 53059bc0-1472-438b-956a-7508a94a91f0
title: Disable System Firewall
status: test
level: high
description: Detects disabling of system firewalls which could be used by adversaries
    to bypass controls that limit usage of the network.
author: Pawel Mazur
date: '2022-01-22'
tags:
    - attack.t1562.004
    - attack.defense-evasion
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.004/T1562.004.md
    - https://firewalld.org/documentation/man-pages/firewall-cmd.html
falsepositives:
    - Admin activity
taxonomy: sigma
logsource:
    product: linux
    service: auditd
detection:
    selection:
        type: SERVICE_STOP
        unit:
            - firewalld
            - iptables
            - ufw
    condition: selection
ocsf_mapping:
    class_name: network_activity
    logsource:
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-13T20:15:37.052930+00:00'
        service:
            source_field: service
            source_value: auditd
            mapped_at: '2025-11-13T20:15:37.052930+00:00'
    detection_fields:
        -   source_field: type
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:15:37.737851+00:00'
        -   source_field: unit
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:15:37.737868+00:00'
