id: 45810b50-7edc-42ca-813b-bdac02fb946b
title: Steganography Hide Zip Information in Picture File
status: test
level: low
description: Detects appending of zip file to image
author: Pawel Mazur
date: '2021-09-09'
modified: '2022-10-09'
tags:
    - attack.defense-evasion
    - attack.t1027.003
references:
    - https://zerotoroot.me/steganography-hiding-a-zip-in-a-jpeg-file/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: linux
    service: auditd
detection:
    commands:
        type: EXECVE
        a0: cat
    a1:
        a1|endswith:
            - .jpg
            - .png
    a2:
        a2|endswith: .zip
    condition: commands and a1 and a2
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-26T02:16:28.708445+00:00'
        service:
            source_field: service
            source_value: auditd
            mapped_at: '2025-11-26T02:16:28.708445+00:00'
    detection_fields:
        -   source_field: type
            target_table: process_activity
            target_field: action
            mapped_at: '2025-11-26T02:16:28.708465+00:00'
        -   source_field: a0
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:16:28.708468+00:00'
        -   source_field: a1
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:16:28.708470+00:00'
        -   source_field: a2
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:16:28.708472+00:00'
