title: Data Compressed
id: a3b5e3e9-1b49-4119-8b8e-0344a01f21ee
status: test
level: low
author: Timur Zinniatullin, oscd.community
description: An adversary may compress data (e.g., sensitive documents) that is collected
    prior to exfiltration in order to make it portable and minimize the amount of
    data sent over the network.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/a78b9ed805ab9ea2e422e1aa7741e9407d82d7b1/atomics/T1560.001/T1560.001.md
falsepositives:
    - Legitimate use of archiving tools by legitimate user.
tags:
    - attack.exfiltration
    - attack.t1560.001
date: '2019-10-21'
modified: '2023-07-28'
logsource:
    product: linux
    service: auditd
detection:
    selection1:
        type: execve
        a0: zip
    selection2:
        type: execve
        a0: gzip
        a1: -k
    selection3:
        type: execve
        a0: tar
        a1|contains: -c
    condition: 1 of selection*
ocsf_mapping:
    class_name: file_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:35:30.587801+00:00'
        service:
            source_field: service
            source_value: auditd
            mapped_at: '2025-12-04T01:35:30.587801+00:00'
    detection_fields:
        -   source_field: type
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:35:30.587818+00:00'
        -   source_field: a0
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:35:30.587820+00:00'
        -   source_field: a1
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:35:30.587821+00:00'
