id: a5a827d9-1bbe-4952-9293-c59d897eb41b
title: Steganography Extract Files with Steghide
status: test
level: low
description: Detects extraction of files with usage of steghide binary, the adversaries
    may use this technique to prevent the detection of hidden information.
author: Pawel Mazur
date: '2021-09-11'
modified: '2022-10-09'
tags:
    - attack.defense-evasion
    - attack.t1027.003
references:
    - https://vitux.com/how-to-hide-confidential-files-in-images-on-debian-using-steganography/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: linux
    service: auditd
detection:
    selection:
        type: EXECVE
        a0: steghide
        a1: extract
        a2: -sf
        a3|endswith:
            - .jpg
            - .png
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-26T02:16:13.324249+00:00'
        service:
            source_field: service
            source_value: auditd
            mapped_at: '2025-11-26T02:16:13.324249+00:00'
    detection_fields:
        -   source_field: type
            target_table: process_activity
            target_field: action
            mapped_at: '2025-11-26T02:16:13.324268+00:00'
        -   source_field: a0
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:16:13.324270+00:00'
        -   source_field: a1
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:16:13.324272+00:00'
        -   source_field: a2
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:16:13.324274+00:00'
        -   source_field: a3
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:16:13.324276+00:00'
