id: edd595d7-7895-4fa7-acb3-85a18a8772ca
title: Steganography Unzip Hidden Information From Picture File
status: test
level: low
description: Detects extracting of zip file from image file
author: Pawel Mazur
date: '2021-09-09'
modified: '2022-10-09'
tags:
    - attack.defense-evasion
    - attack.t1027.003
references:
    - https://zerotoroot.me/steganography-hiding-a-zip-in-a-jpeg-file/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: linux
    service: auditd
detection:
    commands:
        type: EXECVE
        a0: unzip
    a1:
        a1|endswith:
            - .jpg
            - .png
    condition: commands and a1
ocsf_mapping:
    class_name: file_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-26T02:16:30.007446+00:00'
        service:
            source_field: service
            source_value: auditd
            mapped_at: '2025-11-26T02:16:30.007446+00:00'
    detection_fields:
        -   source_field: type
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:16:30.007460+00:00'
        -   source_field: a0
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:16:30.007462+00:00'
        -   source_field: a1
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:16:30.007463+00:00'
