id: dbe4b9c5-c254-4258-9688-d6af0b7967fd
title: Screen Capture with Import Tool
status: test
level: low
description: 'Detects adversary creating screen capture of a desktop with Import Tool.

    Highly recommended using rule on servers, due to high usage of screenshot utilities
    on user workstations.

    ImageMagick must be installed.

    '
author: Pawel Mazur
date: '2021-09-21'
modified: '2022-10-09'
tags:
    - attack.collection
    - attack.t1113
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1113/T1113.md
    - https://linux.die.net/man/1/import
    - https://imagemagick.org/
falsepositives:
    - Legitimate use of screenshot utility
taxonomy: sigma
logsource:
    product: linux
    service: auditd
detection:
    import:
        type: EXECVE
        a0: import
    import_window_root:
        a1: -window
        a2: root
        a3|endswith:
            - .png
            - .jpg
            - .jpeg
    import_no_window_root:
        a1|endswith:
            - .png
            - .jpg
            - .jpeg
    condition: import and (import_window_root or import_no_window_root)
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-13T20:15:27.352458+00:00'
        service:
            source_field: service
            source_value: auditd
            mapped_at: '2025-11-13T20:15:27.352458+00:00'
    detection_fields:
        -   source_field: type
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:15:27.352471+00:00'
        -   source_field: a0
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:15:27.352475+00:00'
        -   source_field: a1
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:15:27.352477+00:00'
        -   source_field: a2
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:15:27.352489+00:00'
        -   source_field: a3
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:15:27.352492+00:00'
