id: 9a0d8ca0-2385-4020-b6c6-cb6153ca56f3
title: System Owner or User Discovery - Linux
status: test
level: low
description: 'Detects the execution of host or user discovery utilities such as "whoami",
    "hostname", "id", etc.

    Adversaries may use the information from System Owner/User Discovery during automated
    discovery to shape follow-on behaviors, including whether or not the adversary
    fully infects the target and/or attempts specific actions.

    '
author: Timur Zinniatullin, oscd.community
date: '2019-10-21'
modified: '2024-11-30'
tags:
    - attack.discovery
    - attack.t1033
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1033/T1033.md
falsepositives:
    - Admin activity
taxonomy: sigma
logsource:
    product: linux
    service: auditd
detection:
    selection:
        type: EXECVE
        a0:
            - hostname
            - id
            - last
            - users
            - w
            - who
            - whoami
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-26T02:16:05.538583+00:00'
        service:
            source_field: service
            source_value: auditd
            mapped_at: '2025-11-26T02:16:05.538583+00:00'
    detection_fields:
        -   source_field: type
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:16:05.538596+00:00'
        -   source_field: a0
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:16:05.538598+00:00'
