title: Possible Coin Miner CPU Priority Param
id: 071d5e5a-9cef-47ec-bc4e-a42e34d8d0ed
status: test
level: critical
author: Florian Roth (Nextron Systems)
description: Detects command line parameter very often used with coin miners
references:
    - https://xmrig.com/docs/miner/command-line-options
falsepositives:
    - Other tools that use a --cpu-priority flag
tags:
    - attack.privilege-escalation
    - attack.t1068
date: '2021-10-09'
modified: '2022-12-25'
logsource:
    product: linux
    service: auditd
detection:
    cmd1:
        a1|startswith: --cpu-priority
    cmd2:
        a2|startswith: --cpu-priority
    cmd3:
        a3|startswith: --cpu-priority
    cmd4:
        a4|startswith: --cpu-priority
    cmd5:
        a5|startswith: --cpu-priority
    cmd6:
        a6|startswith: --cpu-priority
    cmd7:
        a7|startswith: --cpu-priority
    condition: 1 of cmd*
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:35:33.678826+00:00'
        service:
            source_field: service
            source_value: auditd
            mapped_at: '2025-12-04T01:35:33.678826+00:00'
    detection_fields:
        -   source_field: a1
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:35:33.678847+00:00'
        -   source_field: a2
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:35:33.678849+00:00'
        -   source_field: a3
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:35:33.678851+00:00'
        -   source_field: a4
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:35:33.678853+00:00'
        -   source_field: a5
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:35:33.678855+00:00'
        -   source_field: a6
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:35:33.678857+00:00'
        -   source_field: a7
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:35:33.678859+00:00'
