title: Audio Capture
id: a7af2487-9c2f-42e4-9bb9-ff961f0561d5
status: test
level: low
author: Pawel Mazur
description: Detects attempts to record audio with arecord utility
references:
    - https://linux.die.net/man/1/arecord
    - https://linuxconfig.org/how-to-test-microphone-with-audio-linux-sound-architecture-alsa
falsepositives:
    - Unknown
tags:
    - attack.collection
    - attack.t1123
date: '2021-09-04'
modified: '2022-10-09'
logsource:
    product: linux
    service: auditd
detection:
    selection:
        type: EXECVE
        a0: arecord
        a1: -vv
        a2: -fdat
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:35:31.654218+00:00'
        service:
            source_field: service
            source_value: auditd
            mapped_at: '2025-12-04T01:35:31.654218+00:00'
    detection_fields:
        -   source_field: type
            target_table: process_activity
            target_field: action
            mapped_at: '2025-12-04T01:35:31.654241+00:00'
        -   source_field: a0
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:35:31.654245+00:00'
        -   source_field: a1
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:35:31.654248+00:00'
        -   source_field: a2
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:35:31.654251+00:00'
