id: f7158a64-6204-4d6d-868a-6e6378b467e0
title: Suspicious C2 Activities
status: test
level: medium
description: 'Detects suspicious activities as declared by Florian Roth in its ''Best
    Practice Auditd Configuration''.

    This includes the detection of the following commands; wget, curl, base64, nc,
    netcat, ncat, ssh, socat, wireshark, rawshark, rdesktop, nmap.

    These commands match a few techniques from the tactics "Command and Control",
    including not exhaustively the following; Application Layer Protocol (T1071),
    Non-Application Layer Protocol (T1095), Data Encoding (T1132)

    '
author: Marie Euler
date: '2020-05-18'
modified: '2021-11-27'
tags:
    - attack.command-and-control
references:
    - https://github.com/Neo23x0/auditd
falsepositives:
    - Admin or User activity
taxonomy: sigma
logsource:
    product: linux
    service: auditd
detection:
    selection:
        key: susp_activity
    condition: selection
ocsf_mapping:
    class_name: network_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-26T02:16:17.940807+00:00'
        service:
            source_field: service
            source_value: auditd
            mapped_at: '2025-11-26T02:16:17.940807+00:00'
    detection_fields:
        -   source_field: key
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:16:17.940837+00:00'
