title: Password Policy Discovery - Linux
id: ca94a6db-8106-4737-9ed2-3e3bb826af0a
status: stable
level: low
author: Ömer Günal, oscd.community, Pawel Mazur
description: Detects password policy discovery commands
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1201/T1201.md
    - https://linux.die.net/man/1/chage
    - https://man7.org/linux/man-pages/man1/passwd.1.html
    - https://superuser.com/questions/150675/how-to-display-password-policy-information-for-a-user-ubuntu
falsepositives:
    - Legitimate administration activities
tags:
    - attack.discovery
    - attack.t1201
date: '2020-10-08'
modified: '2024-12-01'
logsource:
    product: linux
    service: auditd
detection:
    selection_files:
        type: PATH
        name:
            - /etc/login.defs
            - /etc/pam.d/auth
            - /etc/pam.d/common-account
            - /etc/pam.d/common-auth
            - /etc/pam.d/common-password
            - /etc/pam.d/system-auth
            - /etc/security/pwquality.conf
    selection_chage:
        type: EXECVE
        a0: chage
        a1:
            - --list
            - -l
    selection_passwd:
        type: EXECVE
        a0: passwd
        a1:
            - -S
            - --status
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:35:49.481714+00:00'
        service:
            source_field: service
            source_value: auditd
            mapped_at: '2025-12-04T01:35:49.481714+00:00'
    detection_fields:
        -   source_field: type
            target_table: process_activity
            target_field: action
            mapped_at: '2025-12-04T01:35:49.481739+00:00'
        -   source_field: name
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:35:49.481741+00:00'
        -   source_field: a0
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:35:49.481743+00:00'
        -   source_field: a1
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:35:49.481744+00:00'
