id: eae8ce9f-bde9-47a6-8e79-f20d18419910
title: Suspicious History File Operations - Linux
status: test
level: medium
description: Detects commandline operations on shell history files
author: Mikhail Larin, oscd.community
date: '2020-10-17'
modified: '2022-11-28'
tags:
    - attack.credential-access
    - attack.t1552.003
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.003/T1552.003.md
fields:
    - a0
    - a1
    - a2
    - a3
    - key
falsepositives:
    - Legitimate administrative activity
    - Legitimate software, cleaning hist file
taxonomy: sigma
logsource:
    product: linux
    service: auditd
detection:
    execve:
        type: EXECVE
    history:
        - .bash_history
        - .zsh_history
        - .zhistory
        - .history
        - .sh_history
        - fish_history
    condition: execve and history
ocsf_mapping:
    class_name: file_activity
    logsource:
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-13T20:15:31.563028+00:00'
        service:
            source_field: service
            source_value: auditd
            mapped_at: '2025-11-13T20:15:31.563028+00:00'
    detection_fields:
        -   source_field: type
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:15:31.563034+00:00'
