title: Webshell Remote Command Execution
id: c0d3734d-330f-4a03-aae2-65dacc6a8222
status: test
level: critical
author: Ilyas Ochkov, Beyu Denis, oscd.community
description: Detects possible command execution by web application/web shell
references:
    - Personal Experience of the Author
falsepositives:
    - Admin activity
    - Crazy web applications
tags:
    - attack.persistence
    - attack.t1505.003
date: '2019-10-12'
modified: '2022-12-25'
logsource:
    product: linux
    service: auditd
detection:
    selection:
        type: SYSCALL
        syscall: execve
        key: detect_execve_www
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:35:46.459950+00:00'
        service:
            source_field: service
            source_value: auditd
            mapped_at: '2025-12-04T01:35:46.459950+00:00'
    detection_fields:
        -   source_field: type
            target_table: process_activity
            target_field: action
            mapped_at: '2025-12-04T01:35:46.459966+00:00'
        -   source_field: syscall
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:35:46.459968+00:00'
        -   source_field: key
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:35:46.459969+00:00'
