id: c52a914f-3d8b-4b2a-bb75-b3991e75f8ba
title: Binary Padding - Linux
status: test
level: high
description: 'Adversaries may use binary padding to add junk data and change the on-disk
    representation of malware.

    This rule detect using dd and truncate to add a junk data to file.

    '
author: Igor Fits, oscd.community
date: '2020-10-13'
modified: '2023-05-03'
tags:
    - attack.defense-evasion
    - attack.t1027.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1027.001/T1027.001.md
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: linux
    service: auditd
detection:
    selection_execve:
        type: EXECVE
    keywords_truncate:
        '|all':
            - truncate
            - -s
    keywords_dd:
        '|all':
            - dd
            - if=
    keywords_filter: of=
    condition: selection_execve and (keywords_truncate or (keywords_dd and not keywords_filter))
ocsf_mapping:
    class_name: file_activity
    activity_id: 3
    logsource:
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-26T02:16:13.990490+00:00'
        service:
            source_field: service
            source_value: auditd
            mapped_at: '2025-11-26T02:16:13.990490+00:00'
    detection_fields:
        -   source_field: type
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:16:13.990513+00:00'
