id: a7af2487-9c2f-42e4-9bb9-ff961f0561d5
title: Audio Capture
status: test
level: low
description: Detects attempts to record audio with arecord utility
author: Pawel Mazur
date: '2021-09-04'
modified: '2022-10-09'
tags:
    - attack.collection
    - attack.t1123
references:
    - https://linux.die.net/man/1/arecord
    - https://linuxconfig.org/how-to-test-microphone-with-audio-linux-sound-architecture-alsa
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: linux
    service: auditd
detection:
    selection:
        type: EXECVE
        a0: arecord
        a1: -vv
        a2: -fdat
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-26T02:15:50.984665+00:00'
        service:
            source_field: service
            source_value: auditd
            mapped_at: '2025-11-26T02:15:50.984665+00:00'
    detection_fields:
        -   source_field: type
            target_table: process_activity
            target_field: action
            mapped_at: '2025-11-26T02:15:50.984686+00:00'
        -   source_field: a0
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:15:50.984689+00:00'
        -   source_field: a1
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:15:50.984690+00:00'
        -   source_field: a2
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:15:50.984692+00:00'
