title: File Time Attribute Change - Linux
id: b3cec4e7-6901-4b0d-a02d-8ab2d8eb818b
status: test
level: medium
author: Igor Fits, oscd.community
description: Detect file time attribute change to hide new or changes to existing
    files.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.006/T1070.006.md
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1070.006
date: '2020-10-15'
modified: '2022-11-28'
logsource:
    product: linux
    service: auditd
detection:
    execve:
        type: EXECVE
    touch: touch
    selection2:
        - -t
        - -acmr
        - -d
        - -r
    condition: execve and touch and selection2
ocsf_mapping:
    class_name: file_activity
    activity_id: 6
    logsource:
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:35:29.999432+00:00'
        service:
            source_field: service
            source_value: auditd
            mapped_at: '2025-12-04T01:35:29.999432+00:00'
    detection_fields:
        -   source_field: type
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:35:29.999452+00:00'
