title: Data Exfiltration with Wget
id: cb39d16b-b3b6-4a7a-8222-1cf24b686ffc
status: test
level: medium
author: Pawel Mazur
description: 'Detects attempts to post the file with the usage of wget utility.

    The adversary can bypass the permission restriction with the misconfigured sudo
    permission for wget utility which could allow them to read files like /etc/shadow.

    '
references:
    - https://linux.die.net/man/1/wget
    - https://gtfobins.github.io/gtfobins/wget/
falsepositives:
    - Legitimate usage of wget utility to post a file
tags:
    - attack.exfiltration
    - attack.t1048.003
date: '2021-11-18'
modified: '2022-12-25'
logsource:
    product: linux
    service: auditd
detection:
    selection:
        type: EXECVE
        a0: wget
        a1|startswith: --post-file=
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:35:47.230782+00:00'
        service:
            source_field: service
            source_value: auditd
            mapped_at: '2025-12-04T01:35:47.230782+00:00'
    detection_fields:
        -   source_field: type
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:35:47.230817+00:00'
        -   source_field: a0
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:35:47.230819+00:00'
        -   source_field: a1
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:35:47.230821+00:00'
