id: 071d5e5a-9cef-47ec-bc4e-a42e34d8d0ed
title: Possible Coin Miner CPU Priority Param
status: test
level: critical
description: Detects command line parameter very often used with coin miners
author: Florian Roth (Nextron Systems)
date: '2021-10-09'
modified: '2022-12-25'
tags:
    - attack.privilege-escalation
    - attack.t1068
references:
    - https://xmrig.com/docs/miner/command-line-options
falsepositives:
    - Other tools that use a --cpu-priority flag
taxonomy: sigma
logsource:
    product: linux
    service: auditd
detection:
    cmd1:
        a1|startswith: --cpu-priority
    cmd2:
        a2|startswith: --cpu-priority
    cmd3:
        a3|startswith: --cpu-priority
    cmd4:
        a4|startswith: --cpu-priority
    cmd5:
        a5|startswith: --cpu-priority
    cmd6:
        a6|startswith: --cpu-priority
    cmd7:
        a7|startswith: --cpu-priority
    condition: 1 of cmd*
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-13T20:15:28.580945+00:00'
        service:
            source_field: service
            source_value: auditd
            mapped_at: '2025-11-13T20:15:28.580945+00:00'
    detection_fields:
        -   source_field: a1
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:15:31.556547+00:00'
        -   source_field: a2
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:15:31.556575+00:00'
        -   source_field: a3
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:15:31.556578+00:00'
        -   source_field: a4
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:15:31.556580+00:00'
        -   source_field: a5
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:15:31.556581+00:00'
        -   source_field: a6
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:15:31.556582+00:00'
        -   source_field: a7
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:15:31.556584+00:00'
