id: 9d4548fa-bba0-4e88-bd66-5d5bf516cda0
title: Masquerading as Linux Crond Process
status: test
level: medium
description: 'Masquerading occurs when the name or location of an executable, legitimate
    or malicious, is manipulated or abused for the sake of evading defenses and observation.

    Several different variations of this technique have been observed.

    '
author: Timur Zinniatullin, oscd.community
date: '2019-10-21'
modified: '2023-08-22'
tags:
    - attack.defense-evasion
    - attack.t1036.003
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/8a82e9b66a5b4f4bc5b91089e9f24e0544f20ad7/atomics/T1036.003/T1036.003.md#atomic-test-2---masquerading-as-linux-crond-process
taxonomy: sigma
logsource:
    product: linux
    service: auditd
detection:
    selection:
        type: execve
        a0: cp
        a1: /bin/sh
        a2|endswith: /crond
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-13T20:15:13.879945+00:00'
        service:
            source_field: service
            source_value: auditd
            mapped_at: '2025-11-13T20:15:13.879945+00:00'
    detection_fields:
        -   source_field: type
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:15:16.877859+00:00'
        -   source_field: a0
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:15:16.877897+00:00'
        -   source_field: a1
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:15:16.877902+00:00'
        -   source_field: a2
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:15:16.877906+00:00'
