id: f4d3748a-65d1-4806-bd23-e25728081d01
title: Network Sniffing - Linux
status: test
level: low
description: 'Network sniffing refers to using the network interface on a system to
    monitor or capture information sent over a wired or wireless connection.

    An adversary may place a network interface into promiscuous mode to passively
    access data in transit over the network, or use span ports to capture a larger
    amount of data.

    '
author: Timur Zinniatullin, oscd.community
date: '2019-10-21'
modified: '2022-12-18'
tags:
    - attack.credential-access
    - attack.discovery
    - attack.t1040
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1040/T1040.md
falsepositives:
    - Legitimate administrator or user uses network sniffing tool for legitimate reasons.
taxonomy: sigma
logsource:
    product: linux
    service: auditd
detection:
    selection_1:
        type: execve
        a0: tcpdump
        a1: -c
        a3|contains: -i
    selection_2:
        type: execve
        a0: tshark
        a1: -c
        a3: -i
    condition: 1 of selection_*
ocsf_mapping:
    class_name: network_activity
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-26T02:16:11.423695+00:00'
        service:
            source_field: service
            source_value: auditd
            mapped_at: '2025-11-26T02:16:11.423695+00:00'
    detection_fields:
        -   source_field: type
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:16:12.769505+00:00'
        -   source_field: a0
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:16:12.769514+00:00'
        -   source_field: a1
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:16:12.769516+00:00'
        -   source_field: a3
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:16:12.769517+00:00'
