id: a5b977d6-8a81-4475-91b9-49dbfcd941f7
title: Remove Immutable File Attribute - Auditd
status: test
level: medium
description: Detects removing immutable file attribute.
author: Jakob Weinzettl, oscd.community
date: '2019-09-23'
modified: '2022-11-26'
tags:
    - attack.defense-evasion
    - attack.t1222.002
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1222.002/T1222.002.md
falsepositives:
    - Administrator interacting with immutable files (e.g. for instance backups).
taxonomy: sigma
logsource:
    product: linux
    service: auditd
detection:
    selection:
        type: EXECVE
        a0|contains: chattr
        a1|contains: -i
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 6
    logsource:
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-26T02:15:40.737166+00:00'
        service:
            source_field: service
            source_value: auditd
            mapped_at: '2025-11-26T02:15:40.737166+00:00'
    detection_fields:
        -   source_field: type
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:15:40.737189+00:00'
        -   source_field: a0
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:15:40.737193+00:00'
        -   source_field: a1
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:15:40.737196+00:00'
