id: 2dad0cba-c62a-4a4f-949f-5f6ecd619769
title: Split A File Into Pieces - Linux
status: test
level: low
description: Detection use of the command "split" to split files into parts and possible
    transfer.
author: Igor Fits, oscd.community
date: '2020-10-15'
modified: '2022-11-28'
tags:
    - attack.exfiltration
    - attack.t1030
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1030/T1030.md
falsepositives:
    - Legitimate administrative activity
taxonomy: sigma
logsource:
    product: linux
    service: auditd
detection:
    selection:
        type: SYSCALL
        comm: split
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: linux
            mapped_at: null
        service:
            source_field: service
            source_value: auditd
            mapped_at: null
    detection_fields:
        -   source_field: type
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: comm
            target_table: null
            target_field: null
            mapped_at: null
