title: Suspicious Commands Linux
id: 1543ae20-cbdf-4ec1-8d12-7664d667a825
status: test
level: medium
author: Florian Roth (Nextron Systems)
description: Detects relevant commands often related to malware or hacking activity
references:
    - Internal Research - mostly derived from exploit code including code in MSF
falsepositives:
    - Admin activity
tags:
    - attack.execution
    - attack.t1059.004
date: '2017-12-12'
modified: '2022-10-05'
logsource:
    product: linux
    service: auditd
detection:
    cmd1:
        type: EXECVE
        a0: chmod
        a1: 777
    cmd2:
        type: EXECVE
        a0: chmod
        a1: u+s
    cmd3:
        type: EXECVE
        a0: cp
        a1: /bin/ksh
    cmd4:
        type: EXECVE
        a0: cp
        a1: /bin/sh
    condition: 1 of cmd*
ocsf_mapping:
    class_name: file_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:35:37.741847+00:00'
        service:
            source_field: service
            source_value: auditd
            mapped_at: '2025-12-04T01:35:37.741847+00:00'
    detection_fields:
        -   source_field: type
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:35:37.741861+00:00'
        -   source_field: a0
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:35:37.741863+00:00'
        -   source_field: a1
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:35:37.741864+00:00'
