title: Modification of ld.so.preload
id: 4b3cb710-5e83-4715-8c45-8b2b5b3e5751
status: test
level: high
author: E.M. Anhaus (originally from Atomic Blue Detections, Tony Lambert), oscd.community
description: Identifies modification of ld.so.preload for shared object injection.
    This technique is used by attackers to load arbitrary code into processes.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1574.006/T1574.006.md
    - https://eqllib.readthedocs.io/en/latest/analytics/fd9b987a-1101-4ed3-bda6-a70300eaf57e.html
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1574.006
date: '2019-10-24'
modified: '2021-11-27'
logsource:
    product: linux
    service: auditd
detection:
    selection:
        type: PATH
        name: /etc/ld.so.preload
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 3
    logsource:
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:35:45.393314+00:00'
        service:
            source_field: service
            source_value: auditd
            mapped_at: '2025-12-04T01:35:45.393314+00:00'
    detection_fields:
        -   source_field: type
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:35:45.393397+00:00'
        -   source_field: name
            target_table: file_activity
            target_field: file.name
            mapped_at: '2025-12-04T01:35:45.393403+00:00'
