title: System Shutdown/Reboot - Linux
id: 4cb57c2f-1f29-41f8-893d-8bed8e1c1d2f
status: test
level: informational
author: Igor Fits, oscd.community
description: Adversaries may shutdown/reboot systems to interrupt access to, or aid
    in the destruction of, those systems.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1529/T1529.md
falsepositives:
    - Legitimate administrative activity
tags:
    - attack.impact
    - attack.t1529
date: '2020-10-15'
modified: '2022-11-26'
logsource:
    product: linux
    service: auditd
detection:
    execve:
        type: EXECVE
    shutdowncmd:
        - shutdown
        - reboot
        - halt
        - poweroff
    init:
        - init
        - telinit
    initselection:
        - 0
        - 6
    condition: execve and (shutdowncmd or (init and initselection))
ocsf_mapping:
    class_name: file_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:35:44.656788+00:00'
        service:
            source_field: service
            source_value: auditd
            mapped_at: '2025-12-04T01:35:44.656788+00:00'
    detection_fields:
        -   source_field: type
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:35:44.656802+00:00'
