id: 323ff3f5-0013-4847-bbd4-250b5edb62cc
title: Modify System Firewall
status: test
level: medium
description: 'Detects the removal of system firewall rules. Adversaries may only delete
    or modify a specific system firewall rule to bypass controls limiting network
    usage or access.

    Detection rules that match only on the disabling of firewalls will miss this.

    '
author: IAI
date: '2023-03-06'
tags:
    - attack.t1562.004
    - attack.defense-evasion
references:
    - https://www.trendmicro.com/en_us/research/22/c/cyclops-blink-sets-sights-on-asus-routers--.html
    - https://blog.aquasec.com/container-security-tnt-container-attack
falsepositives:
    - Legitimate admin activity
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''53059bc0-1472-438b-956a-7508a94a91f0''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    product: linux
    service: auditd
detection:
    selection1:
        type: EXECVE
        a0: iptables
        a1|contains: DROP
    selection2:
        type: EXECVE
        a0: firewall-cmd
        a1|contains: remove
    selection3:
        type: EXECVE
        a0: ufw
        a1|contains: delete
    condition: 1 of selection*
ocsf_mapping:
    class_name: file_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-26T02:16:06.257164+00:00'
        service:
            source_field: service
            source_value: auditd
            mapped_at: '2025-11-26T02:16:06.257164+00:00'
    detection_fields:
        -   source_field: type
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:16:06.257179+00:00'
        -   source_field: a0
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:16:06.257182+00:00'
        -   source_field: a1
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:16:06.257184+00:00'
