title: Logon from a Risky IP Address
id: c191e2fa-f9d6-4ccf-82af-4f2aba08359f
status: test
level: medium
author: Austin Songer @austinsonger
description: Detects when a Microsoft Cloud App Security reported when a user signs
    into your sanctioned apps from a risky IP address.
references:
    - https://learn.microsoft.com/en-us/defender-cloud-apps/anomaly-detection-policy
    - https://learn.microsoft.com/en-us/defender-cloud-apps/policy-template-reference
falsepositives:
    - Unknown
tags:
    - attack.initial-access
    - attack.t1078
date: '2021-08-23'
modified: '2022-10-09'
logsource:
    product: m365
    service: threat_management
detection:
    selection:
        eventSource: SecurityComplianceCenter
        eventName: Log on from a risky IP address
        status: success
    condition: selection
ocsf_mapping:
    class_name: authentication
    activity_id: 1
    logsource:
        product:
            source_field: product
            source_value: m365
            mapped_at: '2025-12-04T01:39:01.553902+00:00'
        service:
            source_field: service
            source_value: threat_management
            mapped_at: '2025-12-04T01:39:01.553902+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: authentication
            target_field: metadata.product.name
            mapped_at: '2025-12-04T01:39:01.553914+00:00'
        -   source_field: eventName
            target_table: authentication
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:39:01.553915+00:00'
        -   source_field: status
            target_table: authentication
            target_field: actor.authorizations.decision
            mapped_at: '2025-12-04T01:39:01.553916+00:00'
