title: Disabling Multi Factor Authentication
id: 60de9b57-dc4d-48b9-a6a0-b39e0469f876
status: test
level: high
author: Splunk Threat Research Team (original rule), Harjot Singh @cyb3rjy0t (sigma
    rule)
description: Detects disabling of Multi Factor Authentication.
references:
    - https://research.splunk.com/cloud/c783dd98-c703-4252-9e8a-f19d9f5c949e/
falsepositives:
    - Unlikely
tags:
    - attack.persistence
    - attack.t1556
date: '2023-09-18'
logsource:
    product: m365
    service: audit
detection:
    selection:
        Operation|contains: Disable Strong Authentication.
    condition: selection
ocsf_mapping:
    class_name: authentication
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: m365
            mapped_at: '2025-12-04T01:39:04.605064+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-12-04T01:39:04.605064+00:00'
    detection_fields:
        -   source_field: Operation
            target_table: authentication
            target_field: action
            mapped_at: '2025-12-04T01:39:04.605112+00:00'
