title: Suspicious OAuth App File Download Activities
id: ee111937-1fe7-40f0-962a-0eb44d57d174
status: test
level: medium
author: Austin Songer @austinsonger
description: Detects when a Microsoft Cloud App Security reported when an app downloads
    multiple files from Microsoft SharePoint or Microsoft OneDrive in a manner that
    is unusual for the user.
references:
    - https://learn.microsoft.com/en-us/defender-cloud-apps/anomaly-detection-policy
    - https://learn.microsoft.com/en-us/defender-cloud-apps/policy-template-reference
falsepositives:
    - Unknown
tags:
    - attack.exfiltration
date: '2021-08-23'
modified: '2022-10-09'
logsource:
    product: m365
    service: threat_management
detection:
    selection:
        eventSource: SecurityComplianceCenter
        eventName: Suspicious OAuth app file download activities
        status: success
    condition: selection
ocsf_mapping:
    class_name: authentication
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: m365
            mapped_at: '2025-12-04T01:39:01.022387+00:00'
        service:
            source_field: service
            source_value: threat_management
            mapped_at: '2025-12-04T01:39:01.022387+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: authentication
            target_field: metadata.product.name
            mapped_at: '2025-12-04T01:39:01.022401+00:00'
        -   source_field: eventName
            target_table: authentication
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:39:01.022402+00:00'
        -   source_field: status
            target_table: authentication
            target_field: actor.authorizations.decision
            mapped_at: '2025-12-04T01:39:01.022404+00:00'
