id: bd132164-884a-48f1-aa2d-c6d646b04c69
title: Microsoft 365 - Potential Ransomware Activity
status: test
level: medium
description: Detects when a Microsoft Cloud App Security reported when a user uploads
    files to the cloud that might be infected with ransomware.
author: austinsonger
date: '2021-08-19'
modified: '2022-10-09'
tags:
    - attack.impact
    - attack.t1486
references:
    - https://learn.microsoft.com/en-us/defender-cloud-apps/anomaly-detection-policy
    - https://learn.microsoft.com/en-us/defender-cloud-apps/policy-template-reference
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: m365
    service: threat_management
detection:
    selection:
        eventSource: SecurityComplianceCenter
        eventName: Potential ransomware activity
        status: success
    condition: selection
ocsf_mapping:
    class_name: authentication
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: m365
            mapped_at: '2025-11-26T02:21:59.668737+00:00'
        service:
            source_field: service
            source_value: threat_management
            mapped_at: '2025-11-26T02:21:59.668737+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: authentication
            target_field: metadata.product.name
            mapped_at: '2025-11-26T02:21:59.668765+00:00'
        -   source_field: eventName
            target_table: authentication
            target_field: action
            mapped_at: '2025-11-26T02:21:59.668770+00:00'
        -   source_field: status
            target_table: authentication
            target_field: actor.authorizations.decision
            mapped_at: '2025-11-26T02:21:59.668774+00:00'
