id: d7eab125-5f94-43df-8710-795b80fa1189
title: Microsoft 365 - Impossible Travel Activity
status: test
level: medium
description: Detects when a Microsoft Cloud App Security reported a risky sign-in
    attempt due to a login associated with an impossible travel.
author: Austin Songer @austinsonger
date: '2020-07-06'
modified: '2021-11-27'
tags:
    - attack.initial-access
    - attack.t1078
references:
    - https://learn.microsoft.com/en-us/defender-cloud-apps/anomaly-detection-policy
    - https://learn.microsoft.com/en-us/defender-cloud-apps/policy-template-reference
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: m365
    service: threat_management
detection:
    selection:
        eventSource: SecurityComplianceCenter
        eventName: Impossible travel activity
        status: success
    condition: selection
ocsf_mapping:
    class_name: authentication
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: m365
            mapped_at: '2025-11-26T02:22:01.116233+00:00'
        service:
            source_field: service
            source_value: threat_management
            mapped_at: '2025-11-26T02:22:01.116233+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: authentication
            target_field: metadata.product.name
            mapped_at: '2025-11-26T02:22:01.116253+00:00'
        -   source_field: eventName
            target_table: authentication
            target_field: action
            mapped_at: '2025-11-26T02:22:01.116256+00:00'
        -   source_field: status
            target_table: authentication
            target_field: actor.authorizations.decision
            mapped_at: '2025-11-26T02:22:01.116258+00:00'
