id: 78a34b67-3c39-4886-8fb4-61c46dc18ecd
title: Microsoft 365 - Unusual Volume of File Deletion
status: test
level: medium
description: Detects when a Microsoft Cloud App Security reported a user has deleted
    a unusual a large volume of files.
author: austinsonger
date: '2021-08-19'
modified: '2022-10-09'
tags:
    - attack.impact
    - attack.t1485
references:
    - https://learn.microsoft.com/en-us/defender-cloud-apps/anomaly-detection-policy
    - https://learn.microsoft.com/en-us/defender-cloud-apps/policy-template-reference
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: m365
    service: threat_management
detection:
    selection:
        eventSource: SecurityComplianceCenter
        eventName: Unusual volume of file deletion
        status: success
    condition: selection
ocsf_mapping:
    class_name: authentication
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: m365
            mapped_at: '2025-11-26T02:21:55.677405+00:00'
        service:
            source_field: service
            source_value: threat_management
            mapped_at: '2025-11-26T02:21:55.677405+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: authentication
            target_field: metadata.product.name
            mapped_at: '2025-11-26T02:21:55.677438+00:00'
        -   source_field: eventName
            target_table: authentication
            target_field: action
            mapped_at: '2025-11-26T02:21:55.677443+00:00'
        -   source_field: status
            target_table: authentication
            target_field: actor.authorizations.decision
            mapped_at: '2025-11-26T02:21:55.677446+00:00'
