id: ff246f56-7f24-402a-baca-b86540e3925c
title: Microsoft 365 - User Restricted from Sending Email
status: test
level: medium
description: Detects when a Security Compliance Center reported a user who exceeded
    sending limits of the service policies and because of this has been restricted
    from sending email.
author: austinsonger
date: '2021-08-19'
modified: '2022-10-09'
tags:
    - attack.initial-access
    - attack.t1199
references:
    - https://learn.microsoft.com/en-us/defender-cloud-apps/anomaly-detection-policy
    - https://learn.microsoft.com/en-us/defender-cloud-apps/policy-template-reference
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: m365
    service: threat_management
detection:
    selection:
        eventSource: SecurityComplianceCenter
        eventName: User restricted from sending email
        status: success
    condition: selection
ocsf_mapping:
    class_name: authentication
    logsource:
        product:
            source_field: product
            source_value: m365
            mapped_at: '2025-11-13T20:17:47.727193+00:00'
        service:
            source_field: service
            source_value: threat_management
            mapped_at: '2025-11-13T20:17:47.727193+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: authentication
            target_field: metadata.product.name
            mapped_at: '2025-11-13T20:17:47.727197+00:00'
        -   source_field: eventName
            target_table: authentication
            target_field: action
            mapped_at: '2025-11-13T20:17:47.727199+00:00'
        -   source_field: status
            target_table: authentication
            target_field: status_id
            mapped_at: '2025-11-13T20:17:47.727200+00:00'
