title: New Federated Domain Added - Exchange
id: 42127bdd-9133-474f-a6f1-97b6c08a4339
status: test
level: medium
author: Splunk Threat Research Team (original rule), '@ionsor (rule)'
description: Detects the addition of a new Federated Domain.
references:
    - https://www.fireeye.com/content/dam/fireeye-www/blog/pdfs/wp-m-unc2452-2021-000343-01.pdf
    - https://us-cert.cisa.gov/ncas/alerts/aa21-008a
    - https://www.splunk.com/en_us/blog/security/a-golden-saml-journey-solarwinds-continued.html
    - https://www.sygnia.co/golden-saml-advisory
    - https://o365blog.com/post/aadbackdoor/
falsepositives:
    - The creation of a new Federated domain is not necessarily malicious, however
        these events need to be followed closely, as it may indicate federated credential
        abuse or backdoor via federated identities at a similar or different cloud
        provider.
tags:
    - attack.persistence
    - attack.t1136.003
date: '2022-02-08'
logsource:
    product: m365
    service: exchange
detection:
    selection:
        eventSource: Exchange
        eventName: Add-FederatedDomain
        status: success
    condition: selection
related:
    -   id: 58f88172-a73d-442b-94c9-95eaed3cbb36
        type: similar
ocsf_mapping:
    class_name: authentication
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: m365
            mapped_at: '2025-12-04T01:38:56.587425+00:00'
        service:
            source_field: service
            source_value: exchange
            mapped_at: '2025-12-04T01:38:56.587425+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: authentication
            target_field: metadata.product.name
            mapped_at: '2025-12-04T01:38:56.587439+00:00'
        -   source_field: eventName
            target_table: authentication
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:38:56.587441+00:00'
        -   source_field: status
            target_table: authentication
            target_field: actor.authorizations.decision
            mapped_at: '2025-12-04T01:38:56.587442+00:00'
