id: a3501e8e-af9e-43c6-8cd6-9360bdaae498
title: Activity from Suspicious IP Addresses
status: test
level: medium
description: 'Detects when a Microsoft Cloud App Security reported users were active
    from an IP address identified as risky by Microsoft Threat Intelligence.

    These IP addresses are involved in malicious activities, such as Botnet C&C, and
    may indicate compromised account.

    '
author: Austin Songer @austinsonger
date: '2021-08-23'
modified: '2022-10-09'
tags:
    - attack.command-and-control
    - attack.t1573
references:
    - https://learn.microsoft.com/en-us/defender-cloud-apps/anomaly-detection-policy
    - https://learn.microsoft.com/en-us/defender-cloud-apps/policy-template-reference
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: m365
    service: threat_detection
detection:
    selection:
        eventSource: SecurityComplianceCenter
        eventName: Activity from suspicious IP addresses
        status: success
    condition: selection
ocsf_mapping:
    class_name: authentication
    logsource:
        product:
            source_field: product
            source_value: m365
            mapped_at: '2025-11-13T20:17:47.730867+00:00'
        service:
            source_field: service
            source_value: threat_detection
            mapped_at: '2025-11-13T20:17:47.730867+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: authentication
            target_field: metadata.product.name
            mapped_at: '2025-11-13T20:17:47.730873+00:00'
        -   source_field: eventName
            target_table: authentication
            target_field: action
            mapped_at: '2025-11-13T20:17:47.730875+00:00'
        -   source_field: status
            target_table: authentication
            target_field: status_id
            mapped_at: '2025-11-13T20:17:47.730876+00:00'
