id: 42127bdd-9133-474f-a6f1-97b6c08a4339
title: New Federated Domain Added - Exchange
status: test
level: medium
description: Detects the addition of a new Federated Domain.
author: Splunk Threat Research Team (original rule), '@ionsor (rule)'
date: '2022-02-08'
tags:
    - attack.persistence
    - attack.t1136.003
references:
    - https://www.fireeye.com/content/dam/fireeye-www/blog/pdfs/wp-m-unc2452-2021-000343-01.pdf
    - https://us-cert.cisa.gov/ncas/alerts/aa21-008a
    - https://www.splunk.com/en_us/blog/security/a-golden-saml-journey-solarwinds-continued.html
    - https://www.sygnia.co/golden-saml-advisory
    - https://o365blog.com/post/aadbackdoor/
falsepositives:
    - The creation of a new Federated domain is not necessarily malicious, however
        these events need to be followed closely, as it may indicate federated credential
        abuse or backdoor via federated identities at a similar or different cloud
        provider.
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''58f88172-a73d-442b-94c9-95eaed3cbb36''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    product: m365
    service: exchange
detection:
    selection:
        eventSource: Exchange
        eventName: Add-FederatedDomain
        status: success
    condition: selection
ocsf_mapping:
    class_name: authentication
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: m365
            mapped_at: '2025-11-26T02:21:49.272722+00:00'
        service:
            source_field: service
            source_value: exchange
            mapped_at: '2025-11-26T02:21:49.272722+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: authentication
            target_field: metadata.product.name
            mapped_at: '2025-11-26T02:21:49.272759+00:00'
        -   source_field: eventName
            target_table: authentication
            target_field: action
            mapped_at: '2025-11-26T02:21:49.272763+00:00'
        -   source_field: status
            target_table: authentication
            target_field: actor.authorizations.decision
            mapped_at: '2025-11-26T02:21:49.272766+00:00'
