id: 58f88172-a73d-442b-94c9-95eaed3cbb36
title: New Federated Domain Added
status: test
level: medium
description: Detects the addition of a new Federated Domain.
author: Splunk Threat Research Team (original rule), Harjot Singh @cyb3rjy0t (sigma
    rule)
date: '2023-09-18'
tags:
    - attack.persistence
    - attack.t1136.003
references:
    - https://research.splunk.com/cloud/e155876a-6048-11eb-ae93-0242ac130002/
    - https://o365blog.com/post/aadbackdoor/
falsepositives:
    - The creation of a new Federated domain is not necessarily malicious, however
        these events need to be followed closely, as it may indicate federated credential
        abuse or backdoor via federated identities at a similar or different cloud
        provider.
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''42127bdd-9133-474f-a6f1-97b6c08a4339''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    product: m365
    service: audit
detection:
    selection_domain:
        Operation|contains: domain
    selection_operation:
        Operation|contains:
            - add
            - new
    condition: all of selection_*
ocsf_mapping:
    class_name: authentication
    logsource:
        product:
            source_field: product
            source_value: m365
            mapped_at: '2025-11-13T20:17:48.289414+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-11-13T20:17:48.289414+00:00'
    detection_fields:
        -   source_field: Operation
            target_table: authentication
            target_field: api.operation
            mapped_at: '2025-11-13T20:17:48.289442+00:00'
