title: PST Export Alert Using New-ComplianceSearchAction
id: 6897cd82-6664-11ed-9022-0242ac120002
status: test
level: medium
author: Nikita Khalimonenkov
description: Alert when a user has performed an export to a search using 'New-ComplianceSearchAction'
    with the '-Export' flag. This detection will detect PST export even if the 'eDiscovery
    search or exported' alert is disabled in the O365.This rule will apply to ExchangePowerShell
    usage and from the cloud.
references:
    - https://learn.microsoft.com/en-us/powershell/module/exchange/new-compliancesearchaction?view=exchange-ps
falsepositives:
    - Exporting a PST can be done for legitimate purposes by legitimate sources, but
        due to the sensitive nature of PST content, it must be monitored.
tags:
    - attack.collection
    - attack.t1114
date: '2022-11-17'
logsource:
    product: m365
    service: threat_management
detection:
    selection:
        eventSource: SecurityComplianceCenter
        Payload|contains|all:
            - New-ComplianceSearchAction
            - Export
            - pst
    condition: selection
related:
    -   id: 18b88d08-d73e-4f21-bc25-4b9892a4fdd0
        type: similar
ocsf_mapping:
    class_name: email_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: m365
            mapped_at: '2025-12-04T01:38:57.675354+00:00'
        service:
            source_field: service
            source_value: threat_management
            mapped_at: '2025-12-04T01:38:57.675354+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: email_activity
            target_field: metadata.product.name
            mapped_at: '2025-12-04T01:38:57.675366+00:00'
        -   source_field: Payload
            target_table: email_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:38:57.675368+00:00'
