title: New Federated Domain Added
id: 58f88172-a73d-442b-94c9-95eaed3cbb36
status: test
level: medium
author: Splunk Threat Research Team (original rule), Harjot Singh @cyb3rjy0t (sigma
    rule)
description: Detects the addition of a new Federated Domain.
references:
    - https://research.splunk.com/cloud/e155876a-6048-11eb-ae93-0242ac130002/
    - https://o365blog.com/post/aadbackdoor/
falsepositives:
    - The creation of a new Federated domain is not necessarily malicious, however
        these events need to be followed closely, as it may indicate federated credential
        abuse or backdoor via federated identities at a similar or different cloud
        provider.
tags:
    - attack.persistence
    - attack.t1136.003
date: '2023-09-18'
logsource:
    product: m365
    service: audit
detection:
    selection_domain:
        Operation|contains: domain
    selection_operation:
        Operation|contains:
            - add
            - new
    condition: all of selection_*
related:
    -   id: 42127bdd-9133-474f-a6f1-97b6c08a4339
        type: similar
ocsf_mapping:
    class_name: authentication
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: m365
            mapped_at: '2025-12-04T01:39:05.178526+00:00'
        service:
            source_field: service
            source_value: audit
            mapped_at: '2025-12-04T01:39:05.178526+00:00'
    detection_fields:
        -   source_field: Operation
            target_table: authentication
            target_field: action
            mapped_at: '2025-12-04T01:39:05.178560+00:00'
