id: d8b0a4fe-07a8-41be-bd39-b14afa025d95
title: Activity from Anonymous IP Addresses
status: test
level: medium
description: Detects when a Microsoft Cloud App Security reported when users were
    active from an IP address that has been identified as an anonymous proxy IP address.
author: Austin Songer @austinsonger
date: '2021-08-23'
modified: '2022-10-09'
tags:
    - attack.command-and-control
    - attack.t1573
references:
    - https://learn.microsoft.com/en-us/defender-cloud-apps/anomaly-detection-policy
    - https://learn.microsoft.com/en-us/defender-cloud-apps/policy-template-reference
falsepositives:
    - User using a VPN or Proxy
taxonomy: sigma
logsource:
    product: m365
    service: threat_management
detection:
    selection:
        eventSource: SecurityComplianceCenter
        eventName: Activity from anonymous IP addresses
        status: success
    condition: selection
ocsf_mapping:
    class_name: authentication
    logsource:
        product:
            source_field: product
            source_value: m365
            mapped_at: '2025-11-13T20:17:47.708280+00:00'
        service:
            source_field: service
            source_value: threat_management
            mapped_at: '2025-11-13T20:17:47.708280+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: authentication
            target_field: metadata.product.name
            mapped_at: '2025-11-13T20:17:47.708291+00:00'
        -   source_field: eventName
            target_table: authentication
            target_field: action
            mapped_at: '2025-11-13T20:17:47.708295+00:00'
        -   source_field: status
            target_table: authentication
            target_field: status_id
            mapped_at: '2025-11-13T20:17:47.708297+00:00'
