id: 2b669496-d215-47d8-bd9a-f4a45bf07cda
title: Data Exfiltration to Unsanctioned Apps
status: test
level: medium
description: Detects when a Microsoft Cloud App Security reported when a user or IP
    address uses an app that is not sanctioned to perform an activity that resembles
    an attempt to exfiltrate information from your organization.
author: Austin Songer @austinsonger
date: '2021-08-23'
modified: '2022-10-09'
tags:
    - attack.exfiltration
    - attack.t1537
references:
    - https://learn.microsoft.com/en-us/defender-cloud-apps/anomaly-detection-policy
    - https://learn.microsoft.com/en-us/defender-cloud-apps/policy-template-reference
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: m365
    service: threat_management
detection:
    selection:
        eventSource: SecurityComplianceCenter
        eventName: Data exfiltration to unsanctioned apps
        status: success
    condition: selection
ocsf_mapping:
    class_name: authentication
    logsource:
        product:
            source_field: product
            source_value: m365
            mapped_at: '2025-11-13T20:17:47.714358+00:00'
        service:
            source_field: service
            source_value: threat_management
            mapped_at: '2025-11-13T20:17:47.714358+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: authentication
            target_field: metadata.product.name
            mapped_at: '2025-11-13T20:17:47.714366+00:00'
        -   source_field: eventName
            target_table: authentication
            target_field: action
            mapped_at: '2025-11-13T20:17:47.714369+00:00'
        -   source_field: status
            target_table: authentication
            target_field: status_id
            mapped_at: '2025-11-13T20:17:47.714371+00:00'
