title: Data Exfiltration to Unsanctioned Apps
id: 2b669496-d215-47d8-bd9a-f4a45bf07cda
status: test
level: medium
author: Austin Songer @austinsonger
description: Detects when a Microsoft Cloud App Security reported when a user or IP
    address uses an app that is not sanctioned to perform an activity that resembles
    an attempt to exfiltrate information from your organization.
references:
    - https://learn.microsoft.com/en-us/defender-cloud-apps/anomaly-detection-policy
    - https://learn.microsoft.com/en-us/defender-cloud-apps/policy-template-reference
falsepositives:
    - Unknown
tags:
    - attack.exfiltration
    - attack.t1537
date: '2021-08-23'
modified: '2022-10-09'
logsource:
    product: m365
    service: threat_management
detection:
    selection:
        eventSource: SecurityComplianceCenter
        eventName: Data exfiltration to unsanctioned apps
        status: success
    condition: selection
ocsf_mapping:
    class_name: authentication
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: m365
            mapped_at: '2025-12-04T01:38:59.641868+00:00'
        service:
            source_field: service
            source_value: threat_management
            mapped_at: '2025-12-04T01:38:59.641868+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: authentication
            target_field: metadata.product.name
            mapped_at: '2025-12-04T01:38:59.641883+00:00'
        -   source_field: eventName
            target_table: authentication
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:38:59.641884+00:00'
        -   source_field: status
            target_table: authentication
            target_field: actor.authorizations.decision
            mapped_at: '2025-12-04T01:38:59.641886+00:00'
