id: 2e669ed8-742e-4fe5-b3c4-5a59b486c2ee
title: Activity Performed by Terminated User
status: test
level: medium
description: 'Detects when a Microsoft Cloud App Security reported for users whose
    account were terminated in Azure AD, but still perform activities in other platforms
    such as AWS or Salesforce.

    This is especially relevant for users who use another account to manage resources,
    since these accounts are often not terminated when a user leaves the company.

    '
author: Austin Songer @austinsonger
date: '2021-08-23'
modified: '2022-10-09'
tags:
    - attack.impact
references:
    - https://learn.microsoft.com/en-us/defender-cloud-apps/anomaly-detection-policy
    - https://learn.microsoft.com/en-us/defender-cloud-apps/policy-template-reference
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: m365
    service: threat_management
detection:
    selection:
        eventSource: SecurityComplianceCenter
        eventName: Activity performed by terminated user
        status: success
    condition: selection
ocsf_mapping:
    class_name: authentication
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: m365
            mapped_at: '2025-11-26T02:21:54.071713+00:00'
        service:
            source_field: service
            source_value: threat_management
            mapped_at: '2025-11-26T02:21:54.071713+00:00'
    detection_fields:
        -   source_field: eventSource
            target_table: authentication
            target_field: metadata.product.name
            mapped_at: '2025-11-26T02:21:54.071731+00:00'
        -   source_field: eventName
            target_table: authentication
            target_field: action
            mapped_at: '2025-11-26T02:21:54.071732+00:00'
        -   source_field: status
            target_table: authentication
            target_field: actor.authorizations.decision
            mapped_at: '2025-11-26T02:21:54.071734+00:00'
