title: Network Connection Initiated By IMEWDBLD.EXE
id: 8d7e392e-9b28-49e1-831d-5949c6281228
status: test
level: high
author: frack113
description: 'Detects a network connection initiated by IMEWDBLD.EXE. This might indicate
    potential abuse of the utility as a LOLBIN in order to download arbitrary files
    or additional payloads.

    '
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1105/T1105.md#atomic-test-10---windows---powershell-download
    - https://lolbas-project.github.io/lolbas/Binaries/IMEWDBLD/
falsepositives:
    - Unknown
tags:
    - attack.command-and-control
    - attack.t1105
date: '2022-01-22'
modified: '2023-11-09'
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        Initiated: 'true'
        Image|endswith: \IMEWDBLD.exe
    condition: selection
related:
    -   id: 863218bd-c7d0-4c52-80cd-0a96c09f54af
        type: derived
ocsf_mapping:
    class_name: network_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: network_connection
            mapped_at: '2025-12-04T01:51:36.642242+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:51:36.642242+00:00'
    detection_fields:
        -   source_field: Initiated
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:51:36.642256+00:00'
        -   source_field: Image
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:51:36.642259+00:00'
