id: 8d7e392e-9b28-49e1-831d-5949c6281228
title: Network Connection Initiated By IMEWDBLD.EXE
status: test
level: high
description: 'Detects a network connection initiated by IMEWDBLD.EXE. This might indicate
    potential abuse of the utility as a LOLBIN in order to download arbitrary files
    or additional payloads.

    '
author: frack113
date: '2022-01-22'
modified: '2023-11-09'
tags:
    - attack.command-and-control
    - attack.t1105
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1105/T1105.md#atomic-test-10---windows---powershell-download
    - https://lolbas-project.github.io/lolbas/Binaries/IMEWDBLD/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''863218bd-c7d0-4c52-80cd-0a96c09f54af''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        Initiated: 'true'
        Image|endswith: \IMEWDBLD.exe
    condition: selection
ocsf_mapping:
    class_name: network_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: network_connection
            mapped_at: '2025-11-26T02:38:27.571172+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:38:27.571172+00:00'
    detection_fields:
        -   source_field: Initiated
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:38:27.571194+00:00'
        -   source_field: Image
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:38:27.571198+00:00'
