id: 8ae51330-899c-4641-8125-e39f2e07da72
title: DNS TXT Answer with Possible Execution Strings
status: test
level: high
description: Detects strings used in command execution in DNS TXT Answer
author: Markus Neis
date: '2018-08-08'
modified: '2021-11-27'
tags:
    - attack.command-and-control
    - attack.t1071.004
references:
    - https://twitter.com/stvemillertime/status/1024707932447854592
    - https://github.com/samratashok/nishang/blob/414ee1104526d7057f9adaeee196d91ae447283e/Backdoors/DNS_TXT_Pwnage.ps1
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: dns
detection:
    selection:
        record_type: TXT
        answer|contains:
            - IEX
            - Invoke-Expression
            - cmd.exe
    condition: selection
ocsf_mapping:
    class_name: dns_activity
    logsource:
        category:
            source_field: category
            source_value: dns
            mapped_at: '2025-11-13T20:15:10.977314+00:00'
    detection_fields:
        -   source_field: record_type
            target_table: dns_activity
            target_field: query.type
            mapped_at: '2025-11-13T20:15:12.174745+00:00'
        -   source_field: answer
            target_table: dns_activity
            target_field: answers.rdata
            mapped_at: '2025-11-13T20:15:12.174800+00:00'
