title: Network Connection Initiated By AddinUtil.EXE
id: 5205613d-2a63-4412-a895-3a2458b587b3
status: test
level: high
author: Michael McKinley (@McKinleyMike), Tony Latteri (@TheLatteri)
description: 'Detects a network connection initiated by the Add-In deployment cache
    updating utility "AddInutil.exe".

    This could indicate a potential command and control communication as this tool
    doesn''t usually initiate network activity.

    '
references:
    - https://www.blue-prints.blog/content/blog/posts/lolbin/addinutil-lolbas.html
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1218
date: '2023-09-18'
modified: '2024-07-16'
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        Initiated: 'true'
        Image|endswith: \addinutil.exe
    condition: selection
ocsf_mapping:
    class_name: network_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: network_connection
            mapped_at: '2025-12-04T01:51:26.670976+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:51:26.670976+00:00'
    detection_fields:
        -   source_field: Initiated
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:51:26.670993+00:00'
        -   source_field: Image
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:51:26.671001+00:00'
