title: Wannacry Killswitch Domain
id: 3eaf6218-3bed-4d8a-8707-274096f12a18
status: test
level: high
author: Mike Wade
description: Detects wannacry killswitch domain dns queries
references:
    - https://www.mandiant.com/resources/blog/wannacry-ransomware-campaign
falsepositives:
    - Analyst testing
tags:
    - attack.command-and-control
    - attack.t1071.001
date: '2020-09-16'
modified: '2022-03-24'
logsource:
    category: dns
detection:
    selection:
        query:
            - ifferfsodp9ifjaposdfjhgosurijfaewrwergwea.testing
            - ifferfsodp9ifjaposdfjhgosurijfaewrwergwea.test
            - ifferfsodp9ifjaposdfjhgosurijfaewrwergwea.com
            - ayylmaotjhsstasdfasdfasdfasdfasdfasdfasdf.com
            - iuqssfsodp9ifjaposdfjhgosurijfaewrwergwea.com
    condition: selection
ocsf_mapping:
    class_name: dns_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: dns
            mapped_at: '2025-12-04T01:35:19.915152+00:00'
    detection_fields:
        -   source_field: query
            target_table: dns_activity
            target_field: query.hostname
            mapped_at: '2025-12-04T01:35:19.915167+00:00'
