id: b3ad3c0f-c949-47a1-a30e-b0491ccae876
title: Uncommon Connection to Active Directory Web Services
status: test
level: medium
description: 'Detects uncommon network connections to the Active Directory Web Services
    (ADWS) from processes not typically associated with ADWS management.

    '
author: '@kostastsale'
date: '2024-01-26'
tags:
    - attack.discovery
    - attack.t1087
references:
    - https://medium.com/falconforce/soaphound-tool-to-collect-active-directory-data-via-adws-165aca78288c
    - https://github.com/FalconForceTeam/FalconFriday/blob/master/Discovery/ADWS_Connection_from_Unexpected_Binary-Win.md
falsepositives:
    - ADWS is used by a number of legitimate applications that need to interact with
        Active Directory. These applications should be added to the allow-listing
        to avoid false positives.
taxonomy: sigma
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        Initiated: true
        DestinationPort: 9389
    filter_main_dsac:
        Image: C:\Windows\system32\dsac.exe
    filter_main_ms_monitoring_agent:
        Image: C:\Program Files\Microsoft Monitoring Agent\
    filter_main_powershell:
        Image|startswith:
            - C:\Program Files\PowerShell\7\pwsh.exe
            - C:\Program Files\PowerShell\7-preview\pwsh.ex
            - C:\Windows\System32\WindowsPowerShell\
            - C:\Windows\SysWOW64\WindowsPowerShell\
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: network_activity
    logsource:
        category:
            source_field: category
            source_value: network_connection
            mapped_at: '2025-11-13T20:21:09.121346+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:09.121346+00:00'
    detection_fields:
        -   source_field: Initiated
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:21:09.121393+00:00'
        -   source_field: DestinationPort
            target_table: network_activity
            target_field: dst_endpoint.port
            mapped_at: '2025-11-13T20:21:09.121398+00:00'
        -   source_field: Image
            target_table: network_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:21:09.121402+00:00'
