id: ed74fe75-7594-4b4b-ae38-e38e3fd2eb23
title: Outbound RDP Connections Over Non-Standard Tools
status: test
level: high
description: 'Detects Non-Standard tools initiating a connection over port 3389 indicating
    possible lateral movement.

    An initial baseline is required before using this utility to exclude third party
    RDP tooling that you might use.

    '
author: Markus Neis
date: '2019-05-15'
modified: '2024-02-09'
tags:
    - attack.lateral-movement
    - attack.t1021.001
    - car.2013-07-002
references:
    - https://portal.msrc.microsoft.com/en-US/security-guidance/advisory/CVE-2019-0708
falsepositives:
    - Third party RDP tools
taxonomy: sigma
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        DestinationPort: 3389
        Initiated: 'true'
    filter_main_mstsc:
        Image:
            - C:\Windows\System32\mstsc.exe
            - C:\Windows\SysWOW64\mstsc.exe
    filter_optional_dns:
        Image: C:\Windows\System32\dns.exe
        SourcePort: 53
        Protocol: udp
    filter_optional_avast:
        Image|endswith:
            - \Avast Software\Avast\AvastSvc.exe
            - \Avast\AvastSvc.exe
    filter_optional_sysinternals_rdcman:
        Image|endswith: \RDCMan.exe
    filter_optional_chrome:
        Image: C:\Program Files\Google\Chrome\Application\chrome.exe
    filter_optional_third_party:
        Image|endswith:
            - \FSAssessment.exe
            - \FSDiscovery.exe
            - \MobaRTE.exe
            - \mRemote.exe
            - \mRemoteNG.exe
            - \Passwordstate.exe
            - \RemoteDesktopManager.exe
            - \RemoteDesktopManager64.exe
            - \RemoteDesktopManagerFree.exe
            - \RSSensor.exe
            - \RTS2App.exe
            - \RTSApp.exe
            - \spiceworks-finder.exe
            - \Terminals.exe
            - \ws_TunnelService.exe
    filter_optional_thor:
        Image|endswith:
            - \thor.exe
            - \thor64.exe
    filter_optional_splunk:
        Image|startswith: C:\Program Files\SplunkUniversalForwarder\bin\
    filter_optional_sentinel_one:
        Image|endswith: \Ranger\SentinelRanger.exe
    filter_optional_firefox:
        Image: C:\Program Files\Mozilla Firefox\firefox.exe
    filter_optional_tsplus:
        Image:
            - C:\Program Files\TSplus\Java\bin\HTML5service.exe
            - C:\Program Files (x86)\TSplus\Java\bin\HTML5service.exe
    filter_optional_null:
        Image: null
    filter_optional_empty:
        Image: ''
    filter_optional_unknown:
        Image: <unknown process>
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: network_activity
    logsource:
        category:
            source_field: category
            source_value: network_connection
            mapped_at: '2025-11-13T20:21:10.107328+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:10.107328+00:00'
    detection_fields:
        -   source_field: DestinationPort
            target_table: network_activity
            target_field: dst_endpoint.port
            mapped_at: '2025-11-13T20:21:11.616777+00:00'
        -   source_field: Initiated
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:21:11.616807+00:00'
        -   source_field: Image
            target_table: network_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:21:11.616811+00:00'
        -   source_field: SourcePort
            target_table: network_activity
            target_field: src_endpoint.port
            mapped_at: '2025-11-13T20:21:11.616813+00:00'
        -   source_field: Protocol
            target_table: network_activity
            target_field: connection_info.protocol_name
            mapped_at: '2025-11-13T20:21:11.616815+00:00'
