title: Cobalt Strike DNS Beaconing
id: 2975af79-28c4-4d2f-a951-9095f229df29
status: test
level: critical
author: Florian Roth (Nextron Systems)
description: Detects suspicious DNS queries known from Cobalt Strike beacons
references:
    - https://www.icebrg.io/blog/footprints-of-fin7-tracking-actor-patterns
    - https://www.sekoia.io/en/hunting-and-detecting-cobalt-strike/
falsepositives:
    - Unknown
tags:
    - attack.command-and-control
    - attack.t1071.004
date: '2018-05-10'
modified: '2022-10-09'
logsource:
    category: dns
detection:
    selection1:
        query|startswith:
            - aaa.stage.
            - post.1
    selection2:
        query|contains: .stage.123456.
    condition: 1 of selection*
ocsf_mapping:
    class_name: dns_activity
    activity_id: 6
    logsource:
        category:
            source_field: category
            source_value: dns
            mapped_at: '2025-12-04T01:35:18.553362+00:00'
    detection_fields:
        -   source_field: query
            target_table: dns_activity
            target_field: query.hostname
            mapped_at: '2025-12-04T01:35:18.553378+00:00'
