id: 25eabf56-22f0-4915-a1ed-056b8dae0a68
title: Suspicious Dropbox API Usage
status: test
level: high
description: Detects an executable that isn't dropbox but communicates with the Dropbox
    API
author: Florian Roth (Nextron Systems)
date: '2022-04-20'
tags:
    - attack.command-and-control
    - attack.t1105
references:
    - https://app.any.run/tasks/7e906adc-9d11-447f-8641-5f40375ecebb
    - https://www.zscaler.com/blogs/security-research/new-espionage-attack-molerats-apt-targeting-users-middle-east
falsepositives:
    - Legitimate use of the API with a tool that the author wasn't aware of
taxonomy: sigma
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        Initiated: 'true'
        DestinationHostname|endswith:
            - api.dropboxapi.com
            - content.dropboxapi.com
    filter_main_legit_dropbox:
        Image|contains: \Dropbox
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: network_activity
    logsource:
        category:
            source_field: category
            source_value: network_connection
            mapped_at: '2025-11-13T20:21:25.894868+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:25.894868+00:00'
    detection_fields:
        -   source_field: Initiated
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:21:25.894890+00:00'
        -   source_field: DestinationHostname
            target_table: network_activity
            target_field: dst_endpoint.hostname
            mapped_at: '2025-11-13T20:21:25.894892+00:00'
        -   source_field: Image
            target_table: network_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:21:25.894894+00:00'
