id: e54979bd-c5f9-4d6c-967b-a04b19ac4c74
title: Uncommon Outbound Kerberos Connection
status: test
level: medium
description: 'Detects uncommon outbound network activity via Kerberos default port
    indicating possible lateral movement or first stage PrivEsc via delegation.

    '
author: Ilyas Ochkov, oscd.community
date: '2019-10-24'
modified: '2024-03-15'
tags:
    - attack.credential-access
    - attack.t1558
    - attack.lateral-movement
    - attack.t1550.003
references:
    - https://github.com/GhostPack/Rubeus
falsepositives:
    - Web Browsers and third party application might generate similar activity. An
        initial baseline is required.
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''eca91c7c-9214-47b9-b4c5-cb1d7e4f2350''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        DestinationPort: 88
        Initiated: 'true'
    filter_main_lsass:
        Image: C:\Windows\System32\lsass.exe
    filter_optional_chrome:
        Image:
            - C:\Program Files (x86)\Google\Chrome\Application\chrome.exe
            - C:\Program Files\Google\Chrome\Application\chrome.exe
    filter_optional_firefox:
        Image:
            - C:\Program Files (x86)\Mozilla Firefox\firefox.exe
            - C:\Program Files\Mozilla Firefox\firefox.exe
    filter_optional_tomcat:
        Image|endswith: \tomcat\bin\tomcat8.exe
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: network_activity
    logsource:
        category:
            source_field: category
            source_value: network_connection
            mapped_at: '2025-11-13T20:21:11.623665+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:11.623665+00:00'
    detection_fields:
        -   source_field: DestinationPort
            target_table: network_activity
            target_field: dst_endpoint.port
            mapped_at: '2025-11-13T20:21:11.623681+00:00'
        -   source_field: Initiated
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:21:11.623684+00:00'
        -   source_field: Image
            target_table: network_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:21:11.623686+00:00'
