title: Cleartext Protocol Usage
id: d7fb8f0e-bd5f-45c2-b467-19571c490d7e
status: stable
level: low
author: Alexandr Yampolskyi, SOC Prime, Tim Shelton
description: 'Ensure that all account usernames and authentication credentials are
    transmitted across networks using encrypted channels.

    Ensure that an encryption is used for all sensitive information in transit. Ensure
    that an encrypted channels is used for all administrative account access.

    '
references:
    - https://www.cisecurity.org/controls/cis-controls-list/
    - https://www.pcisecuritystandards.org/documents/PCI_DSS_v3-2-1.pdf
    - https://nvlpubs.nist.gov/nistpubs/CSWP/NIST.CSWP.04162018.pdf
falsepositives:
    - Unknown
tags:
    - attack.credential-access
date: '2019-03-26'
modified: '2022-10-10'
logsource:
    category: firewall
detection:
    selection:
        dst_port:
            - 8080
            - 21
            - 80
            - 23
            - 50000
            - 1521
            - 27017
            - 3306
            - 1433
            - 11211
            - 15672
            - 5900
            - 5901
            - 5902
            - 5903
            - 5904
    selection_allow1:
        action:
            - forward
            - accept
            - 2
    selection_allow2:
        blocked: 'false'
    condition: selection and 1 of selection_allow*
ocsf_mapping:
    class_name: network_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: firewall
            mapped_at: '2025-12-04T01:35:04.147738+00:00'
    detection_fields:
        -   source_field: dst_port
            target_table: network_activity
            target_field: dst_endpoint.port
            mapped_at: '2025-12-04T01:35:04.147754+00:00'
        -   source_field: action
            target_table: network_activity
            target_field: action
            mapped_at: '2025-12-04T01:35:04.147756+00:00'
        -   source_field: blocked
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:35:04.147757+00:00'
