title: Office Application Initiated Network Connection Over Uncommon Ports
id: 3b5ba899-9842-4bc2-acc2-12308498bf42
status: experimental
level: medium
author: X__Junior (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
description: Detects an office suit application (Word, Excel, PowerPoint, Outlook)
    communicating to target systems over uncommon ports.
references:
    - https://blogs.blackberry.com/en/2023/07/romcom-targets-ukraine-nato-membership-talks-at-nato-summit
falsepositives:
    - Other ports can be used, apply additional filters accordingly
tags:
    - attack.defense-evasion
    - attack.command-and-control
date: '2023-07-12'
modified: '2024-07-02'
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        Initiated: 'true'
        Image|endswith:
            - \excel.exe
            - \outlook.exe
            - \powerpnt.exe
            - \winword.exe
            - \wordview.exe
    filter_main_common_ports:
        DestinationPort:
            - 53
            - 80
            - 139
            - 443
            - 445
    filter_main_outlook_ports:
        Image|contains: :\Program Files\Microsoft Office\
        Image|endswith: \OUTLOOK.EXE
        DestinationPort:
            - 143
            - 465
            - 587
            - 993
            - 995
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: network_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: network_connection
            mapped_at: '2025-12-04T01:51:34.432998+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:51:34.432998+00:00'
    detection_fields:
        -   source_field: Initiated
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:51:34.433020+00:00'
        -   source_field: Image
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:51:34.433023+00:00'
        -   source_field: DestinationPort
            target_table: network_activity
            target_field: dst_endpoint.port
            mapped_at: '2025-12-04T01:51:34.433026+00:00'
