title: Outbound Network Connection Initiated By Script Interpreter
id: 992a6cae-db6a-43c8-9cec-76d7195c96fc
status: test
level: high
author: frack113, Florian Roth (Nextron Systems)
description: Detects a script interpreter wscript/cscript opening a network connection
    to a non-local network. Adversaries may use script to download malicious payloads.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/28d190330fe44de6ff4767fc400cc10fa7cd6540/atomics/T1105/T1105.md
falsepositives:
    - Legitimate scripts
tags:
    - attack.command-and-control
    - attack.t1105
date: '2022-08-28'
modified: '2024-03-13'
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        Initiated: 'true'
        Image|endswith:
            - \wscript.exe
            - \cscript.exe
    filter_main_local_ranges:
        DestinationIp|cidr:
            - 127.0.0.0/8
            - 10.0.0.0/8
            - 172.16.0.0/12
            - 192.168.0.0/16
            - 169.254.0.0/16
            - ::1/128
            - fe80::/10
            - fc00::/7
    filter_main_ms_ranges:
        DestinationIp|cidr: 20.0.0.0/11
    condition: selection and not 1 of filter_main_*
related:
    -   id: 08249dc0-a28d-4555-8ba5-9255a198e08c
        type: derived
ocsf_mapping:
    class_name: network_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: network_connection
            mapped_at: '2025-12-04T01:51:43.894787+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:51:43.894787+00:00'
    detection_fields:
        -   source_field: Initiated
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:51:43.894804+00:00'
        -   source_field: Image
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:51:43.894805+00:00'
        -   source_field: DestinationIp
            target_table: network_activity
            target_field: dst_endpoint.ip
            mapped_at: '2025-12-04T01:51:43.894807+00:00'
