id: 5205613d-2a63-4412-a895-3a2458b587b3
title: Network Connection Initiated By AddinUtil.EXE
status: test
level: high
description: 'Detects a network connection initiated by the Add-In deployment cache
    updating utility "AddInutil.exe".

    This could indicate a potential command and control communication as this tool
    doesn''t usually initiate network activity.

    '
author: Michael McKinley (@McKinleyMike), Tony Latteri (@TheLatteri)
date: '2023-09-18'
modified: '2024-07-16'
tags:
    - attack.defense-evasion
    - attack.t1218
references:
    - https://www.blue-prints.blog/content/blog/posts/lolbin/addinutil-lolbas.html
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        Initiated: 'true'
        Image|endswith: \addinutil.exe
    condition: selection
ocsf_mapping:
    class_name: network_activity
    logsource:
        category:
            source_field: category
            source_value: network_connection
            mapped_at: '2025-11-13T20:21:09.576595+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:09.576595+00:00'
    detection_fields:
        -   source_field: Initiated
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:21:09.576631+00:00'
        -   source_field: Image
            target_table: network_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:21:09.576635+00:00'
