id: 3ab65069-d82a-4d44-a759-466661a082d1
title: Communication To LocaltoNet Tunneling Service Initiated
status: experimental
level: high
description: 'Detects an executable initiating a network connection to "LocaltoNet"
    tunneling sub-domains.

    LocaltoNet is a reverse proxy that enables localhost services to be exposed to
    the Internet.

    Attackers have been seen to use this service for command-and-control activities
    to bypass MFA and perimeter controls.

    '
author: Andreas Braathen (mnemonic.io)
date: '2024-06-17'
tags:
    - attack.command-and-control
    - attack.t1572
    - attack.t1090
    - attack.t1102
references:
    - https://localtonet.com/documents/supported-tunnels
    - https://cloud.google.com/blog/topics/threat-intelligence/unc3944-targets-saas-applications
falsepositives:
    - Legitimate use of the LocaltoNet service.
taxonomy: sigma
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        DestinationHostname|endswith:
            - .localto.net
            - .localtonet.com
        Initiated: 'true'
    condition: selection
ocsf_mapping:
    class_name: network_activity
    logsource:
        category:
            source_field: category
            source_value: network_connection
            mapped_at: '2025-11-13T20:21:27.454770+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:27.454770+00:00'
    detection_fields:
        -   source_field: DestinationHostname
            target_table: network_activity
            target_field: dst_endpoint.hostname
            mapped_at: '2025-11-13T20:21:27.454780+00:00'
        -   source_field: Initiated
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:21:27.454782+00:00'
