title: Network Connection Initiated To DevTunnels Domain
id: 9501f8e6-8e3d-48fc-a8a6-1089dd5d7ef4
status: test
level: medium
author: Kamran Saifullah
description: 'Detects network connections to Devtunnels domains initiated by a process
    on a system. Attackers can abuse that feature to establish a reverse shell or
    persistence on a machine.

    '
references:
    - https://blueteamops.medium.com/detecting-dev-tunnels-16f0994dc3e2
    - https://learn.microsoft.com/en-us/azure/developer/dev-tunnels/security
    - https://cydefops.com/devtunnels-unleashed
falsepositives:
    - Legitimate use of Devtunnels will also trigger this.
tags:
    - attack.exfiltration
    - attack.t1567.001
date: '2023-11-20'
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        Initiated: 'true'
        DestinationHostname|endswith: .devtunnels.ms
    condition: selection
related:
    -   id: 4b657234-038e-4ad5-997c-4be42340bce4
        type: similar
    -   id: b3e6418f-7c7a-4fad-993a-93b65027a9f1
        type: similar
    -   id: 1cb0c6ce-3d00-44fc-ab9c-6d6d577bf20b
        type: similar
ocsf_mapping:
    class_name: network_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: network_connection
            mapped_at: '2025-12-04T01:51:49.289740+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:51:49.289740+00:00'
    detection_fields:
        -   source_field: Initiated
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:51:49.289755+00:00'
        -   source_field: DestinationHostname
            target_table: network_activity
            target_field: dst_endpoint.hostname
            mapped_at: '2025-12-04T01:51:49.289758+00:00'
