title: Network Connection Initiated By Eqnedt32.EXE
id: a66bc059-c370-472c-a0d7-f8fd1bf9d583
status: test
level: high
author: Max Altgelt (Nextron Systems)
description: Detects network connections from the Equation Editor process "eqnedt32.exe".
references:
    - https://twitter.com/forensicitguy/status/1513538712986079238
    - https://forensicitguy.github.io/xloader-formbook-velvetsweatshop-spreadsheet/
    - https://news.sophos.com/en-us/2019/07/18/a-new-equation-editor-exploit-goes-commercial-as-maldoc-attacks-using-it-spike/
falsepositives:
    - Unlikely
tags:
    - attack.execution
    - attack.t1203
date: '2022-04-14'
modified: '2024-05-31'
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        Image|endswith: \eqnedt32.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: network_connection
            mapped_at: '2025-12-04T01:51:32.526283+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:51:32.526283+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:51:32.526297+00:00'
