title: Telegram Bot API Request
id: c64c5175-5189-431b-a55e-6d9882158251
status: test
level: medium
author: Florian Roth (Nextron Systems)
description: Detects suspicious DNS queries to api.telegram.org used by Telegram Bots
    of any kind
references:
    - https://core.telegram.org/bots/faq
    - https://researchcenter.paloaltonetworks.com/2018/03/unit42-telerat-another-android-trojan-leveraging-telegrams-bot-api-to-target-iranian-users/
    - https://blog.malwarebytes.com/threat-analysis/2016/11/telecrypt-the-ransomware-abusing-telegram-api-defeated/
    - https://www.welivesecurity.com/2016/12/13/rise-telebots-analyzing-disruptive-killdisk-attacks/
falsepositives:
    - Legitimate use of Telegram bots in the company
tags:
    - attack.command-and-control
    - attack.t1102.002
date: '2018-06-05'
modified: '2022-10-09'
logsource:
    category: dns
detection:
    selection:
        query: api.telegram.org
    condition: selection
ocsf_mapping:
    class_name: dns_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: dns
            mapped_at: '2025-12-04T01:35:20.681572+00:00'
    detection_fields:
        -   source_field: query
            target_table: dns_activity
            target_field: query.hostname
            mapped_at: '2025-12-04T01:35:20.681587+00:00'
