id: 786cdae8-fefb-4eb2-9227-04e34060db01
title: Suspicious Wordpad Outbound Connections
status: test
level: medium
description: 'Detects a network connection initiated by "wordpad.exe" over uncommon
    destination ports.

    This might indicate potential process injection activity from a beacon or similar
    mechanisms.

    '
author: X__Junior (Nextron Systems)
date: '2023-07-12'
modified: '2023-12-15'
tags:
    - attack.defense-evasion
    - attack.command-and-control
references:
    - https://blogs.blackberry.com/en/2023/07/romcom-targets-ukraine-nato-membership-talks-at-nato-summit
falsepositives:
    - Other ports can be used, apply additional filters accordingly
taxonomy: sigma
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        Initiated: 'true'
        Image|endswith: \wordpad.exe
    filter_main_ports:
        DestinationPort:
            - 80
            - 139
            - 443
            - 445
            - 465
            - 587
            - 993
            - 995
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: network_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: network_connection
            mapped_at: '2025-11-26T02:37:56.058667+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:37:56.058667+00:00'
    detection_fields:
        -   source_field: Initiated
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:37:56.058684+00:00'
        -   source_field: Image
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:37:56.058687+00:00'
        -   source_field: DestinationPort
            target_table: network_activity
            target_field: dst_endpoint.port
            mapped_at: '2025-11-26T02:37:56.058688+00:00'
