id: 0531e43a-d77d-47c2-b89f-5fe50321c805
title: RegAsm.EXE Initiating Network Connection To Public IP
status: experimental
level: medium
description: Detects "RegAsm.exe" initiating a network connection to public IP adresses
author: frack113
date: '2024-04-25'
tags:
    - attack.defense-evasion
    - attack.t1218.009
references:
    - https://app.any.run/tasks/ec207948-4916-47eb-a0f4-4c6abb2e7668/
    - https://research.splunk.com/endpoint/07921114-6db4-4e2e-ae58-3ea8a52ae93f/
    - https://lolbas-project.github.io/lolbas/Binaries/Regasm/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        Initiated: 'true'
        Image|endswith: \regasm.exe
    filter_main_local_ranges:
        DestinationIp|cidr:
            - 127.0.0.0/8
            - 10.0.0.0/8
            - 172.16.0.0/12
            - 192.168.0.0/16
            - 169.254.0.0/16
            - ::1/128
            - fe80::/10
            - fc00::/7
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: network_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: network_connection
            mapped_at: '2025-11-26T02:38:11.994557+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:38:11.994557+00:00'
    detection_fields:
        -   source_field: Initiated
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:38:11.994576+00:00'
        -   source_field: Image
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:38:11.994578+00:00'
        -   source_field: DestinationIp
            target_table: network_activity
            target_field: dst_endpoint.ip
            mapped_at: '2025-11-26T02:38:11.994579+00:00'
