title: Suspicious Network Connection Binary No CommandLine
id: 20384606-a124-4fec-acbb-8bd373728613
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects suspicious network connections made by a well-known Windows binary
    run with no command line parameters
references:
    - https://redcanary.com/blog/raspberry-robin/
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
date: '2022-07-03'
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        Initiated: 'true'
        Image|endswith:
            - \regsvr32.exe
            - \rundll32.exe
            - \dllhost.exe
        CommandLine|endswith:
            - \regsvr32.exe
            - \rundll32.exe
            - \dllhost.exe
    filter_no_cmdline:
        CommandLine: ''
    filter_null:
        CommandLine: null
    condition: selection and not 1 of filter*
ocsf_mapping:
    class_name: network_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: network_connection
            mapped_at: '2025-12-04T01:51:31.859009+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:51:31.859009+00:00'
    detection_fields:
        -   source_field: Initiated
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:51:31.859025+00:00'
        -   source_field: Image
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:51:31.859027+00:00'
        -   source_field: CommandLine
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:51:31.859029+00:00'
