title: Suspicious DNS Query with B64 Encoded String
id: 4153a907-2451-4e4f-a578-c52bb6881432
status: test
level: medium
author: Florian Roth (Nextron Systems)
description: Detects suspicious DNS queries using base64 encoding
references:
    - https://github.com/krmaxwell/dns-exfiltration
falsepositives:
    - Unknown
tags:
    - attack.exfiltration
    - attack.t1048.003
    - attack.command-and-control
    - attack.t1071.004
date: '2018-05-10'
modified: '2022-10-09'
logsource:
    category: dns
detection:
    selection:
        query|contains: ==.
    condition: selection
ocsf_mapping:
    class_name: dns_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: dns
            mapped_at: '2025-12-04T01:35:19.385678+00:00'
    detection_fields:
        -   source_field: query
            target_table: dns_activity
            target_field: query.hostname
            mapped_at: '2025-12-04T01:35:19.385693+00:00'
