id: c7e91a02-d771-4a6d-a700-42587e0b1095
title: Network Connection Initiated By Regsvr32.EXE
status: test
level: medium
description: Detects a network connection initiated by "Regsvr32.exe"
author: Dmitriy Lifanov, oscd.community
date: '2019-10-25'
modified: '2023-09-18'
tags:
    - attack.execution
    - attack.t1559.001
    - attack.defense-evasion
    - attack.t1218.010
references:
    - https://pentestlab.blog/2017/05/11/applocker-bypass-regsvr32/
    - https://oddvar.moe/2017/12/13/applocker-case-study-how-insecure-is-it-really-part-1/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        Initiated: 'true'
        Image|endswith: \regsvr32.exe
    condition: selection
ocsf_mapping:
    class_name: network_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: network_connection
            mapped_at: '2025-11-26T02:38:46.362607+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:38:46.362607+00:00'
    detection_fields:
        -   source_field: Initiated
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:38:46.362621+00:00'
        -   source_field: Image
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:38:46.362623+00:00'
