id: 1d08ac94-400d-4469-a82f-daee9a908849
title: Communication To Ngrok Tunneling Service Initiated
status: test
level: high
description: 'Detects an executable initiating a network connection to "ngrok" tunneling
    domains.

    Attackers were seen using this "ngrok" in order to store their second stage payloads
    and malware.

    While communication with such domains can be legitimate, often times is a sign
    of either data exfiltration by malicious actors or additional download.

    '
author: Florian Roth (Nextron Systems)
date: '2022-11-03'
modified: '2024-02-02'
tags:
    - attack.exfiltration
    - attack.command-and-control
    - attack.t1567
    - attack.t1568.002
    - attack.t1572
    - attack.t1090
    - attack.t1102
    - attack.s0508
references:
    - https://twitter.com/hakluke/status/1587733971814977537/photo/1
    - https://ngrok.com/docs/secure-tunnels/tunnels/ssh-reverse-tunnel-agent
falsepositives:
    - Legitimate use of the ngrok service.
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''18249279-932f-45e2-b37a-8925f2597670''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        DestinationHostname|contains:
            - tunnel.us.ngrok.com
            - tunnel.eu.ngrok.com
            - tunnel.ap.ngrok.com
            - tunnel.au.ngrok.com
            - tunnel.sa.ngrok.com
            - tunnel.jp.ngrok.com
            - tunnel.in.ngrok.com
    condition: selection
ocsf_mapping:
    class_name: network_activity
    logsource:
        category:
            source_field: category
            source_value: network_connection
            mapped_at: '2025-11-13T20:21:11.630402+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:11.630402+00:00'
    detection_fields:
        -   source_field: DestinationHostname
            target_table: network_activity
            target_field: dst_endpoint.hostname
            mapped_at: '2025-11-13T20:21:11.630432+00:00'
