id: 19bf6fdb-7721-4f3d-867f-53467f6a5db6
title: Communication To Ngrok Tunneling Service - Linux
status: test
level: high
description: Detects an executable accessing an ngrok tunneling endpoint, which could
    be a sign of forbidden exfiltration of data exfiltration by malicious actors
author: Florian Roth (Nextron Systems)
date: '2022-11-03'
tags:
    - attack.exfiltration
    - attack.command-and-control
    - attack.t1567
    - attack.t1568.002
    - attack.t1572
    - attack.t1090
    - attack.t1102
    - attack.s0508
references:
    - https://twitter.com/hakluke/status/1587733971814977537/photo/1
    - https://ngrok.com/docs/secure-tunnels/tunnels/ssh-reverse-tunnel-agent
falsepositives:
    - Legitimate use of ngrok
taxonomy: sigma
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        DestinationHostname|contains:
            - tunnel.us.ngrok.com
            - tunnel.eu.ngrok.com
            - tunnel.ap.ngrok.com
            - tunnel.au.ngrok.com
            - tunnel.sa.ngrok.com
            - tunnel.jp.ngrok.com
            - tunnel.in.ngrok.com
    condition: selection
ocsf_mapping:
    class_name: network_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: network_connection
            mapped_at: '2025-11-26T02:17:57.964302+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-26T02:17:57.964302+00:00'
    detection_fields:
        -   source_field: DestinationHostname
            target_table: network_activity
            target_field: dst_endpoint.hostname
            mapped_at: '2025-11-26T02:17:57.964325+00:00'
