id: 7cd1dcdc-6edf-4896-86dc-d1f19ad64903
title: Network Connection Initiated To Cloudflared Tunnels Domains
status: experimental
level: medium
description: 'Detects network connections to Cloudflared tunnels domains initiated
    by a process on the system.

    Attackers can abuse that feature to establish a reverse shell or persistence on
    a machine.

    '
author: Kamran Saifullah, Nasreddine Bencherchali (Nextron Systems)
date: '2024-05-27'
tags:
    - attack.exfiltration
    - attack.command-and-control
    - attack.t1567.001
references:
    - https://defr0ggy.github.io/research/Abusing-Cloudflared-A-Proxy-Service-To-Host-Share-Applications/
    - https://www.guidepointsecurity.com/blog/tunnel-vision-cloudflared-abused-in-the-wild/
    - Internal Research
falsepositives:
    - Legitimate use of cloudflare tunnels will also trigger this.
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''a1d9eec5-33b2-4177-8d24-27fe754d0812''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        Initiated: 'true'
        DestinationHostname|endswith:
            - .v2.argotunnel.com
            - protocol-v2.argotunnel.com
            - trycloudflare.com
            - update.argotunnel.com
    condition: selection
ocsf_mapping:
    class_name: network_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: network_connection
            mapped_at: '2025-11-26T02:38:03.687862+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:38:03.687862+00:00'
    detection_fields:
        -   source_field: Initiated
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:38:03.687880+00:00'
        -   source_field: DestinationHostname
            target_table: network_activity
            target_field: dst_endpoint.hostname
            mapped_at: '2025-11-26T02:38:03.687883+00:00'
