id: 7e4bfe58-4a47-4709-828d-d86c78b7cc1f
title: Cleartext Protocol Usage Via Netflow
status: stable
level: low
description: 'Ensure that all account usernames and authentication credentials are
    transmitted across networks using encrypted channels

    Ensure that an encryption is used for all sensitive information in transit.

    Ensure that an encrypted channels is used for all administrative account access.

    '
author: Alexandr Yampolskyi, SOC Prime
date: '2019-03-26'
modified: '2022-11-18'
tags:
    - attack.credential-access
references:
    - https://www.cisecurity.org/controls/cis-controls-list/
    - https://www.pcisecuritystandards.org/documents/PCI_DSS_v3-2-1.pdf
    - https://nvlpubs.nist.gov/nistpubs/CSWP/NIST.CSWP.04162018.pdf
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    service: netflow
detection:
    selection:
        destination.port:
            - 8080
            - 21
            - 80
            - 23
            - 50000
            - 1521
            - 27017
            - 1433
            - 11211
            - 3306
            - 15672
            - 5900
            - 5901
            - 5902
            - 5903
            - 5904
    condition: selection
ocsf_mapping:
    class_name: network_activity
    logsource:
        service:
            source_field: service
            source_value: netflow
            mapped_at: '2025-11-13T20:14:25.747353+00:00'
    detection_fields:
        -   source_field: destination.port
            target_table: network_activity
            target_field: dst_endpoint.port
            mapped_at: '2025-11-13T20:14:25.747839+00:00'
