id: 14701da0-4b0f-4ee6-9c95-2ffb4e73bb9a
title: Okta User Account Locked Out
status: test
level: medium
description: Detects when an user account is locked out.
author: Austin Songer @austinsonger
date: '2021-09-12'
modified: '2022-10-09'
tags:
    - attack.impact
    - attack.t1531
references:
    - https://developer.okta.com/docs/reference/api/system-log/
    - https://developer.okta.com/docs/reference/api/event-types/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: okta
    service: okta
detection:
    selection:
        displaymessage: Max sign in attempts exceeded
    condition: selection
ocsf_mapping:
    class_name: authentication
    logsource:
        product:
            source_field: product
            source_value: okta
            mapped_at: '2025-11-13T20:16:13.113398+00:00'
        service:
            source_field: service
            source_value: okta
            mapped_at: '2025-11-13T20:16:13.113398+00:00'
    detection_fields:
        -   source_field: displaymessage
            target_table: authentication
            target_field: message
            mapped_at: '2025-11-13T20:16:13.113417+00:00'
