title: Okta User Account Locked Out
id: 14701da0-4b0f-4ee6-9c95-2ffb4e73bb9a
status: test
level: medium
author: Austin Songer @austinsonger
description: Detects when an user account is locked out.
references:
    - https://developer.okta.com/docs/reference/api/system-log/
    - https://developer.okta.com/docs/reference/api/event-types/
falsepositives:
    - Unknown
tags:
    - attack.impact
    - attack.t1531
date: '2021-09-12'
modified: '2022-10-09'
logsource:
    product: okta
    service: okta
detection:
    selection:
        displaymessage: Max sign in attempts exceeded
    condition: selection
ocsf_mapping:
    class_name: user_access
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: okta
            mapped_at: '2025-12-04T01:37:10.554772+00:00'
        service:
            source_field: service
            source_value: okta
            mapped_at: '2025-12-04T01:37:10.554772+00:00'
    detection_fields:
        -   source_field: displaymessage
            target_table: user_access
            target_field: message
            mapped_at: '2025-12-04T01:37:10.554816+00:00'
