id: 0c97c1d3-4057-45c9-b148-1de94b631931
title: Okta Policy Rule Modified or Deleted
status: test
level: medium
description: Detects when an Policy Rule is Modified or Deleted.
author: Austin Songer @austinsonger
date: '2021-09-12'
modified: '2022-10-09'
tags:
    - attack.impact
references:
    - https://developer.okta.com/docs/reference/api/system-log/
    - https://developer.okta.com/docs/reference/api/event-types/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: okta
    service: okta
detection:
    selection:
        eventtype:
            - policy.rule.update
            - policy.rule.delete
    condition: selection
ocsf_mapping:
    class_name: account_change
    logsource:
        product:
            source_field: product
            source_value: okta
            mapped_at: '2025-11-13T20:16:21.154320+00:00'
        service:
            source_field: service
            source_value: okta
            mapped_at: '2025-11-13T20:16:21.154320+00:00'
    detection_fields:
        -   source_field: eventtype
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:16:21.154332+00:00'
