title: Okta Unauthorized Access to App
id: 6cc2b61b-d97e-42ef-a9dd-8aa8dc951657
status: test
level: medium
author: Austin Songer @austinsonger
description: Detects when unauthorized access to app occurs.
references:
    - https://developer.okta.com/docs/reference/api/system-log/
    - https://developer.okta.com/docs/reference/api/event-types/
falsepositives:
    - User might of believe that they had access.
tags:
    - attack.impact
date: '2021-09-12'
modified: '2022-10-09'
logsource:
    product: okta
    service: okta
detection:
    selection:
        displaymessage: User attempted unauthorized access to app
    condition: selection
ocsf_mapping:
    class_name: user_access
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: okta
            mapped_at: '2025-12-04T01:37:09.097318+00:00'
        service:
            source_field: service
            source_value: okta
            mapped_at: '2025-12-04T01:37:09.097318+00:00'
    detection_fields:
        -   source_field: displaymessage
            target_table: user_access
            target_field: message
            mapped_at: '2025-12-04T01:37:09.097330+00:00'
