id: ee39a9f7-5a79-4b0a-9815-d36b3cf28d3e
title: Okta FastPass Phishing Detection
status: test
level: high
description: Detects when Okta FastPass prevents a known phishing site.
author: Austin Songer @austinsonger
date: '2023-05-07'
tags:
    - attack.initial-access
    - attack.t1566
references:
    - https://sec.okta.com/fastpassphishingdetection
    - https://developer.okta.com/docs/reference/api/system-log/
    - https://developer.okta.com/docs/reference/api/event-types/
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    product: okta
    service: okta
detection:
    selection:
        outcome.reason: FastPass declined phishing attempt
        outcome.result: FAILURE
        eventtype: user.authentication.auth_via_mfa
    condition: selection
ocsf_mapping:
    class_name: authentication
    logsource:
        product:
            source_field: product
            source_value: okta
            mapped_at: '2025-11-13T20:16:17.999283+00:00'
        service:
            source_field: service
            source_value: okta
            mapped_at: '2025-11-13T20:16:17.999283+00:00'
    detection_fields:
        -   source_field: outcome.reason
            target_table: authentication
            target_field: status_detail
            mapped_at: '2025-11-13T20:16:18.980880+00:00'
        -   source_field: outcome.result
            target_table: authentication
            target_field: disposition
            mapped_at: '2025-11-13T20:16:18.980888+00:00'
        -   source_field: eventtype
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:16:18.980890+00:00'
