id: 50e068d7-1e6b-4054-87e5-0a592c40c7e0
title: Okta MFA Reset or Deactivated
status: test
level: medium
description: Detects when an attempt at deactivating  or resetting MFA.
author: Austin Songer @austinsonger
date: '2021-09-21'
modified: '2022-10-09'
tags:
    - attack.persistence
    - attack.credential-access
    - attack.defense-evasion
    - attack.t1556.006
references:
    - https://developer.okta.com/docs/reference/api/system-log/
    - https://developer.okta.com/docs/reference/api/event-types/
falsepositives:
    - If a MFA reset or deactivated was performed by a system administrator.
taxonomy: sigma
logsource:
    product: okta
    service: okta
detection:
    selection:
        eventtype:
            - user.mfa.factor.deactivate
            - user.mfa.factor.reset_all
    condition: selection
ocsf_mapping:
    class_name: account_change
    activity_id: 11
    logsource:
        product:
            source_field: product
            source_value: okta
            mapped_at: '2025-11-26T02:18:24.109154+00:00'
        service:
            source_field: service
            source_value: okta
            mapped_at: '2025-11-26T02:18:24.109154+00:00'
    detection_fields:
        -   source_field: eventtype
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:18:24.109165+00:00'
