id: 19951c21-229d-4ccb-8774-b993c3ff3c5c
title: Okta API Token Created
status: test
level: medium
description: Detects when a API token is created
author: Austin Songer @austinsonger
date: '2021-09-12'
modified: '2022-10-09'
tags:
    - attack.persistence
references:
    - https://developer.okta.com/docs/reference/api/system-log/
    - https://developer.okta.com/docs/reference/api/event-types/
falsepositives:
    - Legitimate creation of an API token by authorized users
taxonomy: sigma
logsource:
    product: okta
    service: okta
detection:
    selection:
        eventtype: system.api_token.create
    condition: selection
ocsf_mapping:
    class_name: account_change
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: okta
            mapped_at: '2025-11-26T02:18:24.662998+00:00'
        service:
            source_field: service
            source_value: okta
            mapped_at: '2025-11-26T02:18:24.662998+00:00'
    detection_fields:
        -   source_field: eventtype
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:18:24.663021+00:00'
