id: 07e97cc6-aed1-43ae-9081-b3470d2367f1
title: Okta Suspicious Activity Reported by End-user
status: test
level: high
description: Detects when an Okta end-user reports activity by their account as being
    potentially suspicious.
author: kelnage
date: '2023-09-07'
tags:
    - attack.resource-development
    - attack.t1586.003
references:
    - https://developer.okta.com/docs/reference/api/system-log/
    - https://github.com/okta/workflows-templates/blob/master/workflows/suspicious_activity_reported/readme.md
falsepositives:
    - If an end-user incorrectly identifies normal activity as suspicious.
taxonomy: sigma
logsource:
    product: okta
    service: okta
detection:
    selection:
        eventtype: user.account.report_suspicious_activity_by_enduser
    condition: selection
ocsf_mapping:
    class_name: account_change
    logsource:
        product:
            source_field: product
            source_value: okta
            mapped_at: '2025-11-13T20:16:13.124721+00:00'
        service:
            source_field: service
            source_value: okta
            mapped_at: '2025-11-13T20:16:13.124721+00:00'
    detection_fields:
        -   source_field: eventtype
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:16:13.124731+00:00'
