title: Okta Admin Functions Access Through Proxy
id: 9058ca8b-f397-4fd1-a9fa-2b7aad4d6309
status: test
level: medium
author: Muhammad Faisal @faisalusuf
description: Detects access to Okta admin functions through proxy.
references:
    - https://www.beyondtrust.com/blog/entry/okta-support-unit-breach
    - https://dataconomy.com/2023/10/23/okta-data-breach/
    - https://blog.cloudflare.com/how-cloudflare-mitigated-yet-another-okta-compromise/
falsepositives:
    - False positives are expected if administrators access these function through
        proxy legitimatly. Apply additional filters if necessary
tags:
    - attack.credential-access
date: '2023-10-25'
logsource:
    product: okta
    service: okta
detection:
    selection:
        debugContext.debugData.requestUri|contains: admin
        securityContext.isProxy: 'true'
    condition: selection
ocsf_mapping:
    class_name: http_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: okta
            mapped_at: '2025-12-04T01:37:06.757308+00:00'
        service:
            source_field: service
            source_value: okta
            mapped_at: '2025-12-04T01:37:06.757308+00:00'
    detection_fields:
        -   source_field: debugContext.debugData.requestUri
            target_table: http_activity
            target_field: http_request.url
            mapped_at: '2025-12-04T01:37:06.757325+00:00'
        -   source_field: securityContext.isProxy
            target_table: http_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:37:06.757327+00:00'
