id: cf1dbc6b-6205-41b4-9b88-a83980d2255b
title: Okta API Token Revoked
status: test
level: medium
description: Detects when a API Token is revoked.
author: Austin Songer @austinsonger
date: '2021-09-12'
modified: '2022-10-09'
tags:
    - attack.impact
references:
    - https://developer.okta.com/docs/reference/api/system-log/
    - https://developer.okta.com/docs/reference/api/event-types/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: okta
    service: okta
detection:
    selection:
        eventtype: system.api_token.revoke
    condition: selection
ocsf_mapping:
    class_name: account_change
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: okta
            mapped_at: '2025-11-26T02:18:44.332306+00:00'
        service:
            source_field: service
            source_value: okta
            mapped_at: '2025-11-26T02:18:44.332306+00:00'
    detection_fields:
        -   source_field: eventtype
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:18:44.332330+00:00'
