id: b6c718dd-8f53-4b9f-98d8-93fdca966969
title: New Okta User Created
status: test
level: informational
description: Detects new user account creation
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-10-25'
tags:
    - attack.credential-access
references:
    - https://developer.okta.com/docs/reference/api/event-types/
falsepositives:
    - Legitimate and authorized user creation
taxonomy: sigma
logsource:
    product: okta
    service: okta
detection:
    selection:
        eventtype: user.lifecycle.create
    condition: selection
ocsf_mapping:
    class_name: account_change
    logsource:
        product:
            source_field: product
            source_value: okta
            mapped_at: '2025-11-13T20:16:17.458375+00:00'
        service:
            source_field: service
            source_value: okta
            mapped_at: '2025-11-13T20:16:17.458375+00:00'
    detection_fields:
        -   source_field: eventtype
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:16:17.458387+00:00'
