title: Okta Suspicious Activity Reported by End-user
id: 07e97cc6-aed1-43ae-9081-b3470d2367f1
status: test
level: high
author: kelnage
description: Detects when an Okta end-user reports activity by their account as being
    potentially suspicious.
references:
    - https://developer.okta.com/docs/reference/api/system-log/
    - https://github.com/okta/workflows-templates/blob/master/workflows/suspicious_activity_reported/readme.md
falsepositives:
    - If an end-user incorrectly identifies normal activity as suspicious.
tags:
    - attack.resource-development
    - attack.t1586.003
date: '2023-09-07'
logsource:
    product: okta
    service: okta
detection:
    selection:
        eventtype: user.account.report_suspicious_activity_by_enduser
    condition: selection
ocsf_mapping:
    class_name: account_change
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: okta
            mapped_at: '2025-12-04T01:37:13.697517+00:00'
        service:
            source_field: service
            source_value: okta
            mapped_at: '2025-12-04T01:37:13.697517+00:00'
    detection_fields:
        -   source_field: eventtype
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:37:13.697534+00:00'
