title: Okta User Session Start Via An Anonymising Proxy Service
id: bde30855-5c53-4c18-ae90-1ff79ebc9578
status: test
level: high
author: kelnage
description: Detects when an Okta user session starts where the user is behind an
    anonymising proxy service.
references:
    - https://developer.okta.com/docs/reference/api/system-log/
    - https://sec.okta.com/articles/2023/08/cross-tenant-impersonation-prevention-and-detection
falsepositives:
    - If a user requires an anonymising proxy due to valid justifications.
tags:
    - attack.defense-evasion
    - attack.t1562.006
date: '2023-09-07'
logsource:
    product: okta
    service: okta
detection:
    selection:
        eventtype: user.session.start
        securitycontext.isproxy: 'true'
    condition: selection
ocsf_mapping:
    class_name: http_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: okta
            mapped_at: '2025-12-04T01:37:18.521726+00:00'
        service:
            source_field: service
            source_value: okta
            mapped_at: '2025-12-04T01:37:18.521726+00:00'
    detection_fields:
        -   source_field: eventtype
            target_table: http_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:37:18.521741+00:00'
        -   source_field: securitycontext.isproxy
            target_table: http_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:37:18.521743+00:00'
