id: 91b76b84-8589-47aa-9605-c837583b82a9
title: Potential Okta Password in AlternateID Field
status: test
level: high
description: 'Detects when a user has potentially entered their password into the

    username field, which will cause the password to be retained in log files.

    '
author: kelnage
date: '2023-04-03'
modified: '2023-10-25'
tags:
    - attack.credential-access
    - attack.t1552
references:
    - https://developer.okta.com/docs/reference/api/system-log/
    - https://www.mitiga.io/blog/how-okta-passwords-can-be-compromised-uncovering-a-risk-to-user-data
    - https://help.okta.com/en-us/Content/Topics/users-groups-profiles/usgp-create-character-restriction.htm
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    product: okta
    service: okta
detection:
    selection:
        legacyeventtype: core.user_auth.login_failed
    filter_main:
        actor.alternateid|re: (^0oa.*|[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,10})
    condition: selection and not filter_main
ocsf_mapping:
    class_name: authentication
    logsource:
        product:
            source_field: product
            source_value: okta
            mapped_at: '2025-11-13T20:16:13.647759+00:00'
        service:
            source_field: service
            source_value: okta
            mapped_at: '2025-11-13T20:16:13.647759+00:00'
    detection_fields:
        -   source_field: legacyeventtype
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:16:14.938392+00:00'
        -   source_field: actor.alternateid
            target_table: authentication
            target_field: actor.user.uid
            mapped_at: '2025-11-13T20:16:14.938409+00:00'
