id: 9f308120-69ed-4506-abde-ac6da81f4310
title: Okta Network Zone Deactivated or Deleted
status: test
level: medium
description: Detects when an Network Zone is Deactivated or Deleted.
author: Austin Songer @austinsonger
date: '2021-09-12'
modified: '2022-10-09'
tags:
    - attack.impact
references:
    - https://developer.okta.com/docs/reference/api/system-log/
    - https://developer.okta.com/docs/reference/api/event-types/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: okta
    service: okta
detection:
    selection:
        eventtype:
            - zone.deactivate
            - zone.delete
    condition: selection
ocsf_mapping:
    class_name: account_change
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: okta
            mapped_at: '2025-11-26T02:18:27.219126+00:00'
        service:
            source_field: service
            source_value: okta
            mapped_at: '2025-11-26T02:18:27.219126+00:00'
    detection_fields:
        -   source_field: eventtype
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:18:27.219148+00:00'
