title: New Okta User Created
id: b6c718dd-8f53-4b9f-98d8-93fdca966969
status: test
level: informational
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects new user account creation
references:
    - https://developer.okta.com/docs/reference/api/event-types/
falsepositives:
    - Legitimate and authorized user creation
tags:
    - attack.credential-access
date: '2023-10-25'
logsource:
    product: okta
    service: okta
detection:
    selection:
        eventtype: user.lifecycle.create
    condition: selection
ocsf_mapping:
    class_name: account_change
    activity_id: 1
    logsource:
        product:
            source_field: product
            source_value: okta
            mapped_at: '2025-12-04T01:37:16.982358+00:00'
        service:
            source_field: service
            source_value: okta
            mapped_at: '2025-12-04T01:37:16.982358+00:00'
    detection_fields:
        -   source_field: eventtype
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:37:16.982374+00:00'
