title: OneLogin User Account Locked
id: a717c561-d117-437e-b2d9-0118a7035d01
status: test
level: low
author: Austin Songer @austinsonger
description: Detects when an user account is locked or suspended.
references:
    - https://developers.onelogin.com/api-docs/1/events/event-resource/
falsepositives:
    - System may lock or suspend user accounts.
tags:
    - attack.impact
date: '2021-10-12'
modified: '2022-12-25'
logsource:
    product: onelogin
    service: onelogin.events
detection:
    selection1:
        event_type_id: 532
    selection2:
        event_type_id: 553
    selection3:
        event_type_id: 551
    condition: 1 of selection*
ocsf_mapping:
    class_name: account_change
    activity_id: 9
    logsource:
        product:
            source_field: product
            source_value: onelogin
            mapped_at: '2025-12-04T01:36:57.761510+00:00'
        service:
            source_field: service
            source_value: onelogin.events
            mapped_at: '2025-12-04T01:36:57.761510+00:00'
    detection_fields:
        -   source_field: event_type_id
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:36:57.761532+00:00'
