title: OneLogin User Assumed Another User
id: 62fff148-278d-497e-8ecd-ad6083231a35
status: test
level: low
author: Austin Songer @austinsonger
description: Detects when an user assumed another user account.
references:
    - https://developers.onelogin.com/api-docs/1/events/event-resource
falsepositives:
    - Unknown
tags:
    - attack.impact
date: '2021-10-12'
modified: '2022-12-25'
logsource:
    product: onelogin
    service: onelogin.events
detection:
    selection:
        event_type_id: 3
    condition: selection
ocsf_mapping:
    class_name: account_change
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: onelogin
            mapped_at: '2025-12-04T01:36:58.215956+00:00'
        service:
            source_field: service
            source_value: onelogin.events
            mapped_at: '2025-12-04T01:36:58.215956+00:00'
    detection_fields:
        -   source_field: event_type_id
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:36:58.215972+00:00'
