title: OpenCanary - REDIS Action Command Attempt
id: 547dfc53-ebf6-4afe-8d2e-793d9574975d
status: experimental
level: high
author: Security Onion Solutions
description: Detects instances where a REDIS service on an OpenCanary node has had
    an action command attempted.
references:
    - https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
    - https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
falsepositives:
    - Unlikely
tags:
    - attack.credential-access
    - attack.collection
    - attack.t1003
    - attack.t1213
date: '2024-03-08'
logsource:
    category: application
    product: opencanary
detection:
    selection:
        logtype: 17001
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: application
            mapped_at: '2025-12-04T01:39:48.591531+00:00'
        product:
            source_field: product
            source_value: opencanary
            mapped_at: '2025-12-04T01:39:48.591531+00:00'
    detection_fields:
        -   source_field: logtype
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:39:48.591641+00:00'
