id: 5498fc09-adc6-4804-b9d9-5cca1f0b8760
title: OpenCanary - HTTPPROXY Login Attempt
status: experimental
level: high
description: 'Detects instances where an HTTPPROXY service on an OpenCanary node has
    had an attempt to proxy another page.

    '
author: Security Onion Solutions
date: '2024-03-08'
tags:
    - attack.initial-access
    - attack.defense-evasion
    - attack.t1090
references:
    - https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
    - https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: application
    product: opencanary
detection:
    selection:
        logtype: 7001
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: application
            mapped_at: '2025-11-26T02:23:29.509776+00:00'
        product:
            source_field: product
            source_value: opencanary
            mapped_at: '2025-11-26T02:23:29.509776+00:00'
    detection_fields:
        -   source_field: logtype
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:23:29.509790+00:00'
