title: OpenCanary - SMB File Open Request
id: 22777c9e-873a-4b49-855f-6072ab861a52
status: experimental
level: high
author: Security Onion Solutions
description: Detects instances where an SMB service on an OpenCanary node has had
    a file open request.
references:
    - https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
    - https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
falsepositives:
    - Unlikely
tags:
    - attack.lateral-movement
    - attack.collection
    - attack.t1021
    - attack.t1005
date: '2024-03-08'
logsource:
    category: application
    product: opencanary
detection:
    selection:
        logtype: 5000
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 14
    logsource:
        category:
            source_field: category
            source_value: application
            mapped_at: '2025-12-04T01:39:47.564015+00:00'
        product:
            source_field: product
            source_value: opencanary
            mapped_at: '2025-12-04T01:39:47.564015+00:00'
    detection_fields:
        -   source_field: logtype
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:39:47.564032+00:00'
