id: 6991bc2b-ae2e-447f-bc55-3a1ba04c14e5
title: OpenCanary - FTP Login Attempt
status: experimental
level: high
description: Detects instances where an FTP service on an OpenCanary node has had
    a login attempt.
author: Security Onion Solutions
date: '2024-03-08'
tags:
    - attack.initial-access
    - attack.exfiltration
    - attack.t1190
    - attack.t1021
references:
    - https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
    - https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: application
    product: opencanary
detection:
    selection:
        logtype: 2000
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: application
            mapped_at: '2025-11-13T20:18:24.511873+00:00'
        product:
            source_field: product
            source_value: opencanary
            mapped_at: '2025-11-13T20:18:24.511873+00:00'
    detection_fields:
        -   source_field: logtype
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:18:24.511879+00:00'
