id: e9856028-fd4e-46e6-b3d1-10f7ceb95078
title: OpenCanary - SNMP OID Request
status: experimental
level: high
description: Detects instances where an SNMP service on an OpenCanary node has had
    an OID request.
author: Security Onion Solutions
date: '2024-03-08'
tags:
    - attack.discovery
    - attack.lateral-movement
    - attack.t1016
    - attack.t1021
references:
    - https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
    - https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: application
    product: opencanary
detection:
    selection:
        logtype: 13001
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: application
            mapped_at: '2025-11-26T02:23:28.898275+00:00'
        product:
            source_field: product
            source_value: opencanary
            mapped_at: '2025-11-26T02:23:28.898275+00:00'
    detection_fields:
        -   source_field: logtype
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:23:28.898290+00:00'
