title: OpenCanary - Telnet Login Attempt
id: 512cff7a-683a-43ad-afe0-dd398e872f36
status: experimental
level: high
author: Security Onion Solutions
description: Detects instances where a Telnet service on an OpenCanary node has had
    a login attempt.
references:
    - https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
    - https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
falsepositives:
    - Unlikely
tags:
    - attack.initial-access
    - attack.command-and-control
    - attack.t1133
    - attack.t1078
date: '2024-03-08'
logsource:
    category: application
    product: opencanary
detection:
    selection:
        logtype: 6001
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: application
            mapped_at: '2025-12-04T01:39:53.959622+00:00'
        product:
            source_field: product
            source_value: opencanary
            mapped_at: '2025-12-04T01:39:53.959622+00:00'
    detection_fields:
        -   source_field: logtype
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:39:53.959636+00:00'
