id: e7d79a1b-25ed-4956-bd56-bd344fa8fd06
title: OpenCanary - MySQL Login Attempt
status: experimental
level: high
description: Detects instances where a MySQL service on an OpenCanary node has had
    a login attempt.
author: Security Onion Solutions
date: '2024-03-08'
tags:
    - attack.credential-access
    - attack.collection
    - attack.t1003
    - attack.t1213
references:
    - https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
    - https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: application
    product: opencanary
detection:
    selection:
        logtype: 8001
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: UNMAPPED
    logsource:
        category:
            source_field: category
            source_value: application
            mapped_at: '2025-11-26T02:23:32.729098+00:00'
        product:
            source_field: product
            source_value: opencanary
            mapped_at: '2025-11-26T02:23:32.729098+00:00'
    detection_fields:
        -   source_field: logtype
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:23:32.729133+00:00'
