id: 7cded4b3-f09e-405a-b96f-24248433ba44
title: OpenCanary - NTP Monlist Request
status: experimental
level: high
description: Detects instances where an NTP service on an OpenCanary node has had
    a NTP monlist request.
author: Security Onion Solutions
date: '2024-03-08'
tags:
    - attack.impact
    - attack.t1498
references:
    - https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
    - https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: application
    product: opencanary
detection:
    selection:
        logtype: 11001
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: application
            mapped_at: '2025-11-13T20:18:24.496106+00:00'
        product:
            source_field: product
            source_value: opencanary
            mapped_at: '2025-11-13T20:18:24.496106+00:00'
    detection_fields:
        -   source_field: logtype
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:18:24.496114+00:00'
