title: OpenCanary - TFTP Request
id: b4e6b016-a2ac-4759-ad85-8000b300d61e
status: experimental
level: high
author: Security Onion Solutions
description: Detects instances where a TFTP service on an OpenCanary node has had
    a request.
references:
    - https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
    - https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
falsepositives:
    - Unlikely
tags:
    - attack.exfiltration
    - attack.t1041
date: '2024-03-08'
logsource:
    category: application
    product: opencanary
detection:
    selection:
        logtype: 10001
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: application
            mapped_at: '2025-12-04T01:39:57.244468+00:00'
        product:
            source_field: product
            source_value: opencanary
            mapped_at: '2025-12-04T01:39:57.244468+00:00'
    detection_fields:
        -   source_field: logtype
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:39:57.244485+00:00'
