id: 9db5446c-b44a-4291-8b89-fcab5609c3b3
title: OpenCanary - VNC Connection Attempt
status: experimental
level: high
description: Detects instances where a VNC service on an OpenCanary node has had a
    connection attempt.
author: Security Onion Solutions
date: '2024-03-08'
tags:
    - attack.lateral-movement
    - attack.t1021
references:
    - https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
    - https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: application
    product: opencanary
detection:
    selection:
        logtype: 12001
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: application
            mapped_at: '2025-11-26T02:23:30.469026+00:00'
        product:
            source_field: product
            source_value: opencanary
            mapped_at: '2025-11-26T02:23:30.469026+00:00'
    detection_fields:
        -   source_field: logtype
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:23:30.469061+00:00'
