id: 547dfc53-ebf6-4afe-8d2e-793d9574975d
title: OpenCanary - REDIS Action Command Attempt
status: experimental
level: high
description: Detects instances where a REDIS service on an OpenCanary node has had
    an action command attempted.
author: Security Onion Solutions
date: '2024-03-08'
tags:
    - attack.credential-access
    - attack.collection
    - attack.t1003
    - attack.t1213
references:
    - https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
    - https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: application
    product: opencanary
detection:
    selection:
        logtype: 17001
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: UNMAPPED
    logsource:
        category:
            source_field: category
            source_value: application
            mapped_at: '2025-11-26T02:23:24.852779+00:00'
        product:
            source_field: product
            source_value: opencanary
            mapped_at: '2025-11-26T02:23:24.852779+00:00'
    detection_fields:
        -   source_field: logtype
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:23:24.852797+00:00'
