id: 6e78f90f-0043-4a01-ac41-f97681613a66
title: OpenCanary - MSSQL Login Attempt Via Windows Authentication
status: experimental
level: high
description: 'Detects instances where an MSSQL service on an OpenCanary node has had
    a login attempt using Windows Authentication.

    '
author: Security Onion Solutions
date: '2024-03-08'
tags:
    - attack.credential-access
    - attack.collection
    - attack.t1003
    - attack.t1213
references:
    - https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
    - https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: application
    product: opencanary
detection:
    selection:
        logtype: 9002
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: UNMAPPED
    logsource:
        category:
            source_field: category
            source_value: application
            mapped_at: '2025-11-26T02:23:29.975879+00:00'
        product:
            source_field: product
            source_value: opencanary
            mapped_at: '2025-11-26T02:23:29.975879+00:00'
    detection_fields:
        -   source_field: logtype
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:23:29.975897+00:00'
