id: 493fb4ab-cdcc-4c4f-818c-0e363bd1e4bb
title: WMI Event Consumer Created Named Pipe
status: test
level: medium
description: Detects the WMI Event Consumer service scrcons.exe creating a named pipe
author: Florian Roth (Nextron Systems)
date: '2021-09-01'
modified: '2023-11-30'
tags:
    - attack.t1047
    - attack.execution
references:
    - https://github.com/RiccardoAncarani/LiquidSnake
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: pipe_created
    product: windows
    definition: Note that you have to configure logging for Named Pipe Events in Sysmon
        config (Event ID 17 and Event ID 18). The basic configuration is in popular
        sysmon configuration (https://github.com/SwiftOnSecurity/sysmon-config), but
        it is worth verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
        https://github.com/olafhartong/sysmon-modular. How to test detection? You
        can check powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
detection:
    selection:
        Image|endswith: \scrcons.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: pipe_created
            mapped_at: '2025-11-26T02:23:56.092765+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:23:56.092765+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:23:56.092780+00:00'
