id: 0adc67e0-a68f-4ffd-9c43-28905aad5d6a
title: HackTool - Koh Default Named Pipe
status: test
level: critical
description: Detects creation of default named pipes used by the Koh tool
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-07-08'
modified: '2023-08-07'
tags:
    - attack.privilege-escalation
    - attack.credential-access
    - attack.t1528
    - attack.t1134.001
references:
    - https://github.com/GhostPack/Koh/blob/0283d9f3f91cf74732ad377821986cfcb088e20a/Clients/BOF/KohClient.c#L12
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: pipe_created
    product: windows
    definition: Note that you have to configure logging for Named Pipe Events in Sysmon
        config (Event ID 17 and Event ID 18). The basic configuration is in popular
        sysmon configuration (https://github.com/SwiftOnSecurity/sysmon-config), but
        it is worth verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
        https://github.com/olafhartong/sysmon-modular. How to test detection? You
        can check powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
detection:
    selection:
        PipeName|contains:
            - \imposecost
            - \imposingcost
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: pipe_created
            mapped_at: '2025-11-13T20:18:41.732307+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:18:41.732307+00:00'
    detection_fields:
        -   source_field: PipeName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:18:41.732319+00:00'
