id: f6451de4-df0a-41fa-8d72-b39f54a08db5
title: PUA - PAExec Default Named Pipe
status: test
level: medium
description: Detects PAExec default named pipe
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-10-26'
tags:
    - attack.execution
    - attack.t1569.002
references:
    - https://github.com/microsoft/Microsoft-365-Defender-Hunting-Queries/blob/efa17a600b43c897b4b7463cc8541daa1987eeb4/Command%20and%20Control/C2-NamedPipe.md
    - https://github.com/poweradminllc/PAExec
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: pipe_created
    product: windows
    definition: Note that you have to configure logging for Named Pipe Events in Sysmon
        config (Event ID 17 and Event ID 18). The basic configuration is in popular
        sysmon configuration (https://github.com/SwiftOnSecurity/sysmon-config), but
        it is worth verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
        https://github.com/olafhartong/sysmon-modular. How to test detection? You
        can check powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
detection:
    selection:
        PipeName|startswith: \PAExec
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: pipe_created
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: PipeName
            target_table: null
            target_field: null
            mapped_at: null
