id: f318b911-ea88-43f4-9281-0de23ede628e
title: PUA - CSExec Default Named Pipe
status: test
level: medium
description: Detects default CSExec pipe creation
author: Nikita Nazarov, oscd.community, Nasreddine Bencherchali (Nextron Systems)
date: '2023-08-07'
modified: '2023-11-30'
tags:
    - attack.lateral-movement
    - attack.t1021.002
    - attack.execution
    - attack.t1569.002
references:
    - https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view
    - https://github.com/malcomvetter/CSExec
falsepositives:
    - Legitimate Administrator activity
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''9e77ed63-2ecf-4c7b-b09d-640834882028''),
    type=<SigmaRelatedType.OBSOLETE: 4>)])'
taxonomy: sigma
logsource:
    category: pipe_created
    product: windows
    definition: Note that you have to configure logging for Named Pipe Events in Sysmon
        config (Event ID 17 and Event ID 18). The basic configuration is in popular
        sysmon configuration (https://github.com/SwiftOnSecurity/sysmon-config), but
        it is worth verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
        https://github.com/olafhartong/sysmon-modular. How to test detection? You
        can check powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
detection:
    selection:
        PipeName|contains: \csexecsvc
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: pipe_created
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: PipeName
            target_table: null
            target_field: null
            mapped_at: null
