id: 0e7163d4-9e19-4fa7-9be6-000c61aad77a
title: CobaltStrike Named Pipe Pattern Regex
status: test
level: critical
description: Detects the creation of a named pipe matching a pattern used by CobaltStrike
    Malleable C2 profiles
author: Florian Roth (Nextron Systems)
date: '2021-07-30'
modified: '2022-12-31'
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1055
references:
    - https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
    - https://gist.github.com/MHaggis/6c600e524045a6d49c35291a21e10752
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''85adeb13-4fc9-4e68-8a4a-c7cb2c336eb7''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''d5601f8c-b26f-4ab0-9035-69e11a8d4ad2''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: pipe_created
    product: windows
    definition: Note that you have to configure logging for Named Pipe Events in Sysmon
        config (Event ID 17 and Event ID 18). The basic configuration is in popular
        sysmon configuration (https://github.com/SwiftOnSecurity/sysmon-config), but
        it is worth verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
        https://github.com/olafhartong/sysmon-modular You can also use other repo,
        e.g. https://github.com/Neo23x0/sysmon-config, https://github.com/olafhartong/sysmon-modular.
        How to test detection? You can always use Cobalt Strike, but also you can
        check powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
detection:
    selection:
        PipeName|re|all:
            - \\mojo\.5688\.8052\.(?:183894939787088877|35780273329370473)[0-9a-f]{2}
            - \\wkssvc_?[0-9a-f]{2}
            - \\ntsvcs[0-9a-f]{2}
            - \\DserNamePipe[0-9a-f]{2}
            - \\SearchTextHarvester[0-9a-f]{2}
            - \\mypipe-(?:f|h)[0-9a-f]{2}
            - \\windows\.update\.manager[0-9a-f]{2,3}
            - \\ntsvcs_[0-9a-f]{2}
            - \\scerpc_?[0-9a-f]{2}
            - \\PGMessagePipe[0-9a-f]{2}
            - \\MsFteWds[0-9a-f]{2}
            - \\f4c3[0-9a-f]{2}
            - \\fullduplex_[0-9a-f]{2}
            - \\msrpc_[0-9a-f]{4}
            - \\win\\msrpc_[0-9a-f]{2}
            - \\f53f[0-9a-f]{2}
            - \\rpc_[0-9a-f]{2}
            - \\spoolss_[0-9a-f]{2}
        PipeName|re: \\Winsock2\\CatalogChangeListener-[0-9a-f]{3}-0,
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: pipe_created
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: PipeName
            target_table: null
            target_field: null
            mapped_at: null
