id: 41504465-5e3a-4a5b-a5b4-2a0baadd4463
title: PsExec Tool Execution From Suspicious Locations - PipeName
status: test
level: medium
description: Detects PsExec default pipe creation where the image executed is located
    in a suspicious location. Which could indicate that the tool is being used in
    an attack
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-08-04'
modified: '2023-09-20'
tags:
    - attack.execution
    - attack.t1569.002
    - attack.s0029
references:
    - https://www.jpcert.or.jp/english/pub/sr/ir_research.html
    - https://jpcertcc.github.io/ToolAnalysisResultSheet
falsepositives:
    - Rare legitimate use of psexec from the locations mentioned above. This will
        require initial tuning based on your environment.
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''f3f3a972-f982-40ad-b63c-bca6afdfad7c''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: pipe_created
    product: windows
    definition: Note that you have to configure logging for Named Pipe Events in Sysmon
        config (Event ID 17 and Event ID 18). The basic configuration is in popular
        sysmon configuration (https://github.com/SwiftOnSecurity/sysmon-config), but
        it is worth verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
        https://github.com/olafhartong/sysmon-modular. How to test detection? You
        can check powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
detection:
    selection:
        PipeName: \PSEXESVC
        Image|contains:
            - :\Users\Public\
            - :\Windows\Temp\
            - \AppData\Local\Temp\
            - \Desktop\
            - \Downloads\
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: UNMAPPED
    logsource:
        category:
            source_field: category
            source_value: pipe_created
            mapped_at: '2025-11-26T02:23:52.276495+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:23:52.276495+00:00'
    detection_fields:
        -   source_field: PipeName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:23:53.484796+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:23:53.484831+00:00'
