id: 1f7025a6-e747-4130-aac4-961eb47015f1
title: HackTool - DiagTrackEoP Default Named Pipe
status: test
level: critical
description: Detects creation of default named pipe used by the DiagTrackEoP POC,
    a tool that abuses "SeImpersonate" privilege.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-08-03'
modified: '2023-08-07'
tags:
    - attack.privilege-escalation
references:
    - https://github.com/Wh04m1001/DiagTrackEoP/blob/3a2fc99c9700623eb7dc7d4b5f314fd9ce5ef51f/main.cpp#L22
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: pipe_created
    product: windows
    definition: Note that you have to configure logging for Named Pipe Events in Sysmon
        config (Event ID 17 and Event ID 18). The basic configuration is in popular
        sysmon configuration (https://github.com/SwiftOnSecurity/sysmon-config), but
        it is worth verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
        https://github.com/olafhartong/sysmon-modular. How to test detection? You
        can check powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
detection:
    selection:
        PipeName|contains: thisispipe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: pipe_created
            mapped_at: '2025-11-13T20:18:42.354473+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:18:42.354473+00:00'
    detection_fields:
        -   source_field: PipeName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:18:42.354480+00:00'
