title: Veeam Backup Servers Credential Dumping Script Execution
id: 976d6e6f-a04b-4900-9713-0134a353e38b
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects execution of a PowerShell script that contains calls to the "Veeam.Backup"
    class, in order to dump stored credentials.
references:
    - https://www.pwndefend.com/2021/02/15/retrieving-passwords-from-veeam-backup-servers/
    - https://labs.withsecure.com/publications/fin7-target-veeam-servers
falsepositives:
    - Administrators backup scripts (must be investigated)
tags:
    - attack.credential-access
date: '2023-05-04'
logsource:
    category: ps_script
    product: windows
    definition: bade5735-5ab0-4aa7-a642-a11be0e40872
detection:
    selection:
        ScriptBlockText|contains|all:
            - '[Credentials]'
            - '[Veeam.Backup.Common.ProtectedStorage]::GetLocalString'
            - Invoke-Sqlcmd
            - Veeam Backup and Replication
    condition: selection
ocsf_mapping:
    class_name: script_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-12-04T01:54:13.749343+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:54:13.749343+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-12-04T01:54:13.749356+00:00'
