id: ddcd88cb-7f62-4ce5-86f9-1704190feb0a
title: Potential In-Memory Execution Using Reflection.Assembly
status: test
level: medium
description: Detects usage of "Reflection.Assembly" load functions to dynamically
    load assemblies in memory
author: frack113
date: '2022-12-25'
tags:
    - attack.defense-evasion
    - attack.t1620
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=50
falsepositives:
    - Legitimate use of the library
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: Script Block Logging must be enable
detection:
    selection:
        ScriptBlockText|contains: '[Reflection.Assembly]::load'
    condition: selection
ocsf_mapping:
    class_name: script_activity
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-13T20:21:48.332034+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:48.332034+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-13T20:21:48.332038+00:00'
