id: 4c4af3cd-2115-479c-8193-6b8bfce9001c
title: PowerShell ICMP Exfiltration
status: test
level: medium
description: Detects Exfiltration Over Alternative Protocol - ICMP. Adversaries may
    steal data by exfiltrating it over an un-encrypted network protocol other than
    that of the existing command and control channel.
author: Bartlomiej Czyz @bczyz1, oscd.community
date: '2020-10-10'
modified: '2022-12-25'
tags:
    - attack.exfiltration
    - attack.t1048.003
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1048.003/T1048.003.md#atomic-test-2---exfiltration-over-alternative-protocol---icmp
falsepositives:
    - Legitimate usage of System.Net.NetworkInformation.Ping class
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains|all:
            - New-Object
            - System.Net.NetworkInformation.Ping
            - .Send(
    condition: selection
ocsf_mapping:
    class_name: script_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-26T02:42:41.143084+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:42:41.143084+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-26T02:42:41.143098+00:00'
