id: bde47d4b-9987-405c-94c7-b080410e8ea7
title: Clearing Windows Console History
status: test
level: high
description: Identifies when a user attempts to clear console history. An adversary
    may clear the command history of a compromised account to conceal the actions
    undertaken during an intrusion.
author: Austin Songer @austinsonger
date: '2021-11-25'
modified: '2022-12-25'
tags:
    - attack.defense-evasion
    - attack.t1070
    - attack.t1070.003
references:
    - https://stefanos.cloud/blog/kb/how-to-clear-the-powershell-command-history/
    - https://www.shellhacks.com/clear-history-powershell/
    - https://community.sophos.com/sophos-labs/b/blog/posts/powershell-command-history-forensics
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection1:
        ScriptBlockText|contains: Clear-History
    selection2a:
        ScriptBlockText|contains:
            - Remove-Item
            - rm
    selection2b:
        ScriptBlockText|contains:
            - ConsoleHost_history.txt
            - (Get-PSReadlineOption).HistorySavePath
    condition: selection1 or selection2a and selection2b
ocsf_mapping:
    class_name: script_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-26T02:43:02.999179+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:43:02.999179+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-26T02:43:02.999210+00:00'
