id: f5d1def8-1de0-4a0e-9794-1f6f27dd605c
title: PowerShell Hotfix Enumeration
status: test
level: medium
description: Detects call to "Win32_QuickFixEngineering" in order to enumerate installed
    hotfixes often used in "enum" scripts by attackers
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-06-21'
tags:
    - attack.discovery
references:
    - https://github.com/411Hall/JAWS/blob/233f142fcb1488172aa74228a666f6b3c5c48f1d/jaws-enum.ps1
falsepositives:
    - Legitimate administration scripts
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains|all:
            - Win32_QuickFixEngineering
            - HotFixID
    condition: selection
ocsf_mapping:
    class_name: script_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-26T02:42:19.603347+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:42:19.603347+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-26T02:42:19.603372+00:00'
