id: 4fdc44df-bfe9-4fcc-b041-68f5a2d3031c
title: Powershell LocalAccount Manipulation
status: test
level: medium
description: 'Adversaries may manipulate accounts to maintain access to victim systems.

    Account manipulation may consist of any action that preserves adversary access
    to a compromised account, such as modifying credentials or permission groups

    '
author: frack113
date: '2021-12-28'
tags:
    - attack.persistence
    - attack.t1098
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1098/T1098.md#atomic-test-1---admin-account-manipulate
    - https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.localaccounts/?view=powershell-5.1
falsepositives:
    - Legitimate administrative script
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains:
            - Disable-LocalUser
            - Enable-LocalUser
            - Get-LocalUser
            - Set-LocalUser
            - New-LocalUser
            - Rename-LocalUser
            - Remove-LocalUser
    condition: selection
ocsf_mapping:
    class_name: script_activity
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-13T20:21:48.278161+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:48.278161+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-13T20:21:48.278173+00:00'
