title: SyncAppvPublishingServer Bypass Powershell Restriction - PS Module
id: fe5ce7eb-dad8-467c-84a9-31ec23bd644a
status: test
level: medium
author: Ensar Şamil, @sblmsrsn, OSCD Community
description: Detects SyncAppvPublishingServer process execution which usually utilized
    by adversaries to bypass PowerShell execution restrictions.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Syncappvpublishingserver/
falsepositives:
    - App-V clients
tags:
    - attack.defense-evasion
    - attack.t1218
date: '2020-10-05'
modified: '2022-12-02'
logsource:
    category: ps_module
    product: windows
    definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
    selection:
        ContextInfo|contains: SyncAppvPublishingServer.exe
    condition: selection
related:
    -   id: fde7929d-8beb-4a4c-b922-be9974671667
        type: derived
    -   id: 9f7aa113-9da6-4a8d-907c-5f1a4b908299
        type: derived
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: ps_module
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: ContextInfo
            target_table: null
            target_field: null
            mapped_at: null
