title: Potential Persistence Via PowerShell User Profile Using Add-Content
id: 05b3e303-faf0-4f4a-9b30-46cc13e69152
status: test
level: medium
author: frack113, Nasreddine Bencherchali (Nextron Systems)
description: Detects calls to "Add-Content" cmdlet in order to modify the content
    of the user profile and potentially adding suspicious commands for persistence
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.013/T1546.013.md
falsepositives:
    - Legitimate administration and tuning scripts that aim to add functionality to
        a user PowerShell session
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1546.013
date: '2021-08-18'
modified: '2023-05-04'
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection_add:
        ScriptBlockText|contains: Add-Content $profile
    selection_options:
        ScriptBlockText|contains:
            - '-Value "IEX '
            - -Value "Invoke-Expression
            - -Value "Invoke-WebRequest
            - -Value "Start-Process
            - '-Value ''IEX '
            - -Value 'Invoke-Expression
            - -Value 'Invoke-WebRequest
            - -Value 'Start-Process
    condition: all of selection_*
ocsf_mapping:
    class_name: script_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-12-04T01:54:36.866822+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:54:36.866822+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-12-04T01:54:36.866837+00:00'
