id: e2812b49-bae0-4b21-b366-7c142eafcde2
title: Potentially Suspicious Call To Win32_NTEventlogFile Class - PSScript
status: test
level: medium
description: Detects usage of the WMI class "Win32_NTEventlogFile" in a potentially
    suspicious way (delete, backup, change permissions, etc.) from a PowerShell script
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-07-13'
tags:
    - attack.defense-evasion
references:
    - https://learn.microsoft.com/en-us/previous-versions/windows/desktop/legacy/aa394225(v=vs.85)
falsepositives:
    - Legitimate administration and backup scripts
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: bade5735-5ab0-4aa7-a642-a11be0e40872
detection:
    selection_class:
        ScriptBlockText|contains: Win32_NTEventlogFile
    selection_function:
        ScriptBlockText|contains:
            - .BackupEventlog(
            - .ChangeSecurityPermissions(
            - .ChangeSecurityPermissionsEx(
            - .ClearEventLog(
            - .Delete(
            - .DeleteEx(
            - .Rename(
            - .TakeOwnerShip(
            - .TakeOwnerShipEx(
    condition: all of selection_*
ocsf_mapping:
    class_name: script_activity
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-13T20:21:46.219732+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:46.219732+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-13T20:21:46.219738+00:00'
