title: Powershell Local Email Collection
id: 2837e152-93c8-43d2-85ba-c3cd3c2ae614
status: test
level: medium
author: frack113
description: 'Adversaries may target user email on local systems to collect sensitive
    information.

    Files containing email data can be acquired from a users local system, such as
    Outlook storage or cache files.

    '
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1114.001/T1114.001.md
falsepositives:
    - Unknown
tags:
    - attack.collection
    - attack.t1114.001
date: '2021-07-21'
modified: '2022-12-25'
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains:
            - Get-Inbox.ps1
            - Microsoft.Office.Interop.Outlook
            - Microsoft.Office.Interop.Outlook.olDefaultFolders
            - -comobject outlook.application
    condition: selection
ocsf_mapping:
    class_name: script_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-12-04T01:54:04.573715+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:54:04.573715+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-12-04T01:54:04.573751+00:00'
