title: Alternate PowerShell Hosts - PowerShell Module
id: 64e8e417-c19a-475a-8d19-98ea705394cc
status: test
level: medium
author: Roberto Rodriguez @Cyb3rWard0g
description: Detects alternate PowerShell hosts potentially bypassing detections looking
    for powershell.exe
references:
    - https://threathunterplaybook.com/hunts/windows/190610-PwshAlternateHosts/notebook.html
falsepositives:
    - Programs using PowerShell directly without invocation of a dedicated interpreter
    - MSP Detection Searcher
    - Citrix ConfigSync.ps1
tags:
    - attack.execution
    - attack.t1059.001
date: '2019-08-11'
modified: '2022-12-13'
logsource:
    category: ps_module
    product: windows
    definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
    selection:
        ContextInfo|contains: '*'
    filter_powershell:
        ContextInfo|contains:
            - = powershell
            - = C:\Windows\System32\WindowsPowerShell\v1.0\powershell
            - = C:\Windows\SysWOW64\WindowsPowerShell\v1.0\powershell
            - = C:/Windows/System32/WindowsPowerShell/v1.0/powershell
            - = C:/Windows/SysWOW64/WindowsPowerShell/v1.0/powershell
    filter_sdiagnhost:
        ContextInfo|contains: = C:\WINDOWS\System32\sdiagnhost.exe -Embedding
    filter_citrix:
        ContextInfo|contains: ConfigSyncRun.exe
    filter_adace:
        ContextInfo|contains: C:\Windows\system32\dsac.exe
    filter_winrm:
        ContextInfo|contains: C:\Windows\system32\wsmprovhost.exe -Embedding
    filter_help_update:
        Payload|contains:
            - Update-Help
            - Failed to update Help for the module
    condition: selection and not 1 of filter_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: ps_module
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: ContextInfo
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Payload
            target_table: null
            target_field: null
            mapped_at: null
