id: fa6a5a45-3ee2-4529-aa14-ee5edc9e29cb
title: Suspicious Get Local Groups Information - PowerShell
status: test
level: low
description: 'Adversaries may attempt to find local system groups and permission settings.

    The knowledge of local system permission groups can help adversaries determine
    which groups exist and which users belong to a particular group.

    Adversaries may use this information to determine which users have elevated permissions,
    such as the users found within the local administrators group.

    '
author: frack113
date: '2021-12-12'
modified: '2022-11-25'
tags:
    - attack.discovery
    - attack.t1069.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1069.001/T1069.001.md
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    test_3:
        ScriptBlockText|contains:
            - get-localgroup
            - Get-LocalGroupMember
    test_6:
        ScriptBlockText|contains|all:
            - Get-WMIObject
            - Win32_Group
    condition: 1 of test_*
ocsf_mapping:
    class_name: script_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-26T02:42:05.408481+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:42:05.408481+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-26T02:42:05.408518+00:00'
