id: 815bfc17-7fc6-4908-a55e-2f37b98cedb4
title: AD Groups Or Users Enumeration Using PowerShell - PoshModule
status: test
level: low
description: 'Adversaries may attempt to find domain-level groups and permission settings.

    The knowledge of domain-level permission groups can help adversaries determine
    which groups exist and which users belong to a particular group.

    Adversaries may use this information to determine which users have elevated permissions,
    such as domain administrators.

    '
author: frack113
date: '2021-12-15'
modified: '2023-01-20'
tags:
    - attack.discovery
    - attack.t1069.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1069.002/T1069.002.md
falsepositives:
    - Administrator script
taxonomy: sigma
logsource:
    category: ps_module
    product: windows
    definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
    selection_ad_principal:
        Payload|contains: get-ADPrincipalGroupMembership
        ContextInfo|contains: get-ADPrincipalGroupMembership
    selection_get_aduser:
        Payload|contains|all:
            - get-aduser
            - '-f '
            - '-pr '
            - DoesNotRequirePreAuth
        ContextInfo|contains|all:
            - get-aduser
            - '-f '
            - '-pr '
            - DoesNotRequirePreAuth
    condition: 1 of selection_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: ps_module
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Payload
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: ContextInfo
            target_table: null
            target_field: null
            mapped_at: null
