id: 313fbb0a-a341-4682-848d-6d6f8c4fab7c
title: Suspicious PowerShell WindowStyle Option
status: test
level: medium
description: 'Adversaries may use hidden windows to conceal malicious activity from
    the plain sight of users.

    In some cases, windows that would typically be displayed when an application carries
    out an operation can be hidden

    '
author: frack113, Tim Shelton (fp AWS)
date: '2021-10-20'
modified: '2023-01-03'
tags:
    - attack.defense-evasion
    - attack.t1564.003
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1564.003/T1564.003.md
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains|all:
            - powershell
            - WindowStyle
            - Hidden
    filter:
        ScriptBlockText|contains|all:
            - :\Program Files\Amazon\WorkSpacesConfig\Scripts\
            - $PSScriptRoot\Module\WorkspaceScriptModule\WorkspaceScriptModule
    condition: selection and not filter
ocsf_mapping:
    class_name: script_activity
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-13T20:21:48.253163+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:48.253163+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-13T20:21:48.253168+00:00'
