title: Use Get-NetTCPConnection
id: b366adb4-d63d-422d-8a2c-186463b5ded0
status: test
level: low
author: frack113
description: Adversaries may attempt to get a listing of network connections to or
    from the compromised system they are currently accessing or from remote systems
    by querying for information over the network.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1049/T1049.md#atomic-test-2---system-network-connections-discovery-with-powershell
falsepositives:
    - Unknown
tags:
    - attack.discovery
    - attack.t1049
date: '2021-12-10'
modified: '2023-10-27'
logsource:
    category: ps_classic_start
    product: windows
detection:
    selection:
        Data|contains: Get-NetTCPConnection
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: ps_classic_start
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Data
            target_table: null
            target_field: null
            mapped_at: null
