id: ca8b77a9-d499-4095-b793-5d5f330d450e
title: PowerShell Credential Prompt
status: test
level: high
description: Detects PowerShell calling a credential prompt
author: John Lambert (idea), Florian Roth (Nextron Systems)
date: '2017-04-09'
modified: '2022-12-25'
tags:
    - attack.credential-access
    - attack.execution
    - attack.t1059.001
references:
    - https://twitter.com/JohnLaTwC/status/850381440629981184
    - https://t.co/ezOTGy1a1G
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains: PromptForCredential
    condition: selection
ocsf_mapping:
    class_name: script_activity
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-13T20:21:46.196124+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:46.196124+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-13T20:21:46.196130+00:00'
