id: 87df9ee1-5416-453a-8a08-e8d4a51e9ce1
title: Delete Volume Shadow Copies Via WMI With PowerShell
status: stable
level: high
description: Shadow Copies deletion using operating systems utilities via PowerShell
author: frack113
date: '2021-06-03'
modified: '2023-10-27'
tags:
    - attack.impact
    - attack.t1490
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md
    - https://www.fortinet.com/blog/threat-research/stomping-shadow-copies-a-second-look-into-deletion-methods
falsepositives:
    - Legitimate Administrator deletes Shadow Copies using operating systems utilities
        for legitimate reason
taxonomy: sigma
logsource:
    category: ps_classic_start
    product: windows
detection:
    selection:
        Data|contains|all:
            - Get-WmiObject
            - Win32_ShadowCopy
        Data|contains:
            - Delete()
            - Remove-WmiObject
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: ps_classic_start
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Data
            target_table: null
            target_field: null
            mapped_at: null
