id: 243de76f-4725-4f2e-8225-a8a69b15ad61
title: PowerShell Create Local User
status: test
level: medium
description: Detects creation of a local user via PowerShell
author: '@ROxPinTeddy'
date: '2020-04-11'
modified: '2022-12-25'
tags:
    - attack.execution
    - attack.t1059.001
    - attack.persistence
    - attack.t1136.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1136.001/T1136.001.md
falsepositives:
    - Legitimate user creation
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains: New-LocalUser
    condition: selection
ocsf_mapping:
    class_name: script_activity
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-13T20:21:48.329419+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:48.329419+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-13T20:21:48.329422+00:00'
