title: Suspicious Non PowerShell WSMAN COM Provider
id: df9a0e0e-fedb-4d6c-8668-d765dfc92aa7
status: test
level: medium
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
description: Detects suspicious use of the WSMAN provider without PowerShell.exe as
    the host application.
references:
    - https://twitter.com/chadtilbury/status/1275851297770610688
    - https://bohops.com/2020/05/12/ws-management-com-another-approach-for-winrm-lateral-movement/
    - https://github.com/bohops/WSMan-WinRM
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1059.001
    - attack.lateral-movement
    - attack.t1021.003
date: '2020-06-24'
modified: '2024-12-27'
logsource:
    product: windows
    service: powershell-classic
detection:
    selection:
        Data|contains: ProviderName=WSMan
    filter_main_ps:
        Data|contains:
            - HostApplication=powershell
            - HostApplication=C:\Windows\System32\WindowsPowerShell\v1.0\powershell
            - HostApplication=C:\Windows\SysWOW64\WindowsPowerShell\v1.0\powershell
            - HostApplication=C:/Windows/System32/WindowsPowerShell/v1.0/powershell
            - HostApplication=C:/Windows/SysWOW64/WindowsPowerShell/v1.0/powershell
    filter_main_host_application_null:
        Data|re: HostId=[a-zA-Z0-9-]{36}\s+EngineVersion=
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: powershell-classic
            mapped_at: null
    detection_fields:
        -   source_field: Data
            target_table: null
            target_field: null
            mapped_at: null
