title: Potential Active Directory Enumeration Using AD Module - PsModule
id: 74176142-4684-4d8a-8b0a-713257e7df8e
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems), frack113
description: Detects usage of the "Import-Module" cmdlet to load the "Microsoft.ActiveDirectory.Management.dl"
    DLL. Which is often used by attackers to perform AD enumeration.
references:
    - https://github.com/samratashok/ADModule
    - https://twitter.com/cyb3rops/status/1617108657166061568?s=20
    - https://www.ired.team/offensive-security-experiments/active-directory-kerberos-abuse/active-directory-enumeration-with-ad-module-without-rsat-or-admin-privileges
falsepositives:
    - Legitimate use of the library for administrative activity
tags:
    - attack.reconnaissance
    - attack.discovery
    - attack.impact
date: '2023-01-22'
logsource:
    category: ps_module
    product: windows
    definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
    selection_cmdlet:
        Payload|contains:
            - 'Import-Module '
            - 'ipmo '
    selection_dll:
        Payload|contains: Microsoft.ActiveDirectory.Management.dll
    condition: all of selection_*
related:
    -   id: 70bc5215-526f-4477-963c-a47a5c9ebd12
        type: similar
    -   id: 9e620995-f2d8-4630-8430-4afd89f77604
        type: similar
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: ps_module
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Payload
            target_table: null
            target_field: null
            mapped_at: null
