id: d93129cd-1ee0-479f-bc03-ca6f129882e3
title: Powershell Detect Virtualization Environment
status: test
level: medium
description: 'Adversaries may employ various system checks to detect and avoid virtualization
    and analysis environments.

    This may include changing behaviors based on the results of checks for the presence
    of artifacts indicative of a virtual machine environment (VME) or sandbox

    '
author: frack113, Duc.Le-GTSC
date: '2021-08-03'
modified: '2022-03-03'
tags:
    - attack.defense-evasion
    - attack.t1497.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1497.001/T1497.001.md
    - https://techgenix.com/malicious-powershell-scripts-evade-detection/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection_action:
        ScriptBlockText|contains:
            - Get-WmiObject
            - gwmi
    selection_module:
        ScriptBlockText|contains:
            - MSAcpi_ThermalZoneTemperature
            - Win32_ComputerSystem
    condition: all of selection*
ocsf_mapping:
    class_name: script_activity
    activity_id: UNMAPPED
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-26T02:42:49.169064+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:42:49.169064+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-26T02:42:49.169099+00:00'
