id: c1344fa2-323b-4d2e-9176-84b4d4821c88
title: Windows Defender Exclusions Added - PowerShell
status: test
level: medium
description: Detects modifications to the Windows Defender configuration settings
    using PowerShell to add exclusions
author: Tim Rauch, Elastic (idea)
date: '2022-09-16'
modified: '2022-11-26'
tags:
    - attack.defense-evasion
    - attack.t1562
    - attack.execution
    - attack.t1059
references:
    - https://www.elastic.co/guide/en/security/current/windows-defender-exclusions-added-via-powershell.html
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''17769c90-230e-488b-a463-e05c08e9d48f''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection_args_exc:
        ScriptBlockText|contains:
            - ' -ExclusionPath '
            - ' -ExclusionExtension '
            - ' -ExclusionProcess '
            - ' -ExclusionIpAddress '
    selection_args_pref:
        ScriptBlockText|contains:
            - 'Add-MpPreference '
            - 'Set-MpPreference '
    condition: all of selection*
ocsf_mapping:
    class_name: script_activity
    activity_id: UNMAPPED
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-26T02:42:34.361959+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:42:34.361959+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-26T02:42:34.361971+00:00'
