id: 34f90d3c-c297-49e9-b26d-911b05a4866c
title: Powershell Keylogging
status: test
level: medium
description: Adversaries may log user keystrokes to intercept credentials as the user
    types them.
author: frack113
date: '2021-07-30'
modified: '2022-07-11'
tags:
    - attack.collection
    - attack.t1056.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218/T1218.md
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1056.001/src/Get-Keystrokes.ps1
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection_basic:
        ScriptBlockText|contains: Get-Keystrokes
    selection_high:
        ScriptBlockText|contains|all:
            - Get-ProcAddress user32.dll GetAsyncKeyState
            - Get-ProcAddress user32.dll GetForegroundWindow
    condition: 1 of selection_*
ocsf_mapping:
    class_name: script_activity
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-13T20:21:46.274235+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:46.274235+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-13T20:21:46.274240+00:00'
