title: AADInternals PowerShell Cmdlets Execution - PsScript
id: 91e69562-2426-42ce-a647-711b8152ced6
status: test
level: high
author: Austin Songer (@austinsonger), Nasreddine Bencherchali (Nextron Systems)
description: Detects ADDInternals Cmdlet execution. A tool for administering Azure
    AD and Office 365. Which can be abused by threat actors to attack Azure AD or
    Office 365.
references:
    - https://o365blog.com/aadinternals/
    - https://github.com/Gerenios/AADInternals
falsepositives:
    - Legitimate use of the library for administrative activity
tags:
    - attack.execution
    - attack.reconnaissance
    - attack.discovery
    - attack.credential-access
    - attack.impact
date: '2022-12-23'
logsource:
    category: ps_script
    product: windows
    definition: Script Block Logging must be enable
detection:
    selection:
        ScriptBlockText|contains:
            - Add-AADInt
            - ConvertTo-AADInt
            - Disable-AADInt
            - Enable-AADInt
            - Export-AADInt
            - Get-AADInt
            - Grant-AADInt
            - Install-AADInt
            - Invoke-AADInt
            - Join-AADInt
            - New-AADInt
            - Open-AADInt
            - Read-AADInt
            - Register-AADInt
            - Remove-AADInt
            - Restore-AADInt
            - Search-AADInt
            - Send-AADInt
            - Set-AADInt
            - Start-AADInt
            - Update-AADInt
    condition: selection
related:
    -   id: c86500e9-a645-4680-98d7-f882c70c1ea3
        type: similar
ocsf_mapping:
    class_name: script_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-12-04T01:54:28.532014+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:54:28.532014+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-12-04T01:54:28.532027+00:00'
