id: 99c49d9c-34ea-45f7-84a7-4751ae6b2cbc
title: Dump Credentials from Windows Credential Manager With PowerShell
status: test
level: medium
description: 'Adversaries may search for common password storage locations to obtain
    user credentials.

    Passwords are stored in several places on a system, depending on the operating
    system or application holding the credentials.

    '
author: frack113
date: '2021-12-20'
modified: '2022-12-25'
tags:
    - attack.credential-access
    - attack.t1555
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1555/T1555.md
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection_kiddie:
        ScriptBlockText|contains:
            - Get-PasswordVaultCredentials
            - Get-CredManCreds
    selection_rename_Password:
        ScriptBlockText|contains|all:
            - New-Object
            - Windows.Security.Credentials.PasswordVault
    selection_rename_credman:
        ScriptBlockText|contains|all:
            - New-Object
            - Microsoft.CSharp.CSharpCodeProvider
            - '[System.Runtime.InteropServices.RuntimeEnvironment]::GetRuntimeDirectory())'
            - Collections.ArrayList
            - System.CodeDom.Compiler.CompilerParameters
    condition: 1 of selection_*
ocsf_mapping:
    class_name: script_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-26T02:43:00.365944+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:43:00.365944+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-26T02:43:00.365960+00:00'
