id: 6bfb8fa7-b2e7-4f6c-8d9d-824e5d06ea9e
title: Invoke-Obfuscation VAR+ Launcher - PowerShell Module
status: test
level: high
description: Detects Obfuscated use of Environment Variables to execute PowerShell
author: Jonathan Cheong, oscd.community
date: '2020-10-15'
modified: '2024-04-05'
tags:
    - attack.defense-evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
references:
    - https://github.com/SigmaHQ/sigma/issues/1009
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''0adfbc14-0ed1-11eb-adc1-0242ac120002''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: ps_module
    product: windows
    definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
    selection_4103:
        Payload|re: cmd.{0,5}(?:/c|/r)(?:\s|)"set\s[a-zA-Z]{3,6}.*(?:\{\d\}){1,}\\"\s+?-f(?:.*\)){1,}.*"
    condition: selection_4103
ocsf_mapping:
    class_name: script_activity
    logsource:
        category:
            source_field: category
            source_value: ps_module
            mapped_at: '2025-11-13T20:21:48.858239+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:48.858239+00:00'
    detection_fields:
        -   source_field: Payload
            target_table: script_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:21:48.858260+00:00'
