title: Registry-Free Process Scope COR_PROFILER
id: 23590215-4702-4a70-8805-8dc9e58314a2
status: test
level: medium
author: frack113
description: 'Adversaries may leverage the COR_PROFILER environment variable to hijack
    the execution flow of programs that load the .NET CLR.

    The COR_PROFILER is a .NET Framework feature which allows developers to specify
    an unmanaged (or external of .NET) profiling DLL to be loaded into each .NET process
    that loads the Common Language Runtime (CLR).

    These profiliers are designed to monitor, troubleshoot, and debug managed code
    executed by the .NET CLR.

    (Citation: Microsoft Profiling Mar 2017)

    (Citation: Microsoft COR_PROFILER Feb 2013)

    '
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1574.012/T1574.012.md#atomic-test-3---registry-free-process-scope-cor_profiler
falsepositives:
    - Legitimate administrative script
tags:
    - attack.persistence
    - attack.t1574.012
date: '2021-12-30'
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains|all:
            - $env:COR_ENABLE_PROFILING
            - $env:COR_PROFILER
            - $env:COR_PROFILER_PATH
    condition: selection
ocsf_mapping:
    class_name: script_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-12-04T01:54:42.488446+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:54:42.488446+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-12-04T01:54:42.488472+00:00'
