title: Potential RemoteFXvGPUDisablement.EXE Abuse - PowerShell ScriptBlock
id: cacef8fc-9d3d-41f7-956d-455c6e881bc5
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects PowerShell module creation where the module Contents are set
    to "function Get-VMRemoteFXPhysicalVideoAdapter". This could be a sign of potential
    abuse of the "RemoteFXvGPUDisablement.exe" binary which is known to be vulnerable
    to module load-order hijacking.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218/T1218.md
    - https://github.com/redcanaryco/AtomicTestHarnesses/blob/7e1e4da116801e3d6fcc6bedb207064577e40572/TestHarnesses/T1218_SignedBinaryProxyExecution/InvokeRemoteFXvGPUDisablementCommand.ps1
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1218
date: '2023-05-09'
logsource:
    category: ps_script
    product: windows
    definition: bade5735-5ab0-4aa7-a642-a11be0e40872
detection:
    selection:
        ScriptBlockText|startswith: function Get-VMRemoteFXPhysicalVideoAdapter {
    condition: selection
related:
    -   id: a6fc3c46-23b8-4996-9ea2-573f4c4d88c5
        type: similar
    -   id: f65e22f9-819e-4f96-9c7b-498364ae7a25
        type: similar
    -   id: 38a7625e-b2cb-485d-b83d-aff137d859f4
        type: similar
ocsf_mapping:
    class_name: script_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-12-04T01:54:16.690168+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:54:16.690168+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-12-04T01:54:16.690184+00:00'
