title: PSAsyncShell - Asynchronous TCP Reverse Shell
id: afd3df04-948d-46f6-ae44-25966c44b97f
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects the use of PSAsyncShell an Asynchronous TCP Reverse Shell written
    in powershell
references:
    - https://github.com/JoelGMSec/PSAsyncShell
falsepositives:
    - Unlikely
tags:
    - attack.execution
    - attack.t1059.001
date: '2022-10-04'
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains: PSAsyncShell
    condition: selection
ocsf_mapping:
    class_name: script_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-12-04T01:54:21.645782+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:54:21.645782+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-12-04T01:54:21.645806+00:00'
