id: 115fdba9-f017-42e6-84cf-d5573bf2ddf8
title: Disable of ETW Trace - Powershell
status: test
level: high
description: Detects usage of powershell cmdlets to disable or remove ETW trace sessions
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-06-28'
modified: '2022-11-25'
tags:
    - attack.defense-evasion
    - attack.t1070
    - attack.t1562.006
    - car.2016-04-002
references:
    - https://medium.com/palantir/tampering-with-windows-event-tracing-background-offense-and-defense-4be7ac62ac63
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''a238b5d0-ce2d-4414-a676-7a531b3d13d6''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection_pwsh_remove:
        ScriptBlockText|contains: 'Remove-EtwTraceProvider '
    selection_pwsh_set:
        ScriptBlockText|contains|all:
            - 'Set-EtwTraceProvider '
            - '0x11'
    condition: 1 of selection*
ocsf_mapping:
    class_name: script_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-26T02:42:14.033843+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:42:14.033843+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-26T02:42:14.033870+00:00'
