title: Suspicious PowerShell Mailbox SMTP Forward Rule
id: 15b7abbb-8b40-4d01-9ee2-b51994b1d474
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects usage of the powerShell Set-Mailbox Cmdlet to set-up an SMTP
    forwarding rule.
references:
    - https://m365internals.com/2022/10/07/hunting-in-on-premises-exchange-server-logs/
falsepositives:
    - Legitimate usage of the cmdlet to forward emails
tags:
    - attack.exfiltration
date: '2022-10-26'
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains|all:
            - 'Set-Mailbox '
            - ' -DeliverToMailboxAndForward '
            - ' -ForwardingSmtpAddress '
    condition: selection
ocsf_mapping:
    class_name: script_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-12-04T01:54:26.840594+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:54:26.840594+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-12-04T01:54:26.840607+00:00'
