title: Bad Opsec Powershell Code Artifacts
id: 8d31a8ce-46b5-4dd6-bdc3-680931f1db86
status: test
level: critical
author: ok @securonix invrep_de, oscd.community
description: 'focuses on trivial artifacts observed in variants of prevalent offensive
    ps1 payloads, including

    Cobalt Strike Beacon, PoshC2, Powerview, Letmein, Empire, Powersploit, and other
    attack payloads

    that often undergo minimal changes by attackers due to bad opsec.

    '
references:
    - https://newtonpaul.com/analysing-fileless-malware-cobalt-strike-beacon/
    - https://labs.sentinelone.com/top-tier-russian-organized-cybercrime-group-unveils-fileless-stealthy-powertrick-backdoor-for-high-value-targets/
    - https://www.mdeditor.tw/pl/pgRt
falsepositives:
    - Moderate-to-low; Despite the shorter length/lower entropy for some of these,
        because of high specificity, fp appears to be fairly limited in many environments.
tags:
    - attack.execution
    - attack.t1059.001
date: '2020-10-09'
modified: '2022-12-25'
logsource:
    category: ps_module
    product: windows
    definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
    selection_4103:
        Payload|contains:
            - $DoIt
            - harmj0y
            - mattifestation
            - _RastaMouse
            - tifkin_
            - '0xdeadbeef'
    condition: selection_4103
related:
    -   id: 73e733cc-1ace-3212-a107-ff2523cc9fc3
        type: derived
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: ps_module
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Payload
            target_table: null
            target_field: null
            mapped_at: null
