title: Suspicious FromBase64String Usage On Gzip Archive - Ps Script
id: df69cb1d-b891-4cd9-90c7-d617d90100ce
status: test
level: medium
author: frack113
description: Detects attempts of decoding a base64 Gzip archive in a PowerShell script.
    This technique is often used as a method to load malicious content into memory
    afterward.
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=43
falsepositives:
    - Legitimate administrative script
tags:
    - attack.command-and-control
    - attack.t1132.001
date: '2022-12-23'
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains|all:
            - FromBase64String
            - MemoryStream
            - H4sI
    condition: selection
related:
    -   id: d75d6b6b-adb9-48f7-824b-ac2e786efe1f
        type: similar
ocsf_mapping:
    class_name: script_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-12-04T01:55:02.490702+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:55:02.490702+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-12-04T01:55:02.490720+00:00'
