id: 3ceb2083-a27f-449a-be33-14ec1b7cc973
title: Silence.EDA Detection
status: test
level: critical
description: Detects Silence EmpireDNSAgent as described in the Group-IP report
author: Alina Stepchenkova, Group-IB, oscd.community
date: '2019-11-01'
modified: '2023-04-03'
tags:
    - attack.execution
    - attack.t1059.001
    - attack.command-and-control
    - attack.t1071.004
    - attack.t1572
    - attack.impact
    - attack.t1529
    - attack.g0091
    - attack.s0363
references:
    - https://www.group-ib.com/resources/threat-research/silence_2.0.going_global.pdf
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    empire:
        ScriptBlockText|contains|all:
            - System.Diagnostics.Process
            - Stop-Computer
            - Restart-Computer
            - Exception in execution
            - $cmdargs
            - Close-Dnscat2Tunnel
    dnscat:
        ScriptBlockText|contains|all:
            - set type=$LookupType`nserver
            - $Command | nslookup 2>&1 | Out-String
            - New-RandomDNSField
            - '[Convert]::ToString($SYNOptions, 16)'
            - $Session.Dead = $True
            - $Session["Driver"] -eq
    condition: empire and dnscat
ocsf_mapping:
    class_name: script_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-26T02:42:07.972023+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:42:07.972023+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-26T02:42:07.972037+00:00'
