id: 48a45d45-8112-416b-8a67-46e03a4b2107
title: Remove Account From Domain Admin Group
status: test
level: medium
description: 'Adversaries may interrupt availability of system and network resources
    by inhibiting access to accounts utilized by legitimate users.

    Accounts may be deleted, locked, or manipulated (ex: changed credentials) to remove
    access to accounts.

    '
author: frack113
date: '2021-12-26'
tags:
    - attack.impact
    - attack.t1531
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1531/T1531.md#atomic-test-3---remove-account-from-domain-admin-group
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains|all:
            - Remove-ADGroupMember
            - '-Identity '
            - '-Members '
    condition: selection
ocsf_mapping:
    class_name: script_activity
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-13T20:21:48.262390+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:48.262390+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-13T20:21:48.262396+00:00'
