title: Powershell DNSExfiltration
id: d59d7842-9a21-4bc6-ba98-64bfe0091355
status: test
level: high
author: frack113
description: DNSExfiltrator allows for transferring (exfiltrate) a file over a DNS
    request covert channel
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1048/T1048.md#atomic-test-3---dnsexfiltration-doh
    - https://github.com/Arno0x/DNSExfiltrator
falsepositives:
    - Legitimate script
tags:
    - attack.exfiltration
    - attack.t1048
date: '2022-01-07'
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection_cmdlet:
        ScriptBlockText|contains: Invoke-DNSExfiltrator
        ScriptBlockText|contains|all:
            - ' -i '
            - ' -d '
            - ' -p '
            - ' -doh '
            - ' -t '
    condition: selection_cmdlet
ocsf_mapping:
    class_name: script_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-12-04T01:53:58.635086+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:53:58.635086+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-12-04T01:53:58.635108+00:00'
