title: Code Executed Via Office Add-in XLL File
id: 36fbec91-fa1b-4d5d-8df1-8d8edcb632ad
status: test
level: high
author: frack113
description: 'Adversaries may abuse Microsoft Office add-ins to obtain persistence
    on a compromised system.

    Office add-ins can be used to add functionality to Office programs

    '
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1137.006/T1137.006.md
falsepositives:
    - Unknown
tags:
    - attack.persistence
    - attack.t1137.006
date: '2021-12-28'
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains|all:
            - 'new-object '
            - '-ComObject '
            - .application
            - .RegisterXLL
    condition: selection
ocsf_mapping:
    class_name: script_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-12-04T01:54:23.431923+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:54:23.431923+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-12-04T01:54:23.431940+00:00'
