id: daf7eb81-35fd-410d-9d7a-657837e602bb
title: Zip A Folder With PowerShell For Staging In Temp  - PowerShell Module
status: test
level: medium
description: 'Detects PowerShell scripts that make use of the "Compress-Archive" Cmdlet
    in order to compress folders and files where the output is stored in a potentially
    suspicious location that is used often by malware for exfiltration.

    An adversary might compress data (e.g., sensitive documents) that is collected
    prior to exfiltration in order to make it portable and minimize the amount of
    data sent over the network.

    '
author: Nasreddine Bencherchali (Nextron Systems), frack113
date: '2021-07-20'
modified: '2023-12-18'
tags:
    - attack.collection
    - attack.t1074.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1074.001/T1074.001.md
    - https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-347a
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''71ff406e-b633-4989-96ec-bc49d825a412''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''b7a3c9a3-09ea-4934-8864-6a32cacd98d9''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''85a8e5ba-bd03-4bfb-bbfa-a4409a8f8b98''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: ps_module
    product: windows
    definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
    selection:
        ContextInfo|contains|all:
            - Compress-Archive -Path*-DestinationPath $env:TEMP
            - Compress-Archive -Path*-DestinationPath*\AppData\Local\Temp\
            - Compress-Archive -Path*-DestinationPath*:\Windows\Temp\
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: ps_module
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: ContextInfo
            target_table: null
            target_field: null
            mapped_at: null
