id: 03409c93-a7c7-49ba-9a4c-a00badf2a153
title: Troubleshooting Pack Cmdlet Execution
status: test
level: medium
description: Detects execution of "TroubleshootingPack" cmdlets to leverage CVE-2022-30190
    or action similar to "msdt" lolbin (as described in LOLBAS)
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-06-21'
tags:
    - attack.defense-evasion
    - attack.t1202
references:
    - https://twitter.com/nas_bench/status/1537919885031772161
    - https://lolbas-project.github.io/lolbas/Binaries/Msdt/
falsepositives:
    - Legitimate usage of "TroubleshootingPack" cmdlet for troubleshooting purposes
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains|all:
            - Invoke-TroubleshootingPack
            - C:\Windows\Diagnostics\System\PCW
            - -AnswerFile
            - -Unattended
    condition: selection
ocsf_mapping:
    class_name: script_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-26T02:42:42.398330+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:42:42.398330+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-26T02:42:42.398342+00:00'
