title: Powershell Token Obfuscation - Powershell
id: f3a98ce4-6164-4dd4-867c-4d83de7eca51
status: test
level: high
author: frack113
description: Detects TOKEN OBFUSCATION technique from Invoke-Obfuscation
references:
    - https://github.com/danielbohannon/Invoke-Obfuscation
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1027.009
date: '2022-12-27'
modified: '2023-03-24'
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|re|all:
            - \w+`(\w+|-|.)`[\w+|\s]
            - '"(\{\d\}){2,}"\s*-f'
        ScriptBlockText|re: (?i)\$\{`?e`?n`?v`?:`?p`?a`?t`?h`?\}
    filter_envpath:
        ScriptBlockText|contains: ${env:path}
    filter_chocolatey:
        ScriptBlockText|contains:
            - it will return true or false instead
            - The function also prevents `Get-ItemProperty` from failing
    filter_exchange:
        Path|startswith: C:\Program Files\Microsoft\Exchange Server\
        Path|endswith: \bin\servicecontrol.ps1
        ScriptBlockText|contains: '`r`n'
    condition: selection and not 1 of filter_*
related:
    -   id: deb9b646-a508-44ee-b7c9-d8965921c6b6
        type: similar
ocsf_mapping:
    class_name: script_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-12-04T01:54:23.028806+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:54:23.028806+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-12-04T01:54:23.028821+00:00'
        -   source_field: Path
            target_table: script_activity
            target_field: script.file.path
            mapped_at: '2025-12-04T01:54:23.028823+00:00'
