id: c5b20776-639a-49bf-94c7-84f912b91c15
title: Netcat The Powershell Version
status: test
level: medium
description: Adversaries may use a non-application layer protocol for communication
    between host and C2 server or among infected hosts within a network
author: frack113
date: '2021-07-21'
modified: '2023-10-27'
tags:
    - attack.command-and-control
    - attack.t1095
references:
    - https://nmap.org/ncat/
    - https://github.com/besimorhino/powercat
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1095/T1095.md
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''bf7286e7-c0be-460b-a7e8-5b2e07ecc2f2''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: ps_classic_start
    product: windows
detection:
    selection:
        Data|contains:
            - 'powercat '
            - powercat.ps1
    condition: selection
ocsf_mapping:
    class_name: null
    logsource:
        category:
            source_field: category
            source_value: ps_classic_start
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Data
            target_table: null
            target_field: null
            mapped_at: null
