id: 42821614-9264-4761-acfc-5772c3286f76
title: Root Certificate Installed - PowerShell
status: test
level: medium
description: Adversaries may install a root certificate on a compromised system to
    avoid warnings when connecting to adversary controlled web servers.
author: oscd.community, @redcanary, Zach Stanford @svch0st
date: '2020-10-10'
modified: '2022-12-02'
tags:
    - attack.defense-evasion
    - attack.t1553.004
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1553.004/T1553.004.md
falsepositives:
    - Help Desk or IT may need to manually add a corporate Root CA on occasion. Need
        to test if GPO push doesn't trigger FP
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection1:
        ScriptBlockText|contains|all:
            - Move-Item
            - Cert:\LocalMachine\Root
    selection2:
        ScriptBlockText|contains|all:
            - Import-Certificate
            - Cert:\LocalMachine\Root
    condition: 1 of selection*
ocsf_mapping:
    class_name: script_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-26T02:41:12.337550+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:41:12.337550+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-26T02:41:12.337570+00:00'
