id: 99c4658d-2c5e-4d87-828d-7c066ca537c3
title: Disable-WindowsOptionalFeature Command PowerShell
status: test
level: high
description: 'Detect built in PowerShell cmdlet Disable-WindowsOptionalFeature, Deployment
    Image Servicing and Management tool.

    Similar to DISM.exe, this cmdlet is used to enumerate, install, uninstall, configure,
    and update features and packages in Windows images

    '
author: frack113
date: '2022-09-10'
tags:
    - attack.defense-evasion
    - attack.t1562.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/5b67c9b141fa3918017f8fa44f2f88f0b1ecb9e1/atomics/T1562.001/T1562.001.md
    - https://learn.microsoft.com/en-us/powershell/module/dism/disable-windowsoptionalfeature?view=windowsserver2022-ps
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection_cmd:
        ScriptBlockText|contains|all:
            - Disable-WindowsOptionalFeature
            - -Online
            - -FeatureName
    selection_feature:
        ScriptBlockText|contains:
            - Windows-Defender-Gui
            - Windows-Defender-Features
            - Windows-Defender
            - Windows-Defender-ApplicationGuard
    condition: all of selection*
ocsf_mapping:
    class_name: script_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-26T02:41:46.087221+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:41:46.087221+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-26T02:41:46.087231+00:00'
