title: Suspicious PowerShell Download
id: 3236fcd0-b7e3-4433-b4f8-86ad61a9af2d
status: test
level: medium
author: Florian Roth (Nextron Systems)
description: Detects suspicious PowerShell download command
references:
    - https://www.trendmicro.com/en_us/research/22/j/lv-ransomware-exploits-proxyshell-in-attack.html
falsepositives:
    - PowerShell scripts that download content from the Internet
tags:
    - attack.execution
    - attack.t1059.001
date: '2017-03-05'
modified: '2023-10-27'
logsource:
    category: ps_classic_start
    product: windows
detection:
    selection_webclient:
        Data|contains: Net.WebClient
    selection_download:
        Data|contains:
            - .DownloadFile(
            - .DownloadString(
    condition: all of selection_*
related:
    -   id: 65531a81-a694-4e31-ae04-f8ba5bc33759
        type: derived
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: ps_classic_start
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Data
            target_table: null
            target_field: null
            mapped_at: null
