id: e55a5195-4724-480e-a77e-3ebe64bd3759
title: Invoke-Obfuscation Via Use MSHTA - PowerShell
status: test
level: high
description: Detects Obfuscated Powershell via use MSHTA in Scripts
author: Nikita Nazarov, oscd.community
date: '2020-10-08'
modified: '2022-11-29'
tags:
    - attack.defense-evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
references:
    - https://github.com/SigmaHQ/sigma/issues/1009
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection_4104:
        ScriptBlockText|contains|all:
            - set
            - '&&'
            - mshta
            - vbscript:createobject
            - .run
            - (window.close)
    condition: selection_4104
ocsf_mapping:
    class_name: script_activity
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-13T20:21:46.238269+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:46.238269+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-13T20:21:46.238274+00:00'
