title: Extracting Information with PowerShell
id: bd5971a7-626d-46ab-8176-ed643f694f68
status: test
level: medium
author: frack113
description: 'Adversaries may search local file systems and remote file shares for
    files containing insecurely stored credentials.

    These can be files created by users to store their own credentials, shared credential
    stores for a group of individuals,

    configuration files containing passwords for a system or service, or source code/binary
    files containing embedded passwords.

    '
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.001/T1552.001.md
falsepositives:
    - Unknown
tags:
    - attack.credential-access
    - attack.t1552.001
date: '2021-12-19'
modified: '2022-12-25'
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains|all:
            - ls
            - ' -R'
            - 'select-string '
            - '-Pattern '
    condition: selection
ocsf_mapping:
    class_name: script_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-12-04T01:54:08.043338+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:54:08.043338+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-12-04T01:54:08.043368+00:00'
