id: 363eccc0-279a-4ccf-a3ab-24c2e63b11fb
title: Powershell Create Scheduled Task
status: test
level: medium
description: Adversaries may abuse the Windows Task Scheduler to perform task scheduling
    for initial or recurring execution of malicious code
author: frack113
date: '2021-12-28'
tags:
    - attack.persistence
    - attack.t1053.005
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1053.005/T1053.005.md#atomic-test-4---powershell-cmdlet-scheduled-task
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1053.005/T1053.005.md#atomic-test-6---wmi-invoke-cimmethod-scheduled-task
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection_cmdlet:
        ScriptBlockText|contains:
            - New-ScheduledTaskAction
            - New-ScheduledTaskTrigger
            - New-ScheduledTaskPrincipal
            - New-ScheduledTaskSettingsSet
            - New-ScheduledTask
            - Register-ScheduledTask
    selection_cimmethod:
        ScriptBlockText|contains|all:
            - Invoke-CimMethod
            - -ClassName
            - PS_ScheduledTask
            - -NameSpace
            - Root\Microsoft\Windows\TaskScheduler
    condition: 1 of selection_*
ocsf_mapping:
    class_name: script_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-26T02:41:37.704643+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:41:37.704643+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-26T02:41:37.704672+00:00'
