title: Suspicious PowerShell Invocations - Generic - PowerShell Module
id: bbb80e91-5746-4fbe-8898-122e2cafdbf4
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects suspicious PowerShell invocation command parameters
references:
    - Internal Research
falsepositives:
    - Very special / sneaky PowerShell scripts
tags:
    - attack.execution
    - attack.t1059.001
date: '2017-03-12'
modified: '2023-01-03'
logsource:
    category: ps_module
    product: windows
    definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
    selection_encoded:
        ContextInfo|contains:
            - ' -enc '
            - ' -EncodedCommand '
            - ' -ec '
    selection_hidden:
        ContextInfo|contains:
            - ' -w hidden '
            - ' -window hidden '
            - ' -windowstyle hidden '
            - ' -w 1 '
    selection_noninteractive:
        ContextInfo|contains:
            - ' -noni '
            - ' -noninteractive '
    condition: all of selection*
related:
    -   id: 3d304fda-78aa-43ed-975c-d740798a49c1
        type: derived
    -   id: ed965133-513f-41d9-a441-e38076a0798f
        type: similar
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: ps_module
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: ContextInfo
            target_table: null
            target_field: null
            mapped_at: null
