id: 35f41cd7-c98e-469f-8a02-ec4ba0cc7a7e
title: PowerShell Write-EventLog Usage
status: test
level: medium
description: Detects usage of the "Write-EventLog" cmdlet with 'RawData' flag. The
    cmdlet can be levreage to write malicious payloads to the EventLog and then retrieve
    them later for later use
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-08-16'
tags:
    - attack.defense-evasion
references:
    - https://www.blackhillsinfosec.com/windows-event-logs-for-red-teams/
falsepositives:
    - Legitimate applications writing events via this cmdlet. Investigate alerts to
        determine if the action is benign
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains|all:
            - Write-EventLog
            - '-RawData '
    condition: selection
ocsf_mapping:
    class_name: script_activity
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-13T20:21:48.301698+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:48.301698+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-13T20:21:48.301702+00:00'
