id: b5522a23-82da-44e5-9c8b-e10ed8955f88
title: Powershell Execute Batch Script
status: test
level: medium
description: 'Adversaries may abuse the Windows command shell for execution.

    The Windows command shell ([cmd](https://attack.mitre.org/software/S0106)) is
    the primary command prompt on Windows systems.

    The Windows command prompt can be used to control almost any aspect of a system,
    with various permission levels required for different subsets of commands.

    Batch files (ex: .bat or .cmd) also provide the shell with a list of sequential
    commands to run, as well as normal scripting operations such as conditionals and
    loops.

    Common uses of batch files include long or repetitive tasks, or the need to run
    the same set of commands on multiple system

    '
author: frack113
date: '2022-01-02'
tags:
    - attack.execution
    - attack.t1059.003
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1059.003/T1059.003.md#atomic-test-1---create-and-execute-batch-script
falsepositives:
    - Legitimate administration script
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection_start:
        ScriptBlockText|contains: Start-Process
    selection_batch:
        ScriptBlockText|contains:
            - .cmd
            - .bat
    condition: all of selection_*
ocsf_mapping:
    class_name: script_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-26T02:42:53.061808+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:42:53.061808+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-26T02:42:53.061822+00:00'
