id: e6cb92b4-b470-4eb8-8a9d-d63e8583aae0
title: Invoke-Obfuscation RUNDLL LAUNCHER - PowerShell
status: test
level: medium
description: Detects Obfuscated Powershell via RUNDLL LAUNCHER
author: Timur Zinniatullin, oscd.community
date: '2020-10-18'
modified: '2022-11-29'
tags:
    - attack.defense-evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
references:
    - https://github.com/SigmaHQ/sigma/issues/1009
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection_4104:
        ScriptBlockText|contains|all:
            - rundll32.exe
            - shell32.dll
            - shellexec_rundll
            - powershell
    condition: selection_4104
ocsf_mapping:
    class_name: script_activity
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-13T20:21:48.327104+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:48.327104+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-13T20:21:48.327110+00:00'
