title: Automated Collection Bookmarks Using Get-ChildItem PowerShell
id: e0565f5d-d420-4e02-8a68-ac00d864f9cf
status: test
level: low
author: frack113
description: 'Adversaries may enumerate browser bookmarks to learn more about compromised
    hosts.

    Browser bookmarks may reveal personal information about users (ex: banking sites,
    interests, social media, etc.) as well as details about

    internal network resources such as servers, tools/dashboards, or other related
    infrastructure.

    '
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1217/T1217.md
falsepositives:
    - Unknown
tags:
    - attack.discovery
    - attack.t1217
date: '2021-12-13'
modified: '2022-12-25'
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains|all:
            - Get-ChildItem
            - ' -Recurse '
            - ' -Path '
            - ' -Filter Bookmarks'
            - ' -ErrorAction SilentlyContinue'
            - ' -Force'
    condition: selection
ocsf_mapping:
    class_name: script_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-12-04T01:54:27.247896+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:54:27.247896+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-12-04T01:54:27.247911+00:00'
