title: Invoke-Obfuscation Via Use Rundll32 - PowerShell Module
id: 88a22f69-62f9-4b8a-aa00-6b0212f2f05a
status: test
level: high
author: Nikita Nazarov, oscd.community
description: Detects Obfuscated Powershell via use Rundll32 in Scripts
references:
    - https://github.com/SigmaHQ/sigma/issues/1009
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
date: '2019-10-08'
modified: '2022-11-29'
logsource:
    category: ps_module
    product: windows
    definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
    selection_4103:
        Payload|contains|all:
            - '&&'
            - rundll32
            - shell32.dll
            - shellexec_rundll
        Payload|contains:
            - value
            - invoke
            - comspec
            - iex
    condition: selection_4103
related:
    -   id: a5a30a6e-75ca-4233-8b8c-42e0f2037d3b
        type: derived
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: ps_module
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Payload
            target_table: null
            target_field: null
            mapped_at: null
