id: b140afd9-474b-4072-958e-2ebb435abd68
title: Suspicious Get-ADDBAccount Usage
status: test
level: high
description: Detects suspicious invocation of the Get-ADDBAccount script that reads
    from a ntds.dit file and may be used to get access to credentials without using
    any credential dumpers
author: Florian Roth (Nextron Systems)
date: '2022-03-16'
tags:
    - attack.credential-access
    - attack.t1003.003
references:
    - https://www.n00py.io/2022/03/manipulating-user-passwords-without-mimikatz/
    - https://github.com/MichaelGrafnetter/DSInternals/blob/7ba59c12ee9a1cb430d7dc186a3366842dd612c8/Documentation/PowerShell/Get-ADDBAccount.md
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: ps_module
    product: windows
    definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
    selection:
        Payload|contains|all:
            - Get-ADDBAccount
            - 'BootKey '
            - 'DatabasePath '
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: ps_module
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Payload
            target_table: null
            target_field: null
            mapped_at: null
