title: Clear PowerShell History - PowerShell Module
id: f99276ad-d122-4989-a09a-d00904a5f9d2
status: test
level: medium
author: Ilyas Ochkov, Jonhnathan Ribeiro, Daniil Yugoslavskiy, oscd.community
description: Detects keywords that could indicate clearing PowerShell history
references:
    - https://gist.github.com/hook-s3c/7363a856c3cdbadeb71085147f042c1a
falsepositives:
    - Legitimate PowerShell scripts
tags:
    - attack.defense-evasion
    - attack.t1070.003
date: '2019-10-25'
modified: '2022-12-02'
logsource:
    category: ps_module
    product: windows
    definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
    selection_1a_payload:
        Payload|contains:
            - del
            - Remove-Item
            - rm
    selection_1b_payload:
        Payload|contains: (Get-PSReadlineOption).HistorySavePath
    selection_payload_2:
        Payload|contains|all:
            - Set-PSReadlineOption
            - –HistorySaveStyle
            - SaveNothing
    selection_payload_3:
        Payload|contains|all:
            - Set-PSReadlineOption
            - -HistorySaveStyle
            - SaveNothing
    condition: 1 of selection_payload_* or all of selection_1*
related:
    -   id: dfba4ce1-e0ea-495f-986e-97140f31af2d
        type: derived
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: ps_module
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Payload
            target_table: null
            target_field: null
            mapped_at: null
