title: Change User Agents with WebRequest
id: d4488827-73af-4f8d-9244-7b7662ef046e
status: test
level: medium
author: frack113
description: 'Adversaries may communicate using application layer protocols associated
    with web traffic to avoid detection/network filtering by blending in with existing
    traffic.

    Commands to the remote system, and often the results of those commands, will be
    embedded within the protocol traffic between the client and server.

    '
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1071.001/T1071.001.md#t1071001---web-protocols
falsepositives:
    - Unknown
tags:
    - attack.command-and-control
    - attack.t1071.001
date: '2022-01-23'
modified: '2023-01-02'
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains|all:
            - Invoke-WebRequest
            - '-UserAgent '
    condition: selection
ocsf_mapping:
    class_name: script_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-12-04T01:54:00.595494+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:54:00.595494+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-12-04T01:54:00.595533+00:00'
