title: Winlogon Helper DLL
id: 851c506b-6b7c-4ce2-8802-c703009d03c0
status: test
level: medium
author: Timur Zinniatullin, oscd.community
description: 'Winlogon.exe is a Windows component responsible for actions at logon/logoff
    as well as the secure attention sequence (SAS) triggered by Ctrl-Alt-Delete.

    Registry entries in HKLM\Software[Wow6432Node]Microsoft\Windows NT\CurrentVersion\Winlogon\
    and HKCU\Software\Microsoft\Windows NT\CurrentVersion\Winlogon\ are

    used to manage additional helper programs and functionalities that support Winlogon.
    Malicious modifications to these Registry keys may cause Winlogon to

    load and execute malicious DLLs and/or executables.

    '
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.004/T1547.004.md
falsepositives:
    - Unknown
tags:
    - attack.persistence
    - attack.t1547.004
date: '2019-10-21'
modified: '2022-07-07'
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains: CurrentVersion\Winlogon
    selection2:
        ScriptBlockText|contains:
            - Set-ItemProperty
            - New-Item
    condition: all of selection*
ocsf_mapping:
    class_name: script_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-12-04T01:53:44.685365+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:53:44.685365+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-12-04T01:53:44.685378+00:00'
