id: f99276ad-d122-4989-a09a-d00904a5f9d2
title: Clear PowerShell History - PowerShell Module
status: test
level: medium
description: Detects keywords that could indicate clearing PowerShell history
author: Ilyas Ochkov, Jonhnathan Ribeiro, Daniil Yugoslavskiy, oscd.community
date: '2019-10-25'
modified: '2022-12-02'
tags:
    - attack.defense-evasion
    - attack.t1070.003
references:
    - https://gist.github.com/hook-s3c/7363a856c3cdbadeb71085147f042c1a
falsepositives:
    - Legitimate PowerShell scripts
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''dfba4ce1-e0ea-495f-986e-97140f31af2d''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: ps_module
    product: windows
    definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
    selection_1a_payload:
        Payload|contains:
            - del
            - Remove-Item
            - rm
    selection_1b_payload:
        Payload|contains: (Get-PSReadlineOption).HistorySavePath
    selection_payload_2:
        Payload|contains|all:
            - Set-PSReadlineOption
            - –HistorySaveStyle
            - SaveNothing
    selection_payload_3:
        Payload|contains|all:
            - Set-PSReadlineOption
            - -HistorySaveStyle
            - SaveNothing
    condition: 1 of selection_payload_* or all of selection_1*
ocsf_mapping:
    class_name: script_activity
    logsource:
        category:
            source_field: category
            source_value: ps_module
            mapped_at: '2025-11-13T20:21:51.338759+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:51.338759+00:00'
    detection_fields:
        -   source_field: Payload
            target_table: script_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:21:51.338769+00:00'
