id: d2e3f2f6-7e09-4bf2-bc5d-90186809e7fb
title: PowerShell Script With File Upload Capabilities
status: test
level: low
description: Detects PowerShell scripts leveraging the "Invoke-WebRequest" cmdlet
    to send data via either "PUT" or "POST" method.
author: frack113
date: '2022-01-07'
modified: '2023-05-04'
tags:
    - attack.exfiltration
    - attack.t1020
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1020/T1020.md
    - https://www.w3.org/Protocols/rfc2616/rfc2616-sec9.html
    - https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.utility/invoke-webrequest?view=powershell-7.4
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: bade5735-5ab0-4aa7-a642-a11be0e40872
detection:
    selection_cmdlet:
        ScriptBlockText|contains:
            - Invoke-WebRequest
            - 'iwr '
    selection_flag:
        ScriptBlockText|contains:
            - -Method Put
            - -Method Post
    condition: all of selection_*
ocsf_mapping:
    class_name: script_activity
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-13T20:21:46.286810+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:46.286810+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-13T20:21:46.286813+00:00'
