title: Netcat The Powershell Version
id: c5b20776-639a-49bf-94c7-84f912b91c15
status: test
level: medium
author: frack113
description: Adversaries may use a non-application layer protocol for communication
    between host and C2 server or among infected hosts within a network
references:
    - https://nmap.org/ncat/
    - https://github.com/besimorhino/powercat
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1095/T1095.md
falsepositives:
    - Unknown
tags:
    - attack.command-and-control
    - attack.t1095
date: '2021-07-21'
modified: '2023-10-27'
logsource:
    category: ps_classic_start
    product: windows
detection:
    selection:
        Data|contains:
            - 'powercat '
            - powercat.ps1
    condition: selection
related:
    -   id: bf7286e7-c0be-460b-a7e8-5b2e07ecc2f2
        type: derived
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: ps_classic_start
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Data
            target_table: null
            target_field: null
            mapped_at: null
