id: 8c521530-5169-495d-a199-0a3a881ad24e
title: NTFS Alternate Data Stream
status: test
level: high
description: Detects writing data into NTFS alternate data streams from powershell.
    Needs Script Block Logging.
author: Sami Ruohonen
date: '2018-07-24'
modified: '2022-12-25'
tags:
    - attack.defense-evasion
    - attack.t1564.004
    - attack.execution
    - attack.t1059.001
references:
    - https://web.archive.org/web/20220614030603/http://www.powertheshell.com/ntfsstreams/
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1564.004/T1564.004.md
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection_content:
        ScriptBlockText|contains:
            - set-content
            - add-content
    selection_stream:
        ScriptBlockText|contains: -stream
    condition: all of selection*
ocsf_mapping:
    class_name: script_activity
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-13T20:21:48.315777+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:48.315777+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-13T20:21:48.315781+00:00'
