id: bbb80e91-5746-4fbe-8898-122e2cafdbf4
title: Suspicious PowerShell Invocations - Generic - PowerShell Module
status: test
level: high
description: Detects suspicious PowerShell invocation command parameters
author: Florian Roth (Nextron Systems)
date: '2017-03-12'
modified: '2023-01-03'
tags:
    - attack.execution
    - attack.t1059.001
references:
    - Internal Research
falsepositives:
    - Very special / sneaky PowerShell scripts
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''3d304fda-78aa-43ed-975c-d740798a49c1''),
    type=<SigmaRelatedType.DERIVED: 2>), SigmaRelatedItem(id=UUID(''ed965133-513f-41d9-a441-e38076a0798f''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: ps_module
    product: windows
    definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
    selection_encoded:
        ContextInfo|contains:
            - ' -enc '
            - ' -EncodedCommand '
            - ' -ec '
    selection_hidden:
        ContextInfo|contains:
            - ' -w hidden '
            - ' -window hidden '
            - ' -windowstyle hidden '
            - ' -w 1 '
    selection_noninteractive:
        ContextInfo|contains:
            - ' -noni '
            - ' -noninteractive '
    condition: all of selection*
ocsf_mapping:
    class_name: script_activity
    logsource:
        category:
            source_field: category
            source_value: ps_module
            mapped_at: '2025-11-13T20:21:51.370439+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:51.370439+00:00'
    detection_fields:
        -   source_field: ContextInfo
            target_table: script_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:21:51.370443+00:00'
