title: Suspicious Connection to Remote Account
id: 1883444f-084b-419b-ac62-e0d0c5b3693f
status: test
level: low
author: frack113
description: 'Adversaries with no prior knowledge of legitimate credentials within
    the system or environment may guess passwords to attempt access to accounts.

    Without knowledge of the password for an account, an adversary may opt to systematically
    guess the password using a repetitive or iterative mechanism

    '
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1110.001/T1110.001.md#atomic-test-2---brute-force-credentials-of-single-active-directory-domain-user-via-ldap-against-domain-controller-ntlm-or-kerberos
falsepositives:
    - Unknown
tags:
    - attack.credential-access
    - attack.t1110.001
date: '2021-12-27'
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains:
            - System.DirectoryServices.Protocols.LdapDirectoryIdentifier
            - System.Net.NetworkCredential
            - System.DirectoryServices.Protocols.LdapConnection
    condition: selection
ocsf_mapping:
    class_name: script_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-12-04T01:54:57.853895+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:54:57.853895+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-12-04T01:54:57.853913+00:00'
