title: PowerView PowerShell Cmdlets - ScriptBlock
id: dcd74b95-3f36-4ed9-9598-0490951643aa
status: test
level: high
author: Bhabesh Raj
description: Detects Cmdlet names from PowerView of the PowerSploit exploitation framework.
references:
    - https://powersploit.readthedocs.io/en/stable/Recon/README
    - https://github.com/PowerShellMafia/PowerSploit/tree/master/Recon
    - https://thedfirreport.com/2020/10/08/ryuks-return
    - https://adsecurity.org/?p=2277
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1059.001
date: '2021-05-18'
modified: '2023-11-22'
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains:
            - Export-PowerViewCSV
            - Find-DomainLocalGroupMember
            - Find-DomainObjectPropertyOutlier
            - Find-DomainProcess
            - Find-DomainShare
            - Find-DomainUserEvent
            - Find-DomainUserLocation
            - Find-ForeignGroup
            - Find-ForeignUser
            - Find-GPOComputerAdmin
            - Find-GPOLocation
            - Find-InterestingDomain
            - Find-InterestingFile
            - Find-LocalAdminAccess
            - Find-ManagedSecurityGroups
            - Get-CachedRDPConnection
            - Get-DFSshare
            - Get-DomainDFSShare
            - Get-DomainDNSRecord
            - Get-DomainDNSZone
            - Get-DomainFileServer
            - Get-DomainGPOComputerLocalGroupMapping
            - Get-DomainGPOLocalGroup
            - Get-DomainGPOUserLocalGroupMapping
            - Get-LastLoggedOn
            - Get-LoggedOnLocal
            - Get-NetFileServer
            - Get-NetForest
            - Get-NetGPOGroup
            - Get-NetProcess
            - Get-NetRDPSession
            - Get-RegistryMountedDrive
            - Get-RegLoggedOn
            - Get-WMIRegCachedRDPConnection
            - Get-WMIRegLastLoggedOn
            - Get-WMIRegMountedDrive
            - Get-WMIRegProxy
            - Invoke-ACLScanner
            - Invoke-CheckLocalAdminAccess
            - Invoke-EnumerateLocalAdmin
            - Invoke-EventHunter
            - Invoke-FileFinder
            - Invoke-Kerberoast
            - Invoke-MapDomainTrust
            - Invoke-ProcessHunter
            - Invoke-RevertToSelf
            - Invoke-ShareFinder
            - Invoke-UserHunter
            - Invoke-UserImpersonation
            - Remove-RemoteConnection
            - Request-SPNTicket
            - Resolve-IPAddress
    condition: selection
related:
    -   id: b2317cfa-4a47-4ead-b3ff-297438c0bc2d
        type: similar
ocsf_mapping:
    class_name: script_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-12-04T01:54:15.344210+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:54:15.344210+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-12-04T01:54:15.344227+00:00'
