title: Malicious ShellIntel PowerShell Commandlets
id: 402e1e1d-ad59-47b6-bf80-1ee44985b3a7
status: test
level: high
author: Max Altgelt (Nextron Systems), Tobias Michalski (Nextron Systems)
description: Detects Commandlet names from ShellIntel exploitation scripts.
references:
    - https://github.com/Shellntel/scripts/
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1059.001
date: '2021-08-09'
modified: '2023-01-02'
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains:
            - Invoke-SMBAutoBrute
            - Invoke-GPOLinks
            - Invoke-Potato
    condition: selection
ocsf_mapping:
    class_name: script_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-12-04T01:54:15.752288+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:54:15.752288+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-12-04T01:54:15.752304+00:00'
