id: 16b37b70-6fcf-4814-a092-c36bd3aafcbd
title: PowerShell ShellCode
status: test
level: high
description: Detects Base64 encoded Shellcode
author: David Ledbetter (shellcode), Florian Roth (Nextron Systems)
date: '2018-11-17'
modified: '2024-01-25'
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1055
    - attack.execution
    - attack.t1059.001
references:
    - https://twitter.com/cyb3rops/status/1063072865992523776
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains:
            - OiCAAAAYInlM
            - OiJAAAAYInlM
    condition: selection
ocsf_mapping:
    class_name: script_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-26T02:42:35.423333+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:42:35.423333+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-26T02:42:35.423390+00:00'
