title: Usage Of Web Request Commands And Cmdlets - ScriptBlock
id: 1139d2e2-84b1-4226-b445-354492eba8ba
status: test
level: medium
author: James Pemberton / @4A616D6573
description: Detects the use of various web request commands with commandline tools
    and Windows PowerShell cmdlets (including aliases) via PowerShell scriptblock
    logs
references:
    - https://4sysops.com/archives/use-powershell-to-download-a-file-with-http-https-and-ftp/
    - https://blog.jourdant.me/post/3-ways-to-download-files-with-powershell
falsepositives:
    - Use of Get-Command and Get-Help modules to reference Invoke-WebRequest and Start-BitsTransfer.
tags:
    - attack.execution
    - attack.t1059.001
date: '2019-10-24'
modified: '2023-01-10'
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains:
            - '[System.Net.WebRequest]::create'
            - 'curl '
            - Invoke-RestMethod
            - Invoke-WebRequest
            - 'iwr '
            - Net.WebClient
            - Resume-BitsTransfer
            - Start-BitsTransfer
            - 'wget '
            - WinHttp.WinHttpRequest
    filter:
        Path|startswith: C:\Packages\Plugins\Microsoft.GuestConfiguration.ConfigurationforWindows\
    condition: selection and not filter
related:
    -   id: 9fc51a3c-81b3-4fa7-b35f-7c02cf10fd2d
        type: derived
ocsf_mapping:
    class_name: script_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-12-04T01:55:06.359267+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:55:06.359267+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-12-04T01:55:06.359281+00:00'
        -   source_field: Path
            target_table: script_activity
            target_field: script.file.path
            mapped_at: '2025-12-04T01:55:06.359283+00:00'
