id: a9723fcc-881c-424c-8709-fd61442ab3c3
title: Recon Information for Export with PowerShell
status: test
level: medium
description: Once established within a system or network, an adversary may use automated
    techniques for collecting internal data
author: frack113
date: '2021-07-30'
modified: '2022-12-25'
tags:
    - attack.collection
    - attack.t1119
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1119/T1119.md
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection_action:
        ScriptBlockText|contains:
            - 'Get-Service '
            - 'Get-ChildItem '
            - 'Get-Process '
    selection_redirect:
        ScriptBlockText|contains: '> $env:TEMP\'
    condition: all of selection*
ocsf_mapping:
    class_name: script_activity
    activity_id: UNMAPPED
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-26T02:41:26.526975+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:41:26.526975+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-26T02:41:26.526994+00:00'
