id: c5ac6a1e-9407-45f5-a0ce-ca9a0806a287
title: Replace Desktop Wallpaper by Powershell
status: test
level: low
description: 'An adversary may deface systems internal to an organization in an attempt
    to intimidate or mislead users.

    This may take the form of modifications to internal websites, or directly to user
    systems with the replacement of the desktop wallpaper

    '
author: frack113
date: '2021-12-26'
tags:
    - attack.impact
    - attack.t1491.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1491.001/T1491.001.md
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection_1:
        ScriptBlockText|contains|all:
            - Get-ItemProperty
            - 'Registry::'
            - HKEY_CURRENT_USER\Control Panel\Desktop\
            - WallPaper
    selection_2:
        ScriptBlockText|contains: SystemParametersInfo(20,0,*,3)
    condition: 1 of selection_*
ocsf_mapping:
    class_name: script_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-26T02:41:47.158744+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:41:47.158744+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-26T02:41:47.158761+00:00'
