id: 155c7fd5-47b4-49b2-bbeb-eb4fab335429
title: Add Windows Capability Via PowerShell Script
status: test
level: medium
description: Detects usage of the "Add-WindowsCapability" cmdlet to add Windows capabilities.
    Notable capabilities could be "OpenSSH" and others.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-01-22'
modified: '2023-05-09'
tags:
    - attack.execution
references:
    - https://learn.microsoft.com/en-us/windows-server/administration/openssh/openssh_install_firstuse?tabs=powershell
    - https://www.virustotal.com/gui/file/af1c82237b6e5a3a7cdbad82cc498d298c67845d92971bada450023d1335e267/content
falsepositives:
    - Legitimate usage of the capabilities by administrators or users. Add additional
        filters accordingly.
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''b36d01a3-ddaf-4804-be18-18a6247adfcd''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection_cmdlet:
        ScriptBlockText|contains: 'Add-WindowsCapability '
    selection_capa:
        ScriptBlockText|contains: -Name OpenSSH.
    condition: all of selection_*
ocsf_mapping:
    class_name: script_activity
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-13T20:21:46.242358+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:46.242358+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-13T20:21:46.242362+00:00'
