id: f62176f3-8128-4faa-bf6c-83261322e5eb
title: Malicious PowerShell Keywords
status: test
level: medium
description: Detects keywords from well-known PowerShell exploitation frameworks
author: Sean Metcalf (source), Florian Roth (Nextron Systems)
date: '2017-03-05'
modified: '2023-06-20'
tags:
    - attack.execution
    - attack.t1059.001
references:
    - https://adsecurity.org/?p=2921
falsepositives:
    - Depending on the scripts, this rule might require some initial tuning to fit
        the environment
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains:
            - AdjustTokenPrivileges
            - IMAGE_NT_OPTIONAL_HDR64_MAGIC
            - Metasploit
            - Microsoft.Win32.UnsafeNativeMethods
            - Mimikatz
            - MiniDumpWriteDump
            - PAGE_EXECUTE_READ
            - ReadProcessMemory.Invoke
            - SE_PRIVILEGE_ENABLED
            - SECURITY_DELEGATION
            - TOKEN_ADJUST_PRIVILEGES
            - TOKEN_ALL_ACCESS
            - TOKEN_ASSIGN_PRIMARY
            - TOKEN_DUPLICATE
            - TOKEN_ELEVATION
            - TOKEN_IMPERSONATE
            - TOKEN_INFORMATION_CLASS
            - TOKEN_PRIVILEGES
            - TOKEN_QUERY
    condition: selection
ocsf_mapping:
    class_name: script_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-26T02:42:59.438075+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:42:59.438075+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-26T02:42:59.438096+00:00'
