title: Potential In-Memory Execution Using Reflection.Assembly
id: ddcd88cb-7f62-4ce5-86f9-1704190feb0a
status: test
level: medium
author: frack113
description: Detects usage of "Reflection.Assembly" load functions to dynamically
    load assemblies in memory
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=50
falsepositives:
    - Legitimate use of the library
tags:
    - attack.defense-evasion
    - attack.t1620
date: '2022-12-25'
logsource:
    category: ps_script
    product: windows
    definition: Script Block Logging must be enable
detection:
    selection:
        ScriptBlockText|contains: '[Reflection.Assembly]::load'
    condition: selection
ocsf_mapping:
    class_name: script_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-12-04T01:55:00.615323+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:55:00.615323+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-12-04T01:55:00.615343+00:00'
