id: d4a11f63-2390-411c-9adf-d791fd152830
title: Windows Screen Capture with CopyFromScreen
status: test
level: medium
description: 'Adversaries may attempt to take screen captures of the desktop to gather
    information over the course of an operation.

    Screen capturing functionality may be included as a feature of a remote access
    tool used in post-compromise operations

    '
author: frack113
date: '2021-12-28'
modified: '2022-07-07'
tags:
    - attack.collection
    - attack.t1113
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1113/T1113.md#atomic-test-6---windows-screen-capture-copyfromscreen
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains: .CopyFromScreen
    condition: selection
ocsf_mapping:
    class_name: script_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-26T02:41:10.604852+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:41:10.604852+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-26T02:41:10.604884+00:00'
