id: c70e019b-1479-4b65-b0cc-cd0c6093a599
title: PowerShell Called from an Executable Version Mismatch
status: test
level: high
description: Detects PowerShell called from an executable by the version mismatch
    method
author: Sean Metcalf (source), Florian Roth (Nextron Systems)
date: '2017-03-05'
modified: '2023-10-27'
tags:
    - attack.defense-evasion
    - attack.execution
    - attack.t1059.001
references:
    - https://adsecurity.org/?p=2921
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: ps_classic_start
    product: windows
detection:
    selection_engine:
        Data|contains:
            - EngineVersion=2.
            - EngineVersion=4.
            - EngineVersion=5.
    selection_host:
        Data|contains: HostVersion=3.
    condition: all of selection_*
ocsf_mapping:
    class_name: null
    logsource:
        category:
            source_field: category
            source_value: ps_classic_start
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Data
            target_table: null
            target_field: null
            mapped_at: null
