id: 6c6c6282-7671-4fe9-a0ce-a2dcebdc342b
title: Powershell XML Execute Command
status: test
level: medium
description: 'Adversaries may abuse PowerShell commands and scripts for execution.

    PowerShell is a powerful interactive command-line interface and scripting environment
    included in the Windows operating system. (Citation: TechNet PowerShell)

    Adversaries can use PowerShell to perform a number of actions, including discovery
    of information and execution of code

    '
author: frack113
date: '2022-01-19'
modified: '2023-01-19'
tags:
    - attack.execution
    - attack.t1059.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1059.001/T1059.001.md#atomic-test-8---powershell-xml-requests
falsepositives:
    - Legitimate administrative script
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection_xml:
        ScriptBlockText|contains|all:
            - New-Object
            - System.Xml.XmlDocument
            - .Load
    selection_exec:
        ScriptBlockText|contains:
            - 'IEX '
            - 'Invoke-Expression '
            - 'Invoke-Command '
            - ICM -
    condition: all of selection_*
ocsf_mapping:
    class_name: script_activity
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-13T20:21:46.178643+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:46.178643+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-13T20:21:46.178652+00:00'
