id: 602f5669-6927-4688-84db-0d4b7afb2150
title: Disable Powershell Command History
status: test
level: high
description: Detects scripts or commands that disabled the Powershell command history
    by removing psreadline module
author: Ali Alwashali
date: '2022-08-21'
tags:
    - attack.defense-evasion
    - attack.t1070.003
references:
    - https://twitter.com/DissectMalware/status/1062879286749773824
falsepositives:
    - Legitimate script that disables the command history
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains|all:
            - Remove-Module
            - psreadline
    condition: selection
ocsf_mapping:
    class_name: script_activity
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-13T20:21:46.188046+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:46.188046+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-13T20:21:46.188057+00:00'
