title: Suspicious PowerShell Download - PoshModule
id: de41232e-12e8-49fa-86bc-c05c7e722df9
status: test
level: medium
author: Florian Roth (Nextron Systems)
description: Detects suspicious PowerShell download command
references:
    - https://learn.microsoft.com/en-us/dotnet/api/system.net.webclient.downloadfile?view=net-8.0
    - https://learn.microsoft.com/en-us/dotnet/api/system.net.webclient.downloadstring?view=net-8.0
falsepositives:
    - PowerShell scripts that download content from the Internet
tags:
    - attack.execution
    - attack.t1059.001
date: '2017-03-05'
modified: '2023-01-20'
logsource:
    category: ps_module
    product: windows
    definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
    selection_webclient_:
        ContextInfo|contains: System.Net.WebClient
    selection_function:
        ContextInfo|contains:
            - .DownloadFile(
            - .DownloadString(
    condition: all of selection_*
related:
    -   id: 65531a81-a694-4e31-ae04-f8ba5bc33759
        type: derived
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: ps_module
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: ContextInfo
            target_table: null
            target_field: null
            mapped_at: null
