id: e3818659-5016-4811-a73c-dde4679169d2
title: Suspicious Computer Machine Password by PowerShell
status: test
level: medium
description: 'The Reset-ComputerMachinePassword cmdlet changes the computer account
    password that the computers use to authenticate to the domain controllers in the
    domain.

    You can use it to reset the password of the local computer.

    '
author: frack113
date: '2022-02-21'
tags:
    - attack.initial-access
    - attack.t1078
references:
    - https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.management/reset-computermachinepassword?view=powershell-5.1
    - https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/
falsepositives:
    - Administrator PowerShell scripts
taxonomy: sigma
logsource:
    category: ps_module
    product: windows
    definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
    selection:
        ContextInfo|contains: Reset-ComputerMachinePassword
    condition: selection
ocsf_mapping:
    class_name: script_activity
    logsource:
        category:
            source_field: category
            source_value: ps_module
            mapped_at: '2025-11-13T20:21:49.469442+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:49.469442+00:00'
    detection_fields:
        -   source_field: ContextInfo
            target_table: script_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:21:50.708898+00:00'
