id: e0d6c087-2d1c-47fd-8799-3904103c5a98
title: AMSI Bypass Pattern Assembly GetType
status: test
level: high
description: Detects code fragments found in small and obfuscated AMSI bypass PowerShell
    scripts
author: Florian Roth (Nextron Systems)
date: '2022-11-09'
tags:
    - attack.defense-evasion
    - attack.t1562.001
    - attack.execution
references:
    - https://www.mdsec.co.uk/2018/06/exploring-powershell-amsi-and-logging-evasion/
    - https://twitter.com/cyb3rops/status/1588574518057979905?s=20&t=A7hh93ONM7ni1Rj1jO5OaA
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains|all:
            - '[Ref].Assembly.GetType'
            - SetValue($null,$true)
            - NonPublic,Static
    condition: selection
ocsf_mapping:
    class_name: script_activity
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-13T20:21:48.340643+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:48.340643+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-13T20:21:48.340647+00:00'
