title: DSInternals Suspicious PowerShell Cmdlets - ScriptBlock
id: 846c7a87-8e14-4569-9d49-ecfd4276a01c
status: experimental
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: 'Detects execution and usage of the DSInternals PowerShell module. Which
    can be used to perform what might be considered as suspicious activity such as
    dumping DPAPI backup keys or manipulating NTDS.DIT files.

    The DSInternals PowerShell Module exposes several internal features of Active
    Directory and Azure Active Directory. These include FIDO2 and NGC key auditing,
    offline ntds.dit file manipulation, password auditing, DC recovery from IFM backups
    and password hash calculation.

    '
references:
    - https://github.com/MichaelGrafnetter/DSInternals/blob/39ee8a69bbdc1cfd12c9afdd7513b4788c4895d4/Src/DSInternals.PowerShell/DSInternals.psd1
falsepositives:
    - Legitimate usage of DSInternals for administration or audit purpose.
tags:
    - attack.execution
    - attack.t1059.001
date: '2024-06-26'
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains:
            - Add-ADDBSidHistory
            - Add-ADNgcKey
            - Add-ADReplNgcKey
            - ConvertFrom-ADManagedPasswordBlob
            - ConvertFrom-GPPrefPassword
            - ConvertFrom-ManagedPasswordBlob
            - ConvertFrom-UnattendXmlPassword
            - ConvertFrom-UnicodePassword
            - ConvertTo-AADHash
            - ConvertTo-GPPrefPassword
            - ConvertTo-KerberosKey
            - ConvertTo-LMHash
            - ConvertTo-MsoPasswordHash
            - ConvertTo-NTHash
            - ConvertTo-OrgIdHash
            - ConvertTo-UnicodePassword
            - Disable-ADDBAccount
            - Enable-ADDBAccount
            - Get-ADDBAccount
            - Get-ADDBBackupKey
            - Get-ADDBDomainController
            - Get-ADDBGroupManagedServiceAccount
            - Get-ADDBKdsRootKey
            - Get-ADDBSchemaAttribute
            - Get-ADDBServiceAccount
            - Get-ADDefaultPasswordPolicy
            - Get-ADKeyCredential
            - Get-ADPasswordPolicy
            - Get-ADReplAccount
            - Get-ADReplBackupKey
            - Get-ADReplicationAccount
            - Get-ADSIAccount
            - Get-AzureADUserEx
            - Get-BootKey
            - Get-KeyCredential
            - Get-LsaBackupKey
            - Get-LsaPolicy
            - Get-SamPasswordPolicy
            - Get-SysKey
            - Get-SystemKey
            - New-ADDBRestoreFromMediaScript
            - New-ADKeyCredential
            - New-ADNgcKey
            - New-NTHashSet
            - Remove-ADDBObject
            - Save-DPAPIBlob
            - Set-ADAccountPasswordHash
            - Set-ADDBAccountPassword
            - Set-ADDBBootKey
            - Set-ADDBDomainController
            - Set-ADDBPrimaryGroup
            - Set-ADDBSysKey
            - Set-AzureADUserEx
            - Set-LsaPolicy
            - Set-SamAccountPasswordHash
            - Set-WinUserPasswordHash
            - Test-ADDBPasswordQuality
            - Test-ADPasswordQuality
            - Test-ADReplPasswordQuality
            - Test-PasswordQuality
            - Unlock-ADDBAccount
            - Write-ADNgcKey
            - Write-ADReplNgcKey
    condition: selection
related:
    -   id: 43d91656-a9b2-4541-b7e2-6a9bd3a13f4e
        type: similar
ocsf_mapping:
    class_name: script_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-12-04T01:53:40.080488+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:53:40.080488+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-12-04T01:53:40.080502+00:00'
