id: 6331d09b-4785-4c13-980f-f96661356249
title: PowerShell Downgrade Attack - PowerShell
status: test
level: medium
description: Detects PowerShell downgrade attack by comparing the host versions with
    the actually used engine version 2.0
author: Florian Roth (Nextron Systems), Lee Holmes (idea), Harish Segar (improvements)
date: '2017-03-22'
modified: '2023-10-27'
tags:
    - attack.defense-evasion
    - attack.execution
    - attack.t1059.001
references:
    - http://www.leeholmes.com/blog/2017/03/17/detecting-and-preventing-powershell-downgrade-attacks/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: ps_classic_start
    product: windows
detection:
    selection:
        Data|contains: EngineVersion=2.
    filter_main:
        Data|contains: HostVersion=2.
    condition: selection and not filter_main
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: ps_classic_start
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Data
            target_table: null
            target_field: null
            mapped_at: null
