id: fc028194-969d-4122-8abe-0470d5b8f12f
title: Access to Browser Login Data
status: test
level: medium
description: 'Adversaries may acquire credentials from web browsers by reading files
    specific to the target browser.

    Web browsers commonly save credentials such as website usernames and passwords
    so that they do not need to be entered manually in the future.

    Web browsers typically store the credentials in an encrypted format within a credential
    store.

    '
author: frack113
date: '2022-01-30'
tags:
    - attack.credential-access
    - attack.t1555.003
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1555.003/T1555.003.md
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''98f4c75c-3089-44f3-b733-b327b9cd9c9d''),
    type=<SigmaRelatedType.OBSOLETE: 4>), SigmaRelatedItem(id=UUID(''47147b5b-9e17-4d76-b8d2-7bac24c5ce1b''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection_cmd:
        ScriptBlockText|contains|all:
            - Copy-Item
            - -Destination
    selection_path:
        ScriptBlockText|contains:
            - \Opera Software\Opera Stable\Login Data
            - \Mozilla\Firefox\Profiles
            - \Microsoft\Edge\User Data\Default
            - \Google\Chrome\User Data\Default\Login Data
            - \Google\Chrome\User Data\Default\Login Data For Account
    condition: all of selection_*
ocsf_mapping:
    class_name: script_activity
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-13T20:21:46.224222+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:46.224222+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-13T20:21:46.224226+00:00'
