id: 91109523-17f0-4248-a800-f81d9e7c081d
title: PowerShell WMI Win32_Product Install MSI
status: test
level: medium
description: Detects the execution of an MSI file using PowerShell and the WMI Win32_Product
    class
author: frack113
date: '2022-04-24'
tags:
    - attack.defense-evasion
    - attack.t1218.007
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.007/T1218.007.md
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains|all:
            - 'Invoke-CimMethod '
            - '-ClassName '
            - 'Win32_Product '
            - '-MethodName '
            - .msi
    condition: selection
ocsf_mapping:
    class_name: script_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-26T02:41:47.926702+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:41:47.926702+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-26T02:41:47.926720+00:00'
