id: cacef8fc-9d3d-41f7-956d-455c6e881bc5
title: Potential RemoteFXvGPUDisablement.EXE Abuse - PowerShell ScriptBlock
status: test
level: high
description: Detects PowerShell module creation where the module Contents are set
    to "function Get-VMRemoteFXPhysicalVideoAdapter". This could be a sign of potential
    abuse of the "RemoteFXvGPUDisablement.exe" binary which is known to be vulnerable
    to module load-order hijacking.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-05-09'
tags:
    - attack.defense-evasion
    - attack.t1218
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218/T1218.md
    - https://github.com/redcanaryco/AtomicTestHarnesses/blob/7e1e4da116801e3d6fcc6bedb207064577e40572/TestHarnesses/T1218_SignedBinaryProxyExecution/InvokeRemoteFXvGPUDisablementCommand.ps1
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''a6fc3c46-23b8-4996-9ea2-573f4c4d88c5''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''f65e22f9-819e-4f96-9c7b-498364ae7a25''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''38a7625e-b2cb-485d-b83d-aff137d859f4''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: bade5735-5ab0-4aa7-a642-a11be0e40872
detection:
    selection:
        ScriptBlockText|startswith: function Get-VMRemoteFXPhysicalVideoAdapter {
    condition: selection
ocsf_mapping:
    class_name: script_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-26T02:42:02.562465+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:42:02.562465+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-26T02:42:02.562483+00:00'
