id: 3bf1d859-3a7e-44cb-8809-a99e066d3478
title: PowerShell Set-Acl On Windows Folder - PsScript
status: test
level: high
description: Detects PowerShell scripts to set the ACL to a file in the Windows folder
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: '2023-07-18'
tags:
    - attack.defense-evasion
    - attack.t1222
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/74438b0237d141ee9c99747976447dc884cb1a39/atomics/T1505.005/T1505.005.md
    - https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.security/set-acl?view=powershell-5.1
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''cae80281-ef23-44c5-873b-fd48d2666f49''),
    type=<SigmaRelatedType.DERIVED: 2>), SigmaRelatedItem(id=UUID(''0944e002-e3f6-4eb5-bf69-3a3067b53d73''),
    type=<SigmaRelatedType.DERIVED: 2>), SigmaRelatedItem(id=UUID(''bdeb2cff-af74-4094-8426-724dc937f20a''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: bade5735-5ab0-4aa7-a642-a11be0e40872
detection:
    selection_cmdlet:
        ScriptBlockText|contains|all:
            - 'Set-Acl '
            - '-AclObject '
    selection_paths:
        ScriptBlockText|contains:
            - -Path "C:\Windows
            - -Path "C:/Windows
            - -Path 'C:\Windows
            - -Path 'C:/Windows
            - -Path C:\Windows
            - -Path C:/Windows
            - -Path $env:windir
            - -Path "$env:windir
            - -Path '$env:windir
    selection_permissions:
        ScriptBlockText|contains:
            - FullControl
            - Allow
    condition: all of selection_*
ocsf_mapping:
    class_name: script_activity
    activity_id: UNMAPPED
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-26T02:41:20.951993+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:41:20.951993+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-26T02:41:20.952006+00:00'
