id: 26b692dc-1722-49b2-b496-a8258aa6371d
title: Clear PowerShell History - PowerShell
status: test
level: medium
description: Detects keywords that could indicate clearing PowerShell history
author: Ilyas Ochkov, Jonhnathan Ribeiro, Daniil Yugoslavskiy, oscd.community
date: '2022-01-25'
modified: '2022-12-02'
tags:
    - attack.defense-evasion
    - attack.t1070.003
references:
    - https://gist.github.com/hook-s3c/7363a856c3cdbadeb71085147f042c1a
falsepositives:
    - Legitimate PowerShell scripts
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''dfba4ce1-e0ea-495f-986e-97140f31af2d''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection1a:
        ScriptBlockText|contains:
            - del
            - Remove-Item
            - rm
    selection1b:
        ScriptBlockText|contains: (Get-PSReadlineOption).HistorySavePath
    selection_2:
        ScriptBlockText|contains|all:
            - Set-PSReadlineOption
            - –HistorySaveStyle
            - SaveNothing
    selection_3:
        ScriptBlockText|contains|all:
            - Set-PSReadlineOption
            - -HistorySaveStyle
            - SaveNothing
    condition: 1 of selection_* or all of selection1*
ocsf_mapping:
    class_name: script_activity
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-13T20:21:48.254976+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:48.254976+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-13T20:21:48.254987+00:00'
