id: 2f77047c-e6e9-4c11-b088-a3de399524cd
title: Potential Persistence Via Security Descriptors - ScriptBlock
status: test
level: high
description: Detects usage of certain functions and keywords that are used to manipulate
    security descriptors in order to potentially set a backdoor. As seen used in the
    DAMP project.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-01-05'
tags:
    - attack.persistence
    - attack.defense-evasion
    - attack.privilege-escalation
references:
    - https://github.com/HarmJ0y/DAMP
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains|all:
            - win32_Trustee
            - win32_Ace
            - .AccessMask
            - .AceType
            - .SetSecurityDescriptor
        ScriptBlockText|contains:
            - \Lsa\JD
            - \Lsa\Skew1
            - \Lsa\Data
            - \Lsa\GBG
    condition: selection
ocsf_mapping:
    class_name: script_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-26T02:43:01.680771+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:43:01.680771+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-26T02:43:01.680788+00:00'
