title: Suspicious PowerShell Invocations - Specific
id: ae7fbf8e-f3cb-49fd-8db4-5f3bed522c71
status: test
level: high
author: Florian Roth (Nextron Systems), Jonhnathan Ribeiro
description: Detects suspicious PowerShell invocation command parameters
references:
    - Internal Research
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1059.001
date: '2017-03-05'
modified: '2023-01-05'
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection_convert_b64:
        ScriptBlockText|contains|all:
            - -nop
            - ' -w '
            - hidden
            - ' -c '
            - '[Convert]::FromBase64String'
    selection_iex_selection:
        ScriptBlockText|contains|all:
            - ' -w '
            - hidden
            - -noni
            - -nop
            - ' -c '
            - iex
            - New-Object
    selection_enc_selection:
        ScriptBlockText|contains|all:
            - ' -w '
            - hidden
            - -ep
            - bypass
            - -Enc
    selection_reg_selection:
        ScriptBlockText|contains|all:
            - powershell
            - reg
            - add
            - HKCU\software\microsoft\windows\currentversion\run
    selection_webclient_selection:
        ScriptBlockText|contains|all:
            - bypass
            - -noprofile
            - -windowstyle
            - hidden
            - new-object
            - system.net.webclient
            - .download
    selection_iex_webclient:
        ScriptBlockText|contains|all:
            - iex
            - New-Object
            - Net.WebClient
            - .Download
    filter_chocolatey:
        ScriptBlockText|contains:
            - (New-Object System.Net.WebClient).DownloadString('https://community.chocolatey.org/install.ps1
            - (New-Object System.Net.WebClient).DownloadString('https://chocolatey.org/install.ps1')
            - Write-ChocolateyWarning
    condition: 1 of selection_* and not 1 of filter_*
related:
    -   id: fce5f582-cc00-41e1-941a-c6fabf0fdb8c
        type: obsolete
    -   id: 8ff28fdd-e2fa-4dfa-aeda-ef3d61c62090
        type: similar
    -   id: 536e2947-3729-478c-9903-745aaffe60d2
        type: similar
ocsf_mapping:
    class_name: script_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-12-04T01:54:51.454152+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:54:51.454152+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-12-04T01:54:51.454167+00:00'
