title: User Discovery And Export Via Get-ADUser Cmdlet - PowerShell
id: c2993223-6da8-4b1a-88ee-668b8bf315e9
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects usage of the Get-ADUser cmdlet to collect user information and
    output it to a file
references:
    - http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
    - https://www.microsoft.com/en-us/security/blog/2022/10/18/defenders-beware-a-case-for-post-ransomware-investigations/
falsepositives:
    - Legitimate admin scripts may use the same technique, it's better to exclude
        specific computers or users who execute these commands or scripts often
tags:
    - attack.discovery
    - attack.t1033
date: '2022-11-17'
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains|all:
            - 'Get-ADUser '
            - ' -Filter \*'
        ScriptBlockText|contains:
            - ' > '
            - ' | Select '
            - Out-File
            - Set-Content
            - Add-Content
    condition: selection
related:
    -   id: 1114e048-b69c-4f41-bc20-657245ae6e3f
        type: similar
ocsf_mapping:
    class_name: script_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-12-04T01:53:59.063683+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:53:59.063683+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-12-04T01:53:59.063700+00:00'
