title: Potential Invoke-Mimikatz PowerShell Script
id: 189e3b02-82b2-4b90-9662-411eb64486d4
status: test
level: high
author: Tim Rauch, Elastic (idea)
description: Detects Invoke-Mimikatz PowerShell script and alike. Mimikatz is a credential
    dumper capable of obtaining plaintext Windows account logins and passwords.
references:
    - https://www.elastic.co/guide/en/security/current/potential-invoke-mimikatz-powershell-script.html#potential-invoke-mimikatz-powershell-script
falsepositives:
    - Mimikatz can be useful for testing the security of networks
tags:
    - attack.credential-access
    - attack.t1003
date: '2022-09-28'
logsource:
    category: ps_script
    product: windows
detection:
    selection_1:
        ScriptBlockText|contains|all:
            - DumpCreds
            - DumpCerts
    selection_2:
        ScriptBlockText|contains: sekurlsa::logonpasswords
    selection_3:
        ScriptBlockText|contains|all:
            - crypto::certificates
            - CERT_SYSTEM_STORE_LOCAL_MACHINE
    condition: 1 of selection*
ocsf_mapping:
    class_name: script_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-12-04T01:54:10.365368+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:54:10.365368+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-12-04T01:54:10.365384+00:00'
