id: 504d63cb-0dba-4d02-8531-e72981aace2c
title: Suspicious X509Enrollment - Ps Script
status: test
level: medium
description: Detect use of X509Enrollment
author: frack113
date: '2022-12-23'
tags:
    - attack.defense-evasion
    - attack.t1553.004
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=42
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=41
    - https://learn.microsoft.com/en-us/dotnet/api/microsoft.hpc.scheduler.store.cx509enrollmentwebclassfactoryclass?view=hpc-sdk-5.1.6115
falsepositives:
    - Legitimate administrative script
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''114de787-4eb2-48cc-abdb-c0b449f93ea4''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains:
            - X509Enrollment.CBinaryConverter
            - 884e2002-217d-11da-b2a4-000e7bbb2b09
    condition: selection
ocsf_mapping:
    class_name: script_activity
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-13T20:21:46.276730+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:46.276730+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-13T20:21:46.276734+00:00'
