id: cae80281-ef23-44c5-873b-fd48d2666f49
title: PowerShell Script Change Permission Via Set-Acl - PsScript
status: test
level: low
description: Detects PowerShell scripts set ACL to of a file or a folder
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: '2023-07-18'
tags:
    - attack.defense-evasion
    - attack.t1222
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/74438b0237d141ee9c99747976447dc884cb1a39/atomics/T1505.005/T1505.005.md
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''0944e002-e3f6-4eb5-bf69-3a3067b53d73''),
    type=<SigmaRelatedType.DERIVED: 2>), SigmaRelatedItem(id=UUID(''bdeb2cff-af74-4094-8426-724dc937f20a''),
    type=<SigmaRelatedType.DERIVED: 2>), SigmaRelatedItem(id=UUID(''3bf1d859-3a7e-44cb-8809-a99e066d3478''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: bade5735-5ab0-4aa7-a642-a11be0e40872
detection:
    selection:
        ScriptBlockText|contains|all:
            - 'Set-Acl '
            - '-AclObject '
            - '-Path '
    condition: selection
ocsf_mapping:
    class_name: script_activity
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-13T20:21:48.300331+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:48.300331+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-13T20:21:48.300335+00:00'
