id: 95afc12e-3cbb-40c3-9340-84a032e596a3
title: Service Registry Permissions Weakness Check
status: test
level: medium
description: 'Adversaries may execute their own malicious payloads by hijacking the
    Registry entries used by services.

    Adversaries may use flaws in the permissions for registry to redirect from the
    originally specified executable to one that they control, in order to launch their
    own code at Service start.

    Windows stores local service configuration information in the Registry under HKLM\SYSTEM\CurrentControlSet\Services

    '
author: frack113
date: '2021-12-30'
tags:
    - attack.persistence
    - attack.t1574.011
    - stp.2a
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1574.011/T1574.011.md#atomic-test-1---service-registry-permissions-weakness
    - https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.security/get-acl?view=powershell-7.4
falsepositives:
    - Legitimate administrative script
taxonomy: sigma
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains|all:
            - get-acl
            - REGISTRY::HKLM\SYSTEM\CurrentControlSet\Services\
    condition: selection
ocsf_mapping:
    class_name: script_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: ps_script
            mapped_at: '2025-11-26T02:43:00.988031+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:43:00.988031+00:00'
    detection_fields:
        -   source_field: ScriptBlockText
            target_table: script_activity
            target_field: script.script_content.value
            mapped_at: '2025-11-26T02:43:00.988068+00:00'
