title: HackTool - Dumpert Process Dumper Execution
id: 2704ab9e-afe2-4854-a3b1-0c0706d03578
status: test
level: critical
author: Florian Roth (Nextron Systems)
description: Detects the use of Dumpert process dumper, which dumps the lsass.exe
    process memory
references:
    - https://github.com/outflanknl/Dumpert
    - https://unit42.paloaltonetworks.com/actors-still-exploiting-sharepoint-vulnerability/
falsepositives:
    - Very unlikely
tags:
    - attack.credential-access
    - attack.t1003.001
date: '2020-02-04'
modified: '2023-02-04'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Hashes|contains: 09D278F9DE118EF09163C6140255C690
        CommandLine|contains: Dumpert.dll
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:48:01.230412+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:48:01.230412+00:00'
    detection_fields:
        -   source_field: Hashes
            target_table: process_activity
            target_field: process.file.hashes.value
            mapped_at: '2025-12-04T01:48:01.230449+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:48:01.230465+00:00'
