id: e8a95b5e-c891-46e2-b33a-93937d3abc31
title: Suspicious HH.EXE Execution
status: test
level: high
description: Detects a suspicious execution of a Microsoft HTML Help (HH.exe)
author: Maxim Pavlunin
date: '2020-04-01'
modified: '2023-04-12'
tags:
    - attack.defense-evasion
    - attack.execution
    - attack.initial-access
    - attack.t1047
    - attack.t1059.001
    - attack.t1059.003
    - attack.t1059.005
    - attack.t1059.007
    - attack.t1218
    - attack.t1218.001
    - attack.t1218.010
    - attack.t1218.011
    - attack.t1566
    - attack.t1566.001
references:
    - https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/chm-badness-delivers-a-banking-trojan/
    - https://github.com/elastic/protections-artifacts/commit/746086721fd385d9f5c6647cada1788db4aea95f#diff-27939090904026cc396b0b629c8e4314acd6f5dac40a676edbc87f4567b47eb7
    - https://www.ptsecurity.com/ww-en/analytics/pt-esc-threat-intelligence/higaisa-or-winnti-apt-41-backdoors-old-and-new/
    - https://www.zscaler.com/blogs/security-research/unintentional-leak-glimpse-attack-vectors-apt37
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        OriginalFileName: HH.exe
        Image|endswith: \hh.exe
    selection_paths:
        CommandLine|contains:
            - .application
            - \AppData\Local\Temp\
            - \Content.Outlook\
            - \Downloads\
            - \Users\Public\
            - \Windows\Temp\
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:44.266866+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:44.266866+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:44.266883+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:44.266886+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:44.266888+00:00'
