id: 2fade0b6-7423-4835-9d4f-335b39b83867
title: Shell Execution Of Process Located In Tmp Directory
status: test
level: high
description: Detects execution of shells from a parent process located in a temporary
    (/tmp) directory
author: Joseliyo Sanchez, @Joseliyo_Jstnk
date: '2023-06-02'
tags:
    - attack.execution
references:
    - https://blogs.jpcert.or.jp/en/2023/05/gobrat.html
    - https://jstnk9.github.io/jstnk9/research/GobRAT-Malware/
    - https://www.virustotal.com/gui/file/60bcd645450e4c846238cf0e7226dc40c84c96eba99f6b2cffcd0ab4a391c8b3/detection
    - https://www.virustotal.com/gui/file/3e44c807a25a56f4068b5b8186eee5002eed6f26d665a8b791c472ad154585d1/detection
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        ParentImage|startswith: /tmp/
        Image|endswith:
            - /bash
            - /csh
            - /dash
            - /fish
            - /ksh
            - /sh
            - /zsh
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:15:55.892705+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-13T20:15:55.892705+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:15:55.892710+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:15:55.892712+00:00'
