title: Suspicious VBoxDrvInst.exe Parameters
id: b7b19cb6-9b32-4fc4-a108-73f19acfe262
status: test
level: medium
author: Konstantin Grishchenko, oscd.community
description: 'Detect VBoxDrvInst.exe run with parameters allowing processing INF file.

    This allows to create values in the registry and install drivers.

    For example one could use this technique to obtain persistence via modifying one
    of Run or RunOnce registry keys

    '
references:
    - https://github.com/LOLBAS-Project/LOLBAS/blob/4db780e0f0b2e2bb8cb1fa13e09196da9b9f1834/yml/LOLUtilz/OtherBinaries/VBoxDrvInst.yml
    - https://twitter.com/pabraeken/status/993497996179492864
fields:
    - ComputerName
    - User
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Legitimate use of VBoxDrvInst.exe utility by VirtualBox Guest Additions installation
        process
tags:
    - attack.defense-evasion
    - attack.t1112
date: '2020-10-06'
modified: '2021-11-27'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \VBoxDrvInst.exe
        CommandLine|contains|all:
            - driver
            - executeinf
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:49:45.212190+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:49:45.212190+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:49:45.212204+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:49:45.212209+00:00'
