id: ab37a6ec-6068-432b-a64e-2c7bf95b1d22
title: Scripting/CommandLine Process Spawned Regsvr32
status: test
level: medium
description: Detects various command line and scripting engines/processes such as
    "PowerShell", "Wscript", "Cmd", etc. spawning a "regsvr32" instance.
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: '2023-05-26'
tags:
    - attack.defense-evasion
    - attack.t1218.010
references:
    - https://web.archive.org/web/20171001085340/https://subt0x10.blogspot.com/2017/04/bypass-application-whitelisting-script.html
    - https://app.any.run/tasks/34221348-072d-4b70-93f3-aa71f6ebecad/
falsepositives:
    - Legitimate ".bat", ".hta", ".ps1" or ".vbs" scripts leverage legitimately often.
        Apply additional filter and exclusions as necessary
    - Some legitimate Windows services
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''8e2b24c9-4add-46a0-b4bb-0057b4e6187d''),
    type=<SigmaRelatedType.OBSOLETE: 4>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith:
            - \cmd.exe
            - \cscript.exe
            - \mshta.exe
            - \powershell_ise.exe
            - \powershell.exe
            - \pwsh.exe
            - \wscript.exe
        Image|endswith: \regsvr32.exe
    filter_main_rpcproxy:
        ParentImage: C:\Windows\System32\cmd.exe
        CommandLine|endswith: ' /s C:\Windows\System32\RpcProxy\RpcProxy.dll'
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:37:15.579902+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:37:15.579902+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:37:15.579926+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:37:15.579929+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:37:15.579932+00:00'
