id: b9cbbc17-d00d-4e3d-a827-b06d03d2380d
title: Monitoring For Persistence Via BITS
status: test
level: medium
description: 'BITS will allow you to schedule a command to execute after a successful
    download to notify you that the job is finished.

    When the job runs on the system the command specified in the BITS job will be
    executed.

    This can be abused by actors to create a backdoor within the system and for persistence.

    It will be chained in a BITS job to schedule the download of malware/additional
    binaries and execute the program after being downloaded.

    '
author: Sreeman
date: '2020-10-29'
modified: '2024-01-25'
tags:
    - attack.defense-evasion
    - attack.t1197
references:
    - https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html
    - http://0xthem.blogspot.com/2014/03/t-emporal-persistence-with-and-schtasks.html
    - https://isc.sans.edu/diary/Wipe+the+drive+Stealthy+Malware+Persistence+Mechanism+-+Part+1/15394
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \bitsadmin.exe
        OriginalFileName: bitsadmin.exe
    selection_cli_notify_1:
        CommandLine|contains: /SetNotifyCmdLine
    selection_cli_notify_2:
        CommandLine|contains:
            - '%COMSPEC%'
            - cmd.exe
            - regsvr32.exe
    selection_cli_add_1:
        CommandLine|contains: /Addfile
    selection_cli_add_2:
        CommandLine|contains:
            - 'http:'
            - 'https:'
            - 'ftp:'
            - 'ftps:'
    condition: selection_img and (all of selection_cli_notify_* or all of selection_cli_add_*)
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:50.290771+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:50.290771+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:50.290779+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:50.290781+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:50.290783+00:00'
