id: ac175779-025a-4f12-98b0-acdaeb77ea85
title: PowerShell Script Run in AppData
status: test
level: medium
description: Detects a suspicious command line execution that invokes PowerShell with
    reference to an AppData folder
author: Florian Roth (Nextron Systems), Jonhnathan Ribeiro, oscd.community
date: '2019-01-09'
modified: '2022-07-14'
tags:
    - attack.execution
    - attack.t1059.001
references:
    - https://twitter.com/JohnLaTwC/status/1082851155481288706
    - https://app.any.run/tasks/f87f1c4e-47e2-4c46-9cf4-31454c06ce03
falsepositives:
    - Administrative scripts
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        CommandLine|contains:
            - powershell.exe
            - \powershell
            - \pwsh
            - pwsh.exe
    selection2:
        CommandLine|contains|all:
            - '/c '
            - \AppData\
        CommandLine|contains:
            - Local\
            - Roaming\
    condition: all of selection*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:43.027564+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:43.027564+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:43.027578+00:00'
