id: 4b13db67-0c45-40f1-aba8-66a1a7198a1e
title: Suspicious Extrac32 Alternate Data Stream Execution
status: test
level: medium
description: Extract data from cab file and hide it in an alternate data stream
author: frack113
date: '2021-11-26'
modified: '2022-12-30'
tags:
    - attack.defense-evasion
    - attack.t1564.004
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Extrac32/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - extrac32.exe
            - .cab
        CommandLine|re: :[^\\]
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:27:58.946720+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:27:58.946720+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:27:58.946734+00:00'
