id: eca49c87-8a75-4f13-9c73-a5a29e845f03
title: Suspicious Runscripthelper.exe
status: test
level: medium
description: Detects execution of powershell scripts via Runscripthelper.exe
author: Victor Sergeev, oscd.community
date: '2020-10-09'
modified: '2022-07-11'
tags:
    - attack.execution
    - attack.t1059
    - attack.defense-evasion
    - attack.t1202
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Runscripthelper/
fields:
    - CommandLine
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \Runscripthelper.exe
        CommandLine|contains: surfacecheck
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:36:48.577371+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:36:48.577371+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:36:48.577405+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:36:48.577409+00:00'
