title: Sticky Key Like Backdoor Execution
id: 2fdefcb3-dbda-401e-ae23-f0db027628bc
status: test
level: critical
author: Florian Roth (Nextron Systems), @twjackomo, Jonhnathan Ribeiro, oscd.community
description: Detects the usage and installation of a backdoor that uses an option
    to register a malicious debugger for built-in tools that are accessible in the
    login screen
references:
    - https://learn.microsoft.com/en-us/archive/blogs/jonathantrull/detecting-sticky-key-backdoors
falsepositives:
    - Unlikely
tags:
    - attack.privilege-escalation
    - attack.persistence
    - attack.t1546.008
    - car.2014-11-003
    - car.2014-11-008
date: '2018-03-15'
modified: '2023-03-07'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \winlogon.exe
        Image|endswith:
            - \cmd.exe
            - \cscript.exe
            - \mshta.exe
            - \powershell.exe
            - \pwsh.exe
            - \regsvr32.exe
            - \rundll32.exe
            - \wscript.exe
            - \wt.exe
        CommandLine|contains:
            - sethc.exe
            - utilman.exe
            - osk.exe
            - Magnify.exe
            - Narrator.exe
            - DisplaySwitch.exe
    condition: selection
related:
    -   id: baca5663-583c-45f9-b5dc-ea96a22ce542
        type: derived
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:49:18.215681+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:49:18.215681+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:49:18.215702+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:49:18.215704+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:49:18.215705+00:00'
