id: 69bd9b97-2be2-41b6-9816-fb08757a4d1a
title: Potentially Suspicious Execution From Parent Process In Public Folder
status: test
level: high
description: 'Detects a potentially suspicious execution of a parent process located
    in the "\Users\Public" folder executing a child process containing references
    to shell or scripting binaries and commandlines.

    '
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: '2022-02-25'
modified: '2024-07-12'
tags:
    - attack.defense-evasion
    - attack.execution
    - attack.t1564
    - attack.t1059
references:
    - https://redcanary.com/blog/blackbyte-ransomware/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|contains: :\Users\Public\
    selection_child:
        Image|endswith:
            - \bitsadmin.exe
            - \certutil.exe
            - \cmd.exe
            - \cscript.exe
            - \mshta.exe
            - \powershell.exe
            - \pwsh.exe
            - \regsvr32.exe
            - \rundll32.exe
            - \wscript.exe
        CommandLine|contains:
            - bitsadmin
            - certutil
            - cscript
            - mshta
            - powershell
            - regsvr32
            - rundll32
            - wscript
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:41.453777+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:41.453777+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:41.453787+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:41.453790+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:41.453792+00:00'
