title: Use Of The SFTP.EXE Binary As A LOLBIN
id: a85ffc3a-e8fd-4040-93bf-78aff284d801
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects the usage of the "sftp.exe" binary as a LOLBIN by abusing the
    "-D" flag
references:
    - https://github.com/LOLBAS-Project/LOLBAS/pull/264
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.execution
    - attack.t1218
date: '2022-11-10'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \sftp.exe
        CommandLine|contains:
            - ' -D ..'
            - ' -D C:\'
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:50:43.690523+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:50:43.690523+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:50:43.690536+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:50:43.690538+00:00'
