title: Potential Defense Evasion Via Binary Rename
id: 36480ae1-a1cb-4eaa-a0d6-29801d7e9142
status: test
level: medium
author: Matthew Green @mgreen27, Ecco, James Pemberton @4A616D6573, oscd.community,
    Andreas Hunkeler (@Karneades)
description: Detects the execution of a renamed binary often used by attackers or
    malware leveraging new Sysmon OriginalFileName datapoint.
references:
    - https://mgreen27.github.io/posts/2019/05/12/BinaryRename.html
    - https://mgreen27.github.io/posts/2019/05/29/BinaryRename2.html
    - https://github.com/redcanaryco/atomic-red-team/blob/0f229c0e42bfe7ca736a14023836d65baa941ed2/atomics/T1036.003/T1036.003.md#atomic-test-1---masquerading-as-windows-lsass-process
falsepositives:
    - Custom applications use renamed binaries adding slight change to binary name.
        Typically this is easy to spot and add to whitelist
tags:
    - attack.defense-evasion
    - attack.t1036.003
date: '2019-06-15'
modified: '2023-01-18'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        OriginalFileName:
            - Cmd.Exe
            - CONHOST.EXE
            - 7z.exe
            - WinRAR.exe
            - wevtutil.exe
            - net.exe
            - net1.exe
            - netsh.exe
            - InstallUtil.exe
    filter:
        Image|endswith:
            - \cmd.exe
            - \conhost.exe
            - \7z.exe
            - \WinRAR.exe
            - \wevtutil.exe
            - \net.exe
            - \net1.exe
            - \netsh.exe
            - \InstallUtil.exe
    condition: selection and not filter
related:
    -   id: 0ba1da6d-b6ce-4366-828c-18826c9de23e
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:43:07.638603+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:43:07.638603+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:43:07.638617+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:43:07.638619+00:00'
