id: 18988e1b-9087-4f8a-82fe-0414dce49878
title: Execute Code with Pester.bat as Parent
status: test
level: medium
description: Detects code execution via Pester.bat (Pester - Powershell Modulte for
    testing)
author: frack113, Nasreddine Bencherchali
date: '2022-08-20'
tags:
    - attack.execution
    - attack.t1059.001
    - attack.defense-evasion
    - attack.t1216
references:
    - https://twitter.com/Oddvarmoe/status/993383596244258816
    - https://twitter.com/_st0pp3r_/status/1560072680887525378
falsepositives:
    - Legitimate use of Pester for writing tests for Powershell scripts and modules
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''59e938ff-0d6d-4dc3-b13f-36cc28734d4e''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_module:
        ParentImage|endswith:
            - \powershell.exe
            - \pwsh.exe
        ParentCommandLine|contains: \WindowsPowerShell\Modules\Pester\
    selection_cli:
        ParentCommandLine|contains:
            - '{ Invoke-Pester -EnableExit ;'
            - '{ Get-Help "'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:34:48.458844+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:34:48.458844+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:34:48.458872+00:00'
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-11-26T02:34:48.458876+00:00'
