id: 3603f18a-ec15-43a1-9af2-d196c8a7fec6
title: System Integrity Protection (SIP) Disabled
status: test
level: medium
description: 'Detects the use of csrutil to disable the Configure System Integrity
    Protection (SIP). This technique is used in post-exploit scenarios.

    '
author: Joseliyo Sanchez, @Joseliyo_Jstnk
date: '2024-01-02'
tags:
    - attack.discovery
    - attack.t1518.001
references:
    - https://ss64.com/osx/csrutil.html
    - https://objective-see.org/blog/blog_0x6D.html
    - https://www.welivesecurity.com/2017/10/20/osx-proton-supply-chain-attack-elmedia/
    - https://www.virustotal.com/gui/file/05a2adb266ec6c0ba9ed176d87d8530e71e845348c13caf9f60049760c312cd3/behavior
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: macos
detection:
    selection:
        Image|endswith: /csrutil
        CommandLine|contains: disable
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:13:14.902122+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-11-26T02:13:14.902122+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:13:14.902143+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:13:14.902146+00:00'
