title: Triple Cross eBPF Rootkit Execve Hijack
id: 0326c3c8-7803-4a0f-8c5c-368f747f7c3e
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects execution of a the file "execve_hijack" which is used by the
    Triple Cross rootkit as a way to elevate privileges
references:
    - https://github.com/h3xduck/TripleCross/blob/1f1c3e0958af8ad9f6ebe10ab442e75de33e91de/src/helpers/execve_hijack.c#L275
falsepositives:
    - Unlikely
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
date: '2022-07-05'
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith: /sudo
        CommandLine|contains: execve_hijack
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:35:51.110561+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:35:51.110561+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:35:51.110580+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:35:51.110582+00:00'
