title: Shell32 DLL Execution in Suspicious Directory
id: 32b96012-7892-429e-b26c-ac2bf46066ff
status: test
level: high
author: Christian Burkard (Nextron Systems)
description: Detects shell32.dll executing a DLL in a suspicious directory
references:
    - https://www.group-ib.com/resources/threat-research/red-curl-2.html
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.execution
    - attack.t1218.011
date: '2021-11-24'
modified: '2023-02-09'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \rundll32.exe
        OriginalFileName: RUNDLL32.EXE
    selection_cli:
        CommandLine|contains|all:
            - shell32.dll
            - Control_RunDLL
        CommandLine|contains:
            - '%AppData%'
            - '%LocalAppData%'
            - '%Temp%'
            - '%tmp%'
            - \AppData\
            - \Temp\
            - \Users\Public\
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:40:55.954331+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:40:55.954331+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:40:55.954345+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:40:55.954347+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:40:55.954348+00:00'
