title: ESXi Account Creation Via ESXCLI
id: b28e4eb3-8bbc-4f0c-819f-edfe8e2f25db
status: test
level: medium
author: Cedric Maurugeon
description: Detects user account creation on ESXi system via esxcli
references:
    - https://developer.broadcom.com/xapis/esxcli-command-reference/7.0.0/namespace/esxcli_system.html
falsepositives:
    - Legitimate administration activities
tags:
    - attack.persistence
    - attack.t1136
date: '2023-08-22'
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith: /esxcli
        CommandLine|contains|all:
            - 'system '
            - 'account '
            - 'add '
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:47.082202+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:47.082202+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:36:47.082221+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:36:47.082223+00:00'
