id: 81325ce1-be01-4250-944f-b4789644556f
title: Schedule Task Creation From Env Variable Or Potentially Suspicious Path Via
    Schtasks.EXE
status: test
level: medium
description: Detects Schtask creations that point to a suspicious folder or an environment
    variable often used by malware
author: Florian Roth (Nextron Systems)
date: '2022-02-21'
modified: '2024-10-28'
tags:
    - attack.execution
    - attack.t1053.005
references:
    - https://www.welivesecurity.com/2022/01/18/donot-go-do-not-respawn/
    - https://www.joesandbox.com/analysis/514608/0/html#324415FF7D8324231381BAD48A052F85DF04
    - https://blog.talosintelligence.com/gophish-powerrat-dcrat/
falsepositives:
    - Benign scheduled tasks creations or executions that happen often during software
        installations
    - Software that uses the AppData folder and scheduled tasks to update the software
        in the AppData folders
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''43f487f0-755f-4c2a-bce7-d6d2eec2fcf8''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_1_create:
        Image|endswith: \schtasks.exe
        CommandLine|contains: ' /create '
    selection_1_all_folders:
        CommandLine|contains:
            - :\Perflogs
            - :\Users\All Users\
            - :\Users\Default\
            - :\Users\Public
            - :\Windows\Temp
            - \AppData\Local\
            - \AppData\Roaming\
            - '%AppData%'
            - '%Public%'
    selection_2_parent:
        ParentCommandLine|endswith: \svchost.exe -k netsvcs -p -s Schedule
    selection_2_some_folders:
        CommandLine|contains:
            - :\Perflogs
            - :\Windows\Temp
            - \Users\Public
            - '%Public%'
    filter_optional_other:
        ParentCommandLine|contains: unattended.ini
        CommandLine|contains: update_task.xml
    filter_optional_team_viewer:
        CommandLine|contains: /Create /TN TVInstallRestore /TR
    filter_optional_avira_install:
        CommandLine|contains|all:
            - /Create /Xml "C:\Users\
            - \AppData\Local\Temp\.CR.
            - Avira_Security_Installation.xml
    filter_optional_avira_other:
        CommandLine|contains|all:
            - /Create /F /TN
            - '/Xml '
            - \AppData\Local\Temp\is-
            - Avira_
        CommandLine|contains:
            - .tmp\UpdateFallbackTask.xml
            - .tmp\WatchdogServiceControlManagerTimeout.xml
            - .tmp\SystrayAutostart.xml
            - .tmp\MaintenanceTask.xml
    filter_optional_klite_codec:
        CommandLine|contains|all:
            - \AppData\Local\Temp\
            - '/Create /TN "klcp_update" /XML '
            - \klcp_update_task.xml
    condition: ( all of selection_1_* or all of selection_2_* ) and not 1 of filter_optional_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:28:28.253136+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:28:28.253136+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:28:28.253151+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:28:28.253153+00:00'
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-11-26T02:28:28.253155+00:00'
