id: 3b3c7f55-f771-4dd6-8a6e-08d057a17caf
title: Arbitrary File Download Via MSPUB.EXE
status: test
level: medium
description: Detects usage of "MSPUB" (Microsoft Publisher) to download arbitrary
    files
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-08-19'
modified: '2023-02-08'
tags:
    - attack.defense-evasion
    - attack.execution
    - attack.t1218
references:
    - https://github.com/LOLBAS-Project/LOLBAS/pull/238/files
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \MSPUB.exe
        OriginalFileName: MSPUB.exe
    selection_cli:
        CommandLine|contains:
            - ftp://
            - http://
            - https://
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:13.298765+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:13.298765+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:13.298789+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:13.298794+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:13.298797+00:00'
