id: fdb62a13-9a81-4e5c-a38f-ea93a16f6d7c
title: PowerShell Base64 Encoded FromBase64String Cmdlet
status: test
level: high
description: Detects usage of a base64 encoded "FromBase64String" cmdlet in a process
    command line
author: Florian Roth (Nextron Systems)
date: '2019-08-24'
modified: '2023-04-06'
tags:
    - attack.defense-evasion
    - attack.t1140
    - attack.execution
    - attack.t1059.001
references:
    - Internal Research
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|base64offset|contains: ::FromBase64String
        CommandLine|contains:
            - OgA6AEYAcgBvAG0AQgBhAHMAZQA2ADQAUwB0AHIAaQBuAGcA
            - oAOgBGAHIAbwBtAEIAYQBzAGUANgA0AFMAdAByAGkAbgBnA
            - 6ADoARgByAG8AbQBCAGEAcwBlADYANABTAHQAcgBpAG4AZw
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:26:42.865438+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:26:42.865438+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:26:42.865465+00:00'
