title: Uncommon AddinUtil.EXE CommandLine Execution
id: 4f2cd9b6-4a17-440f-bb2a-687abb65993a
status: test
level: medium
author: Michael McKinley (@McKinleyMike), Tony Latteri (@TheLatteri)
description: 'Detects execution of the Add-In deployment cache updating utility (AddInutil.exe)
    with uncommon Addinroot or Pipelineroot paths. An adversary may execute AddinUtil.exe
    with uncommon Addinroot/Pipelineroot paths that point to the adversaries Addins.Store
    payload.

    '
references:
    - https://www.blue-prints.blog/content/blog/posts/lolbin/addinutil-lolbas.html
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1218
date: '2023-09-18'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \addinutil.exe
        OriginalFileName: AddInUtil.exe
    selection_cli:
        CommandLine|contains:
            - '-AddInRoot:'
            - '-PipelineRoot:'
    filter_main_addinroot:
        CommandLine|contains:
            - -AddInRoot:"C:\Program Files (x86)\Common Files\Microsoft Shared\VSTA
            - -AddInRoot:C:\Program Files (x86)\Common Files\Microsoft Shared\VSTA
            - -PipelineRoot:"C:\Program Files (x86)\Common Files\Microsoft Shared\VSTA
            - -PipelineRoot:C:\Program Files (x86)\Common Files\Microsoft Shared\VSTA
    condition: all of selection_* and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:41:27.996613+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:41:27.996613+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:41:27.996628+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:41:27.996630+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:41:27.996631+00:00'
