title: DLL Sideloading by VMware Xfer Utility
id: ebea773c-a8f1-42ad-a856-00cb221966e8
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects execution of VMware Xfer utility (VMwareXferlogs.exe) from the
    non-default directory which may be an attempt to sideload arbitrary DLL
references:
    - https://www.sentinelone.com/labs/lockbit-ransomware-side-loads-cobalt-strike-beacon-with-legitimate-vmware-utility/
falsepositives:
    - Unlikely
tags:
    - attack.defense-evasion
    - attack.t1574.002
date: '2022-08-02'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \VMwareXferlogs.exe
    filter:
        Image|startswith: C:\Program Files\VMware\
    condition: selection and not filter
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:45:10.220394+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:45:10.220394+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:45:10.220407+00:00'
