title: Potential PowerShell Execution Policy Tampering - ProcCreation
id: cf2e938e-9a3e-4fe8-a347-411642b28a9f
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects changes to the PowerShell execution policy registry key in order
    to bypass signing requirements for script execution from the CommandLine
references:
    - https://learn.microsoft.com/de-de/powershell/module/microsoft.powershell.security/set-executionpolicy?view=powershell-7.3
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
date: '2023-01-11'
logsource:
    category: process_creation
    product: windows
detection:
    selection_path:
        CommandLine|contains:
            - \ShellIds\Microsoft.PowerShell\ExecutionPolicy
            - \Policies\Microsoft\Windows\PowerShell\ExecutionPolicy
    selection_values:
        CommandLine|contains:
            - Bypass
            - RemoteSigned
            - Unrestricted
    condition: all of selection_*
related:
    -   id: fad91067-08c5-4d1a-8d8c-d96a21b37814
        type: similar
    -   id: 87e3c4e8-a6a8-4ad9-bb4f-46e7ff99a180
        type: similar
    -   id: 61d0475c-173f-4844-86f7-f3eebae1c66b
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:47:32.548786+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:47:32.548786+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:47:32.548806+00:00'
