id: 6104e693-a7d6-4891-86cb-49a258523559
title: Bash Interactive Shell
status: test
level: low
description: Detects execution of the bash shell with the interactive flag "-i".
author: '@d4ns4n_'
date: '2023-04-07'
tags:
    - attack.execution
references:
    - https://pentestmonkey.net/cheat-sheet/shells/reverse-shell-cheat-sheet
    - https://www.revshells.com/
    - https://linux.die.net/man/1/bash
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith: /bash
        CommandLine|contains: ' -i '
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:17:04.757264+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-26T02:17:04.757264+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:17:04.757276+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:17:04.757278+00:00'
