title: HackTool - Quarks PwDump Execution
id: 0685b176-c816-4837-8e7b-1216f346636b
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects usage of the Quarks PwDump tool via commandline arguments
references:
    - https://github.com/quarkslab/quarkspwdump
    - https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/seedworm-apt-iran-middle-east
falsepositives:
    - Unlikely
tags:
    - attack.credential-access
    - attack.t1003.002
date: '2022-09-05'
modified: '2023-02-05'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \QuarksPwDump.exe
    selection_cli:
        CommandLine:
            - ' -dhl'
            - ' --dump-hash-local'
            - ' -dhdc'
            - ' --dump-hash-domain-cached'
            - ' --dump-bitlocker'
            - ' -dhd '
            - ' --dump-hash-domain '
            - --ntds-file
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:46:36.758509+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:46:36.758509+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:46:36.758532+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:46:36.758534+00:00'
