id: 850d55f9-6eeb-4492-ad69-a72338f65ba4
title: C# IL Code Compilation Via Ilasm.EXE
status: test
level: medium
description: Detects the use of "Ilasm.EXE" in order to compile C# intermediate (IL)
    code to EXE or DLL.
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: '2022-05-07'
modified: '2022-05-16'
tags:
    - attack.defense-evasion
    - attack.t1127
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Ilasm/
    - https://www.echotrail.io/insights/search/ilasm.exe
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \ilasm.exe
        OriginalFileName: ilasm.exe
    selection_cli:
        CommandLine|contains:
            - ' /dll'
            - ' /exe'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:37.086542+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:37.086542+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:37.086549+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:37.086552+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:37.086554+00:00'
