title: PktMon.EXE Execution
id: f956c7c1-0f60-4bc5-b7d7-b39ab3c08908
status: test
level: medium
author: frack113
description: Detects execution of PktMon, a tool that captures network packets.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Pktmon/
falsepositives:
    - Legitimate use
tags:
    - attack.credential-access
    - attack.t1040
date: '2022-03-17'
modified: '2023-06-23'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \pktmon.exe
        OriginalFileName: PktMon.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:14.275183+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:14.275183+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:44:14.275200+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:44:14.275202+00:00'
