id: 903076ff-f442-475a-b667-4f246bcc203b
title: Nltest.EXE Execution
status: test
level: low
description: Detects nltest commands that can be used for information discovery
author: Arun Chauhan
date: '2023-02-03'
tags:
    - attack.discovery
    - attack.t1016
    - attack.t1018
    - attack.t1482
references:
    - https://jpcertcc.github.io/ToolAnalysisResultSheet/details/nltest.htm
falsepositives:
    - Legitimate administration activity
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''5cc90652-4cbd-4241-aa3b-4b462fa5a248''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''eeb66bbb-3dde-4582-815a-584aee9fe6d1''),
    type=<SigmaRelatedType.OBSOLETE: 4>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \nltest.exe
        OriginalFileName: nltestrk.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:36:17.195972+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:36:17.195972+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:36:17.196001+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:36:17.196005+00:00'
