title: Capture Credentials with Rpcping.exe
id: 93671f99-04eb-4ab4-a161-70d446a84003
status: test
level: medium
author: Julia Fomina, oscd.community
description: Detects using Rpcping.exe to send a RPC test connection to the target
    server (-s) and force the NTLM hash to be sent in the process.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Rpcping/
    - https://twitter.com/vysecurity/status/974806438316072960
    - https://twitter.com/vysecurity/status/873181705024266241
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/hh875578(v=ws.11)
falsepositives:
    - Unlikely
tags:
    - attack.credential-access
    - attack.t1003
date: '2020-10-09'
modified: '2024-03-13'
logsource:
    category: process_creation
    product: windows
detection:
    use_rpcping:
        Image|endswith: \rpcping.exe
    remote_server:
        CommandLine|contains|windash: -s
    ntlm_auth:
        CommandLine|contains|all|windash:
            - -u
            - NTLM
            - -t
            - ncacn_np
    condition: use_rpcping and remote_server and ntlm_auth
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:24.261817+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:24.261817+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:44:24.261840+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:44:24.261842+00:00'
