id: 75edd216-1939-4c73-8d61-7f3a0d85b5cc
title: File Download Via InstallUtil.EXE
status: test
level: medium
description: 'Detects use of .NET InstallUtil.exe in order to download arbitrary files.
    The files will be written to "%LOCALAPPDATA%\Microsoft\Windows\INetCache\IE\"

    '
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-08-19'
modified: '2023-11-09'
tags:
    - attack.defense-evasion
    - attack.t1218
references:
    - https://github.com/LOLBAS-Project/LOLBAS/pull/239
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \InstallUtil.exe
        OriginalFileName: InstallUtil.exe
    selection_cli:
        CommandLine|contains:
            - ftp://
            - http://
            - https://
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:49.521805+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:49.521805+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:49.521810+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:49.521811+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:49.521813+00:00'
