id: fdfcbd78-48f1-4a4b-90ac-d82241e368c5
title: PsExec Service Execution
status: test
level: medium
description: Detects launch of the PSEXESVC service, which means that this system
    was the target of a psexec remote execution
author: Thomas Patzke, Romaissa Adjailia, Florian Roth (Nextron Systems)
date: '2017-06-12'
modified: '2023-02-28'
tags:
    - attack.execution
references:
    - https://learn.microsoft.com/en-us/sysinternals/downloads/psexec
    - https://www.youtube.com/watch?v=ro2QuZTIMBM
falsepositives:
    - Legitimate administrative tasks
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''fa91cc36-24c9-41ce-b3c8-3bbc3f2f67ba''),
    type=<SigmaRelatedType.OBSOLETE: 4>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image: C:\Windows\PSEXESVC.exe
        OriginalFileName: psexesvc.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:46.904375+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:46.904375+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:46.904381+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:46.904382+00:00'
