title: OMIGOD SCX RunAsProvider ExecuteShellCommand
id: 21541900-27a9-4454-9c4c-3f0a4240344a
status: test
level: high
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research), MSTIC
description: 'Rule to detect the use of the SCX RunAsProvider Invoke_ExecuteShellCommand
    to execute any UNIX/Linux command using the /bin/sh shell.

    SCXcore, started as the Microsoft Operations Manager UNIX/Linux Agent, is now
    used in a host of products including

    Microsoft Operations Manager, Microsoft Azure, and Microsoft Operations Management
    Suite.

    '
references:
    - https://www.wiz.io/blog/omigod-critical-vulnerabilities-in-omi-azure
    - https://github.com/Azure/Azure-Sentinel/pull/3059
falsepositives:
    - Legitimate use of SCX RunAsProvider Invoke_ExecuteShellCommand.
tags:
    - attack.privilege-escalation
    - attack.initial-access
    - attack.execution
    - attack.t1068
    - attack.t1190
    - attack.t1203
date: '2021-10-15'
modified: '2022-10-05'
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        User: root
        LogonId: 0
        CurrentDirectory: /var/opt/microsoft/scx/tmp
        CommandLine|contains: /bin/sh
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:21.366992+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:21.366992+00:00'
    detection_fields:
        -   source_field: User
            target_table: process_activity
            target_field: actor.user.name
            mapped_at: '2025-12-04T01:36:21.367013+00:00'
        -   source_field: LogonId
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:36:21.367017+00:00'
        -   source_field: CurrentDirectory
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:36:21.367019+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:36:21.367021+00:00'
