title: Potentially Suspicious Execution Of Regasm/Regsvcs From Uncommon Location
id: cc368ed0-2411-45dc-a222-510ace303cb2
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects potentially suspicious execution of the Regasm/Regsvcs utilities
    from a potentially suspicious location
references:
    - https://www.fortiguard.com/threat-signal-report/4718?s=09
    - https://lolbas-project.github.io/lolbas/Binaries/Regasm/
    - https://lolbas-project.github.io/lolbas/Binaries/Regsvcs/
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1218.009
date: '2022-08-25'
modified: '2023-02-13'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \Regsvcs.exe
            - \Regasm.exe
        OriginalFileName:
            - RegSvcs.exe
            - RegAsm.exe
    selection_dir:
        CommandLine|contains:
            - \AppData\Local\Temp\
            - \Microsoft\Windows\Start Menu\Programs\Startup\
            - \PerfLogs\
            - \Users\Public\
            - \Windows\Temp\
    condition: all of selection_*
related:
    -   id: e9f8f8cc-07cc-4e81-b724-f387db9175e4
        type: derived
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:43:13.462846+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:43:13.462846+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:43:13.462860+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:43:13.462862+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:43:13.462864+00:00'
