title: Potential Obfuscated Ordinal Call Via Rundll32
id: 43fa5350-db63-4b8f-9a01-789a427074e1
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects execution of "rundll32" with potential obfuscated ordinal calls
references:
    - Internal Research
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
date: '2023-05-17'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \rundll32.exe
        OriginalFileName: RUNDLL32.EXE
        CommandLine|contains: rundll32
    selection_cli:
        CommandLine|contains:
            - '#+'
            - '#-'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:43:04.186879+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:43:04.186879+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:43:04.186903+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:43:04.186905+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:43:04.186906+00:00'
