id: 3a6586ad-127a-4d3b-a677-1e6eacdf8fde
title: Windows Shell/Scripting Processes Spawning Suspicious Programs
status: test
level: high
description: Detects suspicious child processes of a Windows shell and scripting processes
    such as wscript, rundll32, powershell, mshta...etc.
author: Florian Roth (Nextron Systems), Tim Shelton
date: '2018-04-06'
modified: '2023-05-23'
tags:
    - attack.execution
    - attack.defense-evasion
    - attack.t1059.005
    - attack.t1059.001
    - attack.t1218
references:
    - https://mgreen27.github.io/posts/2018/04/02/DownloadCradle.html
fields:
    - CommandLine
    - ParentCommandLine
    - CurrentDirectory
    - Image
    - ParentImage
falsepositives:
    - Administrative scripts
    - Microsoft SCCM
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith:
            - \mshta.exe
            - \powershell.exe
            - \pwsh.exe
            - \rundll32.exe
            - \cscript.exe
            - \wscript.exe
            - \wmiprvse.exe
            - \regsvr32.exe
        Image|endswith:
            - \schtasks.exe
            - \nslookup.exe
            - \certutil.exe
            - \bitsadmin.exe
            - \mshta.exe
    filter_ccmcache:
        CurrentDirectory|contains: \ccmcache\
    filter_amazon:
        ParentCommandLine|contains:
            - \Program Files\Amazon\WorkSpacesConfig\Scripts\setup-scheduledtask.ps1
            - \Program Files\Amazon\WorkSpacesConfig\Scripts\set-selfhealing.ps1
            - \Program Files\Amazon\WorkSpacesConfig\Scripts\check-workspacehealth.ps1
            - \nessus_
    filter_nessus:
        CommandLine|contains: \nessus_
    filter_sccm_install:
        ParentImage|endswith: \mshta.exe
        Image|endswith: \mshta.exe
        ParentCommandLine|contains|all:
            - C:\MEM_Configmgr_
            - \splash.hta
            - '{1E460BD7-F1C3-4B2E-88BF-4E770A288AF5}'
        CommandLine|contains|all:
            - C:\MEM_Configmgr_
            - \SMSSETUP\BIN\
            - \autorun.hta
            - '{1E460BD7-F1C3-4B2E-88BF-4E770A288AF5}'
    condition: selection and not 1 of filter_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:35:12.967621+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:35:12.967621+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:35:12.967667+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:35:12.967672+00:00'
        -   source_field: CurrentDirectory
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:35:12.967676+00:00'
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-11-26T02:35:12.967680+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:35:12.967683+00:00'
