title: Suspicious Scheduled Task Creation via Masqueraded XML File
id: dd2a821e-3b07-4d3b-a9ac-929fe4c6ca0c
status: test
level: medium
author: Swachchhanda Shrawan Poudel, Elastic (idea)
description: Detects the creation of a scheduled task using the "-XML" flag with a
    file without the '.xml' extension. This behavior could be indicative of potential
    defense evasion attempt during persistence
references:
    - https://learn.microsoft.com/en-us/windows/win32/taskschd/daily-trigger-example--xml-
    - https://github.com/elastic/protections-artifacts/blob/084067123d3328a823b1c3fdde305b694275c794/behavior/rules/persistence_suspicious_scheduled_task_creation_via_masqueraded_xml_file.toml
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.t1036.005
    - attack.t1053.005
date: '2023-04-20'
modified: '2024-12-01'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \schtasks.exe
        OriginalFileName: schtasks.exe
    selection_cli_create:
        CommandLine|contains:
            - /create
            - -create
    selection_cli_xml:
        CommandLine|contains:
            - /xml
            - -xml
    filter_main_extension_xml:
        CommandLine|contains: .xml
    filter_main_system_process:
        IntegrityLevel:
            - System
            - S-1-16-16384
    filter_main_rundll32:
        ParentImage|endswith: \rundll32.exe
        ParentCommandLine|contains|all:
            - :\WINDOWS\Installer\MSI
            - .tmp,zzzzInvokeManagedCustomActionOutOfProc
    filter_optional_third_party:
        ParentImage|endswith:
            - :\ProgramData\OEM\UpgradeTool\CareCenter_*\BUnzip\Setup_msi.exe
            - :\Program Files\Axis Communications\AXIS Camera Station\SetupActions.exe
            - :\Program Files\Axis Communications\AXIS Device Manager\AdmSetupActions.exe
            - :\Program Files (x86)\Zemana\AntiMalware\AntiMalware.exe
            - :\Program Files\Dell\SupportAssist\pcdrcui.exe
    condition: all of selection_* and not 1 of filter_main_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:45:29.753810+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:45:29.753810+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:45:29.753852+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:45:29.753857+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:45:29.753859+00:00'
        -   source_field: IntegrityLevel
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:45:29.753863+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:45:29.753866+00:00'
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-12-04T01:45:29.753869+00:00'
