id: ddf36b67-e872-4507-ab2e-46bda21b842c
title: Local System Accounts Discovery - MacOs
status: test
level: low
description: Detects enumeration of local systeam accounts on MacOS
author: Alejandro Ortuno, oscd.community
date: '2020-10-08'
modified: '2022-11-27'
tags:
    - attack.discovery
    - attack.t1087.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1087.001/T1087.001.md
falsepositives:
    - Legitimate administration activities
taxonomy: sigma
logsource:
    category: process_creation
    product: macos
detection:
    selection_1:
        Image|endswith: /dscl
        CommandLine|contains|all:
            - list
            - /users
    selection_2:
        Image|endswith: /dscacheutil
        CommandLine|contains|all:
            - -q
            - user
    selection_3:
        CommandLine|contains: '''x:0:'''
    selection_4:
        Image|endswith: /cat
        CommandLine|contains:
            - /etc/passwd
            - /etc/sudoers
    selection_5:
        Image|endswith: /id
    selection_6:
        Image|endswith: /lsof
        CommandLine|contains: -u
    condition: 1 of selection*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:14:25.758687+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-11-13T20:14:25.758687+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:14:25.758697+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:14:25.758698+00:00'
