id: cfec9d29-64ec-4a0f-9ffe-0fdb856d5446
title: Suspicious Git Clone - Linux
status: test
level: medium
description: Detects execution of "git" in order to clone a remote repository that
    contain suspicious keywords which might be suspicious
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-01-03'
modified: '2023-01-05'
tags:
    - attack.reconnaissance
    - attack.t1593.003
references:
    - https://gist.githubusercontent.com/MichaelKoczwara/12faba9c061c12b5814b711166de8c2f/raw/e2068486692897b620c25fde1ea258c8218fe3d3/history.txt
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection_img:
        Image|endswith: /git
        CommandLine|contains: ' clone '
    selection_keyword:
        CommandLine|contains:
            - exploit
            - Vulns
            - vulnerability
            - RCE
            - RemoteCodeExecution
            - Invoke-
            - CVE-
            - poc-
            - ProofOfConcept
            - proxyshell
            - log4shell
            - eternalblue
            - eternal-blue
            - MS17-
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:15:51.740548+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-13T20:15:51.740548+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:15:51.740565+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:15:51.740567+00:00'
