title: Uncommon Extension Shim Database Installation Via Sdbinst.EXE
id: 18ee686c-38a3-4f65-9f44-48a077141f42
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: 'Detects installation of a potentially suspicious new shim with an uncommon
    extension using sdbinst.exe.

    Adversaries may establish persistence and/or elevate privileges by executing malicious
    content triggered by application shims

    '
references:
    - https://www.fireeye.com/blog/threat-research/2017/05/fin7-shim-databases-persistence.html
    - https://github.com/nasbench/Misc-Research/blob/8ee690e43a379cbce8c9d61107442c36bd9be3d3/Other/Undocumented-Flags-Sdbinst.md
falsepositives:
    - Unknown
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1546.011
date: '2023-08-01'
modified: '2024-01-10'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \sdbinst.exe
        OriginalFileName: sdbinst.exe
    filter_main_legit_ext:
        CommandLine|contains: .sdb
    filter_main_legit_extensions:
        CommandLine|endswith:
            - ' -c'
            - ' -f'
            - ' -mm'
            - ' -t'
        CommandLine|contains: ' -m -bg'
    filter_main_null:
        CommandLine: null
    filter_main_empty:
        CommandLine: ''
    condition: selection and not 1 of filter_main_*
related:
    -   id: 517490a7-115a-48c6-8862-1a481504d5a8
        type: derived
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:11.953872+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:11.953872+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:44:11.953889+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:44:11.953891+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:44:11.953892+00:00'
