id: cd764533-2e07-40d6-a718-cfeec7f2da7f
title: Renamed SysInternals DebugView Execution
status: test
level: high
description: Detects suspicious renamed SysInternals DebugView execution
author: Florian Roth (Nextron Systems)
date: '2020-05-28'
modified: '2023-02-14'
tags:
    - attack.resource-development
    - attack.t1588.002
references:
    - https://www.epicturla.com/blog/sysinturla
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Product: Sysinternals DebugView
    filter:
        OriginalFileName: Dbgview.exe
        Image|endswith: \Dbgview.exe
    condition: selection and not filter
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:54.390745+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:54.390745+00:00'
    detection_fields:
        -   source_field: Product
            target_table: process_activity
            target_field: metadata.product.name
            mapped_at: '2025-11-13T20:20:54.390801+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:54.390806+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:54.390809+00:00'
