id: e31033fc-33f0-4020-9a16-faf9b31cbf08
title: PUA - Netcat Suspicious Execution
status: test
level: high
description: Detects execution of Netcat. Adversaries may use a non-application layer
    protocol for communication between host and C2 server or among infected hosts
    within a network
author: frack113, Florian Roth (Nextron Systems)
date: '2021-07-21'
modified: '2023-02-08'
tags:
    - attack.command-and-control
    - attack.t1095
references:
    - https://nmap.org/ncat/
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1095/T1095.md
    - https://www.revshells.com/
falsepositives:
    - Legitimate ncat use
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \nc.exe
            - \ncat.exe
            - \netcat.exe
    selection_cmdline:
        CommandLine|contains:
            - ' -lvp '
            - ' -lvnp'
            - ' -l -v -p '
            - ' -lv -p '
            - ' -l --proxy-type http '
            - ' -vnl --exec '
            - ' -vnl -e '
            - ' --lua-exec '
            - ' --sh-exec '
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:49.492394+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:49.492394+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:49.492401+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:49.492403+00:00'
