id: 39ed3c80-e6a1-431b-9df3-911ac53d08a7
title: UAC Bypass Using NTFS Reparse Point - Process
status: test
level: high
description: Detects the pattern of UAC Bypass using NTFS reparse point and wusa.exe
    DLL hijacking (UACMe 36)
author: Christian Burkard (Nextron Systems)
date: '2021-08-30'
modified: '2024-12-01'
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
references:
    - https://github.com/hfiref0x/UACME
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        CommandLine|startswith: '"C:\Windows\system32\wusa.exe"  /quiet C:\Users\'
        CommandLine|endswith: \AppData\Local\Temp\update.msu
        IntegrityLevel:
            - High
            - System
            - S-1-16-16384
            - S-1-16-12288
    selection2:
        ParentCommandLine: '"C:\Windows\system32\dism.exe" /online /quiet /norestart
            /add-package /packagepath:"C:\Windows\system32\pe386" /ignorecheck'
        IntegrityLevel:
            - High
            - System
        CommandLine|contains|all:
            - C:\Users\
            - \AppData\Local\Temp\
            - \dismhost.exe {
        Image|endswith: \DismHost.exe
    condition: 1 of selection*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:33:08.942423+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:33:08.942423+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:33:08.942449+00:00'
        -   source_field: IntegrityLevel
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:33:08.942453+00:00'
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-11-26T02:33:08.942456+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:33:08.942458+00:00'
