id: 889719ef-dd62-43df-86c3-768fb08dc7c0
title: Suspicious PowerShell Mailbox Export to Share
status: test
level: critical
description: Detects usage of the powerShell New-MailboxExportRequest Cmdlet to exports
    a mailbox to a remote or local share, as used in ProxyShell exploitations
author: Florian Roth (Nextron Systems)
date: '2021-08-07'
modified: '2022-10-26'
tags:
    - attack.exfiltration
references:
    - https://youtu.be/5mqid-7zp8k?t=2481
    - https://blog.orange.tw/2021/08/proxylogon-a-new-attack-surface-on-ms-exchange-part-1.html
    - https://peterjson.medium.com/reproducing-the-proxyshell-pwn2own-exploit-49743a4ea9a1
    - https://m365internals.com/2022/10/07/hunting-in-on-premises-exchange-server-logs/
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - New-MailboxExportRequest
            - ' -Mailbox '
            - ' -FilePath \\'
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:37.073806+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:37.073806+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:37.073817+00:00'
