id: f99abdf0-6283-4e71-bd2b-b5c048a94743
title: Potentially Suspicious Office Document Executed From Trusted Location
status: test
level: high
description: Detects the execution of an Office application that points to a document
    that is located in a trusted location. Attackers often used this to avoid macro
    security and execute their malicious code.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-06-21'
modified: '2023-10-18'
tags:
    - attack.defense-evasion
    - attack.t1202
references:
    - Internal Research
    - https://twitter.com/Max_Mal_/status/1633863678909874176
    - https://techcommunity.microsoft.com/t5/microsoft-365-blog/new-security-hardening-policies-for-trusted-documents/ba-p/3023465
    - https://twitter.com/_JohnHammond/status/1588155401752788994
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|endswith:
            - \explorer.exe
            - \dopus.exe
    selection_img:
        Image|endswith:
            - \EXCEL.EXE
            - \POWERPNT.EXE
            - \WINWORD.exe
        OriginalFileName:
            - Excel.exe
            - POWERPNT.EXE
            - WinWord.exe
    selection_trusted_location:
        CommandLine|contains:
            - \AppData\Roaming\Microsoft\Templates
            - \AppData\Roaming\Microsoft\Word\Startup\
            - \Microsoft Office\root\Templates\
            - \Microsoft Office\Templates\
    filter_main_dotx:
        CommandLine|endswith:
            - .dotx
            - .xltx
            - .potx
    condition: all of selection_* and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:58.299755+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:58.299755+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:58.299760+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:58.299761+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:58.299762+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:58.299764+00:00'
