id: 37651c2a-42cd-4a69-ae0d-22a4349aa04a
title: Unsigned AppX Installation Attempt Using Add-AppxPackage
status: test
level: medium
description: Detects usage of the "Add-AppxPackage" or it's alias "Add-AppPackage"
    to install unsigned AppX packages
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-01-31'
tags:
    - attack.persistence
    - attack.defense-evasion
references:
    - https://learn.microsoft.com/en-us/windows/msix/package/unsigned-package
    - https://twitter.com/WindowsDocs/status/1620078135080325122
falsepositives:
    - Installation of unsigned packages for testing purposes
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''975b2262-9a49-439d-92a6-0709cccdf0b2''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
        OriginalFileName:
            - PowerShell.EXE
            - pwsh.dll
    selection_cmdlet:
        CommandLine|contains:
            - 'Add-AppPackage '
            - 'Add-AppxPackage '
    selection_flag:
        CommandLine|contains: ' -AllowUnsigned'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:37:03.591893+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:37:03.591893+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:37:03.591928+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:37:03.591933+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:37:03.591936+00:00'
