id: 88d6e60c-759d-4ac1-a447-c0f1466c2d21
title: Chromium Browser Instance Executed With Custom Extension
status: test
level: medium
description: Detects a Chromium based browser process with the 'load-extension' flag
    to start a instance with a custom extension
author: Aedan Russell, frack113, X__Junior (Nextron Systems)
date: '2022-06-19'
modified: '2023-11-28'
tags:
    - attack.persistence
    - attack.t1176
references:
    - https://redcanary.com/blog/chromeloader/
    - https://emkc.org/s/RJjuLa
    - https://www.mandiant.com/resources/blog/lnk-between-browsers
falsepositives:
    - Usage of Chrome Extensions in testing tools such as BurpSuite will trigger this
        alert
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''27ba3207-dd30-4812-abbf-5d20c57d474e''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - \brave.exe
            - \chrome.exe
            - \msedge.exe
            - \opera.exe
            - \vivaldi.exe
        CommandLine|contains: --load-extension=
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:27:50.529787+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:27:50.529787+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:27:50.529815+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:27:50.529819+00:00'
