id: 40f9af16-589d-4984-b78d-8c2aec023197
title: Potential UAC Bypass Via Sdclt.EXE
status: test
level: medium
description: A General detection for sdclt being spawned as an elevated process. This
    could be an indicator of sdclt being used for bypass UAC techniques.
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: '2020-05-02'
modified: '2024-12-01'
tags:
    - attack.privilege-escalation
    - attack.defense-evasion
    - attack.t1548.002
references:
    - https://github.com/OTRF/detection-hackathon-apt29/issues/6
    - https://github.com/OTRF/ThreatHunter-Playbook/blob/2d4257f630f4c9770f78d0c1df059f891ffc3fec/docs/evals/apt29/detections/3.B.2_C36B49B5-DF58-4A34-9FE9-56189B9DEFEA.md
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: sdclt.exe
        IntegrityLevel:
            - High
            - S-1-16-12288
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:37:12.255534+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:37:12.255534+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:37:12.255549+00:00'
        -   source_field: IntegrityLevel
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:37:12.255552+00:00'
