id: b86f6dea-0b2f-41f5-bdcc-a057bd19cd6a
title: File Download From IP Based URL Via CertOC.EXE
status: test
level: high
description: Detects when a user downloads a file from an IP based URL using CertOC.exe
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-10-18'
tags:
    - attack.command-and-control
    - attack.execution
    - attack.t1105
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Certoc/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''70ad0861-d1fe-491c-a45f-fa48148a300d''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \certoc.exe
        OriginalFileName: CertOC.exe
    selection_ip:
        CommandLine|re: ://[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}
    selection_cli:
        CommandLine|contains: -GetCACAPS
    condition: all of selection*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:35.504207+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:35.504207+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:35.504223+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:35.504225+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:35.504227+00:00'
