title: PUA - Potential PE Metadata Tamper Using Rcedit
id: 0c92f2e6-f08f-4b73-9216-ecb0ca634689
status: test
level: medium
author: Micah Babinski
description: Detects the use of rcedit to potentially alter executable PE metadata
    properties, which could conceal efforts to rename system utilities for defense
    evasion.
references:
    - https://security.stackexchange.com/questions/210843/is-it-possible-to-change-original-filename-of-an-exe
    - https://www.virustotal.com/gui/file/02e8e8c5d430d8b768980f517b62d7792d690982b9ba0f7e04163cbc1a6e7915
    - https://github.com/electron/rcedit
falsepositives:
    - Legitimate use of the tool by administrators or users to update metadata of
        a binary
tags:
    - attack.defense-evasion
    - attack.t1036.003
    - attack.t1036
    - attack.t1027.005
    - attack.t1027
date: '2022-12-11'
modified: '2023-03-05'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \rcedit-x64.exe
            - \rcedit-x86.exe
        Description: Edit resources of exe
        Product: rcedit
    selection_flags:
        CommandLine|contains: --set-
    selection_attributes:
        CommandLine|contains:
            - OriginalFileName
            - CompanyName
            - FileDescription
            - ProductName
            - ProductVersion
            - LegalCopyright
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:51:09.130257+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:51:09.130257+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:51:09.130272+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: device.desc
            mapped_at: '2025-12-04T01:51:09.130274+00:00'
        -   source_field: Product
            target_table: process_activity
            target_field: metadata.product.name
            mapped_at: '2025-12-04T01:51:09.130276+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:51:09.130277+00:00'
