title: PUA - Crassus Execution
id: 2c32b543-1058-4808-91c6-5b31b8bed6c5
status: test
level: high
author: pH-T (Nextron Systems)
description: Detects Crassus, a Windows privilege escalation discovery tool, based
    on PE metadata characteristics.
references:
    - https://github.com/vu-ls/Crassus
falsepositives:
    - Unlikely
tags:
    - attack.discovery
    - attack.t1590.001
date: '2023-04-17'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \Crassus.exe
        OriginalFileName: Crassus.exe
        Description|contains: Crassus
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:48:48.357074+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:48:48.357074+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:48:48.357101+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:48:48.357108+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: device.desc
            mapped_at: '2025-12-04T01:48:48.357111+00:00'
