id: d7329412-13bd-44ba-a072-3387f804a106
title: Guest Account Enabled Via Sysadminctl
status: test
level: low
description: Detects attempts to enable the guest account using the sysadminctl utility
author: Sohan G (D4rkCiph3r)
date: '2023-02-18'
tags:
    - attack.initial-access
    - attack.t1078
    - attack.t1078.001
references:
    - https://ss64.com/osx/sysadminctl.html
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: macos
detection:
    selection:
        Image|endswith: /sysadminctl
        CommandLine|contains|all:
            - ' -guestAccount'
            - ' on'
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:13:06.009965+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-11-26T02:13:06.009965+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:13:06.009984+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:13:06.009986+00:00'
