id: 676381a6-15ca-4d73-a9c8-6a22e970b90d
title: Local Groups Discovery - Linux
status: test
level: low
description: Detects enumeration of local system groups. Adversaries may attempt to
    find local system groups and permission settings
author: Ömer Günal, Alejandro Ortuno, oscd.community
date: '2020-10-11'
modified: '2022-11-27'
tags:
    - attack.discovery
    - attack.t1069.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1069.001/T1069.001.md
falsepositives:
    - Legitimate administration activities
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection_1:
        Image|endswith: /groups
    selection_2:
        Image|endswith:
            - /cat
            - /head
            - /tail
            - /more
        CommandLine|contains: /etc/group
    condition: 1 of selection*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:15:49.952531+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-13T20:15:49.952531+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:15:49.952537+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:15:49.952539+00:00'
