id: 42df45e7-e6e9-43b5-8f26-bec5b39cc239
title: System Information Discovery
status: stable
level: informational
description: Detects system information discovery commands
author: Ömer Günal, oscd.community
date: '2020-10-08'
modified: '2021-09-14'
tags:
    - attack.discovery
    - attack.t1082
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1082/T1082.md
falsepositives:
    - Legitimate administration activities
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith:
            - /uname
            - /hostname
            - /uptime
            - /lspci
            - /dmidecode
            - /lscpu
            - /lsmod
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:15:55.915672+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-13T20:15:55.915672+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:15:55.915677+00:00'
