title: Logged-On User Password Change Via Ksetup.EXE
id: c9783e20-4793-4164-ba96-d9ee483992c4
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects password change for the logged-on user's via "ksetup.exe"
references:
    - https://learn.microsoft.com/en-gb/windows-server/administration/windows-commands/ksetup
falsepositives:
    - Unknown
tags:
    - attack.execution
date: '2023-04-06'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \ksetup.exe
        OriginalFileName: ksetup.exe
    selection_cli:
        CommandLine|contains: ' /ChangePassword '
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:45:30.195098+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:45:30.195098+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:45:30.195118+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:45:30.195120+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:45:30.195121+00:00'
