id: 82343930-652f-43f5-ab70-2ee9fdd6d5e9
title: Potential ShellDispatch.DLL Functionality Abuse
status: test
level: medium
description: Detects potential "ShellDispatch.dll" functionality abuse to execute
    arbitrary binaries via "ShellExecute"
author: X__Junior (Nextron Systems)
date: '2023-06-20'
tags:
    - attack.execution
    - attack.defense-evasion
references:
    - https://www.hexacorn.com/blog/2023/06/07/this-lolbin-doesnt-exist/
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \rundll32.exe
        OriginalFileName: RUNDLL32.EXE
    selection_cli:
        CommandLine|contains: RunDll_ShellExecuteW
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:34:38.233764+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:34:38.233764+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:34:38.233790+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:34:38.233793+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:34:38.233796+00:00'
