id: 631b22a4-70f4-4e2f-9ea8-42f84d9df6d8
title: Suspicious AddinUtil.EXE CommandLine Execution
status: test
level: high
description: 'Detects execution of the Add-In deployment cache updating utility (AddInutil.exe)
    with suspicious Addinroot or Pipelineroot paths. An adversary may execute AddinUtil.exe
    with uncommon Addinroot/Pipelineroot paths that point to the adversaries Addins.Store
    payload.

    '
author: Nasreddine Bencherchali (Nextron Systems), Michael McKinley (@McKinleyMike),
    Tony Latteri (@TheLatteri)
date: '2023-09-18'
tags:
    - attack.defense-evasion
    - attack.t1218
references:
    - https://www.blue-prints.blog/content/blog/posts/lolbin/addinutil-lolbas.html
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \addinutil.exe
        OriginalFileName: AddInUtil.exe
    selection_susp_1_flags:
        CommandLine|contains:
            - '-AddInRoot:'
            - '-PipelineRoot:'
    selection_susp_1_paths:
        CommandLine|contains:
            - \AppData\Local\Temp\
            - \Desktop\
            - \Downloads\
            - \Users\Public\
            - \Windows\Temp\
    selection_susp_2:
        CommandLine|contains:
            - -AddInRoot:.
            - -AddInRoot:"."
            - -PipelineRoot:.
            - -PipelineRoot:"."
        CurrentDirectory|contains:
            - \AppData\Local\Temp\
            - \Desktop\
            - \Downloads\
            - \Users\Public\
            - \Windows\Temp\
    condition: selection_img and (all of selection_susp_1_* or selection_susp_2)
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:30:16.691867+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:30:16.691867+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:30:16.691900+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:30:16.691903+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:30:16.691904+00:00'
        -   source_field: CurrentDirectory
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:30:16.691906+00:00'
