title: Suspicious Windows Update Agent Empty Cmdline
id: 52d097e2-063e-4c9c-8fbb-855c8948d135
status: test
level: high
author: Florian Roth (Nextron Systems)
description: 'Detects suspicious Windows Update Agent activity in which a wuauclt.exe
    process command line doesn''t contain any command line flags

    '
references:
    - https://redcanary.com/blog/blackbyte-ransomware/
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1036
date: '2022-02-26'
modified: '2023-11-11'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \Wuauclt.exe
        OriginalFileName: Wuauclt.exe
    selection_cli:
        CommandLine|endswith:
            - Wuauclt
            - Wuauclt.exe
    condition: all of selection*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:49:28.023892+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:49:28.023892+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:49:28.023913+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:49:28.023915+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:49:28.023917+00:00'
