title: Suspicious Usage Of ShellExec_RunDLL
id: d87bd452-6da1-456e-8155-7dc988157b7d
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects suspicious usage of the ShellExec_RunDLL function to launch other
    commands as seen in the the raspberry-robin attack
references:
    - https://redcanary.com/blog/raspberry-robin/
    - https://www.microsoft.com/en-us/security/blog/2022/10/27/raspberry-robin-worm-part-of-larger-ecosystem-facilitating-pre-ransomware-activity/
    - https://github.com/SigmaHQ/sigma/issues/1009
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
date: '2022-09-01'
modified: '2022-12-30'
logsource:
    category: process_creation
    product: windows
detection:
    selection_openasrundll:
        CommandLine|contains: ShellExec_RunDLL
    selection_suspcli:
        CommandLine|contains:
            - \Desktop\
            - \Temp\
            - \Users\Public\
            - comspec
            - iex
            - Invoke-
            - msiexec
            - odbcconf
            - regsvr32
    condition: all of selection_*
related:
    -   id: 36c5146c-d127-4f85-8e21-01bf62355d5a
        type: obsolete
    -   id: 8823e85d-31d8-473e-b7f4-92da070f0fc6
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:49:54.599333+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:49:54.599333+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:49:54.599354+00:00'
