id: 4627c6ae-6899-46e2-aa0c-6ebcb1becd19
title: HackTool - Impacket Tools Execution
status: test
level: high
description: Detects the execution of different compiled Windows binaries of the impacket
    toolset (based on names or part of their names - could lead to false positives)
author: Florian Roth (Nextron Systems)
date: '2021-07-24'
modified: '2023-02-07'
tags:
    - attack.execution
    - attack.t1557.001
references:
    - https://github.com/ropnop/impacket_static_binaries/releases/tag/0.9.21-dev-binaries
falsepositives:
    - Legitimate use of the impacket tools
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|contains:
            - \goldenPac
            - \karmaSMB
            - \kintercept
            - \ntlmrelayx
            - \rpcdump
            - \samrdump
            - \secretsdump
            - \smbexec
            - \smbrelayx
            - \wmiexec
            - \wmipersist
        Image|endswith:
            - \atexec_windows.exe
            - \dcomexec_windows.exe
            - \dpapi_windows.exe
            - \findDelegation_windows.exe
            - \GetADUsers_windows.exe
            - \GetNPUsers_windows.exe
            - \getPac_windows.exe
            - \getST_windows.exe
            - \getTGT_windows.exe
            - \GetUserSPNs_windows.exe
            - \ifmap_windows.exe
            - \mimikatz_windows.exe
            - \netview_windows.exe
            - \nmapAnswerMachine_windows.exe
            - \opdump_windows.exe
            - \psexec_windows.exe
            - \rdp_check_windows.exe
            - \sambaPipe_windows.exe
            - \smbclient_windows.exe
            - \smbserver_windows.exe
            - \sniff_windows.exe
            - \sniffer_windows.exe
            - \split_windows.exe
            - \ticketer_windows.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:30.364116+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:30.364116+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:30.364122+00:00'
