id: 10227522-8429-47e6-a301-f2b2d014e7ad
title: Macos Remote System Discovery
status: test
level: informational
description: Detects the enumeration of other remote systems.
author: Alejandro Ortuno, oscd.community
date: '2020-10-22'
modified: '2021-11-27'
tags:
    - attack.discovery
    - attack.t1018
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1018/T1018.md
falsepositives:
    - Legitimate administration activities
taxonomy: sigma
logsource:
    category: process_creation
    product: macos
detection:
    selection_1:
        Image|endswith: /arp
        CommandLine|contains: -a
    selection_2:
        Image|endswith: /ping
        CommandLine|contains:
            - ' 10.'
            - ' 192.168.'
            - ' 172.16.'
            - ' 172.17.'
            - ' 172.18.'
            - ' 172.19.'
            - ' 172.20.'
            - ' 172.21.'
            - ' 172.22.'
            - ' 172.23.'
            - ' 172.24.'
            - ' 172.25.'
            - ' 172.26.'
            - ' 172.27.'
            - ' 172.28.'
            - ' 172.29.'
            - ' 172.30.'
            - ' 172.31.'
            - ' 127.'
            - ' 169.254.'
    condition: 1 of selection*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:14:25.816204+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-11-13T20:14:25.816204+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:14:25.816209+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:14:25.816210+00:00'
