id: 53d8d3e1-ca33-4012-adf3-e05a4d652e34
title: Process Memory Dump Via Dotnet-Dump
status: test
level: medium
description: 'Detects the execution of "dotnet-dump" with the "collect" flag. The
    execution could indicate potential process dumping of critical processes such
    as LSASS.

    '
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-03-14'
tags:
    - attack.defense-evasion
    - attack.t1218
references:
    - https://learn.microsoft.com/en-us/dotnet/core/diagnostics/dotnet-dump#dotnet-dump-collect
    - https://twitter.com/bohops/status/1635288066909966338
falsepositives:
    - Process dumping is the expected behavior of the tool. So false positives are
        expected in legitimate usage. The PID/Process Name of the process being dumped
        needs to be investigated
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \dotnet-dump.exe
        OriginalFileName: dotnet-dump.dll
    selection_cli:
        CommandLine|contains: collect
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:29.278714+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:29.278714+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:29.278744+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:29.278760+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:29.278763+00:00'
