id: ef64fc9c-a45e-43cc-8fd8-7d75d73b4c99
title: Wusa.EXE Executed By Parent Process Located In Suspicious Location
status: experimental
level: high
description: 'Detects execution of the "wusa.exe" (Windows Update Standalone Installer)
    utility by a parent process that is located in a suspicious location.

    Attackers could instantiate an instance of "wusa.exe" in order to bypass User
    Account Control (UAC). They can duplicate the access token from "wusa.exe" to
    gain elevated privileges.

    '
author: X__Junior (Nextron Systems)
date: '2023-11-26'
modified: '2024-08-15'
tags:
    - attack.execution
references:
    - https://www.fortinet.com/blog/threat-research/konni-campaign-distributed-via-malicious-document
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \wusa.exe
    selection_paths_1:
        ParentImage|contains:
            - :\Perflogs\
            - :\Users\Public\
            - :\Windows\Temp\
            - \Appdata\Local\Temp\
            - \Temporary Internet
    selection_paths_2:
        ParentImage|contains|all:
            - :\Users\
            - \Favorites\
            - :\Users\
            - \Favourites\
            - :\Users\
            - \Contacts\
            - :\Users\
            - \Pictures\
    filter_main_msu:
        CommandLine|contains: .msu
    condition: selection_img and 1 of selection_paths_* and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:28:23.545039+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:28:23.545039+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:28:23.545053+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:28:23.545055+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:28:23.545056+00:00'
