id: 869b9ca7-9ea2-4a5a-8325-e80e62f75445
title: Suspicious Child Process Of SQL Server
status: test
level: high
description: Detects suspicious child processes of the SQLServer process. This could
    indicate potential RCE or SQL Injection.
author: FPT.EagleEye Team, wagga
date: '2020-12-11'
modified: '2023-05-04'
tags:
    - attack.t1505.003
    - attack.t1190
    - attack.initial-access
    - attack.persistence
    - attack.privilege-escalation
references:
    - Internal Research
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''344482e4-a477-436c-aa70-7536d18a48c7''),
    type=<SigmaRelatedType.OBSOLETE: 4>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \sqlservr.exe
        Image|endswith:
            - \bash.exe
            - \bitsadmin.exe
            - \cmd.exe
            - \netstat.exe
            - \nltest.exe
            - \ping.exe
            - \powershell.exe
            - \pwsh.exe
            - \regsvr32.exe
            - \rundll32.exe
            - \sh.exe
            - \systeminfo.exe
            - \tasklist.exe
            - \wsl.exe
    filter_optional_datev:
        ParentImage|startswith: C:\Program Files\Microsoft SQL Server\
        ParentImage|endswith: DATEV_DBENGINE\MSSQL\Binn\sqlservr.exe
        Image: C:\Windows\System32\cmd.exe
        CommandLine|startswith: '"C:\Windows\system32\cmd.exe" '
    condition: selection and not 1 of filter_optional_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:25:35.832107+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:25:35.832107+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:25:35.832132+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:25:35.832135+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:25:35.832138+00:00'
