id: 378a05d8-963c-46c9-bcce-13c7657eac99
title: Potentially Suspicious Electron Application CommandLine
status: test
level: medium
description: Detects potentially suspicious CommandLine of electron apps (teams, discord,
    slack, etc.). This could be a sign of abuse to proxy execution through a signed
    binary.
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: '2023-09-05'
modified: '2023-11-09'
tags:
    - attack.execution
references:
    - https://positive.security/blog/ms-officecmd-rce
    - https://lolbas-project.github.io/lolbas/Binaries/Teams/
    - https://lolbas-project.github.io/lolbas/Binaries/Msedge/
    - https://lolbas-project.github.io/lolbas/Binaries/msedgewebview2/
    - https://medium.com/@MalFuzzer/one-electron-to-rule-them-all-dc2e9b263daf
    - https://chromium.googlesource.com/chromium/chromium/+/master/content/public/common/content_switches.cc
falsepositives:
    - Legitimate usage for debugging purposes
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''f26eb764-fd89-464b-85e2-dc4a8e6e77b8''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \chrome.exe
            - \code.exe
            - \discord.exe
            - \GitHubDesktop.exe
            - \keybase.exe
            - \msedge_proxy.exe
            - \msedge.exe
            - \msedgewebview2.exe
            - \msteams.exe
            - \slack.exe
            - \Teams.exe
        OriginalFileName:
            - chrome.exe
            - code.exe
            - discord.exe
            - GitHubDesktop.exe
            - keybase.exe
            - msedge_proxy.exe
            - msedge.exe
            - msedgewebview2.exe
            - msteams.exe
            - slack.exe
            - Teams.exe
    selection_cli:
        CommandLine|contains:
            - --browser-subprocess-path
            - --gpu-launcher
            - --renderer-cmd-prefix
            - --utility-cmd-prefix
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:28:22.301068+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:28:22.301068+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:28:22.301084+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:28:22.301086+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:28:22.301088+00:00'
