id: ec0722a3-eb5c-4a56-8ab2-bf6f20708592
title: Renamed Gpg.EXE Execution
status: test
level: high
description: Detects the execution of a renamed "gpg.exe". Often used by ransomware
    and loaders to decrypt/encrypt data.
author: Nasreddine Bencherchali (Nextron Systems), frack113
date: '2023-08-09'
tags:
    - attack.impact
    - attack.t1486
references:
    - https://securelist.com/locked-out/68960/
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        OriginalFileName: gpg.exe
    filter_main_img:
        Image|endswith:
            - \gpg.exe
            - \gpg2.exe
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:49.467590+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:49.467590+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:49.467604+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:49.467606+00:00'
