title: Indicator Removal on Host - Clear Mac System Logs
id: acf61bd8-d814-4272-81f0-a7a269aa69aa
status: test
level: medium
author: remotephone, oscd.community
description: Detects deletion of local audit logs
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.002/T1070.002.md
falsepositives:
    - Legitimate administration activities
tags:
    - attack.defense-evasion
    - attack.t1070.002
date: '2020-10-11'
modified: '2022-09-16'
logsource:
    category: process_creation
    product: macos
detection:
    selection1:
        Image|endswith:
            - /rm
            - /unlink
            - /shred
    selection_cli_1:
        CommandLine|contains: /var/log
    selection_cli_2:
        CommandLine|contains|all:
            - /Users/
            - /Library/Logs/
    condition: selection1 and 1 of selection_cli*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:34:04.707170+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-12-04T01:34:04.707170+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:34:04.707185+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:34:04.707187+00:00'
