title: UAC Bypass Using DismHost
id: 853e74f9-9392-4935-ad3b-2e8c040dae86
status: test
level: high
author: Christian Burkard (Nextron Systems)
description: Detects the pattern of UAC Bypass using DismHost DLL hijacking (UACMe
    63)
references:
    - https://github.com/hfiref0x/UACME
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
date: '2021-08-30'
modified: '2024-12-01'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|contains|all:
            - C:\Users\
            - \AppData\Local\Temp\
            - \DismHost.exe
        IntegrityLevel:
            - High
            - System
            - S-1-16-16384
            - S-1-16-12288
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:49:40.836680+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:49:40.836680+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:49:40.836696+00:00'
        -   source_field: IntegrityLevel
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:49:40.836698+00:00'
