title: UAC Bypass Tools Using ComputerDefaults
id: 3c05e90d-7eba-4324-9972-5d7f711a60a8
status: test
level: high
author: Christian Burkard (Nextron Systems)
description: Detects tools such as UACMe used to bypass UAC with computerdefaults.exe
    (UACMe 59)
references:
    - https://github.com/hfiref0x/UACME
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
date: '2021-08-31'
modified: '2024-12-01'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        IntegrityLevel:
            - High
            - System
            - S-1-16-16384
            - S-1-16-12288
        Image: C:\Windows\System32\ComputerDefaults.exe
    filter:
        ParentImage|contains:
            - :\Windows\System32
            - :\Program Files
    condition: selection and not filter
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:49:47.950958+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:49:47.950958+00:00'
    detection_fields:
        -   source_field: IntegrityLevel
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:49:47.950972+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:49:47.950974+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:49:47.950975+00:00'
