id: 08f26069-6f80-474b-8d1f-d971c6fedea0
title: User Has Been Deleted Via Userdel
status: test
level: medium
description: Detects execution of the "userdel" binary. Which is used to delete a
    user account and related files. This is sometimes abused by threat actors in order
    to cover their tracks
author: Tuan Le (NCSGroup)
date: '2022-12-26'
tags:
    - attack.impact
    - attack.t1531
references:
    - https://linuxize.com/post/how-to-delete-group-in-linux/
    - https://www.cyberciti.biz/faq/linux-remove-user-command/
    - https://www.cybrary.it/blog/0p3n/linux-commands-used-attackers/
    - https://linux.die.net/man/8/userdel
falsepositives:
    - Legitimate administrator activities
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith: /userdel
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:15:51.748023+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-13T20:15:51.748023+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:15:51.748029+00:00'
