id: 42333b2c-b425-441c-b70e-99404a17170f
title: HackTool - Sliver C2 Implant Activity Pattern
status: test
level: critical
description: Detects process activity patterns as seen being used by Sliver C2 framework
    implants
author: Nasreddine Bencherchali (Nextron Systems), Florian Roth (Nextron Systems)
date: '2022-08-25'
modified: '2023-03-05'
tags:
    - attack.execution
    - attack.t1059
references:
    - https://github.com/BishopFox/sliver/blob/79f2d48fcdfc2bee4713b78d431ea4b27f733f30/implant/sliver/shell/shell_windows.go#L36
    - https://www.microsoft.com/security/blog/2022/08/24/looking-for-the-sliver-lining-hunting-for-emerging-command-and-control-frameworks/
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains: -NoExit -Command [Console]::OutputEncoding=[Text.UTF8Encoding]::UTF8
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:35:59.821647+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:35:59.821647+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:35:59.821661+00:00'
