title: Persistence Via TypedPaths - CommandLine
id: ec88289a-7e1a-4cc3-8d18-bd1f60e4b9ba
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects modification addition to the 'TypedPaths' key in the user or
    admin registry via the commandline. Which might indicate persistence attempt
references:
    - https://twitter.com/dez_/status/1560101453150257154
    - https://forensafe.com/blogs/typedpaths.html
falsepositives:
    - Unknown
tags:
    - attack.persistence
date: '2022-08-22'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains: \Software\Microsoft\Windows\CurrentVersion\Explorer\TypedPaths
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:01.822099+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:01.822099+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:44:01.822111+00:00'
