id: ab9e3b40-0c85-4ba1-aede-455d226fd124
title: Suspicious Redirection to Local Admin Share
status: test
level: high
description: Detects a suspicious output redirection to the local admins share, this
    technique is often found in malicious scripts or hacktool stagers
author: Florian Roth (Nextron Systems)
date: '2022-01-16'
modified: '2023-12-28'
tags:
    - attack.exfiltration
    - attack.t1048
references:
    - https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
    - http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_redirect:
        CommandLine|contains: '>'
    selection_share:
        CommandLine|contains:
            - \\127.0.0.1\admin$\
            - \\localhost\admin$\
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:38.022993+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:38.022993+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:38.022996+00:00'
