title: Arbitrary File Download Via Squirrel.EXE
id: 1e75c1cc-c5d4-42aa-ac3d-91b0b68b3b4c
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems), Karneades / Markus Neis, Jonhnathan
    Ribeiro, oscd.community
description: 'Detects the usage of the "Squirrel.exe" to download arbitrary files.
    This binary is part of multiple Electron based software installations (Slack,
    Teams, Discord, etc.)

    '
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Squirrel/
    - http://www.hexacorn.com/blog/2019/03/30/sqirrel-packages-manager-as-a-lolbin-a-k-a-many-electron-apps-are-lolbins-by-default/
    - http://www.hexacorn.com/blog/2018/08/16/squirrel-as-a-lolbin/
falsepositives:
    - Expected FP with some Electron based applications such as (1Clipboard, Beaker
        Browser, Caret, Discord, GitHub Desktop, etc.)
tags:
    - attack.defense-evasion
    - attack.execution
    - attack.t1218
date: '2022-06-09'
modified: '2023-11-09'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \squirrel.exe
            - \update.exe
    selection_download_cli:
        CommandLine|contains:
            - ' --download '
            - ' --update '
            - ' --updateRollback='
    selection_download_http_keyword:
        CommandLine|contains: http
    condition: all of selection_*
related:
    -   id: 45239e6a-b035-4aaf-b339-8ad379fcb67e
        type: similar
    -   id: fa4b21c9-0057-4493-b289-2556416ae4d7
        type: obsolete
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:41:59.954138+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:41:59.954138+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:41:59.954153+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:41:59.954155+00:00'
