id: e1693bc8-7168-4eab-8718-cdcaa68a1738
title: Suspicious WMIC Execution Via Office Process
status: test
level: high
description: Office application called wmic to proxye execution through a LOLBIN process.
    This is often used to break suspicious parent-child chain (Office app spawns LOLBin).
author: Vadim Khrykov, Cyb3rEng
date: '2021-08-23'
modified: '2023-02-14'
tags:
    - attack.t1204.002
    - attack.t1047
    - attack.t1218.010
    - attack.execution
    - attack.defense-evasion
references:
    - https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
    - https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/02bcbfc2bfb8b4da601bb30de0344ae453aa1afe/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''438025f9-5856-4663-83f7-52f878a70a50''),
    type=<SigmaRelatedType.DERIVED: 2>), SigmaRelatedItem(id=UUID(''518643ba-7d9c-4fa5-9f37-baed36059f6a''),
    type=<SigmaRelatedType.OBSOLETE: 4>), SigmaRelatedItem(id=UUID(''9d1c72f5-43f0-4da5-9320-648cf2099dd0''),
    type=<SigmaRelatedType.OBSOLETE: 4>), SigmaRelatedItem(id=UUID(''c0e1c3d5-4381-4f18-8145-2583f06a1fe5''),
    type=<SigmaRelatedType.OBSOLETE: 4>), SigmaRelatedItem(id=UUID(''04f5363a-6bca-42ff-be70-0d28bf629ead''),
    type=<SigmaRelatedType.OBSOLETE: 4>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|endswith:
            - \WINWORD.EXE
            - \EXCEL.EXE
            - \POWERPNT.exe
            - \MSPUB.exe
            - \VISIO.exe
            - \MSACCESS.EXE
            - \EQNEDT32.EXE
            - \ONENOTE.EXE
            - \wordpad.exe
            - \wordview.exe
    selection_wmic_img:
        Image|endswith: \wbem\WMIC.exe
        OriginalFileName: wmic.exe
    selection_wmic_cli:
        CommandLine|contains|all:
            - process
            - create
            - call
        CommandLine|contains:
            - regsvr32
            - rundll32
            - msiexec
            - mshta
            - verclsid
            - wscript
            - cscript
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:55.510353+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:55.510353+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:55.510365+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:55.510368+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:55.510370+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:55.510372+00:00'
