title: Uncommon  Assistive Technology Applications Execution Via AtBroker.EXE
id: f24bcaea-0cd1-11eb-adc1-0242ac120002
status: test
level: medium
author: Mateusz Wydra, oscd.community
description: Detects the start of a non built-in assistive technology applications
    via "Atbroker.EXE".
references:
    - http://www.hexacorn.com/blog/2016/07/22/beyond-good-ol-run-key-part-42/
    - https://lolbas-project.github.io/lolbas/Binaries/Atbroker/
falsepositives:
    - Legitimate, non-default assistive technology applications execution
tags:
    - attack.defense-evasion
    - attack.t1218
date: '2020-10-12'
modified: '2024-03-06'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \AtBroker.exe
        OriginalFileName: AtBroker.exe
    selection_cli:
        CommandLine|contains: start
    filter_main_builtin:
        CommandLine|contains:
            - animations
            - audiodescription
            - caretbrowsing
            - caretwidth
            - colorfiltering
            - cursorindicator
            - cursorscheme
            - filterkeys
            - focusborderheight
            - focusborderwidth
            - highcontrast
            - keyboardcues
            - keyboardpref
            - livecaptions
            - magnifierpane
            - messageduration
            - minimumhitradius
            - mousekeys
            - Narrator
            - osk
            - overlappedcontent
            - showsounds
            - soundsentry
            - speechreco
            - stickykeys
            - togglekeys
            - voiceaccess
            - windowarranging
            - windowtracking
            - windowtrackingtimeout
            - windowtrackingzorder
    filter_optional_java:
        CommandLine|contains: Oracle_JavaAccessBridge
    condition: all of selection_* and not 1 of filter_main_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:18.351395+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:18.351395+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:44:18.351446+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:44:18.351451+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:44:18.351452+00:00'
