id: 15b75071-74cc-47e0-b4c6-b43744a62a2b
title: Suspicious Process Start Locations
status: test
level: medium
description: Detects suspicious process run from unusual locations
author: juju4, Jonhnathan Ribeiro, oscd.community
date: '2019-01-16'
modified: '2022-01-07'
tags:
    - attack.defense-evasion
    - attack.t1036
    - car.2013-05-002
references:
    - https://car.mitre.org/wiki/CAR-2013-05-002
falsepositives:
    - False positives depend on scripts and administrative tools used in the monitored
        environment
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|contains:
            - :\RECYCLER\
            - :\SystemVolumeInformation\
        Image|startswith:
            - C:\Windows\Tasks\
            - C:\Windows\debug\
            - C:\Windows\fonts\
            - C:\Windows\help\
            - C:\Windows\drivers\
            - C:\Windows\addins\
            - C:\Windows\cursors\
            - C:\Windows\system32\tasks\
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:33:34.904344+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:33:34.904344+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:33:34.904373+00:00'
