id: 43e26eb5-cd58-48d1-8ce9-a273f5d298d8
title: Potential Container Discovery Via Inodes Listing
status: test
level: low
description: Detects listing of the inodes of the "/" directory to determine if the
    we are running inside of a container.
author: Seth Hanford
date: '2023-08-23'
tags:
    - attack.discovery
    - attack.t1082
references:
    - https://blog.skyplabs.net/posts/container-detection/
    - https://stackoverflow.com/questions/20010199/how-to-determine-if-a-process-runs-inside-lxc-docker
falsepositives:
    - Legitimate system administrator usage of these commands
    - Some container tools or deployments may use these techniques natively to determine
        how they proceed with execution, and will need to be filtered
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith: /ls
        CommandLine|contains|all:
            - ' -*i'
            - ' -*d'
        CommandLine|endswith: ' /'
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:15:51.737523+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-13T20:15:51.737523+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:15:51.737528+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:15:51.737530+00:00'
