id: 7bdde3bf-2a42-4c39-aa31-a92b3e17afac
title: HackTool - LittleCorporal Generated Maldoc Injection
status: test
level: high
description: Detects the process injection of a LittleCorporal generated Maldoc.
author: Christian Burkard (Nextron Systems)
date: '2021-08-09'
modified: '2023-11-28'
tags:
    - attack.execution
    - attack.t1204.002
    - attack.t1055.003
references:
    - https://github.com/connormcgarr/LittleCorporal
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_access
    product: windows
detection:
    selection:
        SourceImage|endswith: \winword.exe
        CallTrace|contains|all:
            - :\Windows\Microsoft.NET\Framework64\v2.
            - UNKNOWN
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_access
            mapped_at: '2025-11-13T20:18:56.016454+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:18:56.016454+00:00'
    detection_fields:
        -   source_field: SourceImage
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-11-13T20:18:56.016477+00:00'
        -   source_field: CallTrace
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:18:56.016480+00:00'
