title: HackTool - ADCSPwn Execution
id: cd8c163e-a19b-402e-bdd5-419ff5859f12
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects command line parameters used by ADCSPwn, a tool to escalate privileges
    in an active directory network by coercing authenticate from machine accounts
    and relaying to the certificate service
references:
    - https://github.com/bats3c/ADCSPwn
falsepositives:
    - Unlikely
tags:
    - attack.credential-access
    - attack.t1557.001
date: '2021-07-31'
modified: '2023-02-04'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - ' --adcs '
            - ' --port '
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:42:37.326185+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:42:37.326185+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:42:37.326198+00:00'
