title: Potentially Suspicious WebDAV LNK Execution
id: 1412aa78-a24c-4abd-83df-767dfb2c5bbe
status: test
level: medium
author: Micah Babinski
description: Detects possible execution via LNK file accessed on a WebDAV server.
references:
    - https://www.trellix.com/en-us/about/newsroom/stories/research/beyond-file-search-a-novel-method.html
    - https://micahbabinski.medium.com/search-ms-webdav-and-chill-99c5b23ac462
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1059.001
    - attack.t1204
date: '2023-08-21'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \explorer.exe
        Image|endswith:
            - \cmd.exe
            - \cscript.exe
            - \mshta.exe
            - \powershell.exe
            - \pwsh.exe
            - \wscript.exe
        CommandLine|contains: \DavWWWRoot\
    condition: selection
related:
    -   id: f0507c0f-a3a2-40f5-acc6-7f543c334993
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:47:00.218187+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:47:00.218187+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:47:00.218214+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:47:00.218215+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:47:00.218217+00:00'
