id: 62510e69-616b-4078-b371-847da438cc03
title: Share And Session Enumeration Using Net.EXE
status: stable
level: low
description: Detects attempts to enumerate file shares, printer shares and sessions
    using "net.exe" with the "view" flag.
author: Endgame, JHasenbusch (ported for oscd.community)
date: '2018-10-30'
modified: '2023-02-21'
tags:
    - attack.discovery
    - attack.t1018
references:
    - https://eqllib.readthedocs.io/en/latest/analytics/b8a94d2f-dc75-4630-9d73-1edc6bd26fff.html
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1018/T1018.md
fields:
    - ComputerName
    - User
    - CommandLine
falsepositives:
    - Legitimate use of net.exe utility by legitimate user
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \net.exe
            - \net1.exe
        OriginalFileName:
            - net.exe
            - net1.exe
    selection_cli:
        CommandLine|contains: view
    filter:
        CommandLine|contains: \\
    condition: all of selection_* and not filter
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:16.867860+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:16.867860+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:16.867869+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:16.867871+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:16.867873+00:00'
