id: be58d2e2-06c8-4f58-b666-b99f6dc3b6cd
title: Suspicious Process Masquerading As SvcHost.EXE
status: experimental
level: high
description: 'Detects a suspicious process that is masquerading as the legitimate
    "svchost.exe" by naming its binary "svchost.exe" and executing from an uncommon
    location.

    Adversaries often disguise their malicious binaries by naming them after legitimate
    system processes like "svchost.exe" to evade detection.

    '
author: Swachchhanda Shrawan Poudel
date: '2024-08-07'
tags:
    - attack.defense-evasion
    - attack.t1036.005
references:
    - https://tria.ge/240731-jh4crsycnb/behavioral2
    - https://redcanary.com/blog/threat-detection/process-masquerading/
falsepositives:
    - Unlikely
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''01d2e2a1-5f09-44f7-9fc1-24faa7479b6d''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''e4a6b256-3e47-40fc-89d2-7a477edd6915''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \svchost.exe
    filter_main_img_location:
        Image:
            - C:\Windows\System32\svchost.exe
            - C:\Windows\SysWOW64\svchost.exe
    filter_main_ofn:
        OriginalFileName: svchost.exe
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:38.637027+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:38.637027+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:38.637032+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:38.637033+00:00'
