title: HackTool - PurpleSharp Execution
id: ff23ffbc-3378-435e-992f-0624dcf93ab4
status: test
level: critical
author: Florian Roth (Nextron Systems)
description: Detects the execution of the PurpleSharp adversary simulation tool
references:
    - https://github.com/mvelazc0/PurpleSharp
falsepositives:
    - Unlikely
tags:
    - attack.t1587
    - attack.resource-development
date: '2021-06-18'
modified: '2023-02-05'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|contains: \purplesharp
        OriginalFileName: PurpleSharp.exe
    selection_cli:
        CommandLine|contains:
            - xyz123456.exe
            - PurpleSharp
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:26.208297+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:26.208297+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:44:26.208312+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:44:26.208313+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:44:26.208315+00:00'
