id: ce7cf472-6fcc-490a-9481-3786840b5d9b
title: InfDefaultInstall.exe .inf Execution
status: test
level: medium
description: Executes SCT script using scrobj.dll from a command in entered into a
    specially prepared INF file.
author: frack113
date: '2021-07-13'
modified: '2022-10-09'
tags:
    - attack.defense-evasion
    - attack.t1218
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218/T1218.md#atomic-test-4---infdefaultinstallexe-inf-execution
    - https://lolbas-project.github.io/lolbas/Binaries/Infdefaultinstall/
fields:
    - ComputerName
    - User
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - 'InfDefaultInstall.exe '
            - '.inf'
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:28:34.412904+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:28:34.412904+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:28:34.412938+00:00'
