title: Potential Netcat Reverse Shell Execution
id: 7f734ed0-4f47-46c0-837f-6ee62505abd9
status: test
level: high
author: '@d4ns4n_, Nasreddine Bencherchali (Nextron Systems)'
description: Detects execution of netcat with the "-e" flag followed by common shells.
    This could be a sign of a potential reverse shell setup.
references:
    - https://pentestmonkey.net/cheat-sheet/shells/reverse-shell-cheat-sheet
    - https://www.revshells.com/
    - https://www.hackingtutorials.org/networking/hacking-netcat-part-2-bind-reverse-shells/
    - https://www.infosecademy.com/netcat-reverse-shells/
    - https://man7.org/linux/man-pages/man1/ncat.1.html
falsepositives:
    - Unlikely
tags:
    - attack.execution
    - attack.t1059
date: '2023-04-07'
logsource:
    category: process_creation
    product: linux
detection:
    selection_nc:
        Image|endswith:
            - /nc
            - /ncat
    selection_flags:
        CommandLine|contains:
            - ' -c '
            - ' -e '
    selection_shell:
        CommandLine|contains:
            - ' ash'
            - ' bash'
            - ' bsh'
            - ' csh'
            - ' ksh'
            - ' pdksh'
            - ' sh'
            - ' tcsh'
            - /bin/ash
            - /bin/bash
            - /bin/bsh
            - /bin/csh
            - /bin/ksh
            - /bin/pdksh
            - /bin/sh
            - /bin/tcsh
            - /bin/zsh
            - $IFSash
            - $IFSbash
            - $IFSbsh
            - $IFScsh
            - $IFSksh
            - $IFSpdksh
            - $IFSsh
            - $IFStcsh
            - $IFSzsh
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:04.370373+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:04.370373+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:36:04.370389+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:36:04.370391+00:00'
