title: Python Reverse Shell Execution Via PTY And Socket Modules
id: 32e62bc7-3de0-4bb1-90af-532978fe42c0
status: test
level: high
author: '@d4ns4n_, Nasreddine Bencherchali (Nextron Systems)'
description: 'Detects the execution of python with calls to the socket and pty module
    in order to connect and spawn a potential reverse shell.

    '
references:
    - https://www.revshells.com/
falsepositives:
    - Unknown
tags:
    - attack.execution
date: '2023-04-24'
modified: '2024-11-04'
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|contains: python
        CommandLine|contains|all:
            - ' -c '
            - import
            - pty
            - socket
            - spawn
            - .connect
    condition: selection
related:
    -   id: c4042d54-110d-45dd-a0e1-05c47822c937
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:12.319270+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:12.319270+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:36:12.319288+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:36:12.319290+00:00'
