title: Tamper Windows Defender Remove-MpPreference
id: 07e3cb2c-0608-410d-be4b-1511cb1a0448
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects attempts to remove Windows Defender configurations using the
    'MpPreference' cmdlet
references:
    - https://techcommunity.microsoft.com/t5/core-infrastructure-and-security/windows-10-controlled-folder-access-event-search/ba-p/2326088
falsepositives:
    - Legitimate PowerShell scripts
tags:
    - attack.defense-evasion
    - attack.t1562.001
date: '2022-08-05'
logsource:
    category: process_creation
    product: windows
detection:
    selection_remove:
        CommandLine|contains: Remove-MpPreference
    selection_tamper:
        CommandLine|contains:
            - '-ControlledFolderAccessProtectedFolders '
            - '-AttackSurfaceReductionRules_Ids '
            - '-AttackSurfaceReductionRules_Actions '
            - '-CheckForSignaturesBeforeRunningScan '
    condition: all of selection_*
related:
    -   id: ae2bdd58-0681-48ac-be7f-58ab4e593458
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:43:55.427028+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:43:55.427028+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:43:55.427040+00:00'
