title: Gpresult Display Group Policy Information
id: e56d3073-83ff-4021-90fe-c658e0709e72
status: test
level: medium
author: frack113
description: Detects cases in which a user uses the built-in Windows utility gpresult
    to display the Resultant Set of Policy (RSoP) information
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1615/T1615.md
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/gpresult
    - https://unit42.paloaltonetworks.com/emissary-trojan-changelog-did-operation-lotus-blossom-cause-it-to-evolve/
    - https://www.welivesecurity.com/wp-content/uploads/2020/05/ESET_Turla_ComRAT.pdf
falsepositives:
    - Unknown
tags:
    - attack.discovery
    - attack.t1615
date: '2022-05-01'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \gpresult.exe
        CommandLine|contains:
            - /z
            - /v
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:50:54.898540+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:50:54.898540+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:50:54.898566+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:50:54.898568+00:00'
