id: 57c4bf16-227f-4394-8ec7-1b745ee061c3
title: Firewall Disabled via Netsh.EXE
status: test
level: medium
description: Detects netsh commands that turns off the Windows firewall
author: Fatih Sirin
date: '2019-11-01'
modified: '2023-02-13'
tags:
    - attack.defense-evasion
    - attack.t1562.004
    - attack.s0108
references:
    - https://www.winhelponline.com/blog/enable-and-disable-windows-firewall-quickly-using-command-line/
    - https://app.any.run/tasks/210244b9-0b6b-4a2c-83a3-04bd3175d017/
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.004/T1562.004.md#atomic-test-1---disable-microsoft-defender-firewall
falsepositives:
    - Legitimate administration activity
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \netsh.exe
        OriginalFileName: netsh.exe
    selection_cli_1:
        CommandLine|contains|all:
            - firewall
            - set
            - opmode
            - disable
    selection_cli_2:
        CommandLine|contains|all:
            - advfirewall
            - set
            - state
            - 'off'
    condition: selection_img and 1 of selection_cli_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:51.934844+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:51.934844+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:51.934849+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:51.934851+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:51.934852+00:00'
