id: d87bd452-6da1-456e-8155-7dc988157b7d
title: Suspicious Usage Of ShellExec_RunDLL
status: test
level: high
description: Detects suspicious usage of the ShellExec_RunDLL function to launch other
    commands as seen in the the raspberry-robin attack
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-09-01'
modified: '2022-12-30'
tags:
    - attack.defense-evasion
references:
    - https://redcanary.com/blog/raspberry-robin/
    - https://www.microsoft.com/en-us/security/blog/2022/10/27/raspberry-robin-worm-part-of-larger-ecosystem-facilitating-pre-ransomware-activity/
    - https://github.com/SigmaHQ/sigma/issues/1009
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''36c5146c-d127-4f85-8e21-01bf62355d5a''),
    type=<SigmaRelatedType.OBSOLETE: 4>), SigmaRelatedItem(id=UUID(''8823e85d-31d8-473e-b7f4-92da070f0fc6''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_openasrundll:
        CommandLine|contains: ShellExec_RunDLL
    selection_suspcli:
        CommandLine|contains:
            - \Desktop\
            - \Temp\
            - \Users\Public\
            - comspec
            - iex
            - Invoke-
            - msiexec
            - odbcconf
            - regsvr32
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:57.098613+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:57.098613+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:57.098627+00:00'
