title: OSACompile Run-Only Execution
id: b9d9b652-d8ed-4697-89a2-a1186ee680ac
status: test
level: high
author: Sohan G (D4rkCiph3r)
description: Detects potential suspicious run-only executions compiled using OSACompile
references:
    - https://redcanary.com/blog/applescript/
    - https://ss64.com/osx/osacompile.html
fields:
    - CommandLine
falsepositives:
    - Unknown
tags:
    - attack.t1059.002
    - attack.execution
date: '2023-01-31'
logsource:
    category: process_creation
    product: macos
detection:
    selection:
        CommandLine|contains|all:
            - osacompile
            - ' -x '
            - ' -e '
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:34:40.588755+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-12-04T01:34:40.588755+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:34:40.588770+00:00'
