id: 49be8799-7b4d-4fda-ad23-cafbefdebbc5
title: Use of Wfc.exe
status: test
level: medium
description: The Workflow Command-line Compiler can be used for AWL bypass and is
    listed in Microsoft's recommended block rules.
author: Christopher Peacock @SecurePeacock, SCYTHE @scythe_io
date: '2022-06-01'
tags:
    - attack.defense-evasion
    - attack.t1127
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Wfc/
    - https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/design/applications-that-can-bypass-wdac
falsepositives:
    - Legitimate use by a software developer
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \wfc.exe
        OriginalFileName: wfc.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:30.342187+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:30.342187+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:30.342194+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:30.342196+00:00'
