title: PsExec/PAExec Escalation to LOCAL SYSTEM
id: 8834e2f7-6b4b-4f09-8906-d2276470ee23
status: test
level: high
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
description: Detects suspicious commandline flags used by PsExec and PAExec to escalate
    a command line to LOCAL_SYSTEM rights
references:
    - https://learn.microsoft.com/en-us/sysinternals/downloads/psexec
    - https://www.poweradmin.com/paexec/
    - https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html
falsepositives:
    - Admins that use PsExec or PAExec to escalate to the SYSTEM account for maintenance
        purposes (rare)
    - Users that debug Microsoft Intune issues using the commands mentioned in the
        official documentation; see https://learn.microsoft.com/en-us/mem/intune/apps/intune-management-extension
tags:
    - attack.resource-development
    - attack.t1587.001
date: '2021-11-23'
modified: '2024-03-05'
logsource:
    category: process_creation
    product: windows
detection:
    selection_sys:
        CommandLine|contains|windash:
            - ' -s cmd'
            - ' -s -i cmd'
            - ' -i -s cmd'
            - ' -s pwsh'
            - ' -s -i pwsh'
            - ' -i -s pwsh'
            - ' -s powershell'
            - ' -s -i powershell'
            - ' -i -s powershell'
    selection_other:
        CommandLine|contains:
            - psexec
            - paexec
            - accepteula
    condition: all of selection_*
related:
    -   id: 207b0396-3689-42d9-8399-4222658efc99
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:48:19.567021+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:48:19.567021+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:48:19.567040+00:00'
