title: Fsutil Behavior Set SymlinkEvaluation
id: c0b2768a-dd06-4671-8339-b16ca8d1f27f
status: test
level: medium
author: frack113
description: 'A symbolic link is a type of file that contains a reference to another
    file.

    This is probably done to make sure that the ransomware is able to follow shortcuts
    on the machine in order to find the original file to encrypt

    '
references:
    - https://www.cybereason.com/blog/cybereason-vs.-blackcat-ransomware
    - https://learn.microsoft.com/fr-fr/windows-server/administration/windows-commands/fsutil-behavior
falsepositives:
    - Legitimate use
tags:
    - attack.execution
    - attack.t1059
date: '2022-03-02'
modified: '2023-01-19'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \fsutil.exe
        OriginalFileName: fsutil.exe
    selection_cli:
        CommandLine|contains|all:
            - 'behavior '
            - 'set '
            - SymlinkEvaluation
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:49:39.636302+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:49:39.636302+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:49:39.636316+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:49:39.636318+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:49:39.636319+00:00'
