id: 264982dc-dbad-4dce-b707-1e0d3e0f73d9
title: Renamed NirCmd.EXE Execution
status: experimental
level: high
description: Detects the execution of a renamed "NirCmd.exe" binary based on the PE
    metadata fields.
author: X__Junior (Nextron Systems)
date: '2024-03-11'
tags:
    - attack.execution
    - attack.t1059
    - attack.defense-evasion
    - attack.t1202
references:
    - https://www.microsoft.com/en-us/security/blog/2024/01/17/new-ttps-observed-in-mint-sandstorm-campaign-targeting-high-profile-individuals-at-universities-and-research-orgs/
    - https://www.nirsoft.net/utils/nircmd.html
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        OriginalFileName: NirCmd.exe
    filter_main_img:
        Image|endswith:
            - \nircmd.exe
            - \nircmdc.exe
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:42.438722+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:42.438722+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:42.438731+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:42.438733+00:00'
