id: 7df1713a-1a5b-4a4b-a071-dc83b144a101
title: Esentutl Gather Credentials
status: test
level: medium
description: Conti recommendation to its affiliates to use esentutl to access NTDS
    dumped file. Trickbot also uses this utilities to get MSEdge info via its module
    pwgrab.
author: sam0x90
date: '2021-08-06'
modified: '2022-10-09'
tags:
    - attack.credential-access
    - attack.t1003
    - attack.t1003.003
references:
    - https://twitter.com/vxunderground/status/1423336151860002816
    - https://attack.mitre.org/software/S0404/
    - https://thedfirreport.com/2021/08/01/bazarcall-to-conti-ransomware-via-trickbot-and-cobalt-strike/
fields:
    - User
    - CommandLine
    - ParentCommandLine
    - CurrentDirectory
falsepositives:
    - To be determined
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - esentutl
            - ' /p'
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:31:47.856822+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:31:47.856822+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:31:47.856832+00:00'
