title: Scheduled Task Executing Payload from Registry
id: 86588b36-c6d3-465f-9cee-8f9093e07798
status: test
level: medium
author: X__Junior (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
description: Detects the creation of a schtasks that potentially executes a payload
    stored in the Windows Registry using PowerShell.
references:
    - https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.persistence
    - attack.t1053.005
    - attack.t1059.001
date: '2023-07-18'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \schtasks.exe
        OriginalFileName: schtasks.exe
    selection_cli_create:
        CommandLine|contains: /Create
    selection_cli_get:
        CommandLine|contains:
            - Get-ItemProperty
            - ' gp '
    selection_cli_hive:
        CommandLine|contains:
            - 'HKCU:'
            - 'HKLM:'
            - 'registry::'
            - HKEY_
    filter_main_encoding:
        CommandLine|contains:
            - FromBase64String
            - encodedcommand
    condition: all of selection_* and not 1 of filter_*
related:
    -   id: c4eeeeae-89f4-43a7-8b48-8d1bdfa66c78
        type: derived
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:48:51.112757+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:48:51.112757+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:48:51.112781+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:48:51.112784+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:48:51.112786+00:00'
