id: 180c7c5c-d64b-4a63-86e9-68910451bc8b
title: Potential File Download Via MS-AppInstaller Protocol Handler
status: test
level: medium
description: 'Detects usage of the "ms-appinstaller" protocol handler via command
    line to potentially download arbitrary files via AppInstaller.EXE

    The downloaded files are temporarly stored in ":\Users\%username%\AppData\Local\Packages\Microsoft.DesktopAppInstaller_8wekyb3d8bbwe\AC\INetCache\<RANDOM-8-CHAR-DIRECTORY>"

    '
author: Nasreddine Bencherchali (Nextron Systems), Swachchhanda Shrawan Poudel
date: '2023-11-09'
tags:
    - attack.defense-evasion
    - attack.execution
    - attack.t1218
references:
    - https://lolbas-project.github.io/lolbas/Binaries/AppInstaller/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''7cff77e1-9663-46a3-8260-17f2e1aa9d0a''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - ms-appinstaller://?source=
            - http
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:28:11.229906+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:28:11.229906+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:28:11.229922+00:00'
