title: Recon Command Output Piped To Findstr.EXE
id: ccb5742c-c248-4982-8c5c-5571b9275ad3
status: experimental
level: medium
author: Nasreddine Bencherchali (Nextron Systems), frack113
description: 'Detects the execution of a potential recon command where the results
    are piped to "findstr". This is meant to trigger on inline calls of "cmd.exe"
    via the "/c" or "/k" for example.

    Attackers often time use this technique to extract specific information they require
    in their reconnaissance phase.

    '
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/02cb591f75064ffe1e0df9ac3ed5972a2e491c97/atomics/T1057/T1057.md#atomic-test-6---discover-specific-process---tasklist
    - https://www.hhs.gov/sites/default/files/manage-engine-vulnerability-sector-alert-tlpclear.pdf
    - https://www.trendmicro.com/en_us/research/22/d/spring4shell-exploited-to-deploy-cryptocurrency-miners.html
falsepositives:
    - Unknown
tags:
    - attack.discovery
    - attack.t1057
date: '2023-07-06'
modified: '2024-06-27'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - ipconfig*|*find
            - net*|*find
            - netstat*|*find
            - ping*|*find
            - systeminfo*|*find
            - tasklist*|*find
            - whoami*|*find
    condition: selection
related:
    -   id: fe63010f-8823-4864-a96b-a7b4a0f7b929
        type: derived
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:47:36.386090+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:47:36.386090+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:47:36.386105+00:00'
