title: New Service Creation Using PowerShell
id: c02e96b7-c63a-4c47-bd83-4a9f74afcfb2
status: test
level: low
author: Timur Zinniatullin, Daniil Yugoslavskiy, oscd.community
description: Detects the creation of a new service using powershell.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1543.003/T1543.003.md
falsepositives:
    - Legitimate administrator or user creates a service for legitimate reasons.
    - Software installation
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1543.003
date: '2023-02-20'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - New-Service
            - -BinaryPathName
    condition: selection
related:
    -   id: 85ff530b-261d-48c6-a441-facaa2e81e48
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:50:09.359410+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:50:09.359410+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:50:09.359425+00:00'
