title: PowerShell SAM Copy
id: 1af57a4b-460a-4738-9034-db68b880c665
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects suspicious PowerShell scripts accessing SAM hives
references:
    - https://twitter.com/splinter_code/status/1420546784250769408
falsepositives:
    - Some rare backup scenarios
    - PowerShell scripts fixing HiveNightmare / SeriousSAM ACLs
tags:
    - attack.credential-access
    - attack.t1003.002
date: '2021-07-29'
modified: '2023-01-06'
logsource:
    category: process_creation
    product: windows
detection:
    selection_1:
        CommandLine|contains|all:
            - \HarddiskVolumeShadowCopy
            - System32\config\sam
    selection_2:
        CommandLine|contains:
            - Copy-Item
            - cp $_.
            - cpi $_.
            - copy $_.
            - .File]::Copy(
    condition: all of selection*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:48:10.312991+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:48:10.312991+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:48:10.313007+00:00'
