title: Script Interpreter Execution From Suspicious Folder
id: 1228c958-e64e-4e71-92ad-7d429f4138ba
status: test
level: high
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
description: Detects a suspicious script execution in temporary folders or folders
    accessible by environment variables
references:
    - https://www.virustotal.com/gui/file/91ba814a86ddedc7a9d546e26f912c541205b47a853d227756ab1334ade92c3f
    - https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/shuckworm-russia-ukraine-military
    - https://learn.microsoft.com/en-us/windows/win32/shell/csidl
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1059
date: '2022-02-08'
modified: '2023-06-16'
logsource:
    category: process_creation
    product: windows
detection:
    selection_proc_image:
        Image|endswith:
            - \cscript.exe
            - \mshta.exe
            - \wscript.exe
    selection_proc_flags:
        CommandLine|contains:
            - ' -ep bypass '
            - ' -ExecutionPolicy bypass '
            - ' -w hidden '
            - '/e:javascript '
            - '/e:Jscript '
            - '/e:vbscript '
    selection_proc_original:
        OriginalFileName:
            - cscript.exe
            - mshta.exe
            - wscript.exe
    selection_folders_1:
        CommandLine|contains:
            - :\Perflogs\
            - :\Users\Public\
            - \AppData\Local\Temp
            - \AppData\Roaming\Temp
            - \Temporary Internet
            - \Windows\Temp
    selection_folders_2:
        CommandLine|contains|all:
            - :\Users\
            - \Favorites\
            - :\Users\
            - \Favourites\
            - :\Users\
            - \Contacts\
    condition: 1 of selection_proc_* and 1 of selection_folders_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:05.644161+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:05.644161+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:44:05.644243+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:44:05.644263+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:44:05.644268+00:00'
