title: HackTool - CrackMapExec Process Patterns
id: f26307d8-14cd-47e3-a26b-4b4769f24af6
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects suspicious process patterns found in logs when CrackMapExec is
    used
references:
    - https://mpgn.gitbook.io/crackmapexec/smb-protocol/obtaining-credentials/dump-lsass
falsepositives:
    - Unknown
tags:
    - attack.credential-access
    - attack.t1003.001
date: '2022-03-12'
modified: '2023-02-13'
logsource:
    category: process_creation
    product: windows
detection:
    selection_lsass_dump1:
        CommandLine|contains|all:
            - 'tasklist /fi '
            - Imagename eq lsass.exe
        CommandLine|contains:
            - 'cmd.exe /c '
            - 'cmd.exe /r '
            - 'cmd.exe /k '
            - 'cmd /c '
            - 'cmd /r '
            - 'cmd /k '
        User|contains:
            - AUTHORI
            - AUTORI
    selection_lsass_dump2:
        CommandLine|contains|all:
            - do rundll32.exe C:\windows\System32\comsvcs.dll, MiniDump
            - \Windows\Temp\
            - ' full'
            - '%%B'
    selection_procdump:
        CommandLine|contains|all:
            - tasklist /v /fo csv
            - findstr /i "lsass"
    condition: 1 of selection*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:47:38.844588+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:47:38.844588+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:47:38.844621+00:00'
        -   source_field: User
            target_table: process_activity
            target_field: actor.user.name
            mapped_at: '2025-12-04T01:47:38.844624+00:00'
