id: aef9d1f1-7396-4e92-a927-4567c7a495c1
title: Suspicious Git Clone
status: test
level: medium
description: Detects execution of "git" in order to clone a remote repository that
    contain suspicious keywords which might be suspicious
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-01-03'
modified: '2023-01-10'
tags:
    - attack.reconnaissance
    - attack.t1593.003
references:
    - https://gist.githubusercontent.com/MichaelKoczwara/12faba9c061c12b5814b711166de8c2f/raw/e2068486692897b620c25fde1ea258c8218fe3d3/history.txt
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \git.exe
            - \git-remote-https.exe
        OriginalFileName: git.exe
    selection_cli:
        CommandLine|contains:
            - ' clone '
            - 'git-remote-https '
    selection_keyword:
        CommandLine|contains:
            - exploit
            - Vulns
            - vulnerability
            - RemoteCodeExecution
            - Invoke-
            - CVE-
            - poc-
            - ProofOfConcept
            - proxyshell
            - log4shell
            - eternalblue
            - eternal-blue
            - MS17-
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:59.102406+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:59.102406+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:59.102411+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:59.102412+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:59.102413+00:00'
