id: 5f60740a-f57b-4e76-82a1-15b6ff2cb134
title: Registry Modification Via Regini.EXE
status: test
level: low
description: Detects the execution of regini.exe which can be used to modify registry
    keys, the changes are imported from one or more text files.
author: Eli Salem, Sander Wiebing, oscd.community
date: '2020-10-08'
modified: '2023-02-08'
tags:
    - attack.t1112
    - attack.defense-evasion
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Regini/
    - https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/regini
fields:
    - ParentImage
    - CommandLine
falsepositives:
    - Legitimate modification of keys
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''77946e79-97f1-45a2-84b4-f37b5c0d8682''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \regini.exe
        OriginalFileName: REGINI.EXE
    filter:
        CommandLine|re: :[^ \\]
    condition: selection and not filter
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:24.097239+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:24.097239+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:24.097251+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:24.097253+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:24.097255+00:00'
