title: File Download From IP Based URL Via CertOC.EXE
id: b86f6dea-0b2f-41f5-bdcc-a057bd19cd6a
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects when a user downloads a file from an IP based URL using CertOC.exe
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Certoc/
falsepositives:
    - Unknown
tags:
    - attack.command-and-control
    - attack.execution
    - attack.t1105
date: '2023-10-18'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \certoc.exe
        OriginalFileName: CertOC.exe
    selection_ip:
        CommandLine|re: ://[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}
    selection_cli:
        CommandLine|contains: -GetCACAPS
    condition: all of selection*
related:
    -   id: 70ad0861-d1fe-491c-a45f-fa48148a300d
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:45:47.982334+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:45:47.982334+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:45:47.982351+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:45:47.982353+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:45:47.982354+00:00'
