id: 79ce34ca-af29-4d0e-b832-fc1b377020db
title: Whoami.EXE Execution From Privileged Process
status: test
level: high
description: Detects the execution of "whoami.exe" by privileged accounts that are
    often abused by threat actors
author: Florian Roth (Nextron Systems), Teymur Kheirkhabarov
date: '2022-01-28'
modified: '2023-12-04'
tags:
    - attack.privilege-escalation
    - attack.discovery
    - attack.t1033
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
    - https://web.archive.org/web/20221019044836/https://nsudo.m2team.org/en-us/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''80167ada-7a12-41ed-b8e9-aa47195c66a1''),
    type=<SigmaRelatedType.OBSOLETE: 4>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        OriginalFileName: whoami.exe
        Image|endswith: \whoami.exe
    selection_user:
        User|contains:
            - AUTHORI
            - AUTORI
            - TrustedInstaller
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:04.996753+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:04.996753+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:04.996779+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:04.996782+00:00'
        -   source_field: User
            target_table: process_activity
            target_field: actor.user.name
            mapped_at: '2025-11-13T20:20:04.996784+00:00'
