title: Wab Execution From Non Default Location
id: 395907ee-96e5-4666-af2e-2ca91688e151
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects execution of wab.exe (Windows Contacts) and Wabmig.exe (Microsoft
    Address Book Import Tool) from non default locations as seen with bumblebee activity
references:
    - https://thedfirreport.com/2022/08/08/bumblebee-roasts-its-way-to-domain-admin/
    - https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/bumblebee-loader-cybercrime
    - https://thedfirreport.com/2022/09/26/bumblebee-round-two/
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.execution
date: '2022-08-12'
modified: '2022-09-27'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - \wab.exe
            - \wabmig.exe
    filter:
        Image|startswith:
            - C:\Windows\WinSxS\
            - C:\Program Files\Windows Mail\
            - C:\Program Files (x86)\Windows Mail\
    condition: selection and not filter
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:45:19.822834+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:45:19.822834+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:45:19.822867+00:00'
