id: c8a180d6-47a3-4345-a609-53f9c3d834fc
title: Suspicious Reconnaissance Activity Using Get-LocalGroupMember Cmdlet
status: test
level: medium
description: Detects suspicious reconnaissance command line activity on Windows systems
    using the PowerShell Get-LocalGroupMember Cmdlet
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-10-10'
tags:
    - attack.discovery
    - attack.t1087.001
references:
    - https://www.absolomb.com/2018-01-26-Windows-Privilege-Escalation-Guide/
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Administrative activity
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''cef24b90-dddc-4ae1-a09a-8764872f69fc''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_cmdlet:
        CommandLine|contains: 'Get-LocalGroupMember '
    selection_group:
        CommandLine|contains:
            - domain admins
            - ' administrator'
            - ' administrateur'
            - enterprise admins
            - Exchange Trusted Subsystem
            - Remote Desktop Users
            - Utilisateurs du Bureau à distance
            - Usuarios de escritorio remoto
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:28:25.504847+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:28:25.504847+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:28:25.504859+00:00'
