id: cc4e02ba-9c06-48e2-b09e-2500cace9ae0
title: Tasks Folder Evasion
status: test
level: high
description: 'The Tasks folder in system32 and syswow64 are globally writable paths.

    Adversaries can take advantage of this and load or influence any script hosts
    or ANY .NET Application

    in Tasks to load and execute a custom assembly into cscript, wscript, regsvr32,
    mshta, eventvwr

    '
author: Sreeman
date: '2020-01-13'
modified: '2022-12-25'
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.execution
    - attack.t1574.002
references:
    - https://twitter.com/subTee/status/1216465628946563073
    - https://gist.github.com/am0nsec/8378da08f848424e4ab0cc5b317fdd26
fields:
    - CommandLine
    - ParentProcess
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        CommandLine|contains:
            - 'echo '
            - 'copy '
            - 'type '
            - file createnew
    selection2:
        CommandLine|contains:
            - ' C:\Windows\System32\Tasks\'
            - ' C:\Windows\SysWow64\Tasks\'
    condition: all of selection*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:26:24.780862+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:26:24.780862+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:26:24.780876+00:00'
