id: 46123129-1024-423e-9fae-43af4a0fa9a5
title: File Download Via Windows Defender MpCmpRun.EXE
status: test
level: high
description: Detects the use of Windows Defender MpCmdRun.EXE to download files
author: Matthew Matchen
date: '2020-09-04'
modified: '2023-11-09'
tags:
    - attack.defense-evasion
    - attack.t1218
    - attack.command-and-control
    - attack.t1105
references:
    - https://web.archive.org/web/20200903194959/https://twitter.com/djmtshepana/status/1301608169496612866
    - https://lolbas-project.github.io/lolbas/Binaries/MpCmdRun/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        OriginalFileName: MpCmdRun.exe
        Image|endswith: \MpCmdRun.exe
        CommandLine|contains: MpCmdRun.exe
        Description: Microsoft Malware Protection Command Line Utility
    selection_cli:
        CommandLine|contains|all:
            - DownloadFile
            - url
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:27.342693+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:27.342693+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:27.342704+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:27.342706+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:27.342709+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: message
            mapped_at: '2025-11-13T20:20:27.342711+00:00'
