title: Use of FSharp Interpreters
id: b96b2031-7c17-4473-afe7-a30ce714db29
status: test
level: medium
author: Christopher Peacock @SecurePeacock, SCYTHE @scythe_io
description: 'Detects the execution of FSharp Interpreters "FsiAnyCpu.exe" and "FSi.exe"

    Both can be used for AWL bypass and to execute F# code via scripts or inline.

    '
references:
    - https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/design/applications-that-can-bypass-wdac
    - https://bohops.com/2020/11/02/exploring-the-wdac-microsoft-recommended-block-rules-part-ii-wfc-fsi/
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/FsiAnyCpu/
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Fsi/
falsepositives:
    - Legitimate use by a software developer.
tags:
    - attack.execution
    - attack.t1059
date: '2022-06-02'
modified: '2024-04-23'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - \fsi.exe
            - \fsianycpu.exe
        OriginalFileName:
            - fsi.exe
            - fsianycpu.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:46:12.366937+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:46:12.366937+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:46:12.366970+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:46:12.366975+00:00'
