title: UAC Bypass WSReset
id: 89a9a0e0-f61a-42e5-8957-b1479565a658
status: test
level: high
author: Christian Burkard (Nextron Systems)
description: Detects the pattern of UAC Bypass via WSReset usable by default sysmon-config
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Wsreset/
    - https://github.com/hfiref0x/UACME
    - https://medium.com/falconforce/falconfriday-detecting-uac-bypasses-0xff16-86c2a9107abf
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
date: '2021-08-23'
modified: '2024-12-01'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \wsreset.exe
        IntegrityLevel:
            - High
            - System
            - S-1-16-16384
            - S-1-16-12288
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:48:30.551964+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:48:30.551964+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:48:30.551982+00:00'
        -   source_field: IntegrityLevel
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:48:30.551984+00:00'
