id: 0d5675be-bc88-4172-86d3-1e96a4476536
title: Potential Tampering With RDP Related Registry Keys Via Reg.EXE
status: test
level: high
description: Detects the execution of "reg.exe" for enabling/disabling the RDP service
    on the host by tampering with the 'CurrentControlSet\Control\Terminal Server'
    values
author: pH-T (Nextron Systems), @Kostastsale, @TheDFIRReport
date: '2022-02-12'
modified: '2023-02-05'
tags:
    - attack.defense-evasion
    - attack.lateral-movement
    - attack.t1021.001
    - attack.t1112
references:
    - https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_main_img:
        Image|endswith: \reg.exe
        OriginalFileName: reg.exe
    selection_main_cli:
        CommandLine|contains|all:
            - ' add '
            - \CurrentControlSet\Control\Terminal Server
            - REG_DWORD
            - ' /f'
    selection_values_1:
        CommandLine|contains|all:
            - Licensing Core
            - EnableConcurrentSessions
    selection_values_2:
        CommandLine|contains:
            - WinStations\RDP-Tcp
            - MaxInstanceCount
            - fEnableWinStation
            - TSUserEnabled
            - TSEnabled
            - TSAppCompat
            - IdleWinStationPoolCount
            - TSAdvertise
            - AllowTSConnections
            - fSingleSessionPerUser
            - fDenyTSConnections
    condition: all of selection_main_* and 1 of selection_values_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:46.321514+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:46.321514+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:46.321530+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:46.321534+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:46.321536+00:00'
