id: f6ecd1cf-19b8-4488-97f6-00f0924991a3
title: PUA - Nmap/Zenmap Execution
status: test
level: medium
description: Detects usage of namp/zenmap. Adversaries may attempt to get a listing
    of services running on remote hosts, including those that may be vulnerable to
    remote software exploitation
author: frack113
date: '2021-12-10'
modified: '2023-12-11'
tags:
    - attack.discovery
    - attack.t1046
references:
    - https://nmap.org/
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1046/T1046.md#atomic-test-3---port-scan-nmap-for-windows
falsepositives:
    - Legitimate administrator activity
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - \nmap.exe
            - \zennmap.exe
        OriginalFileName:
            - nmap.exe
            - zennmap.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:27:49.506965+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:27:49.506965+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:27:49.506995+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:27:49.506999+00:00'
