title: Renamed Remote Utilities RAT (RURAT) Execution
id: 9ef27c24-4903-4192-881a-3adde7ff92a5
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects execution of renamed Remote Utilities (RURAT) via Product PE
    header field
references:
    - https://redcanary.com/blog/misbehaving-rats/
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.collection
    - attack.command-and-control
    - attack.discovery
    - attack.s0592
date: '2022-09-19'
modified: '2023-02-03'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Product: Remote Utilities
    filter:
        Image|endswith:
            - \rutserv.exe
            - \rfusclient.exe
    condition: selection and not filter
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:04.787253+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:04.787253+00:00'
    detection_fields:
        -   source_field: Product
            target_table: process_activity
            target_field: metadata.product.name
            mapped_at: '2025-12-04T01:44:04.787288+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:44:04.787292+00:00'
