id: 2afafd61-6aae-4df4-baed-139fa1f4c345
title: Invocation of Active Directory Diagnostic Tool (ntdsutil.exe)
status: test
level: medium
description: Detects execution of ntdsutil.exe, which can be used for various attacks
    against the NTDS database (NTDS.DIT)
author: Thomas Patzke
date: '2019-01-16'
modified: '2022-03-11'
tags:
    - attack.credential-access
    - attack.t1003.003
references:
    - https://jpcertcc.github.io/ToolAnalysisResultSheet/details/ntdsutil.htm
falsepositives:
    - NTDS maintenance
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \ntdsutil.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:55.524868+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:55.524868+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:55.524880+00:00'
