id: 3b5b0213-0460-4e3f-8937-3abf98ff7dcc
title: Suspicious Workstation Locking via Rundll32
status: test
level: medium
description: Detects a suspicious call to the user32.dll function that locks the user
    workstation
author: frack113
date: '2022-06-04'
modified: '2023-02-09'
tags:
    - attack.defense-evasion
references:
    - https://app.any.run/tasks/2aef9c63-f944-4763-b3ef-81eee209d128/
fields:
    - Image
    - ParentImage
falsepositives:
    - Scripts or links on the user desktop used to lock the workstation instead of
        Windows+L or the menu option
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_call_img:
        Image|endswith: \rundll32.exe
        OriginalFileName: RUNDLL32.EXE
    selection_call_parent:
        ParentImage|endswith: \cmd.exe
    selection_call_cli:
        CommandLine|contains: user32.dll,
    selection_function:
        CommandLine|contains: LockWorkStation
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:31:12.729523+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:31:12.729523+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:31:12.729540+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:31:12.729543+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:31:12.729545+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:31:12.729547+00:00'
