id: 9c14c9fa-1a63-4a64-8e57-d19280559490
title: Invoke-Obfuscation Via Stdin
status: test
level: high
description: Detects Obfuscated Powershell via Stdin in Scripts
author: Nikita Nazarov, oscd.community
date: '2020-10-12'
modified: '2024-04-16'
tags:
    - attack.defense-evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
references:
    - https://github.com/SigmaHQ/sigma/issues/1009
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|re: (?i)(set).*&&\s?set.*(environment|invoke|\$\{?input).*&&.*"
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:26:25.190090+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:26:25.190090+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:26:25.190150+00:00'
