title: Renamed BOINC Client Execution
id: 30d07da2-83ab-45d8-ae75-ec7c0edcaffc
status: experimental
level: medium
author: Matt Anderson (Huntress)
description: Detects the execution of a renamed BOINC binary.
references:
    - https://boinc.berkeley.edu/
    - https://www.virustotal.com/gui/file/91e405e8a527023fb8696624e70498ae83660fe6757cef4871ce9bcc659264d3/details
    - https://www.huntress.com/blog/fake-browser-updates-lead-to-boinc-volunteer-computing-software
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1553
date: '2024-07-23'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        OriginalFileName: BOINC.exe
    filter_main_legit_name:
        Image|endswith: \BOINC.exe
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:45:05.900337+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:45:05.900337+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:45:05.900353+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:45:05.900355+00:00'
