title: Use Short Name Path in Command Line
id: 349d891d-fef0-4fe4-bc53-eee623a15969
status: test
level: medium
author: frack113, Nasreddine Bencherchali
description: Detect use of the Windows 8.3 short name. Which could be used as a method
    to avoid command-line detection
references:
    - https://www.acunetix.com/blog/articles/windows-short-8-3-filenames-web-security-problem/
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-2000-server/cc959352(v=technet.10)
    - https://twitter.com/frack113/status/1555830623633375232
falsepositives:
    - Applications could use this notation occasionally which might generate some
        false positives. In that case investigate the parent and child process.
tags:
    - attack.defense-evasion
    - attack.t1564.004
date: '2022-08-07'
modified: '2022-10-26'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - ~1\
            - ~2\
    filter:
        ParentImage:
            - C:\Windows\System32\Dism.exe
            - C:\Windows\System32\cleanmgr.exe
            - C:\Program Files\GPSoftware\Directory Opus\dopus.exe
        ParentImage|endswith:
            - \WebEx\WebexHost.exe
            - \thor\thor64.exe
            - \veam.backup.shell.exe
            - \winget.exe
            - \Everything\Everything.exe
        ParentImage|contains: \AppData\Local\Temp\WinGet\
        CommandLine|contains:
            - \appdata\local\webex\webex64\meetings\wbxreport.exe
            - C:\Program Files\Git\post-install.bat
            - C:\Program Files\Git\cmd\scalar.exe
    condition: selection and not filter
related:
    -   id: a96970af-f126-420d-90e1-d37bf25e50e1
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:06.102154+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:06.102154+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:44:06.102192+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:44:06.102196+00:00'
