id: 21ff4ca9-f13a-41ad-b828-0077b2af2e40
title: Deletion of Volume Shadow Copies via WMI with PowerShell
status: test
level: high
description: Detects deletion of Windows Volume Shadow Copies with PowerShell code
    and Get-WMIObject. This technique is used by numerous ransomware families such
    as Sodinokibi/REvil
author: Tim Rauch, Elastic (idea)
date: '2022-09-20'
modified: '2022-12-30'
tags:
    - attack.impact
    - attack.t1490
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md#atomic-test-5---windows---delete-volume-shadow-copies-via-wmi-with-powershell
    - https://www.elastic.co/guide/en/security/current/volume-shadow-copy-deletion-via-powershell.html
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''e17121b4-ef2a-4418-8a59-12fb1631fa9e''),
    type=<SigmaRelatedType.DERIVED: 2>), SigmaRelatedItem(id=UUID(''c1337eb8-921a-4b59-855b-4ba188ddcc42''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_get:
        CommandLine|contains:
            - Get-WmiObject
            - gwmi
            - Get-CimInstance
            - gcim
    selection_shadowcopy:
        CommandLine|contains: Win32_ShadowCopy
    selection_delete:
        CommandLine|contains:
            - .Delete()
            - Remove-WmiObject
            - rwmi
            - Remove-CimInstance
            - rcim
    condition: all of selection*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:38.099407+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:38.099407+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:38.099411+00:00'
