title: UAC Bypass Using Windows Media Player - Process
id: 0058b9e5-bcd7-40d4-9205-95ca5a16d7b2
status: test
level: high
author: Christian Burkard (Nextron Systems)
description: Detects the pattern of UAC Bypass using Windows Media Player osksupport.dll
    (UACMe 32)
references:
    - https://github.com/hfiref0x/UACME
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
date: '2021-08-23'
modified: '2024-12-01'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img_1:
        Image: C:\Program Files\Windows Media Player\osk.exe
    selection_img_2:
        Image: C:\Windows\System32\cmd.exe
        ParentCommandLine: '"C:\Windows\system32\mmc.exe" "C:\Windows\system32\eventvwr.msc"
            /s'
    selection_integrity:
        IntegrityLevel:
            - High
            - System
            - S-1-16-16384
            - S-1-16-12288
    condition: 1 of selection_img_* and selection_integrity
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:49:25.866827+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:49:25.866827+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:49:25.866856+00:00'
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-12-04T01:49:25.866859+00:00'
        -   source_field: IntegrityLevel
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:49:25.866861+00:00'
