title: Uncommon Link.EXE Parent Process
id: 6e968eb1-5f05-4dac-94e9-fd0c5cb49fd6
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: 'Detects an uncommon parent process of "LINK.EXE".

    Link.EXE in Microsoft incremental linker. Its a utility usually bundled with Visual
    Studio installation.

    Multiple utilities often found in the same folder (editbin.exe, dumpbin.exe, lib.exe,
    etc) have a hardcode call to the "LINK.EXE" binary without checking its validity.

    This would allow an attacker to sideload any binary with the name "link.exe" if
    one of the aforementioned tools get executed from a different location.

    By filtering the known locations of such utilities we can spot uncommon parent
    process of LINK.EXE that might be suspicious or malicious.

    '
references:
    - https://twitter.com/0gtweet/status/1560732860935729152
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1218
date: '2022-08-22'
modified: '2024-06-27'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \link.exe
        CommandLine|contains: LINK /
    filter_main_visual_studio:
        ParentImage|startswith:
            - C:\Program Files\Microsoft Visual Studio\
            - C:\Program Files (x86)\Microsoft Visual Studio\
        ParentImage|contains:
            - \VC\bin\
            - \VC\Tools\
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:41:25.358563+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:41:25.358563+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:41:25.358579+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:41:25.358581+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:41:25.358583+00:00'
