id: 00d49ed5-4491-4271-a8db-650a4ef6f8c1
title: Suspicious Download from Office Domain
status: test
level: high
description: Detects suspicious ways to download files from Microsoft domains that
    are used to store attachments in Emails or OneNote documents
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: '2021-12-27'
modified: '2022-08-02'
tags:
    - attack.command-and-control
    - attack.t1105
    - attack.t1608
references:
    - https://twitter.com/an0n_r0/status/1474698356635193346?s=12
    - https://twitter.com/mrd0x/status/1475085452784844803?s=12
falsepositives:
    - Scripts or tools that download attachments from these domains (OneNote, Outlook
        365)
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_download:
        Image|endswith:
            - \curl.exe
            - \wget.exe
        CommandLine|contains:
            - Invoke-WebRequest
            - 'iwr '
            - 'curl '
            - 'wget '
            - Start-BitsTransfer
            - .DownloadFile(
            - .DownloadString(
    selection_domains:
        CommandLine|contains:
            - https://attachment.outlook.live.net/owa/
            - https://onenoteonlinesync.onenote.com/onenoteonlinesync/
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:37.992183+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:37.992183+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:37.992190+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:37.992192+00:00'
