title: Renamed Gpg.EXE Execution
id: ec0722a3-eb5c-4a56-8ab2-bf6f20708592
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems), frack113
description: Detects the execution of a renamed "gpg.exe". Often used by ransomware
    and loaders to decrypt/encrypt data.
references:
    - https://securelist.com/locked-out/68960/
tags:
    - attack.impact
    - attack.t1486
date: '2023-08-09'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        OriginalFileName: gpg.exe
    filter_main_img:
        Image|endswith:
            - \gpg.exe
            - \gpg2.exe
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:48:53.380495+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:48:53.380495+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:48:53.380510+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:48:53.380512+00:00'
