title: Potential Provlaunch.EXE Binary Proxy Execution Abuse
id: 7f5d1c9a-3e83-48df-95a7-2b98aae6c13c
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems), Swachchhanda Shrawan Poudel
description: Detects child processes of "provlaunch.exe" which might indicate potential
    abuse to proxy execution.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Provlaunch/
    - https://twitter.com/0gtweet/status/1674399582162153472
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1218
date: '2023-08-08'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \provlaunch.exe
    filter_main_covered_children:
        Image|endswith:
            - \calc.exe
            - \cmd.exe
            - \cscript.exe
            - \mshta.exe
            - \notepad.exe
            - \powershell.exe
            - \pwsh.exe
            - \regsvr32.exe
            - \rundll32.exe
            - \wscript.exe
        Image|contains:
            - :\PerfLogs\
            - :\Temp\
            - :\Users\Public\
            - \AppData\Temp\
            - \Windows\System32\Tasks\
            - \Windows\Tasks\
            - \Windows\Temp\
    condition: selection and not 1 of filter_main_*
related:
    -   id: f9999590-1f94-4a34-a91e-951e47bedefd
        type: similar
    -   id: 2a4b3e61-9d22-4e4a-b60f-6e8f0cde6f25
        type: similar
    -   id: 7021255e-5db3-4946-a8b9-0ba7a4644a69
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:50:59.060055+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:50:59.060055+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:50:59.060075+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:50:59.060077+00:00'
