id: c4042d54-110d-45dd-a0e1-05c47822c937
title: Python Spawning Pretty TTY Via PTY Module
status: test
level: medium
description: 'Detects a python process calling to the PTY module in order to spawn
    a pretty tty which could be indicative of potential reverse shell activity.

    '
author: Nextron Systems
date: '2022-06-03'
modified: '2024-11-04'
tags:
    - attack.execution
    - attack.t1059
references:
    - https://www.volexity.com/blog/2022/06/02/zero-day-exploitation-of-atlassian-confluence/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''32e62bc7-3de0-4bb1-90af-532978fe42c0''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection_img:
        Image|endswith:
            - /python
            - /python2
            - /python3
        Image|contains:
            - /python2.
            - /python3.
    selection_cli_import:
        CommandLine|contains:
            - import pty
            - 'from pty '
    selection_cli_spawn:
        CommandLine|contains: spawn
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:15:51.715530+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-13T20:15:51.715530+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:15:51.715538+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:15:51.715539+00:00'
