id: 4a6713f6-3331-11ed-a261-0242ac120002
title: Taskkill Symantec Endpoint Protection
status: test
level: high
description: 'Detects one of the possible scenarios for disabling Symantec Endpoint
    Protection.

    Symantec Endpoint Protection antivirus software services incorrectly implement
    the protected service mechanism.

    As a result, the NT AUTHORITY/SYSTEM user can execute the taskkill /im command
    several times ccSvcHst.exe /f, thereby killing the process belonging to the service,
    and thus shutting down the service.

    '
author: Ilya Krestinichev, Florian Roth (Nextron Systems)
date: '2022-09-13'
tags:
    - attack.defense-evasion
    - attack.t1562.001
references:
    - https://www.exploit-db.com/exploits/37525
    - https://community.spiceworks.com/topic/2195015-batch-script-to-uninstall-symantec-endpoint-protection
    - https://community.broadcom.com/symantecenterprise/communities/community-home/digestviewer/viewthread?MessageKey=6ce94b67-74e1-4333-b16f-000b7fd874f0&CommunityKey=1ecf5f55-9545-44d6-b0f4-4e4a7f5f5e68&tab=digestviewer
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - taskkill
            - ' /F '
            - ' /IM '
            - ccSvcHst.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 2
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:26:28.371194+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:26:28.371194+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:26:28.371219+00:00'
