id: 1012f107-b8f1-4271-af30-5aed2de89b39
title: Terminal Service Process Spawn
status: test
level: high
description: Detects a process spawned by the terminal service server process (this
    could be an indicator for an exploitation of CVE-2019-0708)
author: Florian Roth (Nextron Systems)
date: '2019-05-22'
modified: '2023-01-25'
tags:
    - attack.initial-access
    - attack.t1190
    - attack.lateral-movement
    - attack.t1210
    - car.2013-07-002
references:
    - https://securingtomorrow.mcafee.com/other-blogs/mcafee-labs/rdp-stands-for-really-do-patch-understanding-the-wormable-rdp-vulnerability-cve-2019-0708/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentCommandLine|contains|all:
            - \svchost.exe
            - termsvcs
    filter_img:
        Image|endswith:
            - \rdpclip.exe
            - :\Windows\System32\csrss.exe
            - :\Windows\System32\wininit.exe
            - :\Windows\System32\winlogon.exe
    filter_null:
        Image: null
    condition: selection and not 1 of filter_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:38.065242+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:38.065242+00:00'
    detection_fields:
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-11-13T20:20:38.065250+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:38.065251+00:00'
