id: 782d6f3e-4c5d-4b8c-92a3-1d05fed72e63
title: RDP Port Forwarding Rule Added Via Netsh.EXE
status: test
level: high
description: Detects the execution of netsh to configure a port forwarding of port
    3389 (RDP) rule
author: Florian Roth (Nextron Systems), oscd.community
date: '2019-01-29'
modified: '2023-02-13'
tags:
    - attack.lateral-movement
    - attack.defense-evasion
    - attack.command-and-control
    - attack.t1090
references:
    - https://www.fireeye.com/blog/threat-research/2019/01/bypassing-network-restrictions-through-rdp-tunneling.html
falsepositives:
    - Legitimate administration activity
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \netsh.exe
        OriginalFileName: netsh.exe
    selection_cli:
        CommandLine|contains|all:
            - ' i'
            - ' p'
            - =3389
            - ' c'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:44.272398+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:44.272398+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:44.272427+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:44.272430+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:44.272431+00:00'
