title: Suspicious Reconnaissance Activity Using Get-LocalGroupMember Cmdlet
id: c8a180d6-47a3-4345-a609-53f9c3d834fc
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects suspicious reconnaissance command line activity on Windows systems
    using the PowerShell Get-LocalGroupMember Cmdlet
references:
    - https://www.absolomb.com/2018-01-26-Windows-Privilege-Escalation-Guide/
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Administrative activity
tags:
    - attack.discovery
    - attack.t1087.001
date: '2022-10-10'
logsource:
    category: process_creation
    product: windows
detection:
    selection_cmdlet:
        CommandLine|contains: 'Get-LocalGroupMember '
    selection_group:
        CommandLine|contains:
            - domain admins
            - ' administrator'
            - ' administrateur'
            - enterprise admins
            - Exchange Trusted Subsystem
            - Remote Desktop Users
            - Utilisateurs du Bureau à distance
            - Usuarios de escritorio remoto
    condition: all of selection_*
related:
    -   id: cef24b90-dddc-4ae1-a09a-8764872f69fc
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:43:35.549286+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:43:35.549286+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:43:35.549300+00:00'
