id: 2992ac4d-31e9-4325-99f2-b18a73221bb2
title: ESXi VM Kill Via ESXCLI
status: test
level: medium
description: Detects execution of the "esxcli" command with the "vm" and "kill" flag
    in order to kill/shutdown a specific VM.
author: Nasreddine Bencherchali (Nextron Systems), Cedric Maurugeon
date: '2023-09-04'
tags:
    - attack.execution
references:
    - https://www.crowdstrike.com/blog/hypervisor-jackpotting-ecrime-actors-increase-targeting-of-esxi-servers/
    - https://developer.broadcom.com/xapis/esxcli-command-reference/7.0.0/namespace/esxcli_vm.html
    - https://www.secuinfra.com/en/techtalk/hide-your-hypervisor-analysis-of-esxiargs-ransomware/
    - https://www.trendmicro.com/en_us/research/22/e/new-linux-based-ransomware-cheerscrypt-targets-exsi-devices.html
falsepositives:
    - Legitimate administration activities
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith: /esxcli
        CommandLine|contains|all:
            - vm process
            - kill
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 2
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:17:27.729613+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-26T02:17:27.729613+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:17:27.729639+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:17:27.729643+00:00'
