title: Add Potential Suspicious New Download Source To Winget
id: c15a46a0-07d4-4c87-b4b6-89207835a83b
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects usage of winget to add new potentially suspicious download sources
references:
    - https://learn.microsoft.com/en-us/windows/package-manager/winget/source
    - https://github.com/nasbench/Misc-Research/tree/b9596e8109dcdb16ec353f316678927e507a5b8d/LOLBINs/Winget
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.execution
    - attack.t1059
date: '2023-04-17'
modified: '2023-12-04'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \winget.exe
        OriginalFileName: winget.exe
    selection_cli:
        CommandLine|contains|all:
            - 'source '
            - 'add '
    selection_source_direct_ip:
        CommandLine|re: ://\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}
    condition: all of selection_*
related:
    -   id: 05ebafc8-7aa2-4bcd-a269-2aec93f9e842
        type: similar
    -   id: 81a0ecb5-0a41-4ba1-b2ba-c944eb92bfa2
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:46:41.795225+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:46:41.795225+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:46:41.795240+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:46:41.795242+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:46:41.795244+00:00'
