id: 2c28c248-7f50-417a-9186-a85b223010ee
title: Wscript Shell Run In CommandLine
status: test
level: medium
description: Detects the presence of the keywords "Wscript", "Shell" and "Run" in
    the command, which could indicate a suspicious activity
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-08-31'
modified: '2023-05-15'
tags:
    - attack.execution
    - attack.t1059
references:
    - https://web.archive.org/web/20220830122045/http://blog.talosintelligence.com/2022/08/modernloader-delivers-multiple-stealers.html
    - https://blog.talosintelligence.com/modernloader-delivers-multiple-stealers-cryptominers-and-rats/
falsepositives:
    - Inline scripting can be used by some rare third party applications or administrators.
        Investigate and apply additional filters accordingly
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - Wscript.
            - .Shell
            - .Run
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:33:00.496272+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:33:00.496272+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:33:00.496288+00:00'
