id: f208d6d8-d83a-4c2c-960d-877c37da84e5
title: Process Launched Without Image Name
status: experimental
level: medium
description: Detect the use of processes with no name (".exe"), which can be used
    to evade Image-based detections.
author: Matt Anderson (Huntress)
date: '2024-07-23'
tags:
    - attack.defense-evasion
references:
    - https://www.huntress.com/blog/fake-browser-updates-lead-to-boinc-volunteer-computing-software
falsepositives:
    - Rare legitimate software.
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:43.030298+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:43.030298+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:43.030304+00:00'
