title: Suspicious Execution of Systeminfo
id: 0ef56343-059e-4cb6-adc1-4c3c967c5e46
status: test
level: low
author: frack113
description: Detects usage of the "systeminfo" command to retrieve information
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1082/T1082.md#atomic-test-1---system-information-discovery
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/systeminfo
falsepositives:
    - Unknown
tags:
    - attack.discovery
    - attack.t1082
date: '2022-01-01'
modified: '2022-07-14'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \systeminfo.exe
        OriginalFileName: sysinfo.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:45:22.759654+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:45:22.759654+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:45:22.759668+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:45:22.759670+00:00'
