id: 2d3cdeec-c0db-45b4-aa86-082f7eb75701
title: Microsoft IIS Service Account Password Dumped
status: test
level: high
description: Detects the Internet Information Services (IIS) command-line tool, AppCmd,
    being used to list passwords
author: Tim Rauch, Janantha Marasinghe, Elastic (original idea)
date: '2022-11-08'
modified: '2023-01-22'
tags:
    - attack.credential-access
    - attack.t1003
references:
    - https://www.elastic.co/guide/en/security/current/microsoft-iis-service-account-password-dumped.html
    - https://twitter.com/0gtweet/status/1588815661085917186?cxt=HHwWhIDUyaDbzYwsAAAA
    - https://www.netspi.com/blog/technical/network-penetration-testing/decrypting-iis-passwords-to-break-out-of-the-dmz-part-2/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_base_name:
        Image|endswith: \appcmd.exe
        OriginalFileName: appcmd.exe
    selection_base_list:
        CommandLine|contains: 'list '
    selection_standalone:
        CommandLine|contains:
            - ' /config'
            - ' /xml'
            - ' -config'
            - ' -xml'
    selection_cmd_flags:
        CommandLine|contains:
            - ' /@t'
            - ' /text'
            - ' /show'
            - ' -@t'
            - ' -text'
            - ' -show'
    selection_cmd_grep:
        CommandLine|contains:
            - :\*
            - password
    condition: all of selection_base_* and (selection_standalone or all of selection_cmd_*)
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:35:48.500302+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:35:48.500302+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:35:48.500334+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:35:48.500337+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:35:48.500341+00:00'
