id: cea2b7ea-792b-405f-95a1-b903ea06458f
title: Suspicious Child Process Of Manage Engine ServiceDesk
status: test
level: high
description: Detects suspicious child processes of the "Manage Engine ServiceDesk
    Plus" Java web service
author: Florian Roth (Nextron Systems)
date: '2023-01-18'
modified: '2023-08-29'
tags:
    - attack.command-and-control
    - attack.t1102
references:
    - https://www.horizon3.ai/manageengine-cve-2022-47966-technical-deep-dive/
    - https://github.com/horizon3ai/CVE-2022-47966/blob/3a51c6b72ebbd87392babd955a8fbeaee2090b35/CVE-2022-47966.py
    - https://blog.viettelcybersecurity.com/saml-show-stopper/
falsepositives:
    - Legitimate sub processes started by Manage Engine ServiceDesk Pro
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|contains|all:
            - \ManageEngine\ServiceDesk\
            - \java.exe
        Image|endswith:
            - \AppVLP.exe
            - \bash.exe
            - \bitsadmin.exe
            - \calc.exe
            - \certutil.exe
            - \cscript.exe
            - \curl.exe
            - \forfiles.exe
            - \mftrace.exe
            - \mshta.exe
            - \net.exe
            - \net1.exe
            - \notepad.exe
            - \powershell.exe
            - \pwsh.exe
            - \query.exe
            - \reg.exe
            - \schtasks.exe
            - \scrcons.exe
            - \sh.exe
            - \systeminfo.exe
            - \whoami.exe
            - \wmic.exe
            - \wscript.exe
    filter_main_net:
        Image|endswith:
            - \net.exe
            - \net1.exe
        CommandLine|contains: ' stop'
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:31:51.286545+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:31:51.286545+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:31:51.286562+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:31:51.286565+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:31:51.286579+00:00'
