title: Exports Critical Registry Keys To a File
id: 82880171-b475-4201-b811-e9c826cd5eaa
status: test
level: high
author: Oddvar Moe, Sander Wiebing, oscd.community
description: Detects the export of a crital Registry key to a file.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Regedit/
    - https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
fields:
    - ParentImage
    - CommandLine
falsepositives:
    - Dumping hives for legitimate purpouse i.e. backup or forensic investigation
tags:
    - attack.exfiltration
    - attack.t1012
date: '2020-10-12'
modified: '2024-03-13'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \regedit.exe
        OriginalFileName: REGEDIT.EXE
    selection_cli_1:
        CommandLine|contains|windash: ' -E '
    selection_cli_2:
        CommandLine|contains:
            - hklm
            - hkey_local_machine
    selection_cli_3:
        CommandLine|endswith:
            - \system
            - \sam
            - \security
    condition: all of selection_*
related:
    -   id: f0e53e89-8d22-46ea-9db5-9d4796ee2f8a
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:43:17.780125+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:43:17.780125+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:43:17.780138+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:43:17.780140+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:43:17.780141+00:00'
