title: Screen Capture - macOS
id: 0877ed01-da46-4c49-8476-d49cdd80dfa7
status: test
level: low
author: remotephone, oscd.community
description: Detects attempts to use screencapture to collect macOS screenshots
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1113/T1113.md
    - https://github.com/EmpireProject/Empire/blob/08cbd274bef78243d7a8ed6443b8364acd1fc48b/lib/modules/python/collection/osx/screenshot.py
falsepositives:
    - Legitimate user activity taking screenshots
tags:
    - attack.collection
    - attack.t1113
date: '2020-10-13'
modified: '2021-11-27'
logsource:
    category: process_creation
    product: macos
detection:
    selection:
        Image: /usr/sbin/screencapture
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:34:40.094583+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-12-04T01:34:40.094583+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:34:40.094600+00:00'
