id: b2309017-4235-44fe-b5af-b15363011957
title: Uncommon Child Process Of Defaultpack.EXE
status: test
level: medium
description: Detects uncommon child processes of "DefaultPack.EXE" binary as a proxy
    to launch other programs
author: frack113
date: '2022-12-31'
modified: '2024-04-22'
tags:
    - attack.t1218
    - attack.defense-evasion
    - attack.execution
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/DefaultPack/
    - https://www.echotrail.io/insights/search/defaultpack.exe
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \DefaultPack.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:36:07.607366+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:36:07.607366+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:36:07.607388+00:00'
