title: Suspicious Cabinet File Execution Via Msdt.EXE
id: dc4576d4-7467-424f-9eee-fd2b02855fe0
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems), GossiTheDog, frack113
description: Detects execution of msdt.exe using the "cab" flag which could indicates
    suspicious diagcab files with embedded answer files leveraging CVE-2022-30190
references:
    - https://twitter.com/nas_bench/status/1537896324837781506
    - https://github.com/GossiTheDog/ThreatHunting/blob/e85884abbf05d5b41efc809ea6532b10b45bd05c/AdvancedHuntingQueries/DogWalk-DiagCab
    - https://github.com/elastic/protections-artifacts/commit/746086721fd385d9f5c6647cada1788db4aea95f#diff-9015912909545e72ed42cbac4d1e96295e8964579c406d23fd9c47a8091576a0
    - https://irsl.medium.com/the-trouble-with-microsofts-troubleshooters-6e32fc80b8bd
falsepositives:
    - Legitimate usage of ".diagcab" files
tags:
    - attack.defense-evasion
    - attack.t1202
date: '2022-06-21'
modified: '2024-03-13'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \msdt.exe
        OriginalFileName: msdt.exe
    selection_cmd:
        CommandLine|contains|windash: ' -cab '
    condition: all of selection_*
related:
    -   id: 6545ce61-a1bd-4119-b9be-fcbee42c0cf3
        type: obsolete
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:41:52.226296+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:41:52.226296+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:41:52.226311+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:41:52.226313+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:41:52.226315+00:00'
