title: Suspicious Reg Add BitLocker
id: 0e0255bf-2548-47b8-9582-c0955c9283f5
status: test
level: high
author: frack113
description: Detects suspicious addition to BitLocker related registry keys via the
    reg.exe utility
references:
    - https://thedfirreport.com/2021/11/15/exchange-exploit-leads-to-domain-wide-ransomware/
falsepositives:
    - Unlikely
tags:
    - attack.impact
    - attack.t1486
date: '2021-11-15'
modified: '2022-09-09'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - REG
            - ADD
            - \SOFTWARE\Policies\Microsoft\FVE
            - /v
            - /f
        CommandLine|contains:
            - EnableBDEWithNoTPM
            - UseAdvancedStartup
            - UseTPM
            - UseTPMKey
            - UseTPMKeyPIN
            - RecoveryKeyMessageSource
            - UseTPMPIN
            - RecoveryKeyMessage
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:42:24.764923+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:42:24.764923+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:42:24.764955+00:00'
