id: e4a6b256-3e47-40fc-89d2-7a477edd6915
title: System File Execution Location Anomaly
status: experimental
level: high
description: 'Detects the execution of a Windows system binary that is usually located
    in the system folder from an uncommon location.

    '
author: Florian Roth (Nextron Systems), Patrick Bareiss, Anton Kutepov, oscd.community,
    Nasreddine Bencherchali (Nextron Systems)
date: '2017-11-27'
modified: '2024-07-16'
tags:
    - attack.defense-evasion
    - attack.t1036
references:
    - https://twitter.com/GelosSnake/status/934900723426439170
    - https://asec.ahnlab.com/en/39828/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''be58d2e2-06c8-4f58-b666-b99f6dc3b6cd''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - \atbroker.exe
            - \audiodg.exe
            - \bcdedit.exe
            - \bitsadmin.exe
            - \certreq.exe
            - \certutil.exe
            - \cmstp.exe
            - \conhost.exe
            - \consent.exe
            - \cscript.exe
            - \csrss.exe
            - \dashost.exe
            - \defrag.exe
            - \dfrgui.exe
            - \dism.exe
            - \dllhost.exe
            - \dllhst3g.exe
            - \dwm.exe
            - \eventvwr.exe
            - \logonui.exe
            - \LsaIso.exe
            - \lsass.exe
            - \lsm.exe
            - \msiexec.exe
            - \ntoskrnl.exe
            - \powershell_ise.exe
            - \powershell.exe
            - \pwsh.exe
            - \regsvr32.exe
            - \rundll32.exe
            - \runonce.exe
            - \RuntimeBroker.exe
            - \schtasks.exe
            - \services.exe
            - \sihost.exe
            - \smartscreen.exe
            - \smss.exe
            - \spoolsv.exe
            - \svchost.exe
            - \taskhost.exe
            - \Taskmgr.exe
            - \userinit.exe
            - \wininit.exe
            - \winlogon.exe
            - \winver.exe
            - \wlanext.exe
            - \wscript.exe
            - \wsl.exe
            - \wsmprovhost.exe
    filter_main_generic:
        Image|startswith:
            - C:\$WINDOWS.~BT\
            - C:\$WinREAgent\
            - C:\Windows\SoftwareDistribution\
            - C:\Windows\System32\
            - C:\Windows\SystemTemp\
            - C:\Windows\SysWOW64\
            - C:\Windows\uus\
            - C:\Windows\WinSxS\
    filter_optional_system32:
        Image|contains: \SystemRoot\System32\
    filter_main_powershell:
        Image:
            - C:\Program Files\PowerShell\7\pwsh.exe
            - C:\Program Files\PowerShell\7-preview\pwsh.exe
    filter_main_wsl_windowsapps:
        Image|startswith: C:\Program Files\WindowsApps\MicrosoftCorporationII.WindowsSubsystemForLinux
        Image|endswith: \wsl.exe
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:51.904467+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:51.904467+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:51.904472+00:00'
