id: 9386d78a-7207-4048-9c9f-a93a7c2d1c05
title: Code Execution via Pcwutl.dll
status: test
level: medium
description: Detects launch of executable by calling the LaunchApplication function
    from pcwutl.dll library.
author: Julia Fomina, oscd.community
date: '2020-10-05'
modified: '2023-02-09'
tags:
    - attack.defense-evasion
    - attack.t1218.011
references:
    - https://lolbas-project.github.io/lolbas/Libraries/Pcwutl/
    - https://twitter.com/harr0ey/status/989617817849876488
falsepositives:
    - Use of Program Compatibility Troubleshooter Helper
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \rundll32.exe
        OriginalFileName: RUNDLL32.EXE
    selection_cli:
        CommandLine|contains|all:
            - pcwutl
            - LaunchApplication
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:25:37.756965+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:25:37.756965+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:25:37.757001+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:25:37.757007+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:25:37.757011+00:00'
