id: 932fb0d8-692b-4b0f-a26e-5643a50fe7d6
title: Audio Capture via PowerShell
status: test
level: medium
description: Detects audio capture via PowerShell Cmdlet.
author: E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community,
    Nasreddine Bencherchali (Nextron Systems)
date: '2019-10-24'
modified: '2023-04-06'
tags:
    - attack.collection
    - attack.t1123
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1123/T1123.md
    - https://eqllib.readthedocs.io/en/latest/analytics/ab7a6ef4-0983-4275-a4f1-5c6bd3c31c23.html
    - https://github.com/frgnca/AudioDeviceCmdlets
falsepositives:
    - Legitimate audio capture by legitimate user.
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - WindowsAudioDevice-Powershell-Cmdlet
            - Toggle-AudioDevice
            - 'Get-AudioDevice '
            - 'Set-AudioDevice '
            - 'Write-AudioDevice '
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:29:50.652728+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:29:50.652728+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:29:50.652758+00:00'
