id: 68bcd73b-37ef-49cb-95fc-edc809730be6
title: Potential Unquoted Service Path Reconnaissance Via Wmic.EXE
status: test
level: medium
description: Detects known WMI recon method to look for unquoted service paths using
    wmic. Often used by pentester and attacker enumeration scripts
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-06-20'
modified: '2023-09-11'
tags:
    - attack.execution
    - attack.t1047
references:
    - https://github.com/nccgroup/redsnarf/blob/35949b30106ae543dc6f2bc3f1be10c6d9a8d40e/redsnarf.py
    - https://github.com/S3cur3Th1sSh1t/Creds/blob/eac23d67f7f90c7fc8e3130587d86158c22aa398/PowershellScripts/jaws-enum.ps1
    - https://www.absolomb.com/2018-01-26-Windows-Privilege-Escalation-Guide/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''09658312-bc27-4a3b-91c5-e49ab9046d1b''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''76f55eaa-d27f-4213-9d45-7b0e4b60bbae''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        OriginalFileName: wmic.exe
        Image|endswith: \WMIC.exe
    selection_cli:
        CommandLine|contains|all:
            - ' service get '
            - name,displayname,pathname,startmode
    condition: all of selection*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:36:32.175570+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:36:32.175570+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:36:32.175597+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:36:32.175600+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:36:32.175602+00:00'
