id: 26488ad0-f9fd-4536-876f-52fea846a2e4
title: HackTool - SharPersist Execution
status: test
level: high
description: Detects the execution of the hacktool SharPersist - used to deploy various
    different kinds of persistence mechanisms
author: Florian Roth (Nextron Systems)
date: '2022-09-15'
modified: '2023-02-04'
tags:
    - attack.persistence
    - attack.t1053
references:
    - https://www.mandiant.com/resources/blog/sharpersist-windows-persistence-toolkit
    - https://github.com/mandiant/SharPersist
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \SharPersist.exe
        Product: SharPersist
    selection_cli_1:
        CommandLine|contains:
            - ' -t schtask -c '
            - ' -t startupfolder -c '
    selection_cli_2:
        CommandLine|contains|all:
            - ' -t reg -c '
            - ' -m add'
    selection_cli_3:
        CommandLine|contains|all:
            - ' -t service -c '
            - ' -m add'
    selection_cli_4:
        CommandLine|contains|all:
            - ' -t schtask -c '
            - ' -m add'
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:25:49.022395+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:25:49.022395+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:25:49.022444+00:00'
        -   source_field: Product
            target_table: process_activity
            target_field: metadata.product.name
            mapped_at: '2025-11-26T02:25:49.022449+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:25:49.022452+00:00'
