id: b98d0db6-511d-45de-ad02-e82a98729620
title: Remotely Hosted HTA File Executed Via Mshta.EXE
status: test
level: high
description: Detects execution of the "mshta" utility with an argument containing
    the "http" keyword, which could indicate that an attacker is executing a remotely
    hosted malicious hta file
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-08-08'
modified: '2023-02-06'
tags:
    - attack.defense-evasion
    - attack.execution
    - attack.t1218.005
references:
    - https://www.trendmicro.com/en_us/research/22/e/avoslocker-ransomware-variant-abuses-driver-file-to-disable-anti-Virus-scans-log4shell.html
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \mshta.exe
        OriginalFileName: MSHTA.EXE
    selection_cli:
        CommandLine|contains:
            - http://
            - https://
            - ftp://
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:27:44.163562+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:27:44.163562+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:27:44.163605+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:27:44.163610+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:27:44.163613+00:00'
