id: c74c0390-3e20-41fd-a69a-128f0275a5ea
title: Cab File Extraction Via Wusa.EXE From Potentially Suspicious Paths
status: test
level: high
description: 'Detects the execution of the "wusa.exe" (Windows Update Standalone Installer)
    utility to extract ".cab" files using the "/extract" argument from potentially
    suspicious paths.

    '
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-08-05'
modified: '2023-11-28'
tags:
    - attack.execution
references:
    - https://web.archive.org/web/20180331144337/https://www.fireeye.com/blog/threat-research/2018/03/sanny-malware-delivery-method-updated-in-recently-observed-attacks.html
    - https://www.echotrail.io/insights/search/wusa.exe/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''59b39960-5f9d-4a49-9cef-1e4d2c1d0cb9''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_root:
        Image|endswith: \wusa.exe
        CommandLine|contains: '/extract:'
    selection_paths:
        CommandLine|contains:
            - :\PerfLogs\
            - :\Users\Public\
            - :\Windows\Temp\
            - \Appdata\Local\Temp\
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:02.449982+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:02.449982+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:02.449999+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:02.450002+00:00'
