id: c4eeeeae-89f4-43a7-8b48-8d1bdfa66c78
title: Scheduled Task Executing Encoded Payload from Registry
status: test
level: high
description: Detects the creation of a schtask that potentially executes a base64
    encoded payload stored in the Windows Registry using PowerShell.
author: pH-T (Nextron Systems), @Kostastsale, @TheDFIRReport, X__Junior (Nextron Systems),
    Nasreddine Bencherchali (Nextron Systems)
date: '2022-02-12'
modified: '2023-02-04'
tags:
    - attack.execution
    - attack.persistence
    - attack.t1053.005
    - attack.t1059.001
references:
    - https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \schtasks.exe
        OriginalFileName: schtasks.exe
    selection_cli_create:
        CommandLine|contains: /Create
    selection_cli_encoding:
        CommandLine|contains:
            - FromBase64String
            - encodedcommand
    selection_cli_get:
        CommandLine|contains:
            - Get-ItemProperty
            - ' gp '
    selection_cli_hive:
        CommandLine|contains:
            - 'HKCU:'
            - 'HKLM:'
            - 'registry::'
            - HKEY_
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:46.325542+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:46.325542+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:46.325564+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:46.325567+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:46.325569+00:00'
