title: Potential Suspicious Windows Feature Enabled - ProcCreation
id: c740d4cf-a1e9-41de-bb16-8a46a4f57918
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: 'Detects usage of the built-in PowerShell cmdlet "Enable-WindowsOptionalFeature"
    used as a Deployment Image Servicing and Management tool.

    Similar to DISM.exe, this cmdlet is used to enumerate, install, uninstall, configure,
    and update features and packages in Windows images

    '
references:
    - https://learn.microsoft.com/en-us/powershell/module/dism/enable-windowsoptionalfeature?view=windowsserver2022-ps
    - https://learn.microsoft.com/en-us/windows/win32/projfs/enabling-windows-projected-file-system
    - https://learn.microsoft.com/en-us/windows/wsl/install-on-server
falsepositives:
    - Legitimate usage of the features listed in the rule.
tags:
    - attack.defense-evasion
date: '2022-12-29'
logsource:
    category: process_creation
    product: windows
detection:
    selection_cmd:
        CommandLine|contains|all:
            - Enable-WindowsOptionalFeature
            - -Online
            - -FeatureName
    selection_feature:
        CommandLine|contains:
            - TelnetServer
            - Internet-Explorer-Optional-amd64
            - TFTP
            - SMB1Protocol
            - Client-ProjFS
            - Microsoft-Windows-Subsystem-Linux
    condition: all of selection_*
related:
    -   id: 55c925c1-7195-426b-a136-a9396800e29b
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:47:35.110836+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:47:35.110836+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:47:35.110851+00:00'
