id: 24de4f3b-804c-4165-b442-5a06a2302c7e
title: Arbitrary Shell Command Execution Via Settingcontent-Ms
status: test
level: medium
description: The .SettingContent-ms file type was introduced in Windows 10 and allows
    a user to create "shortcuts" to various Windows 10 setting pages. These files
    are simply XML and contain paths to various Windows 10 settings binaries.
author: Sreeman
date: '2020-03-13'
modified: '2022-04-14'
tags:
    - attack.t1204
    - attack.t1566.001
    - attack.execution
    - attack.initial-access
references:
    - https://posts.specterops.io/the-tale-of-settingcontent-ms-files-f1ea253e4d39
fields:
    - ParentProcess
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains: .SettingContent-ms
    filter:
        CommandLine|contains: immersivecontrolpanel
    condition: selection and not filter
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:24.085212+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:24.085212+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:24.085227+00:00'
