title: Named Pipe Created Via Mkfifo
id: 9d779ce8-5256-4b13-8b6f-b91c602b43f4
status: test
level: low
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects the creation of a new named pipe using the "mkfifo" utility
references:
    - https://dev.to/0xbf/use-mkfifo-to-create-named-pipe-linux-tips-5bbk
    - https://www.mandiant.com/resources/blog/barracuda-esg-exploited-globally
falsepositives:
    - Unknown
tags:
    - attack.execution
date: '2023-06-16'
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith: /mkfifo
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:35:53.079466+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:35:53.079466+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:35:53.079479+00:00'
