id: d75d6b6b-adb9-48f7-824b-ac2e786efe1f
title: Suspicious FromBase64String Usage On Gzip Archive - Process Creation
status: test
level: medium
description: Detects attempts of decoding a base64 Gzip archive via PowerShell. This
    technique is often used as a method to load malicious content into memory afterward.
author: frack113
date: '2022-12-23'
tags:
    - attack.command-and-control
    - attack.t1132.001
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=43
falsepositives:
    - Legitimate administrative script
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''df69cb1d-b891-4cd9-90c7-d617d90100ce''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - FromBase64String
            - MemoryStream
            - H4sI
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:35:19.756518+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:35:19.756518+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:35:19.756540+00:00'
