id: 80915f59-9b56-4616-9de0-fd0dea6c12fe
title: Clear Linux Logs
status: stable
level: medium
description: Detects attempts to clear logs on the system. Adversaries may clear system
    logs to hide evidence of an intrusion
author: Ömer Günal, oscd.community
date: '2020-10-07'
modified: '2022-09-15'
tags:
    - attack.defense-evasion
    - attack.t1070.002
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.002/T1070.002.md
falsepositives:
    - Legitimate administration activities
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith:
            - /rm
            - /shred
            - /unlink
        CommandLine|contains:
            - /var/log
            - /var/spool/mail
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:16:59.255479+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-26T02:16:59.255479+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:16:59.255532+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:16:59.255537+00:00'
