title: Potential Configuration And Service Reconnaissance Via Reg.EXE
id: 970007b7-ce32-49d0-a4a4-fbef016950bd
status: test
level: medium
author: Timur Zinniatullin, oscd.community
description: Detects the usage of "reg.exe" in order to query reconnaissance information
    from the registry. Adversaries may interact with the Windows registry to gather
    information about credentials, the system, configuration, and installed software.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1012/T1012.md
falsepositives:
    - Discord
tags:
    - attack.discovery
    - attack.t1012
    - attack.t1007
date: '2019-10-21'
modified: '2023-02-05'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \reg.exe
        OriginalFileName: reg.exe
    selection_flag:
        CommandLine|contains: query
    selection_key:
        CommandLine|contains:
            - currentVersion\windows
            - winlogon\
            - currentVersion\shellServiceObjectDelayLoad
            - currentVersion\run
            - currentVersion\policies\explorer\run
            - currentcontrolset\services
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:41:17.765837+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:41:17.765837+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:41:17.765868+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:41:17.765873+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:41:17.765877+00:00'
