id: ff39f1a6-84ac-476f-a1af-37fcdf53d7c0
title: Disable Security Tools
status: test
level: medium
description: Detects disabling security tools
author: Daniil Yugoslavskiy, oscd.community
date: '2020-10-19'
modified: '2021-11-27'
tags:
    - attack.defense-evasion
    - attack.t1562.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
falsepositives:
    - Legitimate activities
taxonomy: sigma
logsource:
    category: process_creation
    product: macos
detection:
    launchctl_unload:
        Image: /bin/launchctl
        CommandLine|contains: unload
    security_plists:
        CommandLine|contains:
            - com.objective-see.lulu.plist
            - com.objective-see.blockblock.plist
            - com.google.santad.plist
            - com.carbonblack.defense.daemon.plist
            - com.carbonblack.daemon.plist
            - at.obdev.littlesnitchd.plist
            - com.tenablesecurity.nessusagent.plist
            - com.opendns.osx.RoamingClientConfigUpdater.plist
            - com.crowdstrike.falcond.plist
            - com.crowdstrike.userdaemon.plist
            - osquery
            - filebeat
            - auditbeat
            - packetbeat
            - td-agent
    disable_gatekeeper:
        Image: /usr/sbin/spctl
        CommandLine|contains: disable
    condition: (launchctl_unload and security_plists) or disable_gatekeeper
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:14:25.830314+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-11-13T20:14:25.830314+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:14:25.830318+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:14:25.830319+00:00'
