id: 44143844-0631-49ab-97a0-96387d6b2d7c
title: File Download Using Notepad++ GUP Utility
status: test
level: high
description: Detects execution of the Notepad++ updater (gup) from a process other
    than Notepad++ to download files.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-06-10'
modified: '2023-03-02'
tags:
    - attack.command-and-control
    - attack.t1105
references:
    - https://twitter.com/nas_bench/status/1535322182863179776
falsepositives:
    - Other parent processes other than notepad++ using GUP that are not currently
        identified
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \GUP.exe
        OriginalFileName: gup.exe
    selection_cli:
        CommandLine|contains|all:
            - ' -unzipTo '
            - http
    filter:
        ParentImage|endswith: \notepad++.exe
    condition: all of selection* and not filter
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:19:59.938831+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:19:59.938831+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:19:59.938855+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:19:59.938858+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:19:59.938860+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:19:59.938862+00:00'
