id: e173ad47-4388-4012-ae62-bd13f71c18a8
title: Potential DLL Sideloading Via DeviceEnroller.EXE
status: test
level: medium
description: 'Detects the use of the PhoneDeepLink parameter to potentially sideload
    a DLL file that does not exist. This non-existent DLL file is named "ShellChromeAPI.dll".

    Adversaries can drop their own renamed DLL and execute it via DeviceEnroller.exe
    using this parameter

    '
author: '@gott_cyber'
date: '2022-08-29'
modified: '2023-02-04'
tags:
    - attack.defense-evasion
    - attack.t1574.002
references:
    - https://mobile.twitter.com/0gtweet/status/1564131230941122561
    - https://strontic.github.io/xcyclopedia/library/DeviceEnroller.exe-24BEF0D6B0ECED36BB41831759FDE18D.html
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''ee4c5d06-3abc-48cc-8885-77f1c20f4451''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \deviceenroller.exe
        OriginalFileName: deviceenroller.exe
    selection_cli:
        CommandLine|contains: /PhoneDeepLink
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:36:05.455626+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:36:05.455626+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:36:05.455648+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:36:05.455651+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:36:05.455654+00:00'
