id: b222df08-0e07-11eb-adc1-0242ac120002
title: Invoke-Obfuscation CLIP+ Launcher
status: test
level: high
description: Detects Obfuscated use of Clip.exe to execute PowerShell
author: Jonathan Cheong, oscd.community
date: '2020-10-13'
modified: '2022-11-17'
tags:
    - attack.defense-evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
references:
    - https://github.com/SigmaHQ/sigma/issues/1009
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - cmd
            - '&&'
            - 'clipboard]::'
            - -f
        CommandLine|contains:
            - /c
            - /r
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:32:57.770930+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:32:57.770930+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:32:57.770962+00:00'
