id: f8341cb2-ee25-43fa-a975-d8a5a9714b39
title: BPFtrace Unsafe Option Usage
status: test
level: medium
description: Detects the usage of the unsafe bpftrace option
author: Andreas Hunkeler (@Karneades)
date: '2022-02-11'
tags:
    - attack.execution
    - attack.t1059.004
references:
    - https://embracethered.com/blog/posts/2021/offensive-bpf-bpftrace/
    - https://bpftrace.org/
falsepositives:
    - Legitimate usage of the unsafe option
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith: bpftrace
        CommandLine|contains: --unsafe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:16:34.524978+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-26T02:16:34.524978+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:16:34.525010+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:16:34.525017+00:00'
