title: Osacompile Execution By Potentially Suspicious Applet/Osascript
id: a753a6af-3126-426d-8bd0-26ebbcb92254
status: test
level: medium
author: Sohan G (D4rkCiph3r), Red Canary (Idea)
description: Detects potential suspicious applet or osascript executing "osacompile".
references:
    - https://redcanary.com/blog/mac-application-bundles/
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1059.002
date: '2023-04-03'
logsource:
    category: process_creation
    product: macos
detection:
    selection:
        ParentImage|endswith:
            - /applet
            - /osascript
        CommandLine|contains: osacompile
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:34:39.047801+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-12-04T01:34:39.047801+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:34:39.047817+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:34:39.047819+00:00'
