title: Renamed Plink Execution
id: 1c12727d-02bf-45ff-a9f3-d49806a3cf43
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects the execution of a renamed version of the Plink binary
references:
    - https://thedfirreport.com/2022/06/06/will-the-real-msiexec-please-stand-up-exploit-leads-to-data-exfiltration/
    - https://the.earth.li/~sgtatham/putty/0.58/htmldoc/Chapter7.html
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1036
date: '2022-06-06'
modified: '2023-02-03'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        OriginalFileName: Plink
        CommandLine|contains|all:
            - ' -l forward'
            - ' -P '
            - ' -R '
    filter:
        Image|endswith: \plink.exe
    condition: selection and not filter
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:46:57.873211+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:46:57.873211+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:46:57.873228+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:46:57.873230+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:46:57.873232+00:00'
