id: 15434e33-5027-4914-88d5-3d4145ec25a9
title: Potential Product Reconnaissance Via Wmic.EXE
status: test
level: medium
description: Detects the execution of WMIC in order to get a list of firewall and
    antivirus products
author: Nasreddine Bencherchali
date: '2023-02-14'
tags:
    - attack.execution
    - attack.t1047
references:
    - https://thedfirreport.com/2023/03/06/2022-year-in-review/
    - https://www.yeahhub.com/list-installed-programs-version-path-windows/
    - https://learn.microsoft.com/en-us/answers/questions/253555/software-list-inventory-wmic-product
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \wmic.exe
        OriginalFileName: wmic.exe
    selection_cli:
        CommandLine|contains: Product
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:21:00.875635+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:00.875635+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:21:00.875645+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:21:00.875646+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:21:00.875648+00:00'
