id: 01aeb693-138d-49d2-9403-c4f52d7d3d62
title: RDP Connection Allowed Via Netsh.EXE
status: test
level: high
description: Detects usage of the netsh command to open and allow connections to port
    3389 (RDP). As seen used by Sarwent Malware
author: Sander Wiebing
date: '2020-05-23'
modified: '2023-12-11'
tags:
    - attack.defense-evasion
    - attack.t1562.004
references:
    - https://labs.sentinelone.com/sarwent-malware-updates-command-detonation/
falsepositives:
    - Legitimate administration activity
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \netsh.exe
        OriginalFileName: netsh.exe
    selection_cli:
        CommandLine|contains|all:
            - 'firewall '
            - 'add '
            - 'tcp '
            - '3389'
        CommandLine|contains:
            - portopening
            - allow
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:07.881046+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:07.881046+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:07.881052+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:07.881054+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:07.881056+00:00'
