id: 7e6237fe-3ddb-438f-9381-9bf9de5af8d0
title: Windows Internet Hosted WebDav Share Mount Via Net.EXE
status: test
level: high
description: Detects when an internet hosted webdav share is mounted using the "net.exe"
    utility
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-02-21'
modified: '2023-07-25'
tags:
    - attack.lateral-movement
    - attack.t1021.002
references:
    - https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \net.exe
            - \net1.exe
        OriginalFileName:
            - net.exe
            - net1.exe
    selection_cli:
        CommandLine|contains|all:
            - ' use '
            - ' http'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:19:56.665240+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:19:56.665240+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:19:56.665246+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:19:56.665247+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:19:56.665248+00:00'
