id: 9fbf5927-5261-4284-a71d-f681029ea574
title: Compress Data and Lock With Password for Exfiltration With 7-ZIP
status: test
level: medium
description: An adversary may compress or encrypt data that is collected prior to
    exfiltration using 3rd party utilities
author: frack113
date: '2021-07-27'
modified: '2023-03-13'
tags:
    - attack.collection
    - attack.t1560.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md
falsepositives:
    - Legitimate activity is expected since compressing files with a password is common.
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Description|contains: 7-Zip
        Image|endswith:
            - \7z.exe
            - \7zr.exe
            - \7za.exe
        OriginalFileName:
            - 7z.exe
            - 7za.exe
    selection_password:
        CommandLine|contains: ' -p'
    selection_action:
        CommandLine|contains:
            - ' a '
            - ' u '
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:34:46.852318+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:34:46.852318+00:00'
    detection_fields:
        -   source_field: Description
            target_table: process_activity
            target_field: device.desc
            mapped_at: '2025-11-26T02:34:46.852351+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:34:46.852355+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:34:46.852358+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:34:46.852361+00:00'
