id: df55196f-f105-44d3-a675-e9dfb6cc2f2b
title: Renamed AdFind Execution
status: test
level: high
description: Detects the use of a renamed Adfind.exe. AdFind continues to be seen
    across majority of breaches. It is used to domain trust discovery to plan out
    subsequent steps in the attack chain.
author: Florian Roth (Nextron Systems)
date: '2022-08-21'
modified: '2024-11-23'
tags:
    - attack.discovery
    - attack.t1018
    - attack.t1087.002
    - attack.t1482
    - attack.t1069.002
references:
    - https://www.joeware.net/freetools/tools/adfind/
    - https://thedfirreport.com/2020/05/08/adfind-recon/
    - https://thedfirreport.com/2021/01/11/trickbot-still-alive-and-well/
    - https://www.microsoft.com/security/blog/2021/01/20/deep-dive-into-the-solorigate-second-stage-activation-from-sunburst-to-teardrop-and-raindrop/
    - https://social.technet.microsoft.com/wiki/contents/articles/7535.adfind-command-examples.aspx
    - https://github.com/center-for-threat-informed-defense/adversary_emulation_library/blob/bf62ece1c679b07b5fb49c4bae947fe24c81811f/fin6/Emulation_Plan/Phase1.md
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_1:
        CommandLine|contains:
            - domainlist
            - trustdmp
            - dcmodes
            - adinfo
            - ' dclist '
            - computer_pwdnotreqd
            - objectcategory=
            - -subnets -f
            - name="Domain Admins"
            - '-sc u:'
            - domainncs
            - dompol
            - ' oudmp '
            - subnetdmp
            - gpodmp
            - fspdmp
            - users_noexpire
            - computers_active
            - computers_pwdnotreqd
    selection_2:
        Hashes|contains:
            - IMPHASH=BCA5675746D13A1F246E2DA3C2217492
            - IMPHASH=53E117A96057EAF19C41380D0E87F1C2
    selection_3:
        OriginalFileName: AdFind.exe
    filter:
        Image|endswith: \AdFind.exe
    condition: 1 of selection* and not filter
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:32:43.699282+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:32:43.699282+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:32:43.699306+00:00'
        -   source_field: Hashes
            target_table: process_activity
            target_field: process.file.hashes.value
            mapped_at: '2025-11-26T02:32:43.699308+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:32:43.699309+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:32:43.699310+00:00'
