title: LSASS Process Reconnaissance Via Findstr.EXE
id: fe63010f-8823-4864-a96b-a7b4a0f7b929
status: experimental
level: high
author: Florian Roth (Nextron Systems)
description: Detects findstring commands that include the keyword lsass, which indicates
    recon actviity for the LSASS process PID
references:
    - https://blog.talosintelligence.com/2022/08/recent-cyber-attack.html?m=1
falsepositives:
    - Unknown
tags:
    - attack.credential-access
    - attack.t1552.006
date: '2022-08-12'
modified: '2024-06-04'
logsource:
    category: process_creation
    product: windows
detection:
    selection_findstr_img:
        Image|endswith:
            - \find.exe
            - \findstr.exe
        OriginalFileName:
            - FIND.EXE
            - FINDSTR.EXE
    selection_findstr_cli:
        CommandLine|contains: lsass
    selection_special:
        CommandLine|contains|windash:
            - ' /i "lsass'
            - ' /i lsass.exe'
            - findstr "lsass
            - findstr lsass
            - findstr.exe "lsass
            - findstr.exe lsass
    condition: all of selection_findstr_* or selection_special
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:41:34.360969+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:41:34.360969+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:41:34.360999+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:41:34.361001+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:41:34.361003+00:00'
