id: 9465ddf4-f9e4-4ebd-8d98-702df3a93239
title: IIS Native-Code Module Command Line Installation
status: test
level: medium
description: Detects suspicious IIS native-code module installations via command line
author: Florian Roth (Nextron Systems)
date: '2019-12-11'
modified: '2024-03-13'
tags:
    - attack.persistence
    - attack.t1505.003
references:
    - https://researchcenter.paloaltonetworks.com/2018/01/unit42-oilrig-uses-rgdoor-iis-backdoor-targets-middle-east/
    - https://www.microsoft.com/security/blog/2022/07/26/malicious-iis-extensions-quietly-open-persistent-backdoors-into-servers/
falsepositives:
    - Unknown as it may vary from organisation to organisation how admins use to install
        IIS modules
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \appcmd.exe
        OriginalFileName: appcmd.exe
    selection_cli:
        CommandLine|contains|all:
            - install
            - module
        CommandLine|contains|windash: '-name:'
    filter_iis_setup:
        ParentImage: C:\Windows\System32\inetsrv\iissetup.exe
    condition: all of selection_* and not 1 of filter_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:58.266322+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:58.266322+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:58.266330+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:58.266332+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:58.266334+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:58.266336+00:00'
