id: d27ab432-2199-483f-a297-03633c05bae6
title: OS Architecture Discovery Via Grep
status: test
level: low
description: 'Detects the use of grep to identify information about the operating
    system architecture. Often combined beforehand with the execution of "uname" or
    "cat /proc/cpuinfo"

    '
author: Joseliyo Sanchez, @Joseliyo_Jstnk
date: '2023-06-02'
tags:
    - attack.discovery
    - attack.t1082
references:
    - https://blogs.jpcert.or.jp/en/2023/05/gobrat.html
    - https://jstnk9.github.io/jstnk9/research/GobRAT-Malware/
    - https://www.virustotal.com/gui/file/60bcd645450e4c846238cf0e7226dc40c84c96eba99f6b2cffcd0ab4a391c8b3/detection
    - https://www.virustotal.com/gui/file/3e44c807a25a56f4068b5b8186eee5002eed6f26d665a8b791c472ad154585d1/detection
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection_process:
        Image|endswith: /grep
    selection_architecture:
        CommandLine|endswith:
            - aarch64
            - arm
            - i386
            - i686
            - mips
            - x86_64
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:15:51.744563+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-13T20:15:51.744563+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:15:51.744568+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:15:51.744569+00:00'
