id: 77df53a5-1d78-4f32-bc5a-0e7465bd8f41
title: Portable Gpg.EXE Execution
status: test
level: medium
description: Detects the execution of "gpg.exe" from uncommon location. Often used
    by ransomware and loaders to decrypt/encrypt data.
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: '2023-08-06'
modified: '2023-11-10'
tags:
    - attack.impact
    - attack.t1486
references:
    - https://www.trendmicro.com/vinfo/vn/threat-encyclopedia/malware/ransom.bat.zarlock.a
    - https://securelist.com/locked-out/68960/
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1486/T1486.md
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - \gpg.exe
            - \gpg2.exe
        OriginalFileName: gpg.exe
        Description: GnuPG’s OpenPGP tool
    filter_main_legit_location:
        Image|contains:
            - :\Program Files (x86)\GNU\GnuPG\bin\
            - :\Program Files (x86)\GnuPG VS-Desktop\
            - :\Program Files (x86)\GnuPG\bin\
            - :\Program Files (x86)\Gpg4win\bin\
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:30.301508+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:30.301508+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:30.301513+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:30.301515+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: message
            mapped_at: '2025-11-13T20:20:30.301516+00:00'
