id: 0fc35fc3-efe6-4898-8a37-0b233339524f
title: Suspicious ScreenSave Change by Reg.exe
status: test
level: medium
description: 'Adversaries may establish persistence by executing malicious content
    triggered by user inactivity.

    Screensavers are programs that execute after a configurable time of user inactivity
    and consist of Portable Executable (PE) files with a .scr file extension

    '
author: frack113
date: '2021-08-19'
modified: '2022-06-02'
tags:
    - attack.privilege-escalation
    - attack.t1546.002
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.002/T1546.002.md
    - https://www.welivesecurity.com/wp-content/uploads/2017/08/eset-gazer.pdf
falsepositives:
    - GPO
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_reg:
        Image|endswith: \reg.exe
        CommandLine|contains:
            - HKEY_CURRENT_USER\Control Panel\Desktop
            - HKCU\Control Panel\Desktop
    selection_option_1:
        CommandLine|contains|all:
            - /v ScreenSaveActive
            - /t REG_SZ
            - /d 1
            - /f
    selection_option_2:
        CommandLine|contains|all:
            - /v ScreenSaveTimeout
            - /t REG_SZ
            - '/d '
            - /f
    selection_option_3:
        CommandLine|contains|all:
            - /v ScreenSaverIsSecure
            - /t REG_SZ
            - /d 0
            - /f
    selection_option_4:
        CommandLine|contains|all:
            - /v SCRNSAVE.EXE
            - /t REG_SZ
            - '/d '
            - .scr
            - /f
    condition: selection_reg and 1 of selection_option_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:36:41.835952+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:36:41.835952+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:36:41.835971+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:36:41.835974+00:00'
