title: Renamed Msdt.EXE Execution
id: bd1c6866-65fc-44b2-be51-5588fcff82b9
status: test
level: high
author: pH-T (Nextron Systems)
description: Detects the execution of a renamed "Msdt.exe" binary
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Msdt/
falsepositives:
    - Unlikely
tags:
    - attack.defense-evasion
    - attack.t1036.003
date: '2022-06-03'
modified: '2023-02-03'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        OriginalFileName: msdt.exe
    filter:
        Image|endswith: \msdt.exe
    condition: selection and not filter
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:50:34.462043+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:50:34.462043+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:50:34.462073+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:50:34.462076+00:00'
