id: f1f3bf22-deb2-418d-8cce-e1a45e46a5bd
title: MMC20 Lateral Movement
status: test
level: high
description: Detects MMC20.Application Lateral Movement; specifically looks for the
    spawning of the parent MMC.exe with a command line of "-Embedding" as a child
    of svchost.exe
author: '@2xxeformyshirt (Security Risk Advisors) - rule; Teymur Kheirkhabarov (idea)'
date: '2020-03-04'
modified: '2021-11-27'
tags:
    - attack.execution
    - attack.t1021.003
references:
    - https://enigma0x3.net/2017/01/05/lateral-movement-using-the-mmc20-application-com-object/
    - https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view?usp=sharing
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \svchost.exe
        Image|endswith: \mmc.exe
        CommandLine|contains: -Embedding
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:28:56.035130+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:28:56.035130+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:28:56.035148+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:28:56.035151+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:28:56.035153+00:00'
