title: File and Directory Discovery - Linux
id: d3feb4ee-ff1d-4d3d-bd10-5b28a238cc72
status: test
level: informational
author: Daniil Yugoslavskiy, oscd.community, CheraghiMilad
description: 'Detects usage of system utilities such as "find", "tree", "findmnt",
    etc, to discover files, directories and network shares.

    '
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1083/T1083.md
falsepositives:
    - Legitimate activities
tags:
    - attack.discovery
    - attack.t1083
date: '2020-10-19'
modified: '2024-12-01'
logsource:
    category: process_creation
    product: linux
detection:
    selection_file_with_asterisk:
        Image|endswith: /file
        CommandLine|re: (.){200,}
    selection_recursive_ls:
        Image|endswith: /ls
        CommandLine|contains: -R
    selection_find_execution:
        Image|endswith: /find
    selection_tree_execution:
        Image|endswith: /tree
    selection_findmnt_execution:
        Image|endswith: /findmnt
    selection_locate_execution:
        Image|endswith: /mlocate
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:05.239802+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:05.239802+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:36:05.239882+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:36:05.239890+00:00'
