title: User Added To Highly Privileged Group
id: 10fb649c-3600-4d37-b1e6-56ea90bb7e09
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects addition of users to highly privileged groups via "Net" or "Add-LocalGroupMember".
references:
    - https://www.huntress.com/blog/slashandgrab-screen-connect-post-exploitation-in-the-wild-cve-2024-1709-cve-2024-1708
falsepositives:
    - Administrative activity that must be investigated
tags:
    - attack.persistence
    - attack.t1098
date: '2024-02-23'
logsource:
    category: process_creation
    product: windows
detection:
    selection_main:
        CommandLine|contains|all:
            - 'localgroup '
            - ' /add'
            - 'Add-LocalGroupMember '
            - ' -Group '
    selection_group:
        CommandLine|contains:
            - Group Policy Creator Owners
            - Schema Admins
    condition: all of selection_*
related:
    -   id: ffa28e60-bdb1-46e0-9f82-05f7a61cc06e
        type: similar
    -   id: ad720b90-25ad-43ff-9b5e-5c841facc8e5
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:47:17.825555+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:47:17.825555+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:47:17.825571+00:00'
