title: Suspicious Reconnaissance Activity Via GatherNetworkInfo.VBS
id: 07aa184a-870d-413d-893a-157f317f6f58
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects execution of the built-in script located in "C:\Windows\System32\gatherNetworkInfo.vbs".
    Which can be used to gather information about the target machine
references:
    - https://posts.slayerlabs.com/living-off-the-land/#gathernetworkinfovbs
    - https://www.mandiant.com/resources/blog/trojanized-windows-installers-ukrainian-government
falsepositives:
    - Unknown
tags:
    - attack.discovery
    - attack.execution
    - attack.t1615
    - attack.t1059.005
date: '2023-02-08'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains: gatherNetworkInfo.vbs
    filter:
        Image|endswith:
            - \cscript.exe
            - \wscript.exe
    condition: selection and not filter
related:
    -   id: f92a6f1e-a512-4a15-9735-da09e78d7273
        type: similar
    -   id: 575dce0c-8139-4e30-9295-1ee75969f7fe
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:45:07.063715+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:45:07.063715+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:45:07.063727+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:45:07.063728+00:00'
