id: ffa6861c-4461-4f59-8a41-578c39f3f23e
title: LSASS Dump Keyword In CommandLine
status: test
level: high
description: 'Detects the presence of the keywords "lsass" and ".dmp" in the commandline,
    which could indicate a potential attempt to dump or create a dump of the lsass
    process.

    '
author: E.M. Anhaus, Tony Lambert, oscd.community, Nasreddine Bencherchali (Nextron
    Systems)
date: '2019-10-24'
modified: '2023-08-29'
tags:
    - attack.credential-access
    - attack.t1003.001
references:
    - https://github.com/Hackndo/lsassy
    - https://medium.com/@markmotig/some-ways-to-dump-lsass-exe-c4a75fdc49bf
    - https://github.com/elastic/detection-rules/blob/c76a39796972ecde44cb1da6df47f1b6562c9770/rules/windows/credential_access_lsass_memdump_file_created.toml
    - https://www.whiteoaksecurity.com/blog/attacks-defenses-dumping-lsass-no-mimikatz/
    - https://github.com/helpsystems/nanodump
    - https://github.com/CCob/MirrorDump
falsepositives:
    - Unlikely
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''a5a2d357-1ab8-4675-a967-ef9990a59391''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - lsass.dmp
            - lsass.zip
            - lsass.rar
            - Andrew.dmp
            - Coredump.dmp
            - NotLSASS.zip
            - lsass_2
            - lsassdump
            - lsassdmp
        CommandLine|contains|all:
            - lsass
            - .dmp
            - SQLDmpr
            - .mdmp
            - nanodump
            - .dmp
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:58.250021+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:58.250021+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:58.250028+00:00'
