title: Potential Renamed Rundll32 Execution
id: 2569ed8c-1147-498a-9b8c-2ad3656b10ed
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects when 'DllRegisterServer' is called in the commandline and the
    image is not rundll32. This could mean that the 'rundll32' utility has been renamed
    in order to avoid detection
references:
    - https://twitter.com/swisscom_csirt/status/1331634525722521602?s=20
    - https://app.any.run/tasks/f74c5157-8508-4ac6-9805-d63fe7b0d399/
falsepositives:
    - Unlikely
tags:
    - attack.execution
date: '2022-08-22'
modified: '2023-02-03'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains: DllRegisterServer
    filter:
        Image|endswith: \rundll32.exe
    condition: selection and not filter
related:
    -   id: 0ba1da6d-b6ce-4366-828c-18826c9de23e
        type: derived
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:08.688107+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:08.688107+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:44:08.688126+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:44:08.688127+00:00'
