title: Potential Hidden Directory Creation Via NTFS INDEX_ALLOCATION Stream - CLI
id: 0900463c-b33b-49a8-be1d-552a3b553dae
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems), Scoubi (@ScoubiMtl)
description: 'Detects command line containing reference to the "::$index_allocation"
    stream, which can be used as a technique to prevent access to folders or files
    from tooling such as "explorer.exe" or "powershell.exe"

    '
references:
    - https://twitter.com/pfiatde/status/1681977680688738305
    - https://soroush.me/blog/2010/12/a-dotty-salty-directory-a-secret-place-in-ntfs-for-secret-files/
    - https://sec-consult.com/blog/detail/pentesters-windows-ntfs-tricks-collection/
    - https://github.com/redcanaryco/atomic-red-team/blob/5c3b23002d2bbede3c07e7307165fc2a235a427d/atomics/T1564.004/T1564.004.md#atomic-test-5---create-hidden-directory-via-index_allocation
    - https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-fscc/c54dec26-1551-4d3a-a0ea-4fa40f848eb3
falsepositives:
    - Unlikely
tags:
    - attack.defense-evasion
    - attack.t1564.004
date: '2023-10-09'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains: ::$index_allocation
    condition: selection
related:
    -   id: a8f866e1-bdd4-425e-a27a-37619238d9c7
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:14.623263+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:14.623263+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:44:14.623273+00:00'
