id: 0152550d-3a26-4efd-9f0e-54a0b28ae2f3
title: Detection of PowerShell Execution via Sqlps.exe
status: test
level: medium
description: 'This rule detects execution of a PowerShell code through the sqlps.exe
    utility, which is included in the standard set of utilities supplied with the
    MSSQL Server.

    Script blocks are not logged in this case, so this utility helps to bypass protection
    mechanisms based on the analysis of these logs.

    '
author: Agro (@agro_sev) oscd.community
date: '2020-10-10'
modified: '2022-12-09'
tags:
    - attack.execution
    - attack.t1059.001
    - attack.defense-evasion
    - attack.t1127
references:
    - https://learn.microsoft.com/en-us/sql/tools/sqlps-utility?view=sql-server-ver15
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Sqlps/
    - https://twitter.com/bryon_/status/975835709587075072
falsepositives:
    - Direct PS command execution through SQLPS.exe is uncommon, childprocess sqlps.exe
        spawned by sqlagent.exe is a legitimate action.
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|endswith: \sqlps.exe
    selection_image:
        Image|endswith: \sqlps.exe
        OriginalFileName: sqlps.exe
    filter_image:
        ParentImage|endswith: \sqlagent.exe
    condition: selection_parent or (selection_image and not filter_image)
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:32:02.736863+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:32:02.736863+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:32:02.736887+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:32:02.736889+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:32:02.736892+00:00'
