id: 1e0e1a81-e79b-44bc-935b-ddb9c8006b3d
title: Potential Script Proxy Execution Via CL_Mutexverifiers.ps1
status: test
level: medium
description: Detects the use of the Microsoft signed script "CL_mutexverifiers" to
    proxy the execution of additional PowerShell script commands
author: Nasreddine Bencherchali (Nextron Systems), oscd.community, Natalia Shornikova,
    frack113
date: '2022-05-21'
modified: '2023-08-17'
tags:
    - attack.defense-evasion
    - attack.t1216
references:
    - https://lolbas-project.github.io/lolbas/Scripts/CL_mutexverifiers/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_pwsh:
        ParentImage|endswith:
            - \powershell.exe
            - \pwsh.exe
        Image|endswith: \powershell.exe
        CommandLine|contains: ' -nologo -windowstyle minimized -file '
    selection_temp:
        CommandLine|contains:
            - \AppData\Local\Temp\
            - \Windows\Temp\
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:33.268233+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:33.268233+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:33.268243+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:33.268245+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:33.268246+00:00'
