title: Potentially Over Permissive Permissions Granted Using Dsacls.EXE
id: 01c42d3c-242d-4655-85b2-34f1739632f7
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects usage of Dsacls to grant over permissive permissions
references:
    - https://ss64.com/nt/dsacls.html
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc771151(v=ws.11)
falsepositives:
    - Legitimate administrators granting over permissive permissions to users
tags:
    - attack.defense-evasion
    - attack.t1218
date: '2022-06-20'
modified: '2023-02-04'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \dsacls.exe
        OriginalFileName: DSACLS.EXE
    selection_flag:
        CommandLine|contains: ' /G '
    selection_permissions:
        CommandLine|contains:
            - GR
            - GE
            - GW
            - GA
            - WP
            - WD
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:42.706719+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:42.706719+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:44:42.706734+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:44:42.706736+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:44:42.706739+00:00'
