id: aa3a6f94-890e-4e22-b634-ffdfd54792cc
title: Suspicious Binary In User Directory Spawned From Office Application
status: test
level: high
description: Detects an executable in the users directory started from one of the
    Microsoft Office suite applications (Word, Excel, PowerPoint, Publisher, Visio)
author: Jason Lynch
date: '2019-04-02'
modified: '2023-02-04'
tags:
    - attack.execution
    - attack.t1204.002
    - attack.g0046
    - car.2013-05-002
references:
    - https://blog.morphisec.com/fin7-not-finished-morphisec-spots-new-campaign
    - https://www.virustotal.com/gui/file/23160972c6ae07f740800fa28e421a81d7c0ca5d5cab95bc082b4a986fbac57
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith:
            - \WINWORD.EXE
            - \EXCEL.EXE
            - \POWERPNT.exe
            - \MSPUB.exe
            - \VISIO.exe
            - \MSACCESS.exe
            - \EQNEDT32.exe
        Image|startswith: C:\users\
        Image|endswith: .exe
    filter:
        Image|endswith: \Teams.exe
    condition: selection and not filter
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:33:24.551128+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:33:24.551128+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:33:24.551146+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:33:24.551148+00:00'
