title: Suspicious Child Process of AspNetCompiler
id: 9ccba514-7cb6-4c5c-b377-700758f2f120
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects potentially suspicious child processes of "aspnet_compiler.exe".
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Aspnet_Compiler/
    - https://ijustwannared.team/2020/08/01/the-curious-case-of-aspnet_compiler-exe/
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1127
date: '2023-08-14'
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|endswith: \aspnet_compiler.exe
    selection_child:
        Image|endswith:
            - \calc.exe
            - \notepad.exe
        Image|contains:
            - \Users\Public\
            - \AppData\Local\Temp\
            - \AppData\Local\Roaming\
            - :\Temp\
            - :\Windows\Temp\
            - :\Windows\System32\Tasks\
            - :\Windows\Tasks\
    condition: all of selection_*
related:
    -   id: 4c7f49ee-2638-43bb-b85b-ce676c30b260
        type: similar
    -   id: 9f50fe98-fe5c-4a2d-86c7-fad7f63ed622
        type: similar
    -   id: a01b8329-5953-4f73-ae2d-aa01e1f35f00
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:45:23.799060+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:45:23.799060+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:45:23.799073+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:45:23.799074+00:00'
