title: Conhost.exe CommandLine Path Traversal
id: ee5e119b-1f75-4b34-add8-3be976961e39
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: detects the usage of path traversal in conhost.exe indicating possible
    command/argument confusion/hijacking
references:
    - https://pentestlab.blog/2020/07/06/indirect-command-execution/
falsepositives:
    - Unlikely
tags:
    - attack.execution
    - attack.t1059.003
date: '2022-06-14'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentCommandLine|contains: conhost
        CommandLine|contains: /../../
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:47:53.976676+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:47:53.976676+00:00'
    detection_fields:
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-12-04T01:47:53.976698+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:47:53.976700+00:00'
