title: Suspicious Child Process Of Wermgr.EXE
id: 396f6630-f3ac-44e3-bfc8-1b161bc00c4e
status: experimental
level: high
author: Florian Roth (Nextron Systems)
description: Detects suspicious Windows Error Reporting manager (wermgr.exe) child
    process
references:
    - https://www.trendmicro.com/en_us/research/22/j/black-basta-infiltrates-networks-via-qakbot-brute-ratel-and-coba.html
    - https://www.echotrail.io/insights/search/wermgr.exe
    - https://github.com/binderlabs/DirCreate2System
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1055
    - attack.t1036
date: '2022-10-14'
modified: '2024-08-29'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \wermgr.exe
        Image|endswith:
            - \cmd.exe
            - \cscript.exe
            - \ipconfig.exe
            - \mshta.exe
            - \net.exe
            - \net1.exe
            - \netstat.exe
            - \nslookup.exe
            - \powershell_ise.exe
            - \powershell.exe
            - \pwsh.exe
            - \regsvr32.exe
            - \rundll32.exe
            - \systeminfo.exe
            - \whoami.exe
            - \wscript.exe
    filter_main_rundll32:
        Image|endswith: \rundll32.exe
        CommandLine|contains|all:
            - C:\Windows\system32\WerConCpl.dll
            - 'LaunchErcApp '
        CommandLine|contains:
            - -queuereporting
            - -responsepester
    condition: selection and not 1 of filter_main_*
related:
    -   id: 5394fcc7-aeb2-43b5-9a09-cac9fc5edcd5
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:49:49.075421+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:49:49.075421+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:49:49.075434+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:49:49.075437+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:49:49.075438+00:00'
