id: 84232095-ecca-4015-b0d7-7726507ee793
title: Suspicious DLL Loaded via CertOC.EXE
status: test
level: high
description: Detects when a user installs certificates by using CertOC.exe to load
    the target DLL file.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-02-15'
modified: '2024-03-05'
tags:
    - attack.defense-evasion
    - attack.t1218
references:
    - https://twitter.com/sblmsrsn/status/1445758411803480072?s=20
    - https://github.com/elastic/protections-artifacts/commit/746086721fd385d9f5c6647cada1788db4aea95f#diff-fe98e74189873d6df72a15df2eaa0315c59ba9cdaca93ecd68afc4ea09194ef2
    - https://lolbas-project.github.io/lolbas/Binaries/Certoc/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''242301bc-f92f-4476-8718-78004a6efd9f''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \certoc.exe
        OriginalFileName: CertOC.exe
    selection_cli:
        CommandLine|contains|windash: ' -LoadDLL '
    selection_paths:
        CommandLine|contains:
            - \Appdata\Local\Temp\
            - \Desktop\
            - \Downloads\
            - \Users\Public\
            - C:\Windows\Tasks\
            - C:\Windows\Temp\
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:24.102012+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:24.102012+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:24.102022+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:24.102024+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:24.102025+00:00'
