title: Windows Hotfix Updates Reconnaissance Via Wmic.EXE
id: dfd2fcb7-8bd5-4daa-b132-5adb61d6ad45
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects the execution of wmic with the "qfe" flag in order to obtain
    information about installed hotfix updates on the system. This is often used by
    pentester and attacker enumeration scripts
references:
    - https://github.com/carlospolop/PEASS-ng/blob/fa0f2e17fbc1d86f1fd66338a40e665e7182501d/winPEAS/winPEASbat/winPEAS.bat
    - https://sushant747.gitbooks.io/total-oscp-guide/content/privilege_escalation_windows.html
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1047
date: '2022-06-20'
modified: '2023-02-14'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        OriginalFileName: wmic.exe
        Image|endswith: \WMIC.exe
    selection_cli:
        CommandLine|contains: ' qfe'
    condition: all of selection*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:43:04.579100+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:43:04.579100+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:43:04.579116+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:43:04.579118+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:43:04.579119+00:00'
