id: 39b31e81-5f5f-4898-9c0e-2160cfc0f9bf
title: HackTool - Hashcat Password Cracker Execution
status: test
level: high
description: Execute Hashcat.exe with provided SAM file from registry of Windows and
    Password list to crack against
author: frack113
date: '2021-12-27'
modified: '2023-02-04'
tags:
    - attack.credential-access
    - attack.t1110.002
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1110.002/T1110.002.md#atomic-test-1---password-cracking-with-hashcat
    - https://hashcat.net/wiki/doku.php?id=hashcat
falsepositives:
    - Tools that use similar command line flags and values
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \hashcat.exe
    selection_cli:
        CommandLine|contains|all:
            - '-a '
            - '-m 1000 '
            - '-r '
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:55.502840+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:55.502840+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:55.502849+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:55.502853+00:00'
