title: Potentially Suspicious Child Process Of ClickOnce Application
id: 67bc0e75-c0a9-4cfc-8754-84a505b63c04
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects potentially suspicious child processes of a ClickOnce deployment
    application
references:
    - https://posts.specterops.io/less-smartscreen-more-caffeine-ab-using-clickonce-for-trusted-code-execution-1446ea8051c5
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.defense-evasion
date: '2023-06-12'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|contains: \AppData\Local\Apps\2.0\
        Image|endswith:
            - \calc.exe
            - \cmd.exe
            - \cscript.exe
            - \explorer.exe
            - \mshta.exe
            - \net.exe
            - \net1.exe
            - \nltest.exe
            - \notepad.exe
            - \powershell.exe
            - \pwsh.exe
            - \reg.exe
            - \regsvr32.exe
            - \rundll32.exe
            - \schtasks.exe
            - \werfault.exe
            - \wscript.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:47:03.113706+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:47:03.113706+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:47:03.113720+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:47:03.113722+00:00'
