id: 98dedfdd-8333-49d4-9f23-d7018cccae53
title: Enable LM Hash Storage - ProcCreation
status: test
level: high
description: 'Detects changes to the "NoLMHash" registry value in order to allow Windows
    to store LM Hashes.

    By setting this registry value to "0" (DWORD), Windows will be allowed to store
    a LAN manager hash of your password in Active Directory and local SAM databases.

    '
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-12-15'
modified: '2023-12-22'
tags:
    - attack.defense-evasion
    - attack.t1112
references:
    - https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-347a
    - https://learn.microsoft.com/en-us/troubleshoot/windows-server/windows-security/prevent-windows-store-lm-hash-password
    - https://www.sans.org/blog/protecting-privileged-domain-accounts-lm-hashes-the-good-the-bad-and-the-ugly/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''c420410f-c2d8-4010-856b-dffe21866437''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - \System\CurrentControlSet\Control\Lsa
            - NoLMHash
            - ' 0'
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:31:22.338876+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:31:22.338876+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:31:22.338890+00:00'
