id: 148431ce-4b70-403d-8525-fcc2993f29ea
title: Potential DLL Injection Or Execution Using Tracker.exe
status: test
level: medium
description: Detects potential DLL injection and execution using "Tracker.exe"
author: Avneet Singh @v3t0_, oscd.community
date: '2020-10-18'
modified: '2023-01-09'
tags:
    - attack.defense-evasion
    - attack.t1055.001
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Tracker/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \tracker.exe
        Description: Tracker
    selection_cli:
        CommandLine|contains:
            - ' /d '
            - ' /c '
    filter_msbuild1:
        CommandLine|contains: ' /ERRORREPORT:PROMPT '
    filter_msbuild2:
        ParentImage|endswith:
            - \Msbuild\Current\Bin\MSBuild.exe
            - \Msbuild\Current\Bin\amd64\MSBuild.exe
    condition: all of selection_* and not 1 of filter_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:57.088509+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:57.088509+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:57.088525+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: message
            mapped_at: '2025-11-13T20:20:57.088528+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:57.088530+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:57.088532+00:00'
