id: 9082ff1f-88ab-4678-a3cc-5bcff99fc74d
title: HackTool - GMER Rootkit Detector and Remover Execution
status: test
level: high
description: Detects the execution GMER tool based on image and hash fields.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-10-05'
modified: '2024-11-23'
tags:
    - attack.defense-evasion
references:
    - http://www.gmer.net/
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \gmer.exe
    selection_sysmon_hash:
        Hashes|contains:
            - MD5=E9DC058440D321AA17D0600B3CA0AB04
            - SHA1=539C228B6B332F5AA523E5CE358C16647D8BBE57
            - SHA256=E8A3E804A96C716A3E9B69195DB6FFB0D33E2433AF871E4D4E1EAB3097237173
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:35.502012+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:35.502012+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:35.502022+00:00'
        -   source_field: Hashes
            target_table: process_activity
            target_field: process.file.hashes.value
            mapped_at: '2025-11-13T20:20:35.502025+00:00'
