title: Suspicious NTLM Authentication on the Printer Spooler Service
id: bb76d96b-821c-47cf-944b-7ce377864492
status: test
level: high
author: Elastic (idea), Tobias Michalski (Nextron Systems)
description: Detects a privilege elevation attempt by coercing NTLM authentication
    on the Printer Spooler service
references:
    - https://twitter.com/med0x2e/status/1520402518685200384
    - https://github.com/elastic/detection-rules/blob/dd224fb3f81d0b4bf8593c5f02a029d647ba2b2d/rules/windows/credential_access_relay_ntlm_auth_via_http_spoolss.toml
falsepositives:
    - Unknown
tags:
    - attack.privilege-escalation
    - attack.credential-access
    - attack.t1212
date: '2022-05-04'
modified: '2023-02-09'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \rundll32.exe
        OriginalFileName: RUNDLL32.EXE
    selection_cli:
        CommandLine|contains|all:
            - C:\windows\system32\davclnt.dll,DavSetCookie
            - http
        CommandLine|contains:
            - spoolss
            - srvsvc
            - /print/pipe/
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:48:11.454326+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:48:11.454326+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:48:11.454344+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:48:11.454346+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:48:11.454347+00:00'
