id: 9691f58d-92c1-4416-8bf3-2edd753ec9cf
title: ESXi Admin Permission Assigned To Account Via ESXCLI
status: test
level: high
description: Detects execution of the "esxcli" command with the "system" and "permission"
    flags in order to assign admin permissions to an account.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-09-04'
tags:
    - attack.execution
references:
    - https://developer.broadcom.com/xapis/esxcli-command-reference/7.0.0/namespace/esxcli_system.html
falsepositives:
    - Legitimate administration activities
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith: /esxcli
        CommandLine|contains: system
        CommandLine|contains|all:
            - ' permission '
            - ' set'
            - Admin
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:15:51.717061+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-13T20:15:51.717061+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:15:51.717067+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:15:51.717068+00:00'
