id: b2815d0d-7481-4bf0-9b6c-a4c48a94b349
title: PowerShell Get-Process LSASS
status: test
level: high
description: Detects a "Get-Process" cmdlet and it's aliases on lsass process, which
    is in almost all cases a sign of malicious activity
author: Florian Roth (Nextron Systems)
date: '2021-04-23'
modified: '2023-01-05'
tags:
    - attack.credential-access
    - attack.t1552.004
references:
    - https://web.archive.org/web/20220205033028/https://twitter.com/PythonResponder/status/1385064506049630211
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - Get-Process lsas
            - ps lsas
            - gps lsas
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:37:07.799274+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:37:07.799274+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:37:07.799290+00:00'
