title: Potential SquiblyTwo Technique Execution
id: 8d63dadf-b91b-4187-87b6-34a1114577ea
status: test
level: medium
author: Markus Neis, Florian Roth
description: Detects potential SquiblyTwo attack technique with possible renamed WMIC
    via Imphash and OriginalFileName fields
references:
    - https://web.archive.org/web/20190209154607/https://subt0x11.blogspot.com/2018/04/wmicexe-whitelisting-bypass-hacking.html
    - https://twitter.com/mattifestation/status/986280382042595328
    - https://atomicredteam.io/defense-evasion/T1220/
    - https://lolbas-project.github.io/lolbas/Binaries/Wmic/
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1047
    - attack.t1220
    - attack.execution
    - attack.t1059.005
    - attack.t1059.007
date: '2019-01-16'
modified: '2024-11-23'
logsource:
    category: process_creation
    product: windows
detection:
    selection_pe:
        Image|endswith: \wmic.exe
        OriginalFileName: wmic.exe
        Hashes|contains:
            - IMPHASH=1B1A3F43BF37B5BFE60751F2EE2F326E
            - IMPHASH=37777A96245A3C74EB217308F3546F4C
            - IMPHASH=9D87C9D67CE724033C0B40CC4CA1B206
    selection_cli:
        CommandLine|contains|all:
            - 'format:'
            - http
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:43:43.964554+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:43:43.964554+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:43:43.964578+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:43:43.964580+00:00'
        -   source_field: Hashes
            target_table: process_activity
            target_field: process.file.hashes.value
            mapped_at: '2025-12-04T01:43:43.964582+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:43:43.964583+00:00'
