title: Potential SMB Relay Attack Tool Execution
id: 5589ab4f-a767-433c-961d-c91f3f704db1
status: test
level: critical
author: Florian Roth (Nextron Systems)
description: Detects different hacktools used for relay attacks on Windows for privilege
    escalation
references:
    - https://foxglovesecurity.com/2016/09/26/rotten-potato-privilege-escalation-from-service-accounts-to-system/
    - https://pentestlab.blog/2017/04/13/hot-potato/
    - https://github.com/ohpe/juicy-potato
    - https://hunter2.gitbook.io/darthsidious/other/war-stories/domain-admin-in-30-minutes
    - https://hunter2.gitbook.io/darthsidious/execution/responder-with-ntlm-relay-and-empire
    - https://www.localpotato.com/
falsepositives:
    - Legitimate files with these rare hacktool names
tags:
    - attack.execution
    - attack.t1557.001
date: '2021-07-24'
modified: '2023-02-14'
logsource:
    category: process_creation
    product: windows
detection:
    selection_pe:
        Image|contains:
            - PetitPotam
            - RottenPotato
            - HotPotato
            - JuicyPotato
            - \just_dce_
            - Juicy Potato
            - \temp\rot.exe
            - \Potato.exe
            - \SpoolSample.exe
            - \Responder.exe
            - \smbrelayx
            - \ntlmrelayx
            - \LocalPotato
    selection_script:
        CommandLine|contains:
            - Invoke-Tater
            - ' smbrelay'
            - ' ntlmrelay'
            - 'cme smb '
            - ' /ntlm:NTLMhash '
            - Invoke-PetitPotam
            - '.exe -t * -p '
    selection_juicypotato_enum:
        CommandLine|contains: .exe -c "{
        CommandLine|endswith: '}" -z'
    filter_hotpotatoes:
        Image|contains:
            - HotPotatoes6
            - HotPotatoes7
            - 'HotPotatoes '
    condition: 1 of selection_* and not 1 of filter_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:43:29.574557+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:43:29.574557+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:43:29.574590+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:43:29.574594+00:00'
