title: Group Has Been Deleted Via Groupdel
id: 8a46f16c-8c4c-82d1-b121-0fdd3ba70a84
status: test
level: medium
author: Tuan Le (NCSGroup)
description: Detects execution of the "groupdel" binary. Which is used to delete a
    group. This is sometimes abused by threat actors in order to cover their tracks
references:
    - https://linuxize.com/post/how-to-delete-group-in-linux/
    - https://www.cyberciti.biz/faq/linux-remove-user-command/
    - https://www.cybrary.it/blog/0p3n/linux-commands-used-attackers/
    - https://linux.die.net/man/8/groupdel
falsepositives:
    - Legitimate administrator activities
tags:
    - attack.impact
    - attack.t1531
date: '2022-12-26'
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith: /groupdel
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:46.656094+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:46.656094+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:36:46.656160+00:00'
