id: 754ed792-634f-40ae-b3bc-e0448d33f695
title: Suspicious PowerShell Parent Process
status: test
level: high
description: Detects a suspicious or uncommon parent processes of PowerShell
author: Teymur Kheirkhabarov, Harish Segar
date: '2020-03-20'
modified: '2023-02-04'
tags:
    - attack.execution
    - attack.t1059.001
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=26
falsepositives:
    - Other scripts
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''692f0bec-83ba-4d04-af7e-e884a96059b6''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|contains: tomcat
        ParentImage|endswith:
            - \amigo.exe
            - \browser.exe
            - \chrome.exe
            - \firefox.exe
            - \httpd.exe
            - \iexplore.exe
            - \jbosssvc.exe
            - \microsoftedge.exe
            - \microsoftedgecp.exe
            - \MicrosoftEdgeSH.exe
            - \mshta.exe
            - \nginx.exe
            - \outlook.exe
            - \php-cgi.exe
            - \regsvr32.exe
            - \rundll32.exe
            - \safari.exe
            - \services.exe
            - \sqlagent.exe
            - \sqlserver.exe
            - \sqlservr.exe
            - \vivaldi.exe
            - \w3wp.exe
    selection_powershell:
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
        CommandLine|contains:
            - /c powershell
            - /c pwsh
        Description: Windows PowerShell
        Product: PowerShell Core 6
        OriginalFileName:
            - PowerShell.EXE
            - pwsh.dll
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:25:55.653393+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:25:55.653393+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:25:55.653439+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:25:55.653443+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:25:55.653446+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: device.desc
            mapped_at: '2025-11-26T02:25:55.653449+00:00'
        -   source_field: Product
            target_table: process_activity
            target_field: metadata.product.name
            mapped_at: '2025-11-26T02:25:55.653452+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:25:55.653454+00:00'
