title: Suspicious Service DACL Modification Via Set-Service Cmdlet
id: a95b9b42-1308-4735-a1af-abb1c5e6f5ac
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects suspicious DACL modifications via the "Set-Service" cmdlet using
    the "SecurityDescriptorSddl" flag (Only available with PowerShell 7) that can
    be used to hide services or make them unstopable
references:
    - https://www.sans.org/blog/red-team-tactics-hiding-windows-services/
    - https://learn.microsoft.com/pt-br/windows/win32/secauthz/sid-strings
falsepositives:
    - Unknown
tags:
    - attack.persistence
    - attack.t1543.003
date: '2022-10-18'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \pwsh.exe
        OriginalFileName: pwsh.dll
    selection_sddl_flag:
        CommandLine|contains:
            - '-SecurityDescriptorSddl '
            - '-sd '
    selection_set_service:
        CommandLine|contains|all:
            - 'Set-Service '
            - D;;
        CommandLine|contains:
            - ;;;IU
            - ;;;SU
            - ;;;BA
            - ;;;SY
            - ;;;WD
    condition: all of selection_*
related:
    -   id: 99cf1e02-00fb-4c0d-8375-563f978dfd37
        type: derived
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:41:33.792171+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:41:33.792171+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:41:33.792307+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:41:33.792320+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:41:33.792324+00:00'
