id: 6120ac2a-a34b-42c0-a9bd-1fb9f459f348
title: AddinUtil.EXE Execution From Uncommon Directory
status: test
level: medium
description: Detects execution of the Add-In deployment cache updating utility (AddInutil.exe)
    from a non-standard directory.
author: Michael McKinley (@McKinleyMike), Tony Latteri (@TheLatteri)
date: '2023-09-18'
tags:
    - attack.defense-evasion
    - attack.t1218
references:
    - https://www.blue-prints.blog/content/blog/posts/lolbin/addinutil-lolbas.html
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \addinutil.exe
        OriginalFileName: AddInUtil.exe
    filter_main_legit_location:
        Image|contains:
            - :\Windows\Microsoft.NET\Framework\
            - :\Windows\Microsoft.NET\Framework64\
            - :\Windows\WinSxS\
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:33:46.268058+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:33:46.268058+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:33:46.268071+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:33:46.268073+00:00'
