id: 536e2947-3729-478c-9903-745aaffe60d2
title: Suspicious PowerShell Invocations - Specific - ProcessCreation
status: test
level: medium
description: Detects suspicious PowerShell invocation command parameters
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-01-05'
tags:
    - attack.defense-evasion
references:
    - Internal Research
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''fce5f582-cc00-41e1-941a-c6fabf0fdb8c''),
    type=<SigmaRelatedType.OBSOLETE: 4>), SigmaRelatedItem(id=UUID(''ae7fbf8e-f3cb-49fd-8db4-5f3bed522c71''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''8ff28fdd-e2fa-4dfa-aeda-ef3d61c62090''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_convert_b64:
        CommandLine|contains|all:
            - -nop
            - ' -w '
            - hidden
            - ' -c '
            - '[Convert]::FromBase64String'
    selection_iex:
        CommandLine|contains|all:
            - ' -w '
            - hidden
            - -noni
            - -nop
            - ' -c '
            - iex
            - New-Object
    selection_enc:
        CommandLine|contains|all:
            - ' -w '
            - hidden
            - -ep
            - bypass
            - -Enc
    selection_reg:
        CommandLine|contains|all:
            - powershell
            - reg
            - add
            - \software\
    selection_webclient:
        CommandLine|contains|all:
            - bypass
            - -noprofile
            - -windowstyle
            - hidden
            - new-object
            - system.net.webclient
            - .download
    selection_iex_webclient:
        CommandLine|contains|all:
            - iex
            - New-Object
            - Net.WebClient
            - .Download
    filter_chocolatey:
        CommandLine|contains:
            - (New-Object System.Net.WebClient).DownloadString('https://community.chocolatey.org/install.ps1
            - Write-ChocolateyWarning
    condition: 1 of selection_* and not 1 of filter_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:38.088289+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:38.088289+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:38.088293+00:00'
