title: Deletion of Volume Shadow Copies via WMI with PowerShell
id: 21ff4ca9-f13a-41ad-b828-0077b2af2e40
status: test
level: high
author: Tim Rauch, Elastic (idea)
description: Detects deletion of Windows Volume Shadow Copies with PowerShell code
    and Get-WMIObject. This technique is used by numerous ransomware families such
    as Sodinokibi/REvil
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md#atomic-test-5---windows---delete-volume-shadow-copies-via-wmi-with-powershell
    - https://www.elastic.co/guide/en/security/current/volume-shadow-copy-deletion-via-powershell.html
falsepositives:
    - Unknown
tags:
    - attack.impact
    - attack.t1490
date: '2022-09-20'
modified: '2022-12-30'
logsource:
    category: process_creation
    product: windows
detection:
    selection_get:
        CommandLine|contains:
            - Get-WmiObject
            - gwmi
            - Get-CimInstance
            - gcim
    selection_shadowcopy:
        CommandLine|contains: Win32_ShadowCopy
    selection_delete:
        CommandLine|contains:
            - .Delete()
            - Remove-WmiObject
            - rwmi
            - Remove-CimInstance
            - rcim
    condition: all of selection*
related:
    -   id: e17121b4-ef2a-4418-8a59-12fb1631fa9e
        type: derived
    -   id: c1337eb8-921a-4b59-855b-4ba188ddcc42
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:46:52.541196+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:46:52.541196+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:46:52.541279+00:00'
