id: 43103702-5886-11ed-9b6a-0242ac120002
title: Suspicious Vsls-Agent Command With AgentExtensionPath Load
status: test
level: medium
description: Detects Microsoft Visual Studio vsls-agent.exe lolbin execution with
    a suspicious library load using the --agentExtensionPath parameter
author: bohops
date: '2022-10-30'
tags:
    - attack.defense-evasion
    - attack.t1218
references:
    - https://twitter.com/bohops/status/1583916360404729857
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - False positives depend on custom use of vsls-agent.exe
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \vsls-agent.exe
        CommandLine|contains: --agentExtensionPath
    filter:
        CommandLine|contains: Microsoft.VisualStudio.LiveShare.Agent.
    condition: selection and not filter
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:36:12.353396+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:36:12.353396+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:36:12.353409+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:36:12.353411+00:00'
