title: Data Copied To Clipboard Via Clip.EXE
id: ddeff553-5233-4ae9-bbab-d64d2bd634be
status: test
level: low
author: frack113
description: Detects the execution of clip.exe in order to copy data to the clipboard.
    Adversaries may collect data stored in the clipboard from users copying information
    within or between applications.
references:
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/clip
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1115/T1115.md
falsepositives:
    - Unknown
tags:
    - attack.collection
    - attack.t1115
date: '2021-07-27'
modified: '2023-02-21'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \clip.exe
        OriginalFileName: clip.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:47:50.749377+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:47:50.749377+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:47:50.749388+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:47:50.749390+00:00'
