title: Potential AMSI Bypass Using NULL Bits
id: 92a974db-ab84-457f-9ec0-55db83d7a825
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects usage of special strings/null bits in order to potentially bypass
    AMSI functionalities
references:
    - https://github.com/r00t-3xp10it/hacking-material-books/blob/43cb1e1932c16ff1f58b755bc9ab6b096046853f/obfuscation/simple_obfuscation.md#amsi-bypass-using-null-bits-satoshi
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1562.001
date: '2023-01-04'
modified: '2023-05-09'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - if(0){{{0}}}' -f $(0 -as [char]) +
            - '#<NULL>'
    condition: selection
related:
    -   id: fa2559c8-1197-471d-9cdd-05a0273d4522
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:50:25.525772+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:50:25.525772+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:50:25.525786+00:00'
