title: Suspicious Execution via macOS Script Editor
id: 6e4dcdd1-e48b-42f7-b2d8-3b413fc58cb4
status: test
level: medium
author: Tim Rauch (rule), Elastic (idea)
description: Detects when the macOS Script Editor utility spawns an unusual child
    process.
references:
    - https://github.com/elastic/protections-artifacts/commit/746086721fd385d9f5c6647cada1788db4aea95f#diff-7f541fbc4a4a28a92970e8bf53effea5bd934604429112c920affb457f5b2685
    - https://wojciechregula.blog/post/macos-red-teaming-initial-access-via-applescript-url/
falsepositives:
    - Unknown
tags:
    - attack.t1566
    - attack.t1566.002
    - attack.initial-access
    - attack.t1059
    - attack.t1059.002
    - attack.t1204
    - attack.t1204.001
    - attack.execution
    - attack.persistence
    - attack.t1553
    - attack.defense-evasion
date: '2022-10-21'
modified: '2022-12-28'
logsource:
    category: process_creation
    product: macos
detection:
    selection_parent:
        ParentImage|endswith: /Script Editor
    selection_img:
        Image|endswith:
            - /curl
            - /bash
            - /sh
            - /zsh
            - /dash
            - /fish
            - /osascript
            - /mktemp
            - /chmod
            - /php
            - /nohup
            - /openssl
            - /plutil
            - /PlistBuddy
            - /xattr
            - /sqlite
            - /funzip
            - /popen
        Image|contains:
            - python
            - perl
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:34:36.858184+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-12-04T01:34:36.858184+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:34:36.858198+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:34:36.858200+00:00'
