title: Powershell Defender Exclusion
id: 17769c90-230e-488b-a463-e05c08e9d48f
status: test
level: medium
author: Florian Roth (Nextron Systems)
description: Detects requests to exclude files, folders or processes from Antivirus
    scanning using PowerShell cmdlets
references:
    - https://learn.microsoft.com/en-us/defender-endpoint/configure-process-opened-file-exclusions-microsoft-defender-antivirus
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
    - https://twitter.com/AdamTheAnalyst/status/1483497517119590403
falsepositives:
    - Possible Admin Activity
    - Other Cmdlets that may use the same parameters
tags:
    - attack.defense-evasion
    - attack.t1562.001
date: '2021-04-29'
modified: '2022-05-12'
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        CommandLine|contains:
            - 'Add-MpPreference '
            - 'Set-MpPreference '
    selection2:
        CommandLine|contains:
            - ' -ExclusionPath '
            - ' -ExclusionExtension '
            - ' -ExclusionProcess '
            - ' -ExclusionIpAddress '
    condition: all of selection*
related:
    -   id: c1344fa2-323b-4d2e-9176-84b4d4821c88
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:50:53.929508+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:50:53.929508+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:50:53.929529+00:00'
