id: 69483748-1525-4a6c-95ca-90dc8d431b68
title: Suspicious Microsoft Office Child Process - MacOS
status: test
level: high
description: Detects suspicious child processes spawning from microsoft office suite
    applications such as word or excel. This could indicates malicious macro execution
author: Sohan G (D4rkCiph3r)
date: '2023-01-31'
modified: '2023-02-04'
tags:
    - attack.execution
    - attack.persistence
    - attack.t1059.002
    - attack.t1137.002
    - attack.t1204.002
references:
    - https://redcanary.com/blog/applescript/
    - https://objective-see.org/blog/blog_0x4B.html
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: macos
detection:
    selection:
        ParentImage|contains:
            - Microsoft Word
            - Microsoft Excel
            - Microsoft PowerPoint
            - Microsoft OneNote
        Image|endswith:
            - /bash
            - /curl
            - /dash
            - /fish
            - /osacompile
            - /osascript
            - /sh
            - /zsh
            - /python
            - /python3
            - /wget
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:13:43.385793+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-11-26T02:13:43.385793+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:13:43.385807+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:13:43.385810+00:00'
