id: 21d856f9-9281-4ded-9377-51a1a6e2a432
title: Potential Persistence Via Logon Scripts - CommandLine
status: test
level: high
description: Detects the addition of a new LogonScript to the registry value "UserInitMprLogonScript"
    for potential persistence
author: Tom Ueltschi (@c_APT_ure)
date: '2019-01-12'
modified: '2023-06-09'
tags:
    - attack.persistence
    - attack.t1037.001
references:
    - https://cocomelonc.github.io/persistence/2022/12/09/malware-pers-20.html
falsepositives:
    - Legitimate addition of Logon Scripts via the command line by administrators
        or third party tools
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''0a98a10c-685d-4ab0-bddc-b6bdd1d48458''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains: UserInitMprLogonScript
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:42.435986+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:42.435986+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:42.436008+00:00'
