id: 725a9768-0f5e-4cb3-aec2-bc5719c6831a
title: Suspicious Where Execution
status: test
level: low
description: 'Adversaries may enumerate browser bookmarks to learn more about compromised
    hosts.

    Browser bookmarks may reveal personal information about users (ex: banking sites,
    interests, social media, etc.) as well as details about

    internal network resources such as servers, tools/dashboards, or other related
    infrastructure.

    '
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: '2021-12-13'
modified: '2022-06-29'
tags:
    - attack.discovery
    - attack.t1217
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1217/T1217.md
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    where_exe:
        Image|endswith: \where.exe
        OriginalFileName: where.exe
    where_opt:
        CommandLine|contains:
            - places.sqlite
            - cookies.sqlite
            - formhistory.sqlite
            - logins.json
            - key4.db
            - key3.db
            - sessionstore.jsonlz4
            - History
            - Bookmarks
            - Cookies
            - Login Data
    condition: all of where_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:26:40.745570+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:26:40.745570+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:26:40.745599+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:26:40.745603+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:26:40.745606+00:00'
