title: Potential Suspicious Browser Launch From Document Reader Process
id: 1193d960-2369-499f-a158-7b50a31df682
status: experimental
level: medium
author: Joseph Kamau
description: 'Detects when a browser process or browser tab is launched from an application
    that handles document files such as Adobe, Microsoft Office, etc. And connects
    to a web application over http(s), this could indicate a possible phishing attempt.

    '
references:
    - https://app.any.run/tasks/69c5abaa-92ad-45ba-8c53-c11e23e05d04/
    - https://app.any.run/tasks/64043a79-165f-4052-bcba-e6e49f847ec1/
falsepositives:
    - Unlikely in most cases, further investigation should be done in the commandline
        of the browser process to determine the context of the URL accessed.
tags:
    - attack.execution
    - attack.t1204.002
date: '2024-05-27'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|contains:
            - Acrobat Reader
            - Microsoft Office
            - PDF Reader
        Image|endswith:
            - \brave.exe
            - \chrome.exe
            - \firefox.exe
            - \msedge.exe
            - \opera.exe
            - \maxthon.exe
            - \seamonkey.exe
            - \vivaldi.exe
            - ''
        CommandLine|contains: http
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:50:19.121752+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:50:19.121752+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:50:19.121769+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:50:19.121771+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:50:19.121773+00:00'
