id: 69ca006d-b9a9-47f5-80ff-ecd4d25d481a
title: HackTool - TruffleSnout Execution
status: test
level: high
description: Detects the use of TruffleSnout.exe an iterative AD discovery toolkit
    for offensive operators, situational awareness and targeted low noise enumeration.
author: frack113
date: '2022-08-20'
modified: '2023-02-13'
tags:
    - attack.discovery
    - attack.t1482
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1482/T1482.md
    - https://github.com/dsnezhkov/TruffleSnout
    - https://github.com/dsnezhkov/TruffleSnout/blob/master/TruffleSnout/Docs/USAGE.md
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        OriginalFileName: TruffleSnout.exe
        Image|endswith: \TruffleSnout.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:30:25.806136+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:30:25.806136+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:30:25.806153+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:30:25.806155+00:00'
