title: Service Started/Stopped Via Wmic.EXE
id: 0b7163dc-7eee-4960-af17-c0cd517f92da
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects usage of wmic to start or stop a service
references:
    - https://sushant747.gitbooks.io/total-oscp-guide/content/privilege_escalation_windows.html
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1047
date: '2022-06-20'
modified: '2023-02-14'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        OriginalFileName: wmic.exe
        Image|endswith: \WMIC.exe
    selection_cli:
        CommandLine|contains|all:
            - ' service '
            - ' call '
        CommandLine|contains:
            - stopservice
            - startservice
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:46:55.156516+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:46:55.156516+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:46:55.156542+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:46:55.156545+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:46:55.156547+00:00'
