id: 3037d961-21e9-4732-b27a-637bcc7bf539
title: Suspicious High IntegrityLevel Conhost Legacy Option
status: test
level: informational
description: ForceV1 asks for information directly from the kernel space. Conhost
    connects to the console application. High IntegrityLevel means the process is
    running with elevated privileges, such as an Administrator context.
author: frack113
date: '2022-12-09'
modified: '2024-12-01'
tags:
    - attack.defense-evasion
    - attack.t1202
references:
    - https://cybercryptosec.medium.com/covid-19-cyber-infection-c615ead7c29
    - https://thedfirreport.com/2022/04/04/stolen-images-campaign-ends-in-conti-ransomware/
    - https://learn.microsoft.com/en-us/windows/win32/secauthz/mandatory-integrity-control
falsepositives:
    - Very Likely, including launching cmd.exe via Run As Administrator
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        IntegrityLevel:
            - High
            - S-1-16-12288
        CommandLine|contains|all:
            - conhost.exe
            - '0xffffffff'
            - -ForceV1
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:29:50.117161+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:29:50.117161+00:00'
    detection_fields:
        -   source_field: IntegrityLevel
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:29:50.117188+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:29:50.117193+00:00'
