id: 198effb6-6c98-4d0c-9ea3-451fa143c45c
title: Run Once Task Execution as Configured in Registry
status: test
level: low
description: This rule detects the execution of Run Once task as configured in the
    registry
author: Avneet Singh @v3t0_, oscd.community, Christopher Peacock @SecurePeacock (updated)
date: '2020-10-18'
modified: '2022-12-13'
tags:
    - attack.defense-evasion
    - attack.t1112
references:
    - https://twitter.com/pabraeken/status/990717080805789697
    - https://lolbas-project.github.io/lolbas/Binaries/Runonce/
    - https://twitter.com/0gtweet/status/1602644163824156672?s=20&t=kuxbUnZPltpvFPZdCrqPXA
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \runonce.exe
        Description: Run Once Wrapper
    selection_cli:
        CommandLine|contains: /AlternateShellStartup
        CommandLine|endswith: /r
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:26:08.022296+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:26:08.022296+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:26:08.022332+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: device.desc
            mapped_at: '2025-11-26T02:26:08.022337+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:26:08.022340+00:00'
