title: Capabilities Discovery - Linux
id: d8d97d51-122d-4cdd-9e2f-01b4b4933530
status: test
level: low
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects usage of "getcap" binary. This is often used during recon activity
    to determine potential binaries that can be abused as GTFOBins or other.
references:
    - https://github.com/SaiSathvik1/Linux-Privilege-Escalation-Notes
    - https://github.com/carlospolop/PEASS-ng
    - https://github.com/diego-treitos/linux-smart-enumeration
falsepositives:
    - Unknown
tags:
    - attack.discovery
    - attack.t1083
date: '2022-12-28'
modified: '2024-03-05'
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith: /getcap
        CommandLine|contains|windash: ' -r '
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:33.818755+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:33.818755+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:36:33.818774+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:36:33.818776+00:00'
