id: d557dc06-62e8-4468-a8e8-7984124908ce
title: HackTool - WinPwn Execution
status: test
level: high
description: 'Detects commandline keywords indicative of potential usge of the tool
    WinPwn. A tool for Windows and Active Directory reconnaissance and exploitation.

    '
author: Swachchhanda Shrawan Poudel
date: '2023-12-04'
tags:
    - attack.credential-access
    - attack.defense-evasion
    - attack.discovery
    - attack.execution
    - attack.privilege-escalation
    - attack.t1046
    - attack.t1082
    - attack.t1106
    - attack.t1518
    - attack.t1548.002
    - attack.t1552.001
    - attack.t1555
    - attack.t1555.003
references:
    - https://github.com/S3cur3Th1sSh1t/WinPwn
    - https://www.publicnow.com/view/EB87DB49C654D9B63995FAD4C9DE3D3CC4F6C3ED?1671634841
    - https://reconshell.com/winpwn-tool-for-internal-windows-pentesting-and-ad-security/
    - https://github.com/redcanaryco/atomic-red-team/blob/4d6c4e8e23d465af7a2388620cfe3f8c76e16cf0/atomics/T1082/T1082.md
    - https://grep.app/search?q=winpwn&filter[repo][0]=redcanaryco/atomic-red-team
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''851fd622-b675-4d26-b803-14bc7baa517a''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - Offline_Winpwn
            - 'WinPwn '
            - WinPwn.exe
            - WinPwn.ps1
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:34:36.555146+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:34:36.555146+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:34:36.555169+00:00'
