id: e218595b-bbe7-4ee5-8a96-f32a24ad3468
title: Suspicious Curl.EXE Download
status: test
level: high
description: Detects a suspicious curl process start on Windows and outputs the requested
    document to a local file
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: '2020-07-03'
modified: '2023-02-21'
tags:
    - attack.command-and-control
    - attack.t1105
references:
    - https://twitter.com/max_mal_/status/1542461200797163522
    - https://web.archive.org/web/20200128160046/https://twitter.com/reegun21/status/1222093798009790464
    - https://github.com/pr0xylife/Qakbot/blob/4f0795d79dabee5bc9dd69f17a626b48852e7869/Qakbot_AA_23.06.2022.txt
    - https://www.volexity.com/blog/2022/07/28/sharptongue-deploys-clever-mail-stealing-browser-extension-sharpext/
    - https://github.com/redcanaryco/atomic-red-team/blob/0f229c0e42bfe7ca736a14023836d65baa941ed2/atomics/T1105/T1105.md#atomic-test-18---curl-download-file
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''bbeaed61-1990-4773-bf57-b81dbad7db2d''),
    type=<SigmaRelatedType.DERIVED: 2>), SigmaRelatedItem(id=UUID(''9a517fca-4ba3-4629-9278-a68694697b81''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_curl:
        Image|endswith: \curl.exe
        Product: The curl executable
    selection_susp_locations:
        CommandLine|contains:
            - '%AppData%'
            - '%Public%'
            - '%Temp%'
            - '%tmp%'
            - \AppData\
            - \Desktop\
            - \Temp\
            - \Users\Public\
            - C:\PerfLogs\
            - C:\ProgramData\
            - C:\Windows\Temp\
    selection_susp_extensions:
        CommandLine|endswith:
            - .dll
            - .gif
            - .jpeg
            - .jpg
            - .png
            - .temp
            - .tmp
            - .txt
            - .vbe
            - .vbs
    filter_optional_git_windows:
        ParentImage: C:\Program Files\Git\usr\bin\sh.exe
        Image: C:\Program Files\Git\mingw64\bin\curl.exe
        CommandLine|contains|all:
            - '--silent --show-error --output '
            - gfw-httpget-
            - AppData
    condition: selection_curl and 1 of selection_susp_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:43.016171+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:43.016171+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:43.016264+00:00'
        -   source_field: Product
            target_table: process_activity
            target_field: metadata.product.name
            mapped_at: '2025-11-13T20:20:43.016269+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:43.016272+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:43.016274+00:00'
