title: Webshell Tool Reconnaissance Activity
id: f64e5c19-879c-4bae-b471-6d84c8339677
status: test
level: high
author: Cian Heasley, Florian Roth (Nextron Systems)
description: 'Detects processes spawned from web servers (PHP, Tomcat, IIS, etc.)
    that perform reconnaissance looking for the existence of popular scripting tools
    (perl, python, wget) on the system via the help commands

    '
references:
    - https://ragged-lab.blogspot.com/2020/07/webshells-automating-reconnaissance.html
falsepositives:
    - Unknown
tags:
    - attack.persistence
    - attack.t1505.003
date: '2020-07-22'
modified: '2023-11-09'
logsource:
    category: process_creation
    product: windows
detection:
    selection_webserver_image:
        ParentImage|endswith:
            - \caddy.exe
            - \httpd.exe
            - \nginx.exe
            - \php-cgi.exe
            - \w3wp.exe
            - \ws_tomcatservice.exe
    selection_webserver_characteristics_tomcat1:
        ParentImage|endswith:
            - \java.exe
            - \javaw.exe
        ParentImage|contains:
            - -tomcat-
            - \tomcat
    selection_webserver_characteristics_tomcat2:
        ParentImage|endswith:
            - \java.exe
            - \javaw.exe
        CommandLine|contains:
            - CATALINA_HOME
            - catalina.jar
    selection_recon:
        CommandLine|contains:
            - perl --help
            - perl -h
            - python --help
            - python -h
            - python3 --help
            - python3 -h
            - wget --help
    condition: 1 of selection_webserver_* and selection_recon
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:45:18.935021+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:45:18.935021+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:45:18.935034+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:45:18.935035+00:00'
