title: Setuid and Setgid
id: c21c4eaa-ba2e-419a-92b2-8371703cbe21
status: test
level: low
author: Ömer Günal
description: Detects suspicious change of file privileges with chown and chmod commands
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1548.001/T1548.001.md
    - https://attack.mitre.org/techniques/T1548/001/
falsepositives:
    - Legitimate administration activities
tags:
    - attack.persistence
    - attack.t1548.001
date: '2020-06-16'
modified: '2022-10-05'
logsource:
    category: process_creation
    product: linux
detection:
    selection_root:
        CommandLine|contains: chown root
    selection_perm:
        CommandLine|contains:
            - ' chmod u+s'
            - ' chmod g+s'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 5
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:30.119773+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:30.119773+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:36:30.119798+00:00'
