title: File Recovery From Backup Via Wbadmin.EXE
id: 6fe4aa1e-0531-4510-8be2-782154b73b48
status: experimental
level: medium
author: Nasreddine Bencherchali (Nextron Systems), frack113
description: 'Detects the recovery of files from backups via "wbadmin.exe".

    Attackers can restore sensitive files such as NTDS.DIT or Registry Hives from
    backups in order to potentially extract credentials.

    '
references:
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/wbadmin-start-recovery
    - https://lolbas-project.github.io/lolbas/Binaries/Wbadmin/
falsepositives:
    - Unknown
tags:
    - attack.impact
    - attack.t1490
date: '2024-05-10'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \wbadmin.exe
        OriginalFileName: WBADMIN.EXE
    selection_cli:
        CommandLine|contains|all:
            - ' recovery'
            - recoveryTarget
            - itemtype:File
    condition: all of selection_*
related:
    -   id: 84972c80-251c-4c3a-9079-4f00aad93938
        type: derived
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:49:21.991115+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:49:21.991115+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:49:21.991144+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:49:21.991146+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:49:21.991148+00:00'
