title: System Network Discovery - Linux
id: e7bd1cfa-b446-4c88-8afb-403bcd79e3fa
status: test
level: informational
author: Ömer Günal and remotephone, oscd.community
description: Detects enumeration of local network configuration
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1016/T1016.md
falsepositives:
    - Legitimate administration activities
tags:
    - attack.discovery
    - attack.t1016
date: '2020-10-06'
modified: '2022-09-15'
logsource:
    category: process_creation
    product: linux
detection:
    selection_img:
        Image|endswith:
            - /firewall-cmd
            - /ufw
            - /iptables
            - /netstat
            - /ss
            - /ip
            - /ifconfig
            - /systemd-resolve
            - /route
    selection_cli:
        CommandLine|contains: /etc/resolv.conf
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:28.082334+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:28.082334+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:36:28.082351+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:36:28.082353+00:00'
