id: eb2d07d4-49cb-4523-801a-da002df36602
title: HackTool - EDRSilencer Execution
status: test
level: high
description: 'Detects the execution of EDRSilencer, a tool that leverages Windows
    Filtering Platform (WFP) to block Endpoint Detection and Response (EDR) agents
    from reporting security events to the server based on PE metadata information.

    '
author: '@gott_cyber'
date: '2024-01-02'
tags:
    - attack.defense-evasion
    - attack.t1562
references:
    - https://github.com/netero1010/EDRSilencer
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \EDRSilencer.exe
        OriginalFileName: EDRSilencer.exe
        Description|contains: EDRSilencer
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:33:05.910967+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:33:05.910967+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:33:05.910980+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:33:05.910982+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: device.desc
            mapped_at: '2025-11-26T02:33:05.910984+00:00'
