id: 0403d67d-6227-4ea8-8145-4e72db7da120
title: UtilityFunctions.ps1 Proxy Dll
status: test
level: medium
description: Detects the use of a Microsoft signed script executing a managed DLL
    with PowerShell.
author: frack113
date: '2022-05-28'
tags:
    - attack.defense-evasion
    - attack.t1216
references:
    - https://lolbas-project.github.io/lolbas/Scripts/UtilityFunctions/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - UtilityFunctions.ps1
            - 'RegSnapin '
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:36:44.120693+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:36:44.120693+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:36:44.120716+00:00'
