id: bb780e0c-16cf-4383-8383-1e5471db6cf9
title: Suspicious XOR Encoded PowerShell Command
status: test
level: medium
description: Detects presence of a potentially xor encoded powershell command
author: Sami Ruohonen, Harish Segar, Tim Shelton, Teymur Kheirkhabarov, Vasiliy Burov,
    oscd.community, Nasreddine Bencherchali
date: '2018-09-05'
modified: '2023-01-30'
tags:
    - attack.defense-evasion
    - attack.execution
    - attack.t1059.001
    - attack.t1140
    - attack.t1027
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=65
    - https://redcanary.com/blog/yellow-cockatoo/
    - https://zero2auto.com/2020/05/19/netwalker-re/
    - https://mez0.cc/posts/cobaltstrike-powershell-exec/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''5b572dcf-254b-425c-a8c5-d9af6bea35a6''),
    type=<SigmaRelatedType.OBSOLETE: 4>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
        OriginalFileName:
            - PowerShell.EXE
            - pwsh.dll
        Description: Windows PowerShell
        Product: PowerShell Core 6
    selection_cli_xor:
        CommandLine|contains: bxor
    selection_cli_other:
        CommandLine|contains:
            - ForEach
            - for(
            - 'for '
            - '-join '
            - -join'
            - -join"
            - -join`
            - ::Join
            - '[char]'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:50.295117+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:50.295117+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:50.295124+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:50.295126+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: message
            mapped_at: '2025-11-13T20:20:50.295127+00:00'
        -   source_field: Product
            target_table: process_activity
            target_field: metadata.product.name
            mapped_at: '2025-11-13T20:20:50.295129+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:50.295130+00:00'
