id: 10fb649c-3600-4d37-b1e6-56ea90bb7e09
title: User Added To Highly Privileged Group
status: test
level: high
description: Detects addition of users to highly privileged groups via "Net" or "Add-LocalGroupMember".
author: Nasreddine Bencherchali (Nextron Systems)
date: '2024-02-23'
tags:
    - attack.persistence
    - attack.t1098
references:
    - https://www.huntress.com/blog/slashandgrab-screen-connect-post-exploitation-in-the-wild-cve-2024-1709-cve-2024-1708
falsepositives:
    - Administrative activity that must be investigated
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''ffa28e60-bdb1-46e0-9f82-05f7a61cc06e''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''ad720b90-25ad-43ff-9b5e-5c841facc8e5''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_main:
        CommandLine|contains|all:
            - 'localgroup '
            - ' /add'
            - 'Add-LocalGroupMember '
            - ' -Group '
    selection_group:
        CommandLine|contains:
            - Group Policy Creator Owners
            - Schema Admins
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:40.508921+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:40.508921+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:40.508930+00:00'
