id: 81ebd28b-9607-4478-bf06-974ed9d53ed7
title: Potential Application Whitelisting Bypass via Dnx.EXE
status: test
level: medium
description: 'Detects the execution of Dnx.EXE. The Dnx utility allows for the execution
    of C# code.

    Attackers might abuse this in order to bypass application whitelisting.

    '
author: Beyu Denis, oscd.community
date: '2019-10-26'
modified: '2024-04-24'
tags:
    - attack.defense-evasion
    - attack.t1218
    - attack.t1027.004
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Csi/
    - https://enigma0x3.net/2016/11/17/bypassing-application-whitelisting-by-using-dnx-exe/
falsepositives:
    - Legitimate use of dnx.exe by legitimate user
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \dnx.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:25:43.774511+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:25:43.774511+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:25:43.774542+00:00'
