title: Explorer NOUACCHECK Flag
id: 534f2ef7-e8a2-4433-816d-c91bccde289b
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects suspicious starts of explorer.exe that use the /NOUACCHECK flag
    that allows to run all sub processes of that newly started explorer.exe without
    any UAC checks
references:
    - https://twitter.com/ORCA6665/status/1496478087244095491
falsepositives:
    - Domain Controller User Logon
    - Unknown how many legitimate software products use that method
tags:
    - attack.defense-evasion
    - attack.t1548.002
date: '2022-02-23'
modified: '2022-04-21'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \explorer.exe
        CommandLine|contains: /NOUACCHECK
    filter_dc_logon:
        ParentCommandLine: C:\Windows\system32\svchost.exe -k netsvcs -p -s Schedule
        ParentImage: C:\Windows\System32\svchost.exe
    condition: selection and not 1 of filter_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:50:05.453691+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:50:05.453691+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:50:05.453706+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:50:05.453708+00:00'
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-12-04T01:50:05.453709+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:50:05.453711+00:00'
