id: 515c8be5-e5df-4c5e-8f6d-a4a2f05e4b48
title: CreateDump Process Dump
status: test
level: high
description: Detects uses of the createdump.exe LOLOBIN utility to dump process memory
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: '2022-01-04'
modified: '2022-08-19'
tags:
    - attack.defense-evasion
    - attack.t1036
    - attack.t1003.001
references:
    - https://www.crowdstrike.com/blog/overwatch-exposes-aquatic-panda-in-possession-of-log-4-shell-exploit-tools/
    - https://twitter.com/bopin2020/status/1366400799199272960
falsepositives:
    - Command lines that use the same flags
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''1a1ed54a-2ba4-4221-94d5-01dee560d71e''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \createdump.exe
        OriginalFileName: FX_VER_INTERNALNAME_STR
    selection_cli:
        CommandLine|contains:
            - ' -u '
            - ' --full '
            - ' -f '
            - ' --name '
            - '.dmp '
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:35.512836+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:35.512836+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:35.512845+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:35.512847+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:35.512848+00:00'
