title: Suspicious Program Location Whitelisted In Firewall Via Netsh.EXE
id: a35f5a72-f347-4e36-8895-9869b0d5fc6d
status: test
level: high
author: Sander Wiebing, Jonhnathan Ribeiro, Daniil Yugoslavskiy, oscd.community
description: Detects Netsh command execution that whitelists a program located in
    a suspicious location in the Windows Firewall
references:
    - https://www.virusradar.com/en/Win32_Kasidet.AD/description
    - https://www.hybrid-analysis.com/sample/07e789f4f2f3259e7559fdccb36e96814c2dbff872a21e1fa03de9ee377d581f?environmentId=100
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1562.004
date: '2020-05-25'
modified: '2023-12-11'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \netsh.exe
        OriginalFileName: netsh.exe
    selection_cli:
        CommandLine|contains|all:
            - firewall
            - add
            - allowedprogram
            - advfirewall
            - firewall
            - add
            - rule
            - action=allow
            - program=
    selection_paths:
        CommandLine|contains:
            - :\$Recycle.bin\
            - :\RECYCLER.BIN\
            - :\RECYCLERS.BIN\
            - :\SystemVolumeInformation\
            - :\Temp\
            - :\Users\Default\
            - :\Users\Desktop\
            - :\Users\Public\
            - :\Windows\addins\
            - :\Windows\cursors\
            - :\Windows\debug\
            - :\Windows\drivers\
            - :\Windows\fonts\
            - :\Windows\help\
            - :\Windows\system32\tasks\
            - :\Windows\Tasks\
            - :\Windows\Temp\
            - \Downloads\
            - \Local Settings\Temporary Internet Files\
            - \Temporary Internet Files\Content.Outlook\
            - '%Public%\'
            - '%TEMP%'
            - '%TMP%'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:42:09.809919+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:42:09.809919+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:42:09.809956+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:42:09.810002+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:42:09.810018+00:00'
