title: Suspicious SYSVOL Domain Group Policy Access
id: 05f3c945-dcc8-4393-9f3d-af65077a8f86
status: test
level: medium
author: Markus Neis, Jonhnathan Ribeiro, oscd.community
description: Detects Access to Domain Group Policies stored in SYSVOL
references:
    - https://adsecurity.org/?p=2288
    - https://www.hybrid-analysis.com/sample/f2943f5e45befa52fb12748ca7171d30096e1d4fc3c365561497c618341299d5?environmentId=100
falsepositives:
    - Administrative activity
tags:
    - attack.credential-access
    - attack.t1552.006
date: '2018-04-09'
modified: '2022-01-07'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - \SYSVOL\
            - \policies\
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:48:33.337385+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:48:33.337385+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:48:33.337435+00:00'
