id: 899133d5-4d7c-4a7f-94ee-27355c879d90
title: Python Inline Command Execution
status: test
level: medium
description: Detects execution of python using the "-c" flag. This is could be used
    as a way to launch a reverse shell or execute live python code.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-01-02'
modified: '2023-02-17'
tags:
    - attack.execution
    - attack.t1059
references:
    - https://docs.python.org/3/using/cmdline.html#cmdoption-c
    - https://www.revshells.com/
    - https://pentestmonkey.net/cheat-sheet/shells/reverse-shell-cheat-sheet
falsepositives:
    - Python libraries that use a flag starting with "-c". Filter according to your
        environment
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        OriginalFileName: python.exe
        Image|endswith:
            - python.exe
            - python3.exe
            - python2.exe
    selection_cli:
        CommandLine|contains: ' -c'
    filter_python:
        ParentImage|startswith: C:\Program Files\Python
        ParentImage|endswith: \python.exe
        ParentCommandLine|contains: -E -s -m ensurepip -U --default-pip
    filter_vscode:
        ParentImage|endswith: \AppData\Local\Programs\Microsoft VS Code\Code.exe
    condition: all of selection_* and not 1 of filter_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:31:34.846600+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:31:34.846600+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:31:34.846614+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:31:34.846615+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:31:34.846617+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:31:34.846619+00:00'
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-11-26T02:31:34.846620+00:00'
