title: Suspicious Browser Child Process - MacOS
id: 0250638a-2b28-4541-86fc-ea4c558fa0c6
status: test
level: medium
author: Sohan G (D4rkCiph3r)
description: Detects suspicious child processes spawned from browsers. This could
    be a result of a potential web browser exploitation.
references:
    - https://fr.slideshare.net/codeblue_jp/cb19-recent-apt-attack-on-crypto-exchange-employees-by-heungsoo-kang
    - https://github.com/elastic/detection-rules/blob/4312d8c9583be524578a14fe6295c3370b9a9307/rules/macos/execution_initial_access_suspicious_browser_childproc.toml
falsepositives:
    - Legitimate browser install, update and recovery scripts
tags:
    - attack.initial-access
    - attack.execution
    - attack.t1189
    - attack.t1203
    - attack.t1059
date: '2023-04-05'
logsource:
    category: process_creation
    product: macos
detection:
    selection:
        ParentImage|contains:
            - com.apple.WebKit.WebContent
            - firefox
            - Google Chrome Helper
            - Google Chrome
            - Microsoft Edge
            - Opera
            - Safari
            - Tor Browser
        Image|endswith:
            - /bash
            - /curl
            - /dash
            - /ksh
            - /osascript
            - /perl
            - /php
            - /pwsh
            - /python
            - /sh
            - /tcsh
            - /wget
            - /zsh
    filter_main_generic:
        CommandLine|contains: --defaults-torrc
    filter_main_ms_autoupdate:
        CommandLine|contains: /Library/Application Support/Microsoft/MAU*/Microsoft
            AutoUpdate.app/Contents/MacOS/msupdate
    filter_main_chrome:
        ParentImage|contains:
            - Google Chrome Helper
            - Google Chrome
        CommandLine|contains:
            - /Volumes/Google Chrome/Google Chrome.app/Contents/Frameworks/*/Resources/install.sh
            - /Applications/Google Chrome.app/Contents/Frameworks/Google Chrome Framework.framework/*/Resources/keystone_promote_preflight.sh
            - /Applications/Google Chrome.app/Contents/Frameworks/Google Chrome Framework.framework/*/Resources/keystone_promote_postflight.sh
    filter_main_ms_edge:
        ParentImage|contains: Microsoft Edge
        CommandLine|contains:
            - IOPlatformExpertDevice
            - hw.model
    filter_main_chromerecovery:
        ParentImage|contains:
            - Google Chrome Helper
            - Google Chrome
        CommandLine|contains|all:
            - /Users/
            - /Library/Application Support/Google/Chrome/recovery/
            - /ChromeRecovery
    filter_optional_null:
        CommandLine: null
    filter_optional_empty:
        CommandLine: ''
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:34:28.278971+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-12-04T01:34:28.278971+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:34:28.278986+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:34:28.278988+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:34:28.278990+00:00'
