id: 6f535e01-ca1f-40be-ab8d-45b19c0c8b7f
title: Import LDAP Data Interchange Format File Via Ldifde.EXE
status: test
level: medium
description: 'Detects the execution of "Ldifde.exe" with the import flag "-i". The
    can be abused to include HTTP-based arguments which will allow the arbitrary download
    of files from a remote server.

    '
author: '@gott_cyber'
date: '2022-09-02'
modified: '2023-03-14'
tags:
    - attack.command-and-control
    - attack.defense-evasion
    - attack.t1218
    - attack.t1105
references:
    - https://twitter.com/0gtweet/status/1564968845726580736
    - https://strontic.github.io/xcyclopedia/library/ldifde.exe-979DE101F5059CEC1D2C56967CA2BAC0.html
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc731033(v=ws.11)
falsepositives:
    - Since the content of the files are unknown, false positives are expected
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \ldifde.exe
        OriginalFileName: ldifde.exe
    selection_cli:
        CommandLine|contains|all:
            - -i
            - -f
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:25:45.841468+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:25:45.841468+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:25:45.841500+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:25:45.841505+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:25:45.841508+00:00'
