id: a642964e-bead-4bed-8910-1bb4d63e3b4d
title: HackTool - Mimikatz Execution
status: test
level: high
description: Detection well-known mimikatz command line arguments
author: Teymur Kheirkhabarov, oscd.community, David ANDRE (additional keywords), Tim
    Shelton
date: '2019-10-22'
modified: '2023-02-21'
tags:
    - attack.credential-access
    - attack.t1003.001
    - attack.t1003.002
    - attack.t1003.004
    - attack.t1003.005
    - attack.t1003.006
references:
    - https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
    - https://tools.thehacker.recipes/mimikatz/modules
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_tools_name:
        CommandLine|contains:
            - DumpCreds
            - mimikatz
    selection_function_names:
        CommandLine|contains:
            - ::aadcookie
            - ::detours
            - ::memssp
            - ::mflt
            - ::ncroutemon
            - ::ngcsign
            - ::printnightmare
            - ::skeleton
            - ::preshutdown
            - ::mstsc
            - ::multirdp
    selection_module_names:
        CommandLine|contains:
            - 'rpc::'
            - 'token::'
            - 'crypto::'
            - 'dpapi::'
            - 'sekurlsa::'
            - 'kerberos::'
            - 'lsadump::'
            - 'privilege::'
            - 'process::'
            - 'vault::'
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:33:42.084127+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:33:42.084127+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:33:42.084148+00:00'
