id: 95e60a2b-4705-444b-b7da-ba0ea81a3ee2
title: Remote Access Tool - Simple Help Execution
status: test
level: medium
description: 'An adversary may use legitimate desktop support and remote access software,
    such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive
    command and control channel to target systems within networks.

    These services are commonly used as legitimate technical support software, and
    may be allowed by application control within a target environment.

    Remote access tools like VNC, Ammyy, and Teamviewer are used frequently when compared
    with other legitimate software commonly used by adversaries. (Citation: Symantec
    Living off the Land)

    '
author: Nasreddine Bencherchali (Nextron Systems)
date: '2024-02-23'
tags:
    - attack.command-and-control
    - attack.t1219
references:
    - https://www.huntress.com/blog/slashandgrab-screen-connect-post-exploitation-in-the-wild-cve-2024-1709-cve-2024-1708
falsepositives:
    - Legitimate usage of the tool
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|contains:
            - \JWrapper-Remote Access\
            - \JWrapper-Remote Support\
        Image|endswith: \SimpleService.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:33:53.565522+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:33:53.565522+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:33:53.565553+00:00'
