title: HackTool - Hydra Password Bruteforce Execution
id: aaafa146-074c-11eb-adc1-0242ac120002
status: test
level: high
author: Vasiliy Burov
description: Detects command line parameters used by Hydra password guessing hack
    tool
references:
    - https://github.com/vanhauser-thc/thc-hydra
falsepositives:
    - Software that uses the caret encased keywords PASS and USER in its command line
tags:
    - attack.credential-access
    - attack.t1110
    - attack.t1110.001
date: '2020-10-05'
modified: '2023-02-04'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - '-u '
            - '-p '
        CommandLine|contains:
            - ^USER^
            - ^PASS^
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:47:24.731601+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:47:24.731601+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:47:24.731624+00:00'
