id: f548a603-c9f2-4c89-b511-b089f7e94549
title: Potential Persistence Via Microsoft Compatibility Appraiser
status: test
level: medium
description: 'Detects manual execution of the "Microsoft Compatibility Appraiser"
    task via schtasks.

    In order to trigger persistence stored in the "\AppCompatFlags\TelemetryController"
    registry key.

    '
author: Sreeman
date: '2020-09-29'
modified: '2023-02-10'
tags:
    - attack.persistence
    - attack.t1053.005
references:
    - https://www.trustedsec.com/blog/abusing-windows-telemetry-for-persistence/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''73a883d0-0348-4be4-a8d8-51031c2564f8''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \schtasks.exe
        OriginalFileName: schtasks.exe
    selection_cli:
        CommandLine|contains|all:
            - 'run '
            - \Application Experience\Microsoft Compatibility Appraiser
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:34:06.637588+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:34:06.637588+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:34:06.637615+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:34:06.637618+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:34:06.637621+00:00'
