id: fff9d2b7-e11c-4a69-93d3-40ef66189767
title: Suspicious Copy From or To System Directory
status: test
level: medium
description: 'Detects a suspicious copy operation that tries to copy a program from
    system (System32, SysWOW64, WinSxS) directories to another on disk.

    Often used to move LOLBINs such as ''certutil'' or ''desktopimgdownldr'' to a
    different location with a different name in order to bypass detections based on
    locations.

    '
author: Florian Roth (Nextron Systems), Markus Neis, Tim Shelton (HAWK.IO), Nasreddine
    Bencherchali (Nextron Systems)
date: '2020-07-03'
modified: '2023-08-29'
tags:
    - attack.defense-evasion
    - attack.t1036.003
references:
    - https://www.hybrid-analysis.com/sample/8da5b75b6380a41eee3a399c43dfe0d99eeefaa1fd21027a07b1ecaa4cd96fdd?environmentId=120
    - https://web.archive.org/web/20180331144337/https://www.fireeye.com/blog/threat-research/2018/03/sanny-malware-delivery-method-updated-in-recently-observed-attacks.html
    - https://thedfirreport.com/2023/08/28/html-smuggling-leads-to-domain-wide-ransomware/
falsepositives:
    - Depend on scripts and administrative tools used in the monitored environment
        (For example an admin scripts like https://www.itexperience.net/sccm-batch-files-and-32-bits-processes-on-64-bits-os/)
    - When cmd.exe and xcopy.exe are called directly
    - When the command contains the keywords but not in the correct order
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''855bc8b5-2ae8-402e-a9ed-b889e6df1900''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_cmd:
        Image|endswith: \cmd.exe
        CommandLine|contains: 'copy '
    selection_pwsh:
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
        CommandLine|contains:
            - copy-item
            - ' copy '
            - 'cpi '
            - ' cp '
    selection_other:
        Image|endswith:
            - \robocopy.exe
            - \xcopy.exe
        OriginalFileName:
            - robocopy.exe
            - XCOPY.EXE
    target:
        CommandLine|contains:
            - \System32
            - \SysWOW64
            - \WinSxS
    condition: 1 of selection_* and target
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:30:55.075455+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:30:55.075455+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:30:55.075469+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:30:55.075471+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:30:55.075472+00:00'
