id: d2125259-ddea-4c1c-9c22-977eb5b29cf0
title: New Root Certificate Installed Via Certutil.EXE
status: test
level: medium
description: 'Detects execution of "certutil" with the "addstore" flag in order to
    install a new certificate on the system.

    Adversaries may install a root certificate on a compromised system to avoid warnings
    when connecting to adversary controlled web servers.

    '
author: oscd.community, @redcanary, Zach Stanford @svch0st
date: '2023-03-05'
modified: '2024-03-05'
tags:
    - attack.defense-evasion
    - attack.t1553.004
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1553.004/T1553.004.md
falsepositives:
    - Help Desk or IT may need to manually add a corporate Root CA on occasion. Need
        to test if GPO push doesn't trigger FP
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''42821614-9264-4761-acfc-5772c3286f76''),
    type=<SigmaRelatedType.DERIVED: 2>), SigmaRelatedItem(id=UUID(''46591fae-7a4c-46ea-aec3-dff5e6d785dc''),
    type=<SigmaRelatedType.OBSOLETE: 4>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \certutil.exe
        OriginalFileName: CertUtil.exe
    selection_cli_add:
        CommandLine|contains|windash: -addstore
    selection_cli_store:
        CommandLine|contains: root
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:27:05.982185+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:27:05.982185+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:27:05.982204+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:27:05.982207+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:27:05.982209+00:00'
