id: bab049ca-7471-4828-9024-38279a4c04da
title: Detect Virtualbox Driver Installation OR Starting Of VMs
status: test
level: low
description: Adversaries can carry out malicious operations using a virtual instance
    to avoid detection. This rule is built to detect the registration of the Virtualbox
    driver or start of a Virtualbox VM.
author: Janantha Marasinghe
date: '2020-09-26'
modified: '2022-07-14'
tags:
    - attack.defense-evasion
    - attack.t1564.006
    - attack.t1564
references:
    - https://news.sophos.com/en-us/2020/05/21/ragnar-locker-ransomware-deploys-virtual-machine-to-dodge-security/
    - https://threatpost.com/maze-ransomware-ragnar-locker-virtual-machine/159350/
fields:
    - ComputerName
    - User
    - CommandLine
    - ParentCommandLine
falsepositives:
    - This may have false positives on hosts where Virtualbox is legitimately being
        used for operations
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_1:
        CommandLine|contains:
            - VBoxRT.dll,RTR3Init
            - VBoxC.dll
            - VBoxDrv.sys
    selection_2:
        CommandLine|contains:
            - startvm
            - controlvm
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:46.332479+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:46.332479+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:46.332490+00:00'
