title: Clipboard Data Collection Via OSAScript
id: 7794fa3c-edea-4cff-bec7-267dd4770fd7
status: test
level: high
author: Sohan G (D4rkCiph3r)
description: Detects possible collection of data from the clipboard via execution
    of the osascript binary
references:
    - https://www.sentinelone.com/blog/how-offensive-actors-use-applescript-for-attacking-macos/
fields:
    - CommandLine
falsepositives:
    - Unlikely
tags:
    - attack.collection
    - attack.execution
    - attack.t1115
    - attack.t1059.002
date: '2023-01-31'
logsource:
    category: process_creation
    product: macos
detection:
    selection:
        CommandLine|contains|all:
            - osascript
            - ' -e '
            - clipboard
    condition: selection
related:
    -   id: 1bc2e6c5-0885-472b-bed6-be5ea8eace55
        type: derived
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:34:38.659759+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-12-04T01:34:38.659759+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:34:38.659781+00:00'
