id: cdf05894-89e7-4ead-b2b0-0a5f97a90f2f
title: Potential Encoded PowerShell Patterns In CommandLine
status: test
level: low
description: Detects specific combinations of encoding methods in PowerShell via the
    commandline
author: Teymur Kheirkhabarov (idea), Vasiliy Burov (rule), oscd.community, Tim Shelton
date: '2020-10-11'
modified: '2023-01-26'
tags:
    - attack.defense-evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=65
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''5b572dcf-254b-425c-a8c5-d9af6bea35a6''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
        OriginalFileName:
            - PowerShell.EXE
            - pwsh.dll
    selection_to_1:
        CommandLine|contains:
            - ToInt
            - ToDecimal
            - ToByte
            - ToUint
            - ToSingle
            - ToSByte
    selection_to_2:
        CommandLine|contains:
            - ToChar
            - ToString
            - String
    selection_gen_1:
        CommandLine|contains|all:
            - char
            - join
    selection_gen_2:
        CommandLine|contains|all:
            - split
            - join
    condition: selection_img and (all of selection_to_* or 1 of selection_gen_*)
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:33.256557+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:33.256557+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:33.256565+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:33.256566+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:33.256568+00:00'
