id: 7ab8f73a-fcff-428b-84aa-6a5ff7877dea
title: Vim GTFOBin Abuse - Linux
status: test
level: high
description: 'Detects the use of "vim" and it''s siblings commands to execute a shell
    or proxy commands.

    Such behavior may be associated with privilege escalation, unauthorized command
    execution, or to break out from restricted environments.

    '
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-12-28'
modified: '2024-09-02'
tags:
    - attack.discovery
    - attack.t1083
references:
    - https://gtfobins.github.io/gtfobins/vim/
    - https://gtfobins.github.io/gtfobins/rvim/
    - https://gtfobins.github.io/gtfobins/vimdiff/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection_img:
        Image|endswith:
            - /rvim
            - /vim
            - /vimdiff
        CommandLine|contains:
            - ' --cmd'
            - ' -c '
    selection_cli:
        CommandLine|contains:
            - :!/
            - ':lua '
            - ':py '
            - /bin/bash
            - /bin/dash
            - /bin/fish
            - /bin/sh
            - /bin/zsh
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:15:55.918205+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-13T20:15:55.918205+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:15:55.918211+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:15:55.918213+00:00'
