title: HackTool - Certipy Execution
id: 6938366d-8954-4ddc-baff-c830b3ba8fcd
status: test
level: high
author: pH-T (Nextron Systems), Sittikorn Sangrattanapitak
description: 'Detects Certipy execution, a tool for Active Directory Certificate Services
    enumeration and abuse based on PE metadata characteristics and common command
    line arguments.

    '
references:
    - https://github.com/ly4k/Certipy
    - https://research.ifcr.dk/certipy-4-0-esc9-esc10-bloodhound-gui-new-authentication-and-request-methods-and-more-7237d88061f7
falsepositives:
    - Unlikely
tags:
    - attack.discovery
    - attack.credential-access
    - attack.t1649
date: '2023-04-17'
modified: '2024-10-08'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \Certipy.exe
        OriginalFileName: Certipy.exe
        Description|contains: Certipy
    selection_cli_commands:
        CommandLine|contains:
            - ' account '
            - ' auth '
            - ' cert '
            - ' find '
            - ' forge '
            - ' ptt '
            - ' relay '
            - ' req '
            - ' shadow '
            - ' template '
    selection_cli_flags:
        CommandLine|contains:
            - ' -bloodhound'
            - ' -ca-pfx '
            - ' -dc-ip '
            - ' -kirbi'
            - ' -old-bloodhound'
            - ' -pfx '
            - ' -target'
            - ' -template'
            - ' -username '
            - ' -vulnerable'
            - auth -pfx
            - shadow auto
            - shadow list
    condition: selection_img or all of selection_cli_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:49:44.485569+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:49:44.485569+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:49:44.485602+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:49:44.485605+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: device.desc
            mapped_at: '2025-12-04T01:49:44.485606+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:49:44.485608+00:00'
