title: Remote Access Tool - ScreenConnect Server Web Shell Execution
id: b19146a3-25d4-41b4-928b-1e2a92641b1b
status: test
level: high
author: Jason Rathbun (Blackpoint Cyber)
description: Detects potential web shell execution from the ScreenConnect server process.
references:
    - https://blackpointcyber.com/resources/blog/breaking-through-the-screen/
    - https://www.connectwise.com/company/trust/security-bulletins/connectwise-screenconnect-23.9.8
falsepositives:
    - Unlikely
tags:
    - attack.initial-access
    - attack.t1190
date: '2024-02-26'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \ScreenConnect.Service.exe
        Image|endswith:
            - \cmd.exe
            - \csc.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:23.714741+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:23.714741+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:44:23.714758+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:44:23.714760+00:00'
