id: 1c526788-0abe-4713-862f-b520da5e5316
title: Chromium Browser Headless Execution To Mockbin Like Site
status: test
level: high
description: Detects the execution of a Chromium based browser process with the "headless"
    flag and a URL pointing to the mockbin.org service (which can be used to exfiltrate
    data).
author: X__Junior (Nextron Systems)
date: '2023-09-11'
tags:
    - attack.execution
references:
    - https://www.zscaler.com/blogs/security-research/steal-it-campaign
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \brave.exe
            - \chrome.exe
            - \msedge.exe
            - \opera.exe
            - \vivaldi.exe
    selection_headless:
        CommandLine|contains: --headless
    selection_url:
        CommandLine|contains:
            - ://run.mocky
            - ://mockbin
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:57.122616+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:57.122616+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:57.122620+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:57.122621+00:00'
