id: b6e2a2e3-2d30-43b1-a4ea-071e36595690
title: Space After Filename - macOS
status: test
level: low
description: Detects attempts to masquerade as legitimate files by adding a space
    to the end of the filename.
author: remotephone
date: '2021-11-20'
modified: '2023-01-04'
tags:
    - attack.defense-evasion
    - attack.t1036.006
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1036.006/T1036.006.md
falsepositives:
    - Mistyped commands or legitimate binaries named to match the pattern
taxonomy: sigma
logsource:
    category: process_creation
    product: macos
detection:
    selection1:
        CommandLine|endswith: ' '
    selection2:
        Image|endswith: ' '
    condition: 1 of selection*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:14:25.815014+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-11-13T20:14:25.815014+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:14:25.815019+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:14:25.815021+00:00'
