title: Sensitive File Dump Via Wbadmin.EXE
id: 8b93a509-1cb8-42e1-97aa-ee24224cdc15
status: experimental
level: high
author: Nasreddine Bencherchali (Nextron Systems), frack113
description: 'Detects the dump of highly sensitive files such as "NTDS.DIT" and "SECURITY"
    hive.

    Attackers can leverage the "wbadmin" utility in order to dump sensitive files
    that might contain credential or sensitive information.

    '
references:
    - https://github.com/LOLBAS-Project/LOLBAS/blob/2cc01b01132b5c304027a658c698ae09dd6a92bf/yml/OSBinaries/Wbadmin.yml
    - https://lolbas-project.github.io/lolbas/Binaries/Wbadmin/
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/wbadmin-start-recovery
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/wbadmin-start-backup
falsepositives:
    - Legitimate backup operation by authorized administrators. Matches must be investigated
        and allowed on a case by case basis.
tags:
    - attack.credential-access
    - attack.t1003.003
date: '2024-05-10'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \wbadmin.exe
        OriginalFileName: WBADMIN.EXE
    selection_backup:
        CommandLine|contains:
            - start
            - backup
    selection_path:
        CommandLine|contains:
            - \config\SAM
            - \config\SECURITY
            - \config\SYSTEM
            - \Windows\NTDS\NTDS.dit
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:41:48.219397+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:41:48.219397+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:41:48.219417+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:41:48.219420+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:41:48.219421+00:00'
