id: dd3ee8cc-f751-41c9-ba53-5a32ed47e563
title: Suspicious Reg Add Open Command
status: test
level: medium
description: Threat actors performed dumping of SAM, SECURITY and SYSTEM registry
    hives using DelegateExecute key
author: frack113
date: '2021-12-20'
modified: '2022-12-25'
tags:
    - attack.credential-access
    - attack.t1003
references:
    - https://thedfirreport.com/2021/12/13/diavol-ransomware/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_1:
        CommandLine|contains|all:
            - reg
            - add
            - hkcu\software\classes\ms-settings\shell\open\command
            - '/ve '
            - /d
    selection_2:
        CommandLine|contains|all:
            - reg
            - add
            - hkcu\software\classes\ms-settings\shell\open\command
            - /v
            - DelegateExecute
    selection_3:
        CommandLine|contains|all:
            - reg
            - delete
            - hkcu\software\classes\ms-settings
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:46.907915+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:46.907915+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:46.907920+00:00'
