id: 863218bd-c7d0-4c52-80cd-0a96c09f54af
title: Arbitrary File Download Via IMEWDBLD.EXE
status: test
level: high
description: Detects usage of "IMEWDBLD.exe" to download arbitrary files
author: Swachchhanda Shrawan Poudel
date: '2023-11-09'
tags:
    - attack.defense-evasion
    - attack.execution
    - attack.t1218
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1105/T1105.md#atomic-test-10---windows---powershell-download
    - https://lolbas-project.github.io/lolbas/Binaries/IMEWDBLD/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''8d7e392e-9b28-49e1-831d-5949c6281228''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \IMEWDBLD.exe
        OriginalFileName: imewdbld.exe
    selection_cli:
        CommandLine|contains:
            - http://
            - https://
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:31:32.890965+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:31:32.890965+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:31:32.890991+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:31:32.890997+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:31:32.890999+00:00'
