title: Potentially Suspicious JWT Token Search Via CLI
id: 6d3a3952-6530-44a3-8554-cf17c116c615
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: 'Detects possible search for JWT tokens via CLI by looking for the string
    "eyJ0eX" or "eyJhbG".

    This string is used as an anchor to look for the start of the JWT token used by
    microsoft office and similar apps.

    '
references:
    - https://mrd0x.com/stealing-tokens-from-office-applications/
falsepositives:
    - Unknown
tags:
    - attack.credential-access
    - attack.t1528
date: '2022-10-25'
modified: '2024-10-06'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - eyJ0eXAiOi
            - eyJhbGciOi
            - ' eyJ0eX'
            - ' "eyJ0eX"'
            - ' ''eyJ0eX'''
            - ' eyJhbG'
            - ' "eyJhbG"'
            - ' ''eyJhbG'''
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:54.070156+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:54.070156+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:44:54.070171+00:00'
