id: 40b1fbe2-18ea-4ee7-be47-0294285811de
title: System Shutdown/Reboot - MacOs
status: test
level: informational
description: Adversaries may shutdown/reboot systems to interrupt access to, or aid
    in the destruction of, those systems.
author: Igor Fits, Mikhail Larin, oscd.community
date: '2020-10-19'
modified: '2022-11-26'
tags:
    - attack.impact
    - attack.t1529
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1529/T1529.md
falsepositives:
    - Legitimate administrative activity
taxonomy: sigma
logsource:
    category: process_creation
    product: macos
detection:
    selection:
        Image|endswith:
            - /shutdown
            - /reboot
            - /halt
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:14:25.799994+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-11-13T20:14:25.799994+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:14:25.799998+00:00'
