title: Tor Client/Browser Execution
id: 62f7c9bf-9135-49b2-8aeb-1e54a6ecc13c
status: test
level: high
author: frack113
description: Detects the use of Tor or Tor-Browser to connect to onion routing networks
references:
    - https://www.logpoint.com/en/blog/detecting-tor-use-with-logpoint/
falsepositives:
    - Unknown
tags:
    - attack.command-and-control
    - attack.t1090.003
date: '2022-02-20'
modified: '2023-02-13'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - \tor.exe
            - \Tor Browser\Browser\firefox.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:49:23.178947+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:49:23.178947+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:49:23.178961+00:00'
