id: e32f92d1-523e-49c3-9374-bdb13b46a3ba
title: Suspicious Mshta.EXE Execution Patterns
status: test
level: high
description: Detects suspicious mshta process execution patterns
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: '2021-07-17'
modified: '2023-02-21'
tags:
    - attack.execution
    - attack.t1106
references:
    - https://en.wikipedia.org/wiki/HTML_Application
    - https://www.echotrail.io/insights/search/mshta.exe
    - https://app.any.run/tasks/34221348-072d-4b70-93f3-aa71f6ebecad/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \mshta.exe
        OriginalFileName: MSHTA.EXE
    selection_susp:
        ParentImage|endswith:
            - \cmd.exe
            - \cscript.exe
            - \powershell.exe
            - \pwsh.exe
            - \regsvr32.exe
            - \rundll32.exe
            - \wscript.exe
        CommandLine|contains:
            - \AppData\Local\
            - C:\ProgramData\
            - C:\Users\Public\
            - C:\Windows\Temp\
    filter_img:
        Image|startswith:
            - C:\Windows\System32\
            - C:\Windows\SysWOW64\
        CommandLine|contains:
            - .htm
            - .hta
        CommandLine|endswith:
            - mshta.exe
            - mshta
    condition: all of selection_* or (selection_img and not filter_img)
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:30:43.946761+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:30:43.946761+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:30:43.946782+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:30:43.946783+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:30:43.946785+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:30:43.946786+00:00'
