id: 8e3c7994-131e-4ba5-b6ea-804d49113a26
title: Uncommon Child Process Spawned By Odbcconf.EXE
status: test
level: medium
description: Detects an uncommon child process of "odbcconf.exe" binary which normally
    shouldn't have any child processes.
author: Harjot Singh @cyb3rjy0t
date: '2023-05-22'
tags:
    - attack.defense-evasion
    - attack.t1218.008
references:
    - https://learn.microsoft.com/en-us/sql/odbc/odbcconf-exe?view=sql-server-ver16
    - https://lolbas-project.github.io/lolbas/Binaries/Odbcconf/
    - https://medium.com/@cyberjyot/t1218-008-dll-execution-using-odbcconf-exe-803fa9e08dac
falsepositives:
    - In rare occurrences where "odbcconf" crashes. It might spawn a "werfault" process
    - Other child processes will depend on the DLL being registered by actions like
        "regsvr". In case where the DLLs have external calls (which should be rare).
        Other child processes might spawn and additional filters need to be applied.
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \odbcconf.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:14.438029+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:14.438029+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:14.438035+00:00'
