title: Renamed SysInternals DebugView Execution
id: cd764533-2e07-40d6-a718-cfeec7f2da7f
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects suspicious renamed SysInternals DebugView execution
references:
    - https://www.epicturla.com/blog/sysinturla
falsepositives:
    - Unknown
tags:
    - attack.resource-development
    - attack.t1588.002
date: '2020-05-28'
modified: '2023-02-14'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Product: Sysinternals DebugView
    filter:
        OriginalFileName: Dbgview.exe
        Image|endswith: \Dbgview.exe
    condition: selection and not filter
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:49:29.248113+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:49:29.248113+00:00'
    detection_fields:
        -   source_field: Product
            target_table: process_activity
            target_field: metadata.product.name
            mapped_at: '2025-12-04T01:49:29.248128+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:49:29.248129+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:49:29.248131+00:00'
