id: bdeb2cff-af74-4094-8426-724dc937f20a
title: PowerShell Script Change Permission Via Set-Acl
status: test
level: high
description: Detects PowerShell execution to set the ACL of a file or a folder
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-10-18'
tags:
    - attack.defense-evasion
references:
    - https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.security/set-acl?view=powershell-5.1
    - https://github.com/redcanaryco/atomic-red-team/blob/74438b0237d141ee9c99747976447dc884cb1a39/atomics/T1505.005/T1505.005.md
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''cae80281-ef23-44c5-873b-fd48d2666f49''),
    type=<SigmaRelatedType.DERIVED: 2>), SigmaRelatedItem(id=UUID(''0944e002-e3f6-4eb5-bf69-3a3067b53d73''),
    type=<SigmaRelatedType.DERIVED: 2>), SigmaRelatedItem(id=UUID(''3bf1d859-3a7e-44cb-8809-a99e066d3478''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        OriginalFileName:
            - PowerShell.EXE
            - pwsh.dll
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
    selection_cmdlet:
        CommandLine|contains|all:
            - 'Set-Acl '
            - '-AclObject '
            - '-Path '
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:30:12.561572+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:30:12.561572+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:30:12.561584+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:30:12.561586+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:30:12.561588+00:00'
