title: Potential Data Exfiltration Activity Via CommandLine Tools
id: 7d1aaf3d-4304-425c-b7c3-162055e0b3ab
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects the use of various CLI utilities exfiltrating data via web requests
references:
    - https://www.sentinelone.com/blog/living-off-windows-defender-lockbit-ransomware-sideloads-cobalt-strike-through-microsoft-security-tool/
falsepositives:
    - Unlikely
tags:
    - attack.execution
    - attack.t1059.001
date: '2022-08-02'
modified: '2023-07-27'
logsource:
    category: process_creation
    product: windows
detection:
    selection_iwr:
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
            - \cmd.exe
        CommandLine|contains:
            - Invoke-WebRequest
            - 'iwr '
            - 'wget '
            - 'curl '
        CommandLine|contains|all:
            - ' -ur'
            - ' -me'
            - ' -b'
            - ' POST '
    selection_curl:
        Image|endswith: \curl.exe
        CommandLine|contains: --ur
    selection_curl_data:
        CommandLine|contains:
            - ' -d '
            - ' --data '
    selection_wget:
        Image|endswith: \wget.exe
        CommandLine|contains:
            - --post-data
            - --post-file
    payloads:
        CommandLine|contains:
            - Get-Content
            - GetBytes
            - hostname
            - ifconfig
            - ipconfig
            - net view
            - netstat
            - nltest
            - qprocess
            - sc query
            - systeminfo
            - tasklist
            - ToBase64String
            - whoami
        CommandLine|contains|all:
            - 'type '
            - ' > '
            - ' C:\'
    condition: (selection_iwr or all of selection_curl* or selection_wget) and payloads
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:46:30.185745+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:46:30.185745+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:46:30.185760+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:46:30.185762+00:00'
