id: e6313acd-208c-44fc-a0ff-db85d572e90e
title: Network Reconnaissance Activity
status: test
level: high
description: Detects a set of suspicious network related commands often used in recon
    stages
author: Florian Roth (Nextron Systems)
date: '2022-02-07'
tags:
    - attack.discovery
    - attack.t1087
    - attack.t1082
    - car.2016-03-001
references:
    - https://thedfirreport.com/2022/02/07/qbot-likes-to-move-it-move-it/
falsepositives:
    - False positives depend on scripts and administrative tools used in the monitored
        environment
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - nslookup
            - _ldap._tcp.dc._msdcs.
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:49.462663+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:49.462663+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:49.462677+00:00'
