title: Flush Iptables Ufw Chain
id: 3be619f4-d9ec-4ea8-a173-18fdd01996ab
status: test
level: medium
author: Joseliyo Sanchez, @Joseliyo_Jstnk
description: Detect use of iptables to flush all firewall rules, tables and chains
    and allow all network traffic
references:
    - https://blogs.blackberry.com/
    - https://www.cyberciti.biz/tips/linux-iptables-how-to-flush-all-rules.html
    - https://twitter.com/Joseliyo_Jstnk/status/1620131033474822144
falsepositives:
    - Network administrators
tags:
    - attack.defense-evasion
    - attack.t1562.004
date: '2023-01-18'
logsource:
    category: process_creation
    product: linux
detection:
    selection_img:
        Image|endswith:
            - /iptables
            - /xtables-legacy-multi
            - /iptables-legacy-multi
            - /ip6tables
            - /ip6tables-legacy-multi
    selection_params:
        CommandLine|contains:
            - -F
            - -Z
            - -X
    selection_ufw:
        CommandLine|contains:
            - ufw-logging-deny
            - ufw-logging-allow
            - ufw6-logging-deny
            - ufw6-logging-allow
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:26.865273+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:26.865273+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:36:26.865292+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:36:26.865297+00:00'
