id: 3b4b232a-af90-427c-a22f-30b0c0837b95
title: CMSTP Execution Process Access
status: stable
level: high
description: Detects various indicators of Microsoft Connection Manager Profile Installer
    execution
author: Nik Seetharaman
date: '2018-07-16'
modified: '2021-06-27'
tags:
    - attack.defense-evasion
    - attack.t1218.003
    - attack.execution
    - attack.t1559.001
    - attack.g0069
    - attack.g0080
    - car.2019-04-001
references:
    - https://web.archive.org/web/20190720093911/http://www.endurant.io/cmstp/detecting-cmstp-enabled-code-execution-and-uac-bypass-with-sysmon/
falsepositives:
    - Legitimate CMSTP use (unlikely in modern enterprise environments)
taxonomy: sigma
logsource:
    category: process_access
    product: windows
detection:
    selection:
        CallTrace|contains: cmlua.dll
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: process_access
            mapped_at: '2025-11-26T02:24:14.225131+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:24:14.225131+00:00'
    detection_fields:
        -   source_field: CallTrace
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:24:14.225148+00:00'
