id: 043c4b8b-3a54-4780-9682-081cb6b8185c
title: Suspicious IIS Module Registration
status: test
level: high
description: Detects a suspicious IIS module registration as described in Microsoft
    threat report on IIS backdoors
author: Florian Roth (Nextron Systems), Microsoft (idea)
date: '2022-08-04'
modified: '2023-01-23'
tags:
    - attack.persistence
    - attack.t1505.004
references:
    - https://www.microsoft.com/security/blog/2022/07/26/malicious-iis-extensions-quietly-open-persistent-backdoors-into-servers/
falsepositives:
    - Administrative activity
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|endswith: \w3wp.exe
    selection_cli_1:
        CommandLine|contains: appcmd.exe add module
    selection_cli_2:
        CommandLine|contains: ' system.enterpriseservices.internal.publish'
        Image|endswith: \powershell.exe
    selection_cli_3:
        CommandLine|contains|all:
            - gacutil
            - ' /I'
    condition: selection_parent and 1 of selection_cli_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:30:58.893575+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:30:58.893575+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:30:58.893600+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:30:58.893603+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:30:58.893604+00:00'
