title: Suspicious Invoke-WebRequest Execution With DirectIP
id: 1edff897-9146-48d2-9066-52e8d8f80a2f
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects calls to PowerShell with Invoke-WebRequest cmdlet using direct
    IP access
references:
    - https://www.huntress.com/blog/critical-vulnerabilities-in-papercut-print-management-software
falsepositives:
    - Unknown
tags:
    - attack.command-and-control
    - attack.t1105
date: '2023-04-21'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
        OriginalFileName:
            - PowerShell.EXE
            - pwsh.dll
    selection_commands:
        CommandLine|contains:
            - 'curl '
            - Invoke-WebRequest
            - 'iwr '
            - 'wget '
    selection_ip:
        CommandLine|contains:
            - ://1
            - ://2
            - ://3
            - ://4
            - ://5
            - ://6
            - ://7
            - ://8
            - ://9
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:49:24.432757+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:49:24.432757+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:49:24.432780+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:49:24.432783+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:49:24.432786+00:00'
