id: 6fe4aa1e-0531-4510-8be2-782154b73b48
title: File Recovery From Backup Via Wbadmin.EXE
status: experimental
level: medium
description: 'Detects the recovery of files from backups via "wbadmin.exe".

    Attackers can restore sensitive files such as NTDS.DIT or Registry Hives from
    backups in order to potentially extract credentials.

    '
author: Nasreddine Bencherchali (Nextron Systems), frack113
date: '2024-05-10'
tags:
    - attack.impact
    - attack.t1490
references:
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/wbadmin-start-recovery
    - https://lolbas-project.github.io/lolbas/Binaries/Wbadmin/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''84972c80-251c-4c3a-9079-4f00aad93938''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \wbadmin.exe
        OriginalFileName: WBADMIN.EXE
    selection_cli:
        CommandLine|contains|all:
            - ' recovery'
            - recoveryTarget
            - itemtype:File
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:51.924589+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:51.924589+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:51.924597+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:51.924598+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:51.924600+00:00'
