id: e7888eb1-13b0-4616-bd99-4bc0c2b054b9
title: Dllhost.EXE Execution Anomaly
status: test
level: high
description: Detects a "dllhost" process spawning with no commandline arguments which
    is very rare to happen and could indicate process injection activity or malware
    mimicking similar system processes.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-06-27'
modified: '2023-05-15'
tags:
    - attack.defense-evasion
    - attack.t1055
references:
    - https://redcanary.com/blog/child-processes/
    - https://nasbench.medium.com/what-is-the-dllhost-exe-process-actually-running-ef9fe4c19c08
    - https://www.ncsc.gov.uk/static-assets/documents/malware-analysis-reports/goofy-guineapig/NCSC-MAR-Goofy-Guineapig.pdf
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \dllhost.exe
        CommandLine:
            - dllhost.exe
            - dllhost
    filter_main_null:
        CommandLine: null
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:30.307168+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:30.307168+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:30.307175+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:30.307177+00:00'
