id: 2e65275c-8288-4ab4-aeb7-6274f58b6b20
title: Procdump Execution
status: test
level: medium
description: Detects usage of the SysInternals Procdump utility
author: Florian Roth (Nextron Systems)
date: '2021-08-16'
modified: '2023-02-28'
tags:
    - attack.defense-evasion
    - attack.t1036
    - attack.t1003.001
references:
    - https://learn.microsoft.com/en-us/sysinternals/downloads/procdump
falsepositives:
    - Legitimate use of procdump by a developer or administrator
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - \procdump.exe
            - \procdump64.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:16.866025+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:16.866025+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:16.866034+00:00'
