title: Potential Binary Proxy Execution Via VSDiagnostics.EXE
id: ac1c92b4-ac81-405a-9978-4604d78cc47e
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects execution of "VSDiagnostics.exe" with the "start" command in
    order to launch and proxy arbitrary binaries.
references:
    - https://twitter.com/0xBoku/status/1679200664013135872
falsepositives:
    - Legitimate usage for tracing and diagnostics purposes
tags:
    - attack.defense-evasion
    - attack.t1218
date: '2023-08-03'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \VSDiagnostics.exe
        OriginalFileName: VSDiagnostics.exe
    selection_cli_start:
        CommandLine|contains: start
    selection_cli_launch:
        CommandLine|contains:
            - ' /launch:'
            - ' -launch:'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:42:42.464489+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:42:42.464489+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:42:42.464513+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:42:42.464515+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:42:42.464516+00:00'
