title: HackTool - Stracciatella Execution
id: 7a4d9232-92fc-404d-8ce1-4c92e7caf539
status: test
level: high
author: pH-T (Nextron Systems)
description: Detects Stracciatella which executes a Powershell runspace from within
    C# (aka SharpPick technique) with AMSI, ETW and Script Block Logging disabled
    based on PE metadata characteristics.
references:
    - https://github.com/mgeeky/Stracciatella
falsepositives:
    - Unlikely
tags:
    - attack.execution
    - attack.defense-evasion
    - attack.t1059
    - attack.t1562.001
date: '2023-04-17'
modified: '2024-11-23'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \Stracciatella.exe
        OriginalFileName: Stracciatella.exe
        Description: Stracciatella
        Hashes|contains:
            - SHA256=9d25e61ec1527e2a69d7c2a4e3fe2fe15890710c198a66a9f25d99fdf6c7b956
            - SHA256=fd16609bd9830c63b9413671678bb159b89c357d21942ddbb6b93add808d121a
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:49:47.629866+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:49:47.629866+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:49:47.629953+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:49:47.629966+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: device.desc
            mapped_at: '2025-12-04T01:49:47.629970+00:00'
        -   source_field: Hashes
            target_table: process_activity
            target_field: process.file.hashes.value
            mapped_at: '2025-12-04T01:49:47.629973+00:00'
