id: 32e280f1-8ad4-46ef-9e80-910657611fbc
title: Potential Homoglyph Attack Using Lookalike Characters
status: test
level: medium
description: 'Detects the presence of unicode characters which are homoglyphs, or
    identical in appearance, to ASCII letter characters.

    This is used as an obfuscation and masquerading techniques. Only "perfect" homoglyphs
    are included; these are characters that

    are indistinguishable from ASCII characters and thus may make excellent candidates
    for homoglyph attack characters.

    '
author: Micah Babinski, @micahbabinski
date: '2023-05-07'
tags:
    - attack.defense-evasion
    - attack.t1036
    - attack.t1036.003
references:
    - https://redcanary.com/threat-detection-report/threats/socgholish/#threat-socgholish
    - http://www.irongeek.com/homoglyph-attack-generator.php
falsepositives:
    - Commandlines with legitimate Cyrillic text; will likely require tuning (or not
        be usable) in countries where these alphabets are in use.
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_upper:
        CommandLine|contains:
            - А
            - В
            - Е
            - К
            - М
            - Н
            - О
            - Р
            - С
            - Т
            - Х
            - Ѕ
            - І
            - Ј
            - Ү
            - Ӏ
            - Ԍ
            - Ԛ
            - Ԝ
            - Α
            - Β
            - Ε
            - Ζ
            - Η
            - Ι
            - Κ
            - Μ
            - Ν
            - Ο
            - Ρ
            - Τ
            - Υ
            - Χ
    selection_lower:
        CommandLine|contains:
            - а
            - е
            - о
            - р
            - с
            - х
            - ѕ
            - і
            - ӏ
            - ј
            - һ
            - ԁ
            - ԛ
            - ԝ
            - ο
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:40.492513+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:40.492513+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:40.492525+00:00'
