id: 33be4333-2c6b-44f4-ae28-102cdbde0a31
title: Suspicious Msbuild Execution By Uncommon Parent Process
status: test
level: medium
description: Detects suspicious execution of 'Msbuild.exe' by a uncommon parent process
author: frack113
date: '2022-11-17'
tags:
    - attack.defense-evasion
references:
    - https://app.any.run/tasks/abdf586e-df0c-4d39-89a7-06bf24913401/
    - https://www.echotrail.io/insights/search/msbuild.exe
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \MSBuild.exe
        OriginalFileName: MSBuild.exe
    filter_parent:
        ParentImage|endswith:
            - \devenv.exe
            - \cmd.exe
            - \msbuild.exe
            - \python.exe
            - \explorer.exe
            - \nuget.exe
    condition: selection and not filter_parent
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:57.108759+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:57.108759+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:57.108765+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:57.108767+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:57.108768+00:00'
