title: Uninstall Crowdstrike Falcon Sensor
id: f0f7be61-9cf5-43be-9836-99d6ef448a18
status: test
level: high
author: frack113
description: Adversaries may disable security tools to avoid possible detection of
    their tools and activities by uninstalling Crowdstrike Falcon
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
falsepositives:
    - Administrator might leverage the same command line for debugging or other purposes.
        However this action must be always investigated
tags:
    - attack.defense-evasion
    - attack.t1562.001
date: '2021-07-12'
modified: '2023-03-09'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - \WindowsSensor.exe
            - ' /uninstall'
            - ' /quiet'
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:46:44.921542+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:46:44.921542+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:46:44.921556+00:00'
