title: Potential Arbitrary File Download Via Cmdl32.EXE
id: f37aba28-a9e6-4045-882c-d5004043b337
status: test
level: medium
author: frack113
description: 'Detects execution of Cmdl32 with the "/vpn" and "/lan" flags.

    Attackers can abuse this utility in order to download arbitrary files via a configuration
    file.

    Inspect the location and the content of the file passed as an argument in order
    to determine if it is suspicious.

    '
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Cmdl32/
    - https://twitter.com/SwiftOnSecurity/status/1455897435063074824
    - https://github.com/LOLBAS-Project/LOLBAS/pull/151
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.defense-evasion
    - attack.t1218
    - attack.t1202
date: '2021-11-03'
modified: '2024-04-22'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \cmdl32.exe
        OriginalFileName: CMDL32.EXE
    selection_cli:
        CommandLine|contains|all:
            - /vpn
            - /lan
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:31.734401+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:31.734401+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:44:31.734412+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:44:31.734414+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:44:31.734415+00:00'
