id: dee4af55-1f22-4e1d-a9d2-4bdc7ecb472a
title: Disabled Volume Snapshots
status: test
level: high
description: Detects commands that temporarily turn off Volume Snapshots
author: Florian Roth (Nextron Systems)
date: '2021-01-28'
modified: '2023-12-15'
tags:
    - attack.defense-evasion
    - attack.t1562.001
references:
    - https://twitter.com/0gtweet/status/1354766164166115331
falsepositives:
    - Legitimate administration
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - \Services\VSS\Diag
            - /d Disabled
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:14.435405+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:14.435405+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:14.435409+00:00'
