title: PUA - Wsudo Suspicious Execution
id: bdeeabc9-ff2a-4a51-be59-bb253aac7891
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects usage of wsudo (Windows Sudo Utility). Which is a tool that let
    the user execute programs with different permissions (System, Trusted Installer,
    Administrator...etc)
references:
    - https://github.com/M2Team/Privexec/
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.privilege-escalation
    - attack.t1059
date: '2022-12-02'
modified: '2023-02-14'
logsource:
    category: process_creation
    product: windows
detection:
    selection_metadata:
        Image|endswith: \wsudo.exe
        OriginalFileName: wsudo.exe
        Description: Windows sudo utility
        ParentImage|endswith: \wsudo-bridge.exe
    selection_cli:
        CommandLine|contains:
            - -u System
            - -uSystem
            - -u TrustedInstaller
            - -uTrustedInstaller
            - ' --ti '
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:47:13.507972+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:47:13.507972+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:47:13.507993+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:47:13.507994+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: device.desc
            mapped_at: '2025-12-04T01:47:13.507996+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:47:13.507997+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:47:13.507998+00:00'
