id: 6c6d9280-e6d0-4b9d-80ac-254701b64916
title: Potential NTLM Coercion Via Certutil.EXE
status: test
level: high
description: Detects possible NTLM coercion via certutil using the 'syncwithWU' flag
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-09-01'
modified: '2023-02-14'
tags:
    - attack.defense-evasion
    - attack.t1218
references:
    - https://github.com/LOLBAS-Project/LOLBAS/issues/243
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \certutil.exe
        OriginalFileName: CertUtil.exe
    selection_cli:
        CommandLine|contains|all:
            - ' -syncwithWU '
            - ' \\'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:31:36.904291+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:31:36.904291+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:31:36.904308+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:31:36.904310+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:31:36.904311+00:00'
