id: ef9dcfed-690c-4c5d-a9d1-482cd422225c
title: Browser Execution In Headless Mode
status: test
level: medium
description: Detects execution of Chromium based browser in headless mode
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-09-12'
tags:
    - attack.command-and-control
    - attack.t1105
references:
    - https://twitter.com/mrd0x/status/1478234484881436672?s=12
    - https://www.trendmicro.com/en_us/research/23/e/managed-xdr-investigation-of-ducktail-in-trend-micro-vision-one.html
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''0e8cfe08-02c9-4815-a2f8-0d157b7ed33e''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - \brave.exe
            - \chrome.exe
            - \msedge.exe
            - \opera.exe
            - \vivaldi.exe
        CommandLine|contains: --headless
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:31:56.575669+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:31:56.575669+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:31:56.575683+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:31:56.575685+00:00'
