id: 1c12727d-02bf-45ff-a9f3-d49806a3cf43
title: Renamed Plink Execution
status: test
level: high
description: Detects the execution of a renamed version of the Plink binary
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-06-06'
modified: '2023-02-03'
tags:
    - attack.defense-evasion
    - attack.t1036
references:
    - https://thedfirreport.com/2022/06/06/will-the-real-msiexec-please-stand-up-exploit-leads-to-data-exfiltration/
    - https://the.earth.li/~sgtatham/putty/0.58/htmldoc/Chapter7.html
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        OriginalFileName: Plink
        CommandLine|contains|all:
            - ' -l forward'
            - ' -P '
            - ' -R '
    filter:
        Image|endswith: \plink.exe
    condition: selection and not filter
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:38.620341+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:38.620341+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:38.620356+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:38.620358+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:38.620360+00:00'
