title: Active Directory Database Snapshot Via ADExplorer
id: 9212f354-7775-4e28-9c9f-8f0a4544e664
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects the execution of Sysinternals ADExplorer with the "-snapshot"
    flag in order to save a local copy of the active directory database.
references:
    - https://www.documentcloud.org/documents/5743766-Global-Threat-Report-2019.html
falsepositives:
    - Unknown
tags:
    - attack.credential-access
    - attack.t1552.001
    - attack.t1003.003
date: '2023-03-14'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \ADExplorer.exe
        OriginalFileName: AdExp
    selection_cli:
        CommandLine|contains: snapshot
    condition: all of selection_*
related:
    -   id: ef61af62-bc74-4f58-b49b-626448227652
        type: derived
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:41.432614+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:41.432614+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:44:41.432687+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:44:41.432692+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:44:41.432695+00:00'
