id: 70ad0861-d1fe-491c-a45f-fa48148a300d
title: File Download via CertOC.EXE
status: test
level: medium
description: Detects when a user downloads a file by using CertOC.exe
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-05-16'
modified: '2023-10-18'
tags:
    - attack.command-and-control
    - attack.t1105
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Certoc/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''b86f6dea-0b2f-41f5-bdcc-a057bd19cd6a''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \certoc.exe
        OriginalFileName: CertOC.exe
    selection_cli:
        CommandLine|contains|all:
            - -GetCACAPS
            - http
    condition: all of selection*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:45.417384+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:45.417384+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:45.417389+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:45.417390+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:45.417391+00:00'
