title: Potentially Suspicious Event Viewer Child Process
id: be344333-921d-4c4d-8bb8-e584cf584780
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects uncommon or suspicious child processes of "eventvwr.exe" which
    might indicate a UAC bypass attempt
references:
    - https://enigma0x3.net/2016/08/15/fileless-uac-bypass-using-eventvwr-exe-and-registry-hijacking/
    - https://www.hybrid-analysis.com/sample/e122bc8bf291f15cab182a5d2d27b8db1e7019e4e96bb5cdbd1dfe7446f3f51f?environmentId=100
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
    - car.2019-04-001
date: '2017-03-19'
modified: '2023-09-28'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \eventvwr.exe
    filter_main_generic:
        Image|endswith:
            - :\Windows\System32\mmc.exe
            - :\Windows\System32\WerFault.exe
            - :\Windows\SysWOW64\WerFault.exe
    condition: selection and not 1 of filter_main_*
related:
    -   id: 7c81fec3-1c1d-43b0-996a-46753041b1b6
        type: derived
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:50:28.593867+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:50:28.593867+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:50:28.593885+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:50:28.593888+00:00'
