title: Shell Invocation via Env Command - Linux
id: bed978f8-7f3a-432b-82c5-9286a9b3031a
status: experimental
level: high
author: Li Ling, Andy Parkidomo, Robert Rakowski, Blake Hartstein (Bloomberg L.P.)
description: 'Detects the use of the env command to invoke a shell. This may indicate
    an attempt to bypass restricted environments, escalate privileges, or execute
    arbitrary commands.

    '
references:
    - https://gtfobins.github.io/gtfobins/env/#shell
    - https://www.elastic.co/guide/en/security/current/linux-restricted-shell-breakout-via-linux-binary-s.html
falsepositives:
    - Github operations such as ghe-backup
tags:
    - attack.execution
    - attack.t1059
date: '2024-09-02'
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith: /env
        CommandLine|endswith:
            - /bin/bash
            - /bin/dash
            - /bin/fish
            - /bin/sh
            - /bin/zsh
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:35:54.919533+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:35:54.919533+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:35:54.919560+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:35:54.919562+00:00'
