title: PUA - CsExec Execution
id: d08a2711-ee8b-4323-bdec-b7d85e892b31
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects the use of the lesser known remote execution tool named CsExec
    a PsExec alternative
references:
    - https://github.com/malcomvetter/CSExec
    - https://www.microsoft.com/security/blog/2022/05/09/ransomware-as-a-service-understanding-the-cybercrime-gig-economy-and-how-to-protect-yourself/
falsepositives:
    - Unknown
tags:
    - attack.resource-development
    - attack.t1587.001
    - attack.execution
    - attack.t1569.002
date: '2022-08-22'
modified: '2023-02-21'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \csexec.exe
    selection_pe:
        Description: csexec
    condition: 1 of selection*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:46:13.971535+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:46:13.971535+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:46:13.971556+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: device.desc
            mapped_at: '2025-12-04T01:46:13.971560+00:00'
