title: MacOS Network Service Scanning
id: 84bae5d4-b518-4ae0-b331-6d4afd34d00f
status: test
level: low
author: Alejandro Ortuno, oscd.community
description: Detects enumeration of local or remote network services.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1046/T1046.md
falsepositives:
    - Legitimate administration activities
tags:
    - attack.discovery
    - attack.t1046
date: '2020-10-21'
modified: '2021-11-27'
logsource:
    category: process_creation
    product: macos
detection:
    selection_1:
        Image|endswith:
            - /nc
            - /netcat
    selection_2:
        Image|endswith:
            - /nmap
            - /telnet
    filter:
        CommandLine|contains: l
    condition: (selection_1 and not filter) or selection_2
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:34:32.439122+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-12-04T01:34:32.439122+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:34:32.439135+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:34:32.439137+00:00'
