title: PUA - NirCmd Execution As LOCAL SYSTEM
id: d9047477-0359-48c9-b8c7-792cedcdc9c4
status: test
level: high
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
description: Detects the use of NirCmd tool for command execution as SYSTEM user
references:
    - https://www.nirsoft.net/utils/nircmd.html
    - https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/
    - https://www.nirsoft.net/utils/nircmd2.html#using
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Legitimate use by administrators
tags:
    - attack.execution
    - attack.t1569.002
    - attack.s0029
date: '2022-01-24'
modified: '2023-02-13'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains: ' runassystem '
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:51:08.581230+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:51:08.581230+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:51:08.581249+00:00'
