title: HackTool - LocalPotato Execution
id: 6bd75993-9888-4f91-9404-e1e4e4e34b77
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects the execution of the LocalPotato POC based on basic PE metadata
    information and default CLI examples
references:
    - https://www.localpotato.com/localpotato_html/LocalPotato.html
    - https://github.com/decoder-it/LocalPotato
falsepositives:
    - Unlikely
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - cve.2023-21746
date: '2023-02-14'
modified: '2024-11-23'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \LocalPotato.exe
    selection_cli:
        CommandLine|contains|all:
            - .exe -i C:\
            - -o Windows\
    selection_hash_plain:
        Hashes|contains:
            - IMPHASH=E1742EE971D6549E8D4D81115F88F1FC
            - IMPHASH=DD82066EFBA94D7556EF582F247C8BB5
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:47:14.825009+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:47:14.825009+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:47:14.825021+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:47:14.825024+00:00'
        -   source_field: Hashes
            target_table: process_activity
            target_field: process.file.hashes.value
            mapped_at: '2025-12-04T01:47:14.825025+00:00'
