id: 9fc51a3c-81b3-4fa7-b35f-7c02cf10fd2d
title: Usage Of Web Request Commands And Cmdlets
status: test
level: medium
description: Detects the use of various web request commands with commandline tools
    and Windows PowerShell cmdlets (including aliases) via CommandLine
author: James Pemberton / @4A616D6573, Endgame, JHasenbusch, oscd.community, Austin
    Songer @austinsonger
date: '2019-10-24'
modified: '2023-01-10'
tags:
    - attack.execution
    - attack.t1059.001
references:
    - https://4sysops.com/archives/use-powershell-to-download-a-file-with-http-https-and-ftp/
    - https://blog.jourdant.me/post/3-ways-to-download-files-with-powershell
    - https://learn.microsoft.com/en-us/powershell/module/bitstransfer/add-bitsfile?view=windowsserver2019-ps
falsepositives:
    - Use of Get-Command and Get-Help modules to reference Invoke-WebRequest and Start-BitsTransfer.
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''1139d2e2-84b1-4226-b445-354492eba8ba''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''f67dbfce-93bc-440d-86ad-a95ae8858c90''),
    type=<SigmaRelatedType.OBSOLETE: 4>), SigmaRelatedItem(id=UUID(''cd5c8085-4070-4e22-908d-a5b3342deb74''),
    type=<SigmaRelatedType.OBSOLETE: 4>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - '[System.Net.WebRequest]::create'
            - 'curl '
            - Invoke-RestMethod
            - Invoke-WebRequest
            - 'iwr '
            - Net.WebClient
            - Resume-BitsTransfer
            - Start-BitsTransfer
            - 'wget '
            - WinHttp.WinHttpRequest
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:45.422636+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:45.422636+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:45.422640+00:00'
