title: Uncommon Svchost Parent Process
id: 01d2e2a1-5f09-44f7-9fc1-24faa7479b6d
status: test
level: medium
author: Florian Roth (Nextron Systems)
description: Detects an uncommon svchost parent process
references:
    - Internal Research
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1036.005
date: '2017-08-15'
modified: '2022-06-28'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \svchost.exe
    filter_main_generic:
        ParentImage|endswith:
            - \Mrt.exe
            - \MsMpEng.exe
            - \ngen.exe
            - \rpcnet.exe
            - \services.exe
            - \TiWorker.exe
    filter_main_parent_null:
        ParentImage: null
    filter_main_parent_empty:
        ParentImage:
            - '-'
            - ''
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:22.006448+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:22.006448+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:44:22.006460+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:44:22.006462+00:00'
