title: Suspicious Process Execution From Fake Recycle.Bin Folder
id: 5ce0f04e-3efc-42af-839d-5b3a543b76c0
status: test
level: high
author: X__Junior (Nextron Systems)
description: Detects process execution from a fake recycle bin folder, often used
    to avoid security solution.
references:
    - https://www.mandiant.com/resources/blog/infected-usb-steal-secrets
    - https://unit42.paloaltonetworks.com/cloaked-ursa-phishing/
falsepositives:
    - Unlikely
tags:
    - attack.persistence
    - attack.defense-evasion
date: '2023-07-12'
modified: '2023-12-11'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|contains:
            - RECYCLERS.BIN\
            - RECYCLER.BIN\
    condition: selection
related:
    -   id: cd8b36ac-8e4a-4c2f-a402-a29b8fbd5bca
        type: derived
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:48:14.878833+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:48:14.878833+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:48:14.878848+00:00'
