id: 56454143-524f-49fb-b1c6-3fb8b1ad41fb
title: Suspicious File Download From File Sharing Domain Via Curl.EXE
status: experimental
level: high
description: Detects potentially suspicious file download from file sharing domains
    using curl.exe
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-05-05'
modified: '2024-10-21'
tags:
    - attack.execution
references:
    - https://labs.withsecure.com/publications/fin7-target-veeam-servers
    - https://github.com/WithSecureLabs/iocs/blob/344203de742bb7e68bd56618f66d34be95a9f9fc/FIN7VEEAM/iocs.csv
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \curl.exe
        OriginalFileName: curl.exe
    selection_websites:
        CommandLine|contains:
            - .githubusercontent.com
            - anonfiles.com
            - cdn.discordapp.com
            - ddns.net
            - dl.dropboxusercontent.com
            - ghostbin.co
            - glitch.me
            - gofile.io
            - hastebin.com
            - mediafire.com
            - mega.nz
            - onrender.com
            - pages.dev
            - paste.ee
            - pastebin.com
            - pastebin.pl
            - pastetext.net
            - pixeldrain.com
            - privatlab.com
            - privatlab.net
            - send.exploit.in
            - sendspace.com
            - storage.googleapis.com
            - storjshare.io
            - supabase.co
            - temp.sh
            - transfer.sh
            - trycloudflare.com
            - ufile.io
            - w3spaces.com
            - workers.dev
    selection_http:
        CommandLine|contains: http
    selection_flag:
        CommandLine|contains:
            - ' -O'
            - --remote-name
            - --output
    selection_ext:
        CommandLine|endswith:
            - .ps1
            - .ps1'
            - .ps1"
            - .dat
            - .dat'
            - .dat"
            - .msi
            - .msi'
            - .msi"
            - .bat
            - .bat'
            - .bat"
            - .exe
            - .exe'
            - .exe"
            - .vbs
            - .vbs'
            - .vbs"
            - .vbe
            - .vbe'
            - .vbe"
            - .hta
            - .hta'
            - .hta"
            - .dll
            - .dll'
            - .dll"
            - .psm1
            - .psm1'
            - .psm1"
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:30:11.759805+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:30:11.759805+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:30:11.759819+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:30:11.759821+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:30:11.759823+00:00'
