title: New User Created Via Net.EXE
id: cd219ff3-fa99-45d4-8380-a7d15116c6dc
status: test
level: medium
author: Endgame, JHasenbusch (adapted to Sigma for oscd.community)
description: Identifies the creation of local users via the net.exe command.
references:
    - https://eqllib.readthedocs.io/en/latest/analytics/014c3f51-89c6-40f1-ac9c-5688f26090ab.html
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1136.001/T1136.001.md
falsepositives:
    - Legitimate user creation.
    - Better use event IDs for user creation rather than command line rules.
tags:
    - attack.persistence
    - attack.t1136.001
date: '2018-10-30'
modified: '2023-02-21'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \net.exe
            - \net1.exe
        OriginalFileName:
            - net.exe
            - net1.exe
    selection_cli:
        CommandLine|contains|all:
            - user
            - add
    condition: all of selection_*
related:
    -   id: b9f0e6f5-09b4-4358-bae4-08408705bd5c
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:43:57.834239+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:43:57.834239+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:43:57.834252+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:43:57.834254+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:43:57.834256+00:00'
