id: 97de11cd-4b67-4abf-9a8b-1020e670aa9e
title: Pnscan Binary Data Transmission Activity
status: experimental
level: medium
description: 'Detects command line patterns associated with the use of Pnscan for
    sending and receiving binary data across the network.

    This behavior has been identified in a Linux malware campaign targeting Docker,
    Apache Hadoop, Redis, and Confluence and was previously used by the threat actor
    known as TeamTNT

    '
author: David Burkett (@signalblur)
date: '2024-04-16'
tags:
    - attack.discovery
    - attack.t1046
references:
    - https://www.cadosecurity.com/blog/spinning-yarn-a-new-linux-malware-campaign-targets-docker-apache-hadoop-redis-and-confluence
    - https://intezer.com/wp-content/uploads/2021/09/TeamTNT-Cryptomining-Explosion.pdf
    - https://regex101.com/r/RugQYK/1
    - https://www.virustotal.com/gui/file/beddf70a7bab805f0c0b69ac0989db6755949f9f68525c08cb874988353f78a9/content
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        CommandLine|re: -(W|R)\s?(\s|"|')([0-9a-fA-F]{2}\s?){2,20}(\s|"|')
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:15:51.681936+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-13T20:15:51.681936+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:15:51.681954+00:00'
