id: 98c5aeef-32d5-492f-b174-64a691896d25
title: Service Security Descriptor Tampering Via Sc.EXE
status: test
level: medium
description: Detection of sc.exe utility adding a new service with special permission
    which hides that service.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-02-28'
tags:
    - attack.persistence
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1574.011
references:
    - https://blog.talosintelligence.com/2021/10/threat-hunting-in-large-datasets-by.html
    - https://www.sans.org/blog/red-team-tactics-hiding-windows-services/
    - https://twitter.com/Alh4zr3d/status/1580925761996828672
    - https://twitter.com/0gtweet/status/1628720819537936386
    - https://itconnect.uw.edu/tools-services-support/it-systems-infrastructure/msinf/other-help/understanding-sddl-syntax/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''99cf1e02-00fb-4c0d-8375-563f978dfd37''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''a537cfc3-4297-4789-92b5-345bfd845ad0''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \sc.exe
        OriginalFileName: sc.exe
    selection_cli:
        CommandLine|contains: sdset
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:46.329277+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:46.329277+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:46.329289+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:46.329292+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:46.329294+00:00'
