id: e66779cc-383e-4224-a3a4-267eeb585c40
title: Bypass UAC via CMSTP
status: test
level: high
description: Detect commandline usage of Microsoft Connection Manager Profile Installer
    (cmstp.exe) to install specially formatted local .INF files
author: E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community
date: '2019-10-24'
modified: '2022-08-30'
tags:
    - attack.privilege-escalation
    - attack.defense-evasion
    - attack.t1548.002
    - attack.t1218.003
references:
    - https://eqllib.readthedocs.io/en/latest/analytics/e584f1a1-c303-4885-8a66-21360c90995b.html
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.003/T1218.003.md
    - https://lolbas-project.github.io/lolbas/Binaries/Cmstp/
fields:
    - ComputerName
    - User
    - CommandLine
falsepositives:
    - Legitimate use of cmstp.exe utility by legitimate user
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \cmstp.exe
        OriginalFileName: CMSTP.EXE
    selection_cli:
        CommandLine|contains:
            - /s
            - -s
            - /au
            - -au
            - /ni
            - -ni
    condition: all of selection*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:32.050839+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:32.050839+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:32.050844+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:32.050846+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:32.050847+00:00'
