id: 07aa184a-870d-413d-893a-157f317f6f58
title: Suspicious Reconnaissance Activity Via GatherNetworkInfo.VBS
status: test
level: high
description: Detects execution of the built-in script located in "C:\Windows\System32\gatherNetworkInfo.vbs".
    Which can be used to gather information about the target machine
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-02-08'
tags:
    - attack.discovery
    - attack.execution
    - attack.t1615
    - attack.t1059.005
references:
    - https://posts.slayerlabs.com/living-off-the-land/#gathernetworkinfovbs
    - https://www.mandiant.com/resources/blog/trojanized-windows-installers-ukrainian-government
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''f92a6f1e-a512-4a15-9735-da09e78d7273''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''575dce0c-8139-4e30-9295-1ee75969f7fe''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains: gatherNetworkInfo.vbs
    filter:
        Image|endswith:
            - \cscript.exe
            - \wscript.exe
    condition: selection and not filter
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:32.058797+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:32.058797+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:32.058803+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:32.058804+00:00'
