id: ef61af62-bc74-4f58-b49b-626448227652
title: Suspicious Active Directory Database Snapshot Via ADExplorer
status: test
level: high
description: Detects the execution of Sysinternals ADExplorer with the "-snapshot"
    flag in order to save a local copy of the active directory database to a suspicious
    directory.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-03-14'
tags:
    - attack.credential-access
    - attack.t1552.001
    - attack.t1003.003
references:
    - https://www.documentcloud.org/documents/5743766-Global-Threat-Report-2019.html
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''9212f354-7775-4e28-9c9f-8f0a4544e664''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \ADExplorer.exe
        OriginalFileName: AdExp
    selection_flag:
        CommandLine|contains: snapshot
    selection_paths:
        CommandLine|contains:
            - \Downloads\
            - \Users\Public\
            - \AppData\
            - \Windows\Temp\
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:58.336950+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:58.336950+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:58.336955+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:58.336957+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:58.336958+00:00'
