title: Chmod Suspicious Directory
id: 6419afd1-3742-47a5-a7e6-b50386cd15f8
status: test
level: medium
author: Christopher Peacock @SecurePeacock, SCYTHE @scythe_io
description: Detects chmod targeting files in abnormal directory paths.
references:
    - https://www.intezer.com/blog/malware-analysis/new-backdoor-sysjoker/
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1222.002/T1222.002.md
falsepositives:
    - Admin changing file permissions.
tags:
    - attack.defense-evasion
    - attack.t1222.002
date: '2022-06-03'
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith: /chmod
        CommandLine|contains:
            - /tmp/
            - /.Library/
            - /etc/
            - /opt/
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:49.287877+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:49.287877+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:36:49.287908+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:36:49.287912+00:00'
