title: PUA - NPS Tunneling Tool Execution
id: 68d37776-61db-42f5-bf54-27e87072d17e
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects the use of NPS, a port forwarding and intranet penetration proxy
    server
references:
    - https://github.com/ehang-io/nps
falsepositives:
    - Legitimate use
tags:
    - attack.command-and-control
    - attack.t1090
date: '2022-10-08'
modified: '2024-11-23'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \npc.exe
    selection_cli_1:
        CommandLine|contains|all:
            - ' -server='
            - ' -vkey='
            - ' -password='
    selection_cli_2:
        CommandLine|contains: ' -config=npc'
    selection_hashes:
        Hashes|contains:
            - MD5=AE8ACF66BFE3A44148964048B826D005
            - SHA1=CEA49E9B9B67F3A13AD0BE1C2655293EA3C18181
            - SHA256=5A456283392FFCEEEACA3D3426C306EB470304637520D72FED1CC1FEBBBD6856
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:48:43.865366+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:48:43.865366+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:48:43.865384+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:48:43.865386+00:00'
        -   source_field: Hashes
            target_table: process_activity
            target_field: process.file.hashes.value
            mapped_at: '2025-12-04T01:48:43.865389+00:00'
