title: Suspicious Obfuscated PowerShell Code
id: 8d01b53f-456f-48ee-90f6-bc28e67d4e35
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects suspicious UTF16 and base64 encoded and often obfuscated PowerShell
    code often used in command lines
references:
    - https://app.any.run/tasks/fcadca91-3580-4ede-aff4-4d2bf809bf99/
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
date: '2022-07-11'
modified: '2023-02-14'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - IAAtAGIAeABvAHIAIAAwAHgA
            - AALQBiAHgAbwByACAAMAB4A
            - gAC0AYgB4AG8AcgAgADAAeA
            - AC4ASQBuAHYAbwBrAGUAKAApACAAfAAg
            - AuAEkAbgB2AG8AawBlACgAKQAgAHwAI
            - ALgBJAG4AdgBvAGsAZQAoACkAIAB8AC
            - AHsAMQB9AHsAMAB9ACIAIAAtAGYAI
            - B7ADEAfQB7ADAAfQAiACAALQBmAC
            - AewAxAH0AewAwAH0AIgAgAC0AZgAg
            - AHsAMAB9AHsAMwB9ACIAIAAtAGYAI
            - B7ADAAfQB7ADMAfQAiACAALQBmAC
            - AewAwAH0AewAzAH0AIgAgAC0AZgAg
            - AHsAMgB9AHsAMAB9ACIAIAAtAGYAI
            - B7ADIAfQB7ADAAfQAiACAALQBmAC
            - AewAyAH0AewAwAH0AIgAgAC0AZgAg
            - AHsAMQB9AHsAMAB9ACcAIAAtAGYAI
            - B7ADEAfQB7ADAAfQAnACAALQBmAC
            - AewAxAH0AewAwAH0AJwAgAC0AZgAg
            - AHsAMAB9AHsAMwB9ACcAIAAtAGYAI
            - B7ADAAfQB7ADMAfQAnACAALQBmAC
            - AewAwAH0AewAzAH0AJwAgAC0AZgAg
            - AHsAMgB9AHsAMAB9ACcAIAAtAGYAI
            - B7ADIAfQB7ADAAfQAnACAALQBmAC
            - AewAyAH0AewAwAH0AJwAgAC0AZgAg
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:47:50.349765+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:47:50.349765+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:47:50.349815+00:00'
