id: ca5583e9-8f80-46ac-ab91-7f314d13b984
title: Potentially Suspicious Child Process of KeyScrambler.exe
status: experimental
level: medium
description: Detects potentially suspicious child processes of KeyScrambler.exe
author: Swachchhanda Shrawan Poudel
date: '2024-05-13'
tags:
    - attack.execution
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1203
    - attack.t1574.002
references:
    - https://twitter.com/DTCERT/status/1712785421845790799
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''d2451be2-b582-4e15-8701-4196ac180260''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|endswith: \KeyScrambler.exe
    selection_binaries:
        Image|endswith:
            - \cmd.exe
            - \cscript.exe
            - \mshta.exe
            - \powershell.exe
            - \pwsh.exe
            - \regsvr32.exe
            - \rundll32.exe
            - \wscript.exe
        OriginalFileName:
            - Cmd.Exe
            - cscript.exe
            - mshta.exe
            - PowerShell.EXE
            - pwsh.dll
            - regsvr32.exe
            - RUNDLL32.EXE
            - wscript.exe
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:03.245885+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:03.245885+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:03.245893+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:03.245894+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:03.245895+00:00'
