title: Use Icacls to Hide File to Everyone
id: 4ae81040-fc1c-4249-bfa3-938d260214d9
status: test
level: medium
author: frack113
description: Detect use of icacls to deny access for everyone in Users folder sometimes
    used to hide malicious files
references:
    - https://app.any.run/tasks/1df999e6-1cb8-45e3-8b61-499d1b7d5a9b/
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1564.001
date: '2022-07-18'
modified: '2024-04-29'
logsource:
    category: process_creation
    product: windows
detection:
    selection_icacls:
        OriginalFileName: iCACLS.EXE
        Image|endswith: \icacls.exe
    selection_cmd:
        CommandLine|contains|all:
            - /deny
            - '*S-1-1-0:'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:49:36.716086+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:49:36.716086+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:49:36.716127+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:49:36.716134+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:49:36.716137+00:00'
