id: db1ac3be-f606-4e3a-89e0-9607cbe6b98a
title: Capsh Shell Invocation - Linux
status: experimental
level: high
description: 'Detects the use of the "capsh" utility to invoke a shell.

    '
author: Li Ling, Andy Parkidomo, Robert Rakowski, Blake Hartstein (Bloomberg L.P.)
date: '2024-09-02'
tags:
    - attack.execution
    - attack.t1059
references:
    - https://gtfobins.github.io/gtfobins/capsh/#shell
    - https://www.elastic.co/guide/en/security/current/linux-restricted-shell-breakout-via-linux-binary-s.html
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith: /capsh
        CommandLine|endswith: ' --'
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:17:01.257378+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-26T02:17:01.257378+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:17:01.257390+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:17:01.257392+00:00'
