id: 1816994b-42e1-4fb1-afd2-134d88184f71
title: PowerShell Base64 Encoded WMI Classes
status: test
level: high
description: Detects calls to base64 encoded WMI class such as "Win32_ShadowCopy",
    "Win32_ScheduledJob", etc.
author: Christian Burkard (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: '2023-01-30'
tags:
    - attack.execution
    - attack.t1059.001
    - attack.defense-evasion
    - attack.t1027
references:
    - https://github.com/Neo23x0/Raccine/blob/20a569fa21625086433dcce8bb2765d0ea08dcb6/yara/mal_revil.yar
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''47688f1b-9f51-4656-b013-3cc49a166a36''),
    type=<SigmaRelatedType.OBSOLETE: 4>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
        OriginalFileName:
            - PowerShell.EXE
            - pwsh.dll
    selection_cli_shadowcopy:
        CommandLine|contains:
            - VwBpAG4AMwAyAF8AUwBoAGEAZABvAHcAYwBvAHAAeQ
            - cAaQBuADMAMgBfAFMAaABhAGQAbwB3AGMAbwBwAHkA
            - XAGkAbgAzADIAXwBTAGgAYQBkAG8AdwBjAG8AcAB5A
            - V2luMzJfU2hhZG93Y29we
            - dpbjMyX1NoYWRvd2NvcH
            - XaW4zMl9TaGFkb3djb3B5
    selection_cli_scheduledJob:
        CommandLine|contains:
            - VwBpAG4AMwAyAF8AUwBjAGgAZQBkAHUAbABlAGQASgBvAGIA
            - cAaQBuADMAMgBfAFMAYwBoAGUAZAB1AGwAZQBkAEoAbwBiA
            - XAGkAbgAzADIAXwBTAGMAaABlAGQAdQBsAGUAZABKAG8AYg
            - V2luMzJfU2NoZWR1bGVkSm9i
            - dpbjMyX1NjaGVkdWxlZEpvY
            - XaW4zMl9TY2hlZHVsZWRKb2
    selection_cli_process:
        CommandLine|contains:
            - VwBpAG4AMwAyAF8AUAByAG8AYwBlAHMAcw
            - cAaQBuADMAMgBfAFAAcgBvAGMAZQBzAHMA
            - XAGkAbgAzADIAXwBQAHIAbwBjAGUAcwBzA
            - V2luMzJfUHJvY2Vzc
            - dpbjMyX1Byb2Nlc3
            - XaW4zMl9Qcm9jZXNz
    selection_cli_useraccount:
        CommandLine|contains:
            - VwBpAG4AMwAyAF8AVQBzAGUAcgBBAGMAYwBvAHUAbgB0A
            - cAaQBuADMAMgBfAFUAcwBlAHIAQQBjAGMAbwB1AG4AdA
            - XAGkAbgAzADIAXwBVAHMAZQByAEEAYwBjAG8AdQBuAHQA
            - V2luMzJfVXNlckFjY291bn
            - dpbjMyX1VzZXJBY2NvdW50
            - XaW4zMl9Vc2VyQWNjb3Vud
    selection_cli_loggedonuser:
        CommandLine|contains:
            - VwBpAG4AMwAyAF8ATABvAGcAZwBlAGQATwBuAFUAcwBlAHIA
            - cAaQBuADMAMgBfAEwAbwBnAGcAZQBkAE8AbgBVAHMAZQByA
            - XAGkAbgAzADIAXwBMAG8AZwBnAGUAZABPAG4AVQBzAGUAcg
            - V2luMzJfTG9nZ2VkT25Vc2Vy
            - dpbjMyX0xvZ2dlZE9uVXNlc
            - XaW4zMl9Mb2dnZWRPblVzZX
    condition: selection_img and 1 of selection_cli_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:19:59.943681+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:19:59.943681+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:19:59.943693+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:19:59.943695+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:19:59.943698+00:00'
