id: b236190c-1c61-41e9-84b3-3fe03f6d76b0
title: Potential Regsvr32 Commandline Flag Anomaly
status: test
level: medium
description: Detects a potential command line flag anomaly related to "regsvr32" in
    which the "/i" flag is used without the "/n" which should be uncommon.
author: Florian Roth (Nextron Systems)
date: '2019-07-13'
modified: '2024-03-13'
tags:
    - attack.defense-evasion
    - attack.t1218.010
references:
    - https://twitter.com/sbousseaden/status/1282441816986484737?s=12
falsepositives:
    - Administrator typo might cause some false positives
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \regsvr32.exe
        CommandLine|contains|windash: ' -i:'
    filter_main_flag:
        CommandLine|contains|windash: ' -n '
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:33.264762+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:33.264762+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:33.264768+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:33.264770+00:00'
