id: a29c1813-ab1f-4dde-b489-330b952e91ae
title: Suspicious Network Command
status: test
level: low
description: Adversaries may look for details about the network configuration and
    settings of systems they access or through information discovery of remote systems
author: frack113, Christopher Peacock '@securepeacock', SCYTHE '@scythe_io'
date: '2021-12-07'
modified: '2022-04-11'
tags:
    - attack.discovery
    - attack.t1016
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1016/T1016.md#atomic-test-1---system-network-configuration-discovery-on-windows
falsepositives:
    - Administrator, hotline ask to user
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - ipconfig /all
            - netsh interface show interface
            - arp -a
            - nbtstat -n
            - net config
            - route print
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:47.749214+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:47.749214+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:47.749222+00:00'
