id: 4d7cda18-1b12-4e52-b45c-d28653210df8
title: Sysmon Driver Unloaded Via Fltmc.EXE
status: test
level: high
description: Detects possible Sysmon filter driver unloaded via fltmc.exe
author: Kirill Kiryanov, oscd.community
date: '2019-10-23'
modified: '2023-02-13'
tags:
    - attack.defense-evasion
    - attack.t1070
    - attack.t1562
    - attack.t1562.002
references:
    - https://www.darkoperator.com/blog/2018/10/5/operating-offensively-against-sysmon
falsepositives:
    - Unlikely
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''4931188c-178e-4ee7-a348-39e8a7a56821''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \fltMC.exe
        OriginalFileName: fltMC.exe
    selection_cli:
        CommandLine|contains|all:
            - unload
            - sysmon
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:52.616249+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:52.616249+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:52.616257+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:52.616259+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:52.616261+00:00'
