title: Suspicious File Download From IP Via Wget.EXE
id: 17f0c0a8-8bd5-4ee0-8c5f-a342c0199f35
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects potentially suspicious file downloads directly from IP addresses
    using Wget.exe
references:
    - https://www.gnu.org/software/wget/manual/wget.html
falsepositives:
    - Unknown
tags:
    - attack.execution
date: '2023-07-27'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \wget.exe
        OriginalFileName: wget.exe
    selection_ip:
        CommandLine|re: ://[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}
    selection_http:
        CommandLine|contains: http
    selection_flag:
        CommandLine|re: \s-O\s
        CommandLine|contains: --output-document
    selection_ext:
        CommandLine|endswith:
            - .ps1
            - .ps1'
            - .ps1"
            - .dat
            - .dat'
            - .dat"
            - .msi
            - .msi'
            - .msi"
            - .bat
            - .bat'
            - .bat"
            - .exe
            - .exe'
            - .exe"
            - .vbs
            - .vbs'
            - .vbs"
            - .vbe
            - .vbe'
            - .vbe"
            - .hta
            - .hta'
            - .hta"
            - .dll
            - .dll'
            - .dll"
            - .psm1
            - .psm1'
            - .psm1"
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:49:55.882411+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:49:55.882411+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:49:55.882431+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:49:55.882434+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:49:55.882435+00:00'
