title: HackTool - SharpLDAPmonitor Execution
id: 9f8fc146-1d1a-4dbf-b8fd-dfae15e08541
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects execution of the SharpLDAPmonitor. Which can monitor the creation,
    deletion and changes to LDAP objects.
references:
    - https://github.com/p0dalirius/LDAPmonitor
falsepositives:
    - Unknown
tags:
    - attack.discovery
date: '2022-12-30'
modified: '2023-02-14'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \SharpLDAPmonitor.exe
        OriginalFileName: SharpLDAPmonitor.exe
    selection_cli:
        CommandLine|contains|all:
            - '/user:'
            - '/pass:'
            - '/dcip:'
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:19.370811+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:19.370811+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:44:19.370832+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:44:19.370834+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:44:19.370836+00:00'
