id: ea3ecad2-db86-4a89-ad0b-132a10d2db55
title: Interactive Bash Suspicious Children
status: test
level: medium
description: Detects suspicious interactive bash as a parent to rather uncommon child
    processes
author: Florian Roth (Nextron Systems)
date: '2022-03-14'
tags:
    - attack.execution
    - attack.defense-evasion
    - attack.t1059.004
    - attack.t1036
references:
    - Internal Research
falsepositives:
    - Legitimate software that uses these patterns
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        ParentCommandLine: bash -i
    anomaly1:
        CommandLine|contains:
            - '-c import '
            - base64
            - pty.spawn
    anomaly2:
        Image|endswith:
            - whoami
            - iptables
            - /ncat
            - /nc
            - /netcat
    condition: selection and 1 of anomaly*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:17:45.974062+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-26T02:17:45.974062+00:00'
    detection_fields:
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-11-26T02:17:45.974083+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:17:45.974086+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:17:45.974087+00:00'
