id: 6b65c28e-11f3-46cb-902a-68f2cafaf474
title: Odbcconf.EXE Suspicious DLL Location
status: test
level: high
description: Detects execution of "odbcconf" where the path of the DLL being registered
    is located in a potentially suspicious location.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-05-22'
modified: '2023-05-26'
tags:
    - attack.defense-evasion
    - attack.t1218.008
references:
    - https://learn.microsoft.com/en-us/sql/odbc/odbcconf-exe?view=sql-server-ver16
    - https://www.trendmicro.com/en_us/research/17/h/backdoor-carrying-emails-set-sights-on-russian-speaking-businesses.html
    - https://securityintelligence.com/posts/raspberry-robin-worm-dridex-malware/
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \odbcconf.exe
        OriginalFileName: odbcconf.exe
    selection_cli:
        CommandLine|contains:
            - :\PerfLogs\
            - :\ProgramData\
            - :\Temp\
            - :\Users\Public\
            - :\Windows\Registration\CRMLog
            - :\Windows\System32\com\dmp\
            - :\Windows\System32\FxsTmp\
            - :\Windows\System32\Microsoft\Crypto\RSA\MachineKeys\
            - :\Windows\System32\spool\drivers\color\
            - :\Windows\System32\spool\PRINTERS\
            - :\Windows\System32\spool\SERVERS\
            - :\Windows\System32\Tasks_Migrated\
            - :\Windows\System32\Tasks\Microsoft\Windows\SyncCenter\
            - :\Windows\SysWOW64\com\dmp\
            - :\Windows\SysWOW64\FxsTmp\
            - :\Windows\SysWOW64\Tasks\Microsoft\Windows\PLA\System\
            - :\Windows\SysWOW64\Tasks\Microsoft\Windows\SyncCenter\
            - :\Windows\Tasks\
            - :\Windows\Temp\
            - :\Windows\Tracing\
            - \AppData\Local\Temp\
            - \AppData\Roaming\
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:15.030854+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:15.030854+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:15.030859+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:15.030860+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:15.030862+00:00'
