id: 1444443e-6757-43e4-9ea4-c8fc705f79a2
title: Boot Configuration Tampering Via Bcdedit.EXE
status: stable
level: high
description: Detects the use of the bcdedit command to tamper with the boot configuration
    data. This technique is often times used by malware or attackers as a destructive
    way before launching ransomware.
author: E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community
date: '2019-10-24'
modified: '2023-02-15'
tags:
    - attack.impact
    - attack.t1490
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md
    - https://eqllib.readthedocs.io/en/latest/analytics/c4732632-9c1d-4980-9fa8-1d98c93f918e.html
fields:
    - ComputerName
    - User
    - CommandLine
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \bcdedit.exe
        OriginalFileName: bcdedit.exe
    selection_set:
        CommandLine|contains: set
    selection_cli:
        CommandLine|contains|all:
            - bootstatuspolicy
            - ignoreallfailures
            - recoveryenabled
            - 'no'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:26:48.994366+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:26:48.994366+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:26:48.994399+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:26:48.994403+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:26:48.994406+00:00'
