id: dbc1f800-0fe0-4bc0-9c66-292c2abe3f78
title: Delete Important Scheduled Task
status: test
level: high
description: Detects when adversaries stop services or processes by deleting their
    respective scheduled tasks in order to conduct data destructive activities
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-09-09'
tags:
    - attack.impact
    - attack.t1489
references:
    - Internal Research
falsepositives:
    - Unlikely
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''9e3cb244-bdb8-4632-8c90-6079c8f4f16d''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''7595ba94-cf3b-4471-aa03-4f6baa9e5fad''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \schtasks.exe
        CommandLine|contains|all:
            - /delete
            - /tn
        CommandLine|contains:
            - \Windows\BitLocker
            - \Windows\ExploitGuard
            - \Windows\SystemRestore\SR
            - \Windows\UpdateOrchestrator\
            - \Windows\Windows Defender\
            - \Windows\WindowsBackup\
            - \Windows\WindowsUpdate\
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:30:39.632395+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:30:39.632395+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:30:39.632414+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:30:39.632415+00:00'
