id: c7d33b50-f690-4b51-8cfb-0fb912a31e57
title: HackTool - SharpDPAPI Execution
status: experimental
level: high
description: 'Detects the execution of the SharpDPAPI tool based on CommandLine flags
    and PE metadata.

    SharpDPAPI is a C# port of some DPAPI functionality from the Mimikatz project.

    '
author: Nasreddine Bencherchali (Nextron Systems)
date: '2024-06-26'
tags:
    - attack.privilege-escalation
    - attack.defense-evasion
    - attack.t1134.001
    - attack.t1134.003
references:
    - https://github.com/GhostPack/SharpDPAPI
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \SharpDPAPI.exe
        OriginalFileName: SharpDPAPI.exe
    selection_other_cli:
        CommandLine|contains:
            - ' backupkey '
            - ' blob '
            - ' certificates '
            - ' credentials '
            - ' keepass '
            - ' masterkeys '
            - ' rdg '
            - ' vaults '
    selection_other_options_guid:
        CommandLine|contains|all:
            - ' {'
            - '}:'
    selection_other_options_flags:
        CommandLine|contains:
            - ' /file:'
            - ' /machine'
            - ' /mkfile:'
            - ' /password:'
            - ' /pvk:'
            - ' /server:'
            - ' /target:'
            - ' /unprotect'
    condition: selection_img or (selection_other_cli and 1 of selection_other_options_*)
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:49.481172+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:49.481172+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:49.481180+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:49.481182+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:49.481183+00:00'
