id: edc2f8ae-2412-4dfd-b9d5-0c57727e70be
title: Potential Powershell ReverseShell Connection
status: stable
level: high
description: Detects usage of the "TcpClient" class. Which can be abused to establish
    remote connections and reverse-shells. As seen used by the Nishang "Invoke-PowerShellTcpOneLine"
    reverse shell and other.
author: FPT.EagleEye, wagga, Nasreddine Bencherchali (Nextron Systems)
date: '2021-03-03'
modified: '2023-04-05'
tags:
    - attack.execution
    - attack.t1059.001
references:
    - https://www.volexity.com/blog/2021/03/02/active-exploitation-of-microsoft-exchange-zero-day-vulnerabilities/
    - https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/
    - https://github.com/samratashok/nishang/blob/414ee1104526d7057f9adaeee196d91ae447283e/Shells/Invoke-PowerShellTcpOneLine.ps1
falsepositives:
    - In rare administrative cases, this function might be used to check network connectivity
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        OriginalFileName:
            - PowerShell.EXE
            - pwsh.dll
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
    selection_cli:
        CommandLine|contains|all:
            - ' Net.Sockets.TCPClient'
            - .GetStream(
            - .Write(
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:42.456856+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:42.456856+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:42.456863+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:42.456864+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:42.456866+00:00'
