id: e28a5a99-da44-436d-b7a0-2afc20a5f413
title: Whoami Utility Execution
status: test
level: low
description: Detects the execution of whoami, which is often used by attackers after
    exploitation / privilege escalation
author: Florian Roth (Nextron Systems)
date: '2018-08-13'
modified: '2023-11-30'
tags:
    - attack.discovery
    - attack.t1033
    - car.2016-03-001
references:
    - https://brica.de/alerts/alert/public/1247926/agent-tesla-keylogger-delivered-inside-a-power-iso-daa-archive/
    - https://app.any.run/tasks/7eaba74e-c1ea-400f-9c17-5e30eee89906/
falsepositives:
    - Admin activity
    - Scripts and administrative tools used in the monitored environment
    - Monitoring activity
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \whoami.exe
        OriginalFileName: whoami.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:30.346341+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:30.346341+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:30.346348+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:30.346350+00:00'
