id: 45d3a03d-f441-458c-8883-df101a3bb146
title: Launch-VsDevShell.PS1 Proxy Execution
status: test
level: medium
description: Detects the use of the 'Launch-VsDevShell.ps1' Microsoft signed script
    to execute commands.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-08-19'
tags:
    - attack.defense-evasion
    - attack.t1216.001
references:
    - https://twitter.com/nas_bench/status/1535981653239255040
falsepositives:
    - Legitimate usage of the script by a developer
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_script:
        CommandLine|contains: Launch-VsDevShell.ps1
    selection_flags:
        CommandLine|contains:
            - 'VsWherePath '
            - 'VsInstallationPath '
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:33:42.751962+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:33:42.751962+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:33:42.751977+00:00'
