id: 3d3aa6cd-6272-44d6-8afc-7e88dfef7061
title: Change Default File Association Via Assoc
status: test
level: low
description: 'Detects file association changes using the builtin "assoc" command.

    When a file is opened, the default program used to open the file (also called
    the file association or handler) is checked. File association selections are stored
    in the Windows Registry and can be edited by users, administrators, or programs
    that have Registry access or by administrators using the built-in assoc utility.
    Applications can modify the file association for a given file extension to call
    an arbitrary program when a file with the given extension is opened.

    '
author: Timur Zinniatullin, oscd.community
date: '2019-10-21'
modified: '2023-03-06'
tags:
    - attack.persistence
    - attack.t1546.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.001/T1546.001.md
fields:
    - Image
    - CommandLine
    - User
    - LogonGuid
    - Hashes
    - ParentProcessGuid
    - ParentCommandLine
falsepositives:
    - Admin activity
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''ae6f14e6-14de-45b0-9f44-c0986f50dc89''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \cmd.exe
        OriginalFileName: Cmd.Exe
    selection_cli:
        CommandLine|contains: assoc
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:59.125687+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:59.125687+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:59.125696+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:59.125697+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:59.125699+00:00'
