id: 0a98a10c-685d-4ab0-bddc-b6bdd1d48458
title: Uncommon Userinit Child Process
status: test
level: high
description: Detects uncommon "userinit.exe" child processes, which could be a sign
    of uncommon shells or login scripts used for persistence.
author: Tom Ueltschi (@c_APT_ure), Tim Shelton
date: '2019-01-12'
modified: '2023-11-14'
tags:
    - attack.t1037.001
    - attack.persistence
references:
    - https://cocomelonc.github.io/persistence/2022/12/09/malware-pers-20.html
    - https://learn.microsoft.com/en-us/windows-server/administration/server-core/server-core-sconfig#powershell-is-the-default-shell-on-server-core
falsepositives:
    - Legitimate logon scripts or custom shells may trigger false positives. Apply
        additional filters accordingly.
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''21d856f9-9281-4ded-9377-51a1a6e2a432''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \userinit.exe
    filter_main_explorer:
        Image|endswith: :\WINDOWS\explorer.exe
    filter_optional_logonscripts:
        CommandLine|contains:
            - netlogon.bat
            - UsrLogon.cmd
    filter_optional_windows_core:
        CommandLine: PowerShell.exe
    filter_optional_proquota:
        Image|endswith:
            - :\Windows\System32\proquota.exe
            - :\Windows\SysWOW64\proquota.exe
    filter_optional_citrix:
        Image|endswith:
            - :\Program Files (x86)\Citrix\HDX\bin\cmstart.exe
            - :\Program Files (x86)\Citrix\HDX\bin\icast.exe
            - :\Program Files (x86)\Citrix\System32\icast.exe
            - :\Program Files\Citrix\HDX\bin\cmstart.exe
            - :\Program Files\Citrix\HDX\bin\icast.exe
            - :\Program Files\Citrix\System32\icast.exe
    filter_optional_image_null:
        Image: null
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:34:16.061728+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:34:16.061728+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:34:16.061754+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:34:16.061758+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:34:16.061761+00:00'
