id: 44e24481-6202-4c62-9127-5a0ae8e3fe3d
title: Obfuscated PowerShell OneLiner Execution
status: test
level: high
description: Detects the execution of a specific OneLiner to download and execute
    powershell modules in memory.
author: '@Kostastsale, @TheDFIRReport'
date: '2022-05-09'
tags:
    - attack.defense-evasion
    - attack.execution
    - attack.t1059.001
    - attack.t1562.001
references:
    - https://thedfirreport.com/2022/05/09/seo-poisoning-a-gootloader-story/
    - https://gist.github.com/mgeeky/3b11169ab77a7de354f4111aa2f0df38
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \powershell.exe
        CommandLine|contains|all:
            - http://127.0.0.1
            - '%{(IRM $_)}'
            - .SubString.ToString()[67,72,64]-Join
            - Import-Module
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:28:54.566638+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:28:54.566638+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:28:54.566657+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:28:54.566664+00:00'
