id: 4bf943c6-5146-4273-98dd-e958fd1e3abf
title: Invoke-Obfuscation Obfuscated IEX Invocation
status: test
level: high
description: Detects all variations of obfuscated powershell IEX invocation code generated
    by Invoke-Obfuscation framework from the following code block
author: Daniel Bohannon (@Mandiant/@FireEye), oscd.community
date: '2019-11-08'
modified: '2022-12-31'
tags:
    - attack.defense-evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
references:
    - https://github.com/danielbohannon/Invoke-Obfuscation/blob/f20e7f843edd0a3a7716736e9eddfa423395dd26/Out-ObfuscatedStringCommand.ps1#L873-L888
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|re|all:
            - \$PSHome\[\s*\d{1,3}\s*\]\s*\+\s*\$PSHome\[
            - \$ShellId\[\s*\d{1,3}\s*\]\s*\+\s*\$ShellId\[
            - \$env:Public\[\s*\d{1,3}\s*\]\s*\+\s*\$env:Public\[
            - \$env:ComSpec\[(\s*\d{1,3}\s*,){2}
            - \*mdr\*\W\s*\)\.Name
            - \$VerbosePreference\.ToString\(
        CommandLine|re: \[String\]\s*\$VerbosePreference
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:30:24.309989+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:30:24.309989+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:30:24.310005+00:00'
