id: de587dce-915e-4218-aac4-835ca6af6f70
title: Potential Persistence Attempt Via Run Keys Using Reg.EXE
status: test
level: medium
description: Detects suspicious command line reg.exe tool adding key to RUN key in
    Registry
author: Florian Roth (Nextron Systems)
date: '2021-06-28'
modified: '2023-01-30'
tags:
    - attack.persistence
    - attack.t1547.001
references:
    - https://app.any.run/tasks/9c0f37bc-867a-4314-b685-e101566766d7/
    - https://learn.microsoft.com/en-us/windows/win32/setupapi/run-and-runonce-registry-keys
falsepositives:
    - Legitimate software automatically (mostly, during installation) sets up autorun
        keys for legitimate reasons.
    - Legitimate administrator sets up autorun keys for legitimate reasons.
    - Discord
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - reg
            - ' ADD '
            - Software\Microsoft\Windows\CurrentVersion\Run
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:38.033369+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:38.033369+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:38.033375+00:00'
