title: Shell Invocation Via Ssh - Linux
id: 8737b7f6-8df3-4bb7-b1da-06019b99b687
status: experimental
level: high
author: Li Ling, Andy Parkidomo, Robert Rakowski, Blake Hartstein (Bloomberg L.P.)
description: 'Detects the use of the "ssh" utility to execute a shell. Such behavior
    may be associated with privilege escalation, unauthorized command execution, or
    to break out from restricted environments.

    '
references:
    - https://gtfobins.github.io/gtfobins/ssh/
    - https://www.elastic.co/guide/en/security/current/linux-restricted-shell-breakout-via-linux-binary-s.html
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1059
date: '2024-08-29'
logsource:
    category: process_creation
    product: linux
detection:
    selection_img:
        Image|endswith: /ssh
        CommandLine|contains:
            - ProxyCommand=;
            - permitlocalcommand=yes
            - localhost
    selection_cli:
        CommandLine|contains:
            - /bin/bash
            - /bin/dash
            - /bin/fish
            - /bin/sh
            - /bin/zsh
            - sh 0<&2 1>&2
            - sh 1>&2 0<&2
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:19.176024+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:19.176024+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:36:19.176048+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:36:19.176053+00:00'
