title: Potential Base64 Decoded From Images
id: 09a910bf-f71f-4737-9c40-88880ba5913d
status: test
level: high
author: Joseliyo Sanchez, @Joseliyo_Jstnk
description: 'Detects the use of tail to extract bytes at an offset from an image
    and then decode the base64 value to create a new file with the decoded content.
    The detected execution is a bash one-liner.

    '
references:
    - https://www.virustotal.com/gui/file/16bafdf741e7a13137c489f3c8db1334f171c7cb13b62617d691b0a64783cc48/behavior
    - https://www.virustotal.com/gui/file/483fafc64a2b84197e1ef6a3f51e443f84dc5742602e08b9e8ec6ad690b34ed0/behavior
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1140
date: '2023-12-20'
logsource:
    category: process_creation
    product: macos
detection:
    selection_image:
        Image|endswith: /bash
    selection_view:
        CommandLine|contains|all:
            - tail
            - -c
    selection_b64:
        CommandLine|contains|all:
            - base64
            - -d
            - '>'
    selection_files:
        CommandLine|contains:
            - .avif
            - .gif
            - .jfif
            - .jpeg
            - .jpg
            - .pjp
            - .pjpeg
            - .png
            - .svg
            - .webp
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:34:32.870201+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-12-04T01:34:32.870201+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:34:32.870220+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:34:32.870222+00:00'
