id: 57bff678-25d1-4d6c-8211-8ca106d12053
title: Remote Access Tool - ScreenConnect Execution
status: test
level: medium
description: 'An adversary may use legitimate desktop support and remote access software,
    such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive
    command and control channel to target systems within networks.

    These services are commonly used as legitimate technical support software, and
    may be allowed by application control within a target environment.

    Remote access tools like VNC, Ammyy, and Teamviewer are used frequently when compared
    with other legitimate software commonly used by adversaries. (Citation: Symantec
    Living off the Land)

    '
author: frack113
date: '2022-02-13'
modified: '2023-03-05'
tags:
    - attack.command-and-control
    - attack.t1219
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1219/T1219.md#atomic-test-5---screenconnect-application-download-and-install-on-windows
falsepositives:
    - Legitimate usage of the tool
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Description: ScreenConnect Service
        Product: ScreenConnect
        Company: ScreenConnect Software
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:57.154807+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:57.154807+00:00'
    detection_fields:
        -   source_field: Description
            target_table: process_activity
            target_field: message
            mapped_at: '2025-11-13T20:20:57.154815+00:00'
        -   source_field: Product
            target_table: process_activity
            target_field: metadata.product.name
            mapped_at: '2025-11-13T20:20:57.154816+00:00'
        -   source_field: Company
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:20:57.154817+00:00'
