title: MSHTA Suspicious Execution 01
id: cc7abbd0-762b-41e3-8a26-57ad50d2eea3
status: test
level: high
author: Diego Perez (@darkquassar), Markus Neis, Swisscom (Improve Rule)
description: Detection for mshta.exe suspicious execution patterns sometimes involving
    file polyglotism
references:
    - http://blog.sevagas.com/?Hacking-around-HTA-files
    - https://0x00sec.org/t/clientside-exploitation-in-2018-how-pentesting-has-changed/7356
    - https://learn.microsoft.com/en-us/previous-versions/dotnet/framework/data/xml/xslt/xslt-stylesheet-scripting-using-msxsl-script
    - https://medium.com/tsscyber/pentesting-and-hta-bypassing-powershell-constrained-language-mode-53a42856c997
    - https://twitter.com/mattifestation/status/1326228491302563846
falsepositives:
    - False positives depend on scripts and administrative tools used in the monitored
        environment
tags:
    - attack.defense-evasion
    - attack.t1140
    - attack.t1218.005
    - attack.execution
    - attack.t1059.007
    - cve.2020-1599
date: '2019-02-22'
modified: '2022-11-07'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \mshta.exe
        CommandLine|contains:
            - vbscript
            - .jpg
            - .png
            - .lnk
            - .xls
            - .doc
            - .zip
            - .dll
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:49:11.648022+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:49:11.648022+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:49:11.648037+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:49:11.648039+00:00'
