id: ff2fff64-4cd6-4a2b-ba7d-e28a30bbe66b
title: Suspicious Scheduled Task Name As GUID
status: test
level: medium
description: Detects creation of a scheduled task with a GUID like name
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-10-31'
tags:
    - attack.execution
    - attack.t1053.005
references:
    - https://thedfirreport.com/2022/10/31/follina-exploit-leads-to-domain-compromise/
    - https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/
falsepositives:
    - Legitimate software naming their tasks as GUIDs
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \schtasks.exe
        CommandLine|contains: '/Create '
    selection_tn:
        CommandLine|contains:
            - /TN "{
            - /TN '{
            - /TN {
    selection_end:
        CommandLine|contains:
            - '}"'
            - '}'''
            - '} '
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:38.085414+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:38.085414+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:38.085418+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:38.085419+00:00'
