id: d21374ff-f574-44a7-9998-4a8c8bf33d7d
title: WmiPrvSE Spawned A Process
status: stable
level: medium
description: Detects WmiPrvSE spawning a process
author: Roberto Rodriguez @Cyb3rWard0g
date: '2019-08-15'
modified: '2023-03-23'
tags:
    - attack.execution
    - attack.t1047
references:
    - https://threathunterplaybook.com/hunts/windows/190815-RemoteServiceInstallation/notebook.html
falsepositives:
    - False positives are expected (e.g. in environments where WinRM is used legitimately)
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''8a582fe2-0882-4b89-a82a-da6b2dc32937''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''692f0bec-83ba-4d04-af7e-e884a96059b6''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \WmiPrvSe.exe
    filter_logonid:
        LogonId:
            - '0x3e7'
            - 'null'
    filter_system_user:
        User|contains:
            - AUTHORI
            - AUTORI
    filter_wmiprvse:
        Image|endswith: \WmiPrvSE.exe
    filter_werfault:
        Image|endswith: \WerFault.exe
    filter_null:
        LogonId: null
    condition: selection and not 1 of filter_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:29:30.271999+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:29:30.271999+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:29:30.272026+00:00'
        -   source_field: LogonId
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:29:30.272029+00:00'
        -   source_field: User
            target_table: process_activity
            target_field: actor.user.name
            mapped_at: '2025-11-26T02:29:30.272032+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:29:30.272034+00:00'
