title: Suspicious Processes Spawned by Java.EXE
id: 0d34ed8b-1c12-4ff2-828c-16fc860b766d
status: test
level: high
author: Andreas Hunkeler (@Karneades), Florian Roth
description: Detects suspicious processes spawned from a Java host process which could
    indicate a sign of exploitation (e.g. log4j)
references:
    - https://web.archive.org/web/20231230220738/https://www.lunasec.io/docs/blog/log4j-zero-day/
falsepositives:
    - Legitimate calls to system binaries
    - Company specific internal usage
tags:
    - attack.initial-access
    - attack.persistence
    - attack.privilege-escalation
date: '2021-12-17'
modified: '2024-01-18'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \java.exe
        Image|endswith:
            - \AppVLP.exe
            - \bitsadmin.exe
            - \certutil.exe
            - \cscript.exe
            - \curl.exe
            - \forfiles.exe
            - \hh.exe
            - \mftrace.exe
            - \mshta.exe
            - \net.exe
            - \net1.exe
            - \query.exe
            - \reg.exe
            - \regsvr32.exe
            - \rundll32.exe
            - \schtasks.exe
            - \scrcons.exe
            - \scriptrunner.exe
            - \sh.exe
            - \systeminfo.exe
            - \whoami.exe
            - \wmic.exe
            - \wscript.exe
    condition: selection
related:
    -   id: dff1e1cc-d3fd-47c8-bfc2-aeb878a754c0
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:17.730637+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:17.730637+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:44:17.730650+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:44:17.730669+00:00'
