title: Persistence Via Sticky Key Backdoor
id: 1070db9a-3e5d-412e-8e7b-7183b616e1b3
status: test
level: critical
author: Sreeman
description: 'By replacing the sticky keys executable with the local admins CMD executable,
    an attacker is able to access a privileged windows console session without authenticating
    to the system.

    When the sticky keys are "activated" the privilleged shell is launched.

    '
references:
    - https://www.fireeye.com/blog/threat-research/2017/03/apt29_domain_frontin.html
    - https://www.clearskysec.com/wp-content/uploads/2020/02/ClearSky-Fox-Kitten-Campaign-v1.pdf
    - https://learn.microsoft.com/en-us/archive/blogs/jonathantrull/detecting-sticky-key-backdoors
falsepositives:
    - Unlikely
tags:
    - attack.t1546.008
    - attack.privilege-escalation
date: '2020-02-18'
modified: '2023-03-07'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - 'copy '
            - '/y '
            - C:\windows\system32\cmd.exe C:\windows\system32\sethc.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:26.530949+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:26.530949+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:44:26.530961+00:00'
