id: 7a02e22e-b885-4404-b38b-1ddc7e65258a
title: Suspicious Schtasks Schedule Type With High Privileges
status: test
level: medium
description: Detects scheduled task creations or modification to be run with high
    privileges on a suspicious schedule type
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-08-31'
tags:
    - attack.execution
    - attack.t1053.005
references:
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks-change
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks-create
falsepositives:
    - Some installers were seen using this method of creation unfortunately. Filter
        them in your environment
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''24c8392b-aa3c-46b7-a545-43f71657fe98''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \schtasks.exe
        OriginalFileName: schtasks.exe
    selection_time:
        CommandLine|contains:
            - ' ONLOGON '
            - ' ONSTART '
            - ' ONCE '
            - ' ONIDLE '
    selection_privs:
        CommandLine|contains:
            - NT AUT
            - ' SYSTEM'
            - HIGHEST
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:38.100913+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:38.100913+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:38.100919+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:38.100921+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:38.100922+00:00'
