title: PUA - Adidnsdump Execution
id: 26d3f0a2-f514-4a3f-a8a7-e7e48a8d9160
status: test
level: low
author: frack113
description: 'This tool enables enumeration and exporting of all DNS records in the
    zone for recon purposes of internal networks Python 3 and python.exe must be installed,

    Usee to Query/modify DNS records for Active Directory integrated DNS via LDAP

    '
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1018/T1018.md#atomic-test-9---remote-system-discovery---adidnsdump
falsepositives:
    - Unknown
tags:
    - attack.discovery
    - attack.t1018
date: '2022-01-01'
modified: '2023-02-21'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \python.exe
        CommandLine|contains: adidnsdump
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:48:26.084574+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:48:26.084574+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:48:26.084586+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:48:26.084594+00:00'
