id: 1775e15e-b61b-4d14-a1a3-80981298085a
title: Rundll32 Execution Without CommandLine Parameters
status: test
level: high
description: Detects suspicious start of rundll32.exe without any parameters as found
    in CobaltStrike beacon activity
author: Florian Roth (Nextron Systems)
date: '2021-05-27'
modified: '2023-08-31'
tags:
    - attack.defense-evasion
    - attack.t1202
references:
    - https://www.cobaltstrike.com/help-opsec
    - https://twitter.com/ber_m1ng/status/1397948048135778309
falsepositives:
    - Possible but rare
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|endswith:
            - \rundll32.exe
            - \rundll32.exe"
            - \rundll32
    filter:
        ParentImage|contains:
            - \AppData\Local\
            - \Microsoft\Edge\
    condition: selection and not filter
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:40.532737+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:40.532737+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:40.532744+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:40.532746+00:00'
