title: Credential Dumping Activity By Python Based Tool
id: f8be3e82-46a3-4e4e-ada5-8e538ae8b9c9
status: stable
level: high
author: Bhabesh Raj, Jonhnathan Ribeiro
description: Detects LSASS process access for potential credential dumping by a Python-like
    tool such as LaZagne or Pypykatz.
references:
    - https://twitter.com/bh4b3sh/status/1303674603819081728
    - https://github.com/skelsec/pypykatz
falsepositives:
    - Unknown
tags:
    - attack.credential-access
    - attack.t1003.001
    - attack.s0349
date: '2023-11-27'
modified: '2023-11-29'
logsource:
    category: process_access
    product: windows
detection:
    selection:
        TargetImage|endswith: \lsass.exe
        CallTrace|contains|all:
            - _ctypes.pyd+
            - :\Windows\System32\KERNELBASE.dll+
            - :\Windows\SYSTEM32\ntdll.dll+
        CallTrace|contains:
            - python27.dll+
            - python3*.dll+
        GrantedAccess: '0x1FFFFF'
    condition: selection
related:
    -   id: 4b9a8556-99c4-470b-a40c-9c8d02c77ed0
        type: obsolete
    -   id: 7186e989-4ed7-4f4e-a656-4674b9e3e48b
        type: obsolete
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: process_access
            mapped_at: '2025-12-04T01:40:09.230914+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:40:09.230914+00:00'
    detection_fields:
        -   source_field: TargetImage
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-12-04T01:40:09.230926+00:00'
        -   source_field: CallTrace
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:40:09.230928+00:00'
        -   source_field: GrantedAccess
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:40:09.230929+00:00'
