title: Direct Autorun Keys Modification
id: 24357373-078f-44ed-9ac4-6d334a668a11
status: test
level: medium
author: Victor Sergeev, Daniil Yugoslavskiy, oscd.community
description: Detects direct modification of autostart extensibility point (ASEP) in
    registry using reg.exe.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Legitimate software automatically (mostly, during installation) sets up autorun
        keys for legitimate reasons.
    - Legitimate administrator sets up autorun keys for legitimate reasons.
    - Discord
tags:
    - attack.persistence
    - attack.t1547.001
date: '2019-10-25'
modified: '2022-08-04'
logsource:
    category: process_creation
    product: windows
detection:
    selection_1:
        Image|endswith: \reg.exe
        CommandLine|contains: add
    selection_2:
        CommandLine|contains:
            - \software\Microsoft\Windows\CurrentVersion\Run
            - \software\Microsoft\Windows NT\CurrentVersion\Winlogon\Userinit
            - \software\Microsoft\Windows NT\CurrentVersion\Winlogon\Shell
            - \software\Microsoft\Windows NT\CurrentVersion\Windows
            - \software\Microsoft\Windows\CurrentVersion\Explorer\User Shell Folders
            - \system\CurrentControlSet\Control\SafeBoot\AlternateShell
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:46:37.263816+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:46:37.263816+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:46:37.263831+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:46:37.263833+00:00'
