id: 1cc50f3f-1fc8-4acf-b2e9-6f172e1fdebd
title: Suspicious Rundll32 Invoking Inline VBScript
status: test
level: high
description: Detects suspicious process related to rundll32 based on command line
    that invokes inline VBScript as seen being used by UNC2452
author: Florian Roth (Nextron Systems)
date: '2021-03-05'
modified: '2022-10-09'
tags:
    - attack.defense-evasion
    - attack.t1055
references:
    - https://www.microsoft.com/security/blog/2021/03/04/goldmax-goldfinder-sibot-analyzing-nobelium-malware/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - rundll32.exe
            - Execute
            - RegRead
            - window.close
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:38.095543+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:38.095543+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:38.095547+00:00'
