id: 83809e84-4475-4b69-bc3e-4aad8568612f
title: MSExchange Transport Agent Installation
status: test
level: medium
description: Detects the Installation of a Exchange Transport Agent
author: Tobias Michalski (Nextron Systems)
date: '2021-06-08'
modified: '2022-10-09'
tags:
    - attack.persistence
    - attack.t1505.002
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=7
fields:
    - AssemblyPath
falsepositives:
    - Legitimate installations of exchange TransportAgents. AssemblyPath is a good
        indicator for this.
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''83809e84-4475-4b69-bc3e-4aad8568612f''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains: Install-TransportAgent
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:34:32.109416+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:34:32.109416+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:34:32.109428+00:00'
