id: 065b00ca-5d5c-4557-ac95-64a6d0b64d86
title: Remote Access Tool - Anydesk Execution From Suspicious Folder
status: test
level: high
description: 'An adversary may use legitimate desktop support and remote access software,
    such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive
    command and control channel to target systems within networks.

    These services are commonly used as legitimate technical support software, and
    may be allowed by application control within a target environment.

    Remote access tools like VNC, Ammyy, and Teamviewer are used frequently when compared
    with other legitimate software commonly used by adversaries. (Citation: Symantec
    Living off the Land)

    '
author: Florian Roth (Nextron Systems)
date: '2022-05-20'
modified: '2023-03-05'
tags:
    - attack.command-and-control
    - attack.t1219
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1219/T1219.md#atomic-test-2---anydesk-files-detected-test-on-windows
falsepositives:
    - Legitimate use of AnyDesk from a non-standard folder
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''b52e84a3-029e-4529-b09b-71d19dd27e94''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \AnyDesk.exe
        Description: AnyDesk
        Product: AnyDesk
        Company: AnyDesk Software GmbH
    filter:
        Image|contains:
            - \AppData\
            - Program Files (x86)\AnyDesk
            - Program Files\AnyDesk
    condition: selection and not filter
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:35.472800+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:35.472800+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:35.472854+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: message
            mapped_at: '2025-11-13T20:20:35.472858+00:00'
        -   source_field: Product
            target_table: process_activity
            target_field: metadata.product.name
            mapped_at: '2025-11-13T20:20:35.472861+00:00'
        -   source_field: Company
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:20:35.472865+00:00'
