id: e0cfaecd-602d-41af-988d-f6ccebb2af26
title: Suspicious Installer Package Child Process
status: test
level: medium
description: Detects the execution of suspicious child processes from macOS installer
    package parent process. This includes osascript, JXA, curl and wget amongst other
    interpreters
author: Sohan G (D4rkCiph3r)
date: '2023-02-18'
tags:
    - attack.t1059
    - attack.t1059.007
    - attack.t1071
    - attack.t1071.001
    - attack.execution
    - attack.command-and-control
references:
    - https://redcanary.com/blog/clipping-silver-sparrows-wings/
    - https://github.com/elastic/detection-rules/blob/4312d8c9583be524578a14fe6295c3370b9a9307/rules/macos/execution_installer_package_spawned_network_event.toml
falsepositives:
    - Legitimate software uses the scripts (preinstall, postinstall)
taxonomy: sigma
logsource:
    category: process_creation
    product: macos
detection:
    selection_installer:
        ParentImage|endswith:
            - /package_script_service
            - /installer
        Image|endswith:
            - /sh
            - /bash
            - /dash
            - /python
            - /ruby
            - /perl
            - /php
            - /javascript
            - /osascript
            - /tclsh
            - /curl
            - /wget
        CommandLine|contains:
            - preinstall
            - postinstall
    condition: selection_installer
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:14:25.776772+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-11-13T20:14:25.776772+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:14:25.776779+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:14:25.776781+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:14:25.776782+00:00'
