title: Usage Of Web Request Commands And Cmdlets
id: 9fc51a3c-81b3-4fa7-b35f-7c02cf10fd2d
status: test
level: medium
author: James Pemberton / @4A616D6573, Endgame, JHasenbusch, oscd.community, Austin
    Songer @austinsonger
description: Detects the use of various web request commands with commandline tools
    and Windows PowerShell cmdlets (including aliases) via CommandLine
references:
    - https://4sysops.com/archives/use-powershell-to-download-a-file-with-http-https-and-ftp/
    - https://blog.jourdant.me/post/3-ways-to-download-files-with-powershell
    - https://learn.microsoft.com/en-us/powershell/module/bitstransfer/add-bitsfile?view=windowsserver2019-ps
falsepositives:
    - Use of Get-Command and Get-Help modules to reference Invoke-WebRequest and Start-BitsTransfer.
tags:
    - attack.execution
    - attack.t1059.001
date: '2019-10-24'
modified: '2023-01-10'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - '[System.Net.WebRequest]::create'
            - 'curl '
            - Invoke-RestMethod
            - Invoke-WebRequest
            - 'iwr '
            - Net.WebClient
            - Resume-BitsTransfer
            - Start-BitsTransfer
            - 'wget '
            - WinHttp.WinHttpRequest
    condition: selection
related:
    -   id: 1139d2e2-84b1-4226-b445-354492eba8ba
        type: similar
    -   id: f67dbfce-93bc-440d-86ad-a95ae8858c90
        type: obsolete
    -   id: cd5c8085-4070-4e22-908d-a5b3342deb74
        type: obsolete
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:48:03.972106+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:48:03.972106+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:48:03.972171+00:00'
