id: 4ae3e30b-b03f-43aa-87e3-b622f4048eed
title: Potential Arbitrary File Download Using Office Application
status: test
level: high
description: Detects potential arbitrary file download using a Microsoft Office application
author: Nasreddine Bencherchali (Nextron Systems), Beyu Denis, oscd.community
date: '2022-05-17'
modified: '2023-06-22'
tags:
    - attack.defense-evasion
    - attack.t1202
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Winword/
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Powerpnt/
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Excel/
    - https://medium.com/@reegun/unsanitized-file-validation-leads-to-malicious-payload-download-via-office-binaries-202d02db7191
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''0c79148b-118e-472b-bdb7-9b57b444cc19''),
    type=<SigmaRelatedType.OBSOLETE: 4>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \EXCEL.EXE
            - \POWERPNT.EXE
            - \WINWORD.exe
        OriginalFileName:
            - Excel.exe
            - POWERPNT.EXE
            - WinWord.exe
    selection_http:
        CommandLine|contains:
            - http://
            - https://
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:31:39.743980+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:31:39.743980+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:31:39.743994+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:31:39.744006+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:31:39.744008+00:00'
