title: Rundll32 Registered COM Objects
id: f1edd233-30b5-4823-9e6a-c4171b24d316
status: test
level: high
author: frack113
description: load malicious registered COM objects
references:
    - https://nasbench.medium.com/a-deep-dive-into-rundll32-exe-642344b41e90
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.015/T1546.015.md
falsepositives:
    - Legitimate use
tags:
    - attack.privilege-escalation
    - attack.persistence
    - attack.t1546.015
date: '2022-02-13'
modified: '2023-02-09'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \rundll32.exe
        OriginalFileName: RUNDLL32.EXE
    selection_cli:
        CommandLine|contains:
            - '-sta '
            - '-localserver '
        CommandLine|contains|all:
            - '{'
            - '}'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:50:02.438898+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:50:02.438898+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:50:02.438915+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:50:02.438917+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:50:02.438918+00:00'
