title: Suspicious GUP Usage
id: 0a4f6091-223b-41f6-8743-f322ec84930b
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects execution of the Notepad++ updater in a suspicious directory,
    which is often used in DLL side-loading attacks
references:
    - https://www.fireeye.com/blog/threat-research/2018/09/apt10-targeting-japanese-corporations-using-updated-ttps.html
falsepositives:
    - Execution of tools named GUP.exe and located in folders different than Notepad++\updater
tags:
    - attack.defense-evasion
    - attack.t1574.002
date: '2019-02-06'
modified: '2022-08-13'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \GUP.exe
    filter_programfiles:
        Image|endswith:
            - \Program Files\Notepad++\updater\GUP.exe
            - \Program Files (x86)\Notepad++\updater\GUP.exe
    filter_user:
        Image|contains: \Users\
        Image|endswith:
            - \AppData\Local\Notepad++\updater\GUP.exe
            - \AppData\Roaming\Notepad++\updater\GUP.exe
    condition: selection and not 1 of filter_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:50:55.364896+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:50:55.364896+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:50:55.364911+00:00'
