id: 84972c80-251c-4c3a-9079-4f00aad93938
title: Sensitive File Recovery From Backup Via Wbadmin.EXE
status: experimental
level: high
description: 'Detects the dump of highly sensitive files such as "NTDS.DIT" and "SECURITY"
    hive.

    Attackers can leverage the "wbadmin" utility in order to dump sensitive files
    that might contain credential or sensitive information.

    '
author: Nasreddine Bencherchali (Nextron Systems), frack113
date: '2024-05-10'
tags:
    - attack.credential-access
    - attack.t1003.003
references:
    - https://github.com/LOLBAS-Project/LOLBAS/blob/2cc01b01132b5c304027a658c698ae09dd6a92bf/yml/OSBinaries/Wbadmin.yml
    - https://lolbas-project.github.io/lolbas/Binaries/Wbadmin/
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/wbadmin-start-recovery
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/wbadmin-start-backup
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''6fe4aa1e-0531-4510-8be2-782154b73b48''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \wbadmin.exe
        OriginalFileName: WBADMIN.EXE
    selection_backup:
        CommandLine|contains|all:
            - ' recovery'
            - recoveryTarget
            - itemtype:File
        CommandLine|contains:
            - \config\SAM
            - \config\SECURITY
            - \config\SYSTEM
            - \Windows\NTDS\NTDS.dit
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:26:01.973987+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:26:01.973987+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:26:01.974020+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:26:01.974024+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:26:01.974027+00:00'
