title: Linux Doas Tool Execution
id: 067d8238-7127-451c-a9ec-fa78045b618b
status: stable
level: low
author: Sittikorn S, Teoderick Contreras
description: Detects the doas tool execution in linux host platform. This utility
    tool allow standard users to perform tasks as root, the same way sudo does.
references:
    - https://research.splunk.com/endpoint/linux_doas_tool_execution/
    - https://www.makeuseof.com/how-to-install-and-use-doas/
falsepositives:
    - Unlikely
tags:
    - attack.privilege-escalation
    - attack.t1548
date: '2022-01-20'
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith: /doas
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:01.127669+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:01.127669+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:36:01.127684+00:00'
