title: Suspicious Regsvr32 Execution From Remote Share
id: 88a87a10-384b-4ad7-8871-2f9bf9259ce5
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects REGSVR32.exe to execute DLL hosted on remote shares
references:
    - https://thedfirreport.com/2022/10/31/follina-exploit-leads-to-domain-compromise/
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1218.010
date: '2022-10-31'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \regsvr32.exe
        OriginalFileName: \REGSVR32.EXE
    selection_cli:
        CommandLine|contains: ' \\'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:49:05.775850+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:49:05.775850+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:49:05.775872+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:49:05.775875+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:49:05.775876+00:00'
