id: 5fdce3ac-e7f9-4ecd-a3aa-a4d78ebbf0af
title: Mstsc.EXE Execution With Local RDP File
status: test
level: low
description: Detects potential RDP connection via Mstsc using a local ".rdp" file
author: Nasreddine Bencherchali (Nextron Systems), Christopher Peacock @securepeacock
date: '2023-04-18'
modified: '2023-04-30'
tags:
    - attack.command-and-control
    - attack.t1219
references:
    - https://www.blackhillsinfosec.com/rogue-rdp-revisiting-initial-access-methods/
    - https://web.archive.org/web/20230726144748/https://blog.thickmints.dev/mintsights/detecting-rogue-rdp/
falsepositives:
    - Likely with legitimate usage of ".rdp" files
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \mstsc.exe
        OriginalFileName: mstsc.exe
    selection_cli:
        CommandLine|endswith:
            - .rdp
            - .rdp"
    filter_optional_wsl:
        ParentImage: C:\Windows\System32\lxss\wslhost.exe
        CommandLine|contains: C:\ProgramData\Microsoft\WSL\wslg.rdp
    condition: all of selection_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:27:25.675847+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:27:25.675847+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:27:25.675881+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:27:25.675885+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:27:25.675887+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:27:25.675889+00:00'
