title: Suspicious Package Installed - Linux
id: 700fb7e8-2981-401c-8430-be58e189e741
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects installation of suspicious packages using system installation
    utilities
references:
    - https://gist.githubusercontent.com/MichaelKoczwara/12faba9c061c12b5814b711166de8c2f/raw/e2068486692897b620c25fde1ea258c8218fe3d3/history.txt
falsepositives:
    - Legitimate administration activities
tags:
    - attack.defense-evasion
    - attack.t1553.004
date: '2023-01-03'
logsource:
    category: process_creation
    product: linux
detection:
    selection_tool_apt:
        Image|endswith:
            - /apt
            - /apt-get
        CommandLine|contains: install
    selection_tool_yum:
        Image|endswith: /yum
        CommandLine|contains:
            - localinstall
            - install
    selection_tool_rpm:
        Image|endswith: /rpm
        CommandLine|contains: -i
    selection_tool_dpkg:
        Image|endswith: /dpkg
        CommandLine|contains:
            - --install
            - -i
    selection_keyword:
        CommandLine|contains:
            - nmap
            - ' nc'
            - netcat
            - wireshark
            - tshark
            - openconnect
            - proxychains
    condition: 1 of selection_tool_* and selection_keyword
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:41.683952+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:41.683952+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:36:41.683971+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:36:41.683974+00:00'
