title: Windows Binary Executed From WSL
id: ed825c86-c009-4014-b413-b76003e33d35
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: 'Detects the execution of Windows binaries from within a WSL instance.

    This could be used to masquerade parent-child relationships

    '
references:
    - Internal Research
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.defense-evasion
    - attack.t1202
date: '2023-02-14'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|re: '[a-zA-Z]:\\'
        CurrentDirectory|contains: \\wsl.localhost
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:43:31.975146+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:43:31.975146+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:43:31.975161+00:00'
        -   source_field: CurrentDirectory
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:43:31.975163+00:00'
