title: Time Machine Backup Disabled Via Tmutil - MacOS
id: 2c95fa8a-8b8d-4787-afce-7117ceb8e3da
status: experimental
level: medium
author: Pratinav Chandra
description: 'Detects disabling of Time Machine (Apple''s automated backup utility
    software) via the native macOS backup utility "tmutil".

    An attacker can use this to prevent backups from occurring.

    '
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1490/T1490.md#atomic-test-12---disable-time-machine
    - https://www.loobins.io/binaries/tmutil/
falsepositives:
    - Legitimate administrator activity
tags:
    - attack.impact
    - attack.t1490
date: '2024-05-29'
logsource:
    category: process_creation
    product: macos
detection:
    selection_img:
        Image|endswith: /tmutil
        CommandLine|contains: tmutil
    selection_cmd:
        CommandLine|contains: disable
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:34:33.231201+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-12-04T01:34:33.231201+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:34:33.231217+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:34:33.231219+00:00'
