title: CMSTP Execution Process Creation
id: 7d4cdc5a-0076-40ca-aac8-f7e714570e47
status: stable
level: high
author: Nik Seetharaman
description: Detects various indicators of Microsoft Connection Manager Profile Installer
    execution
references:
    - https://web.archive.org/web/20190720093911/http://www.endurant.io/cmstp/detecting-cmstp-enabled-code-execution-and-uac-bypass-with-sysmon/
fields:
    - CommandLine
    - ParentCommandLine
    - Details
falsepositives:
    - Legitimate CMSTP use (unlikely in modern enterprise environments)
tags:
    - attack.defense-evasion
    - attack.execution
    - attack.t1218.003
    - attack.g0069
    - car.2019-04-001
date: '2018-07-16'
modified: '2020-12-23'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \cmstp.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:45:31.739224+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:45:31.739224+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:45:31.739237+00:00'
