id: 59e938ff-0d6d-4dc3-b13f-36cc28734d4e
title: Execute Code with Pester.bat
status: test
level: medium
description: Detects code execution via Pester.bat (Pester - Powershell Modulte for
    testing)
author: Julia Fomina, oscd.community
date: '2020-10-08'
modified: '2023-11-09'
tags:
    - attack.execution
    - attack.t1059.001
    - attack.defense-evasion
    - attack.t1216
references:
    - https://twitter.com/Oddvarmoe/status/993383596244258816
    - https://github.com/api0cradle/LOLBAS/blob/d148d278f5f205ce67cfaf49afdfb68071c7252a/OSScripts/pester.md
falsepositives:
    - Legitimate use of Pester for writing tests for Powershell scripts and modules
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    powershell_module:
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
        CommandLine|contains|all:
            - Pester
            - Get-Help
    cmd_execution:
        Image|endswith: \cmd.exe
        CommandLine|contains|all:
            - pester
            - ;
    get_help:
        CommandLine|contains:
            - help
            - \?
    condition: powershell_module or (cmd_execution and get_help)
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:59.074923+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:59.074923+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:59.074929+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:59.074931+00:00'
