title: Port Forwarding Activity Via SSH.EXE
id: 327f48c1-a6db-4eb8-875a-f6981f1b0183
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects port forwarding activity via SSH.exe
references:
    - https://www.absolomb.com/2018-01-26-Windows-Privilege-Escalation-Guide/
falsepositives:
    - Administrative activity using a remote port forwarding to a local port
tags:
    - attack.command-and-control
    - attack.lateral-movement
    - attack.t1572
    - attack.t1021.001
    - attack.t1021.004
date: '2022-10-12'
modified: '2024-03-05'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \ssh.exe
        CommandLine|contains|windash: ' -R '
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:50:19.510476+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:50:19.510476+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:50:19.510491+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:50:19.510493+00:00'
