id: 1182f3b3-e716-4efa-99ab-d2685d04360f
title: History File Deletion
status: test
level: high
description: Detects events in which a history file gets deleted, e.g. the ~/bash_history
    to remove traces of malicious activity
author: Florian Roth (Nextron Systems)
date: '2022-06-20'
modified: '2022-09-15'
tags:
    - attack.impact
    - attack.t1565.001
references:
    - https://github.com/sleventyeleven/linuxprivchecker/
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.003/T1552.003.md
falsepositives:
    - Legitimate administration activities
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith:
            - /rm
            - /unlink
            - /shred
    selection_history:
        CommandLine|contains:
            - /.bash_history
            - /.zsh_history
        CommandLine|endswith:
            - _history
            - .history
            - zhistory
    condition: all of selection*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:15:55.879336+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-13T20:15:55.879336+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:15:55.879343+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:15:55.879344+00:00'
