id: 9801abb8-e297-4dbf-9fbd-57dde0e830ad
title: File Download And Execution Via IEExec.EXE
status: test
level: high
description: Detects execution of the IEExec utility to download and execute files
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-05-16'
modified: '2023-11-09'
tags:
    - attack.command-and-control
    - attack.t1105
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Ieexec/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \IEExec.exe
        OriginalFileName: IEExec.exe
    selection_cli:
        CommandLine|contains:
            - http://
            - https://
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:54.988891+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:54.988891+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:54.988900+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:54.988902+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:54.988904+00:00'
