title: New Generic Credentials Added Via Cmdkey.EXE
id: b1ec66c6-f4d1-4b5c-96dd-af28ccae7727
status: test
level: medium
author: frack113, Nasreddine Bencherchali (Nextron Systems)
description: 'Detects usage of "cmdkey.exe" to add generic credentials.

    As an example, this can be used before connecting to an RDP session via command
    line interface.

    '
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1021.001/T1021.001.md#t1021001---remote-desktop-protocol
falsepositives:
    - Legitimate usage for administration purposes
tags:
    - attack.credential-access
    - attack.t1003.005
date: '2023-02-03'
modified: '2024-03-05'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \cmdkey.exe
        OriginalFileName: cmdkey.exe
    selection_cli_generic:
        CommandLine|contains|windash: ' -g'
    selection_cli_user:
        CommandLine|contains|windash: ' -u'
    selection_cli_password:
        CommandLine|contains|windash: ' -p'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:10.387681+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:10.387681+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:44:10.387696+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:44:10.387706+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:44:10.387707+00:00'
