title: SyncAppvPublishingServer Execute Arbitrary PowerShell Code
id: fbd7c32d-db2a-4418-b92c-566eb8911133
status: test
level: medium
author: frack113
description: Executes arbitrary PowerShell code using SyncAppvPublishingServer.exe.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218/T1218.md
    - https://lolbas-project.github.io/lolbas/Binaries/Syncappvpublishingserver/
fields:
    - ComputerName
    - User
    - CommandLine
    - ParentCommandLine
falsepositives:
    - App-V clients
tags:
    - attack.defense-evasion
    - attack.t1218
date: '2021-07-12'
modified: '2022-10-04'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \SyncAppvPublishingServer.exe
        OriginalFileName: syncappvpublishingserver.exe
    selection_cli:
        CommandLine|contains: '"n; '
    condition: all of selection_*
related:
    -   id: fde7929d-8beb-4a4c-b922-be9974671667
        type: obsolete
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:34.845595+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:34.845595+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:44:34.845608+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:44:34.845611+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:44:34.845612+00:00'
