id: 347906f3-e207-4d18-ae5b-a9403d6bcdef
title: Netsh Allow Group Policy on Microsoft Defender Firewall
status: test
level: medium
description: Adversaries may modify system firewalls in order to bypass controls limiting
    network usage
author: frack113
date: '2022-01-09'
modified: '2023-02-14'
tags:
    - attack.defense-evasion
    - attack.t1562.004
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.004/T1562.004.md#atomic-test-3---allow-smb-and-rdp-on-microsoft-defender-firewall
    - https://learn.microsoft.com/en-us/troubleshoot/windows-server/networking/netsh-advfirewall-firewall-control-firewall-behavior
falsepositives:
    - Legitimate administration activity
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \netsh.exe
        OriginalFileName: netsh.exe
    selection_cli:
        CommandLine|contains|all:
            - advfirewall
            - firewall
            - set
            - rule
            - group=
            - new
            - enable=Yes
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:45.420679+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:45.420679+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:45.420690+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:45.420693+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:45.420696+00:00'
