id: b6457d63-d2a2-4e29-859d-4e7affc153d1
title: Potential Discovery Activity Via Dnscmd.EXE
status: test
level: medium
description: Detects an attempt to leverage dnscmd.exe to enumerate the DNS zones
    of a domain. DNS zones used to host the DNS records for a particular domain.
author: '@gott_cyber'
date: '2022-07-31'
modified: '2023-02-04'
tags:
    - attack.discovery
    - attack.execution
    - attack.t1543.003
references:
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/dnscmd
    - https://learn.microsoft.com/en-us/azure/dns/dns-zones-records
    - https://lolbas-project.github.io/lolbas/Binaries/Dnscmd/
falsepositives:
    - Legitimate administration use
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \dnscmd.exe
    selection_cli:
        CommandLine|contains:
            - /enumrecords
            - /enumzones
            - /ZonePrint
            - /info
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:26:56.630554+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:26:56.630554+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:26:56.630585+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:26:56.630588+00:00'
