id: e62a9f0c-ca1e-46b2-85d5-a6da77f86d1a
title: File Encoded To Base64 Via Certutil.EXE
status: test
level: medium
description: Detects the execution of certutil with the "encode" flag to encode a
    file to base64. This can be abused by threat actors and attackers for data exfiltration
author: Florian Roth (Nextron Systems), Jonhnathan Ribeiro, oscd.community, Nasreddine
    Bencherchali (Nextron Systems)
date: '2019-02-24'
modified: '2024-03-05'
tags:
    - attack.defense-evasion
    - attack.t1027
references:
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/certutil
    - https://unit42.paloaltonetworks.com/new-babyshark-malware-targets-u-s-national-security-think-tanks/
    - https://lolbas-project.github.io/lolbas/Binaries/Certutil/
falsepositives:
    - As this is a general purpose rule, legitimate usage of the encode functionality
        will trigger some false positives. Apply additional filters accordingly
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \certutil.exe
        OriginalFileName: CertUtil.exe
    selection_cli:
        CommandLine|contains|windash: -encode
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:22.264836+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:22.264836+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:22.264852+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:22.264854+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:22.264856+00:00'
