id: b45e3d6f-42c6-47d8-a478-df6bd6cf534c
title: Local System Accounts Discovery - Linux
status: test
level: low
description: Detects enumeration of local systeam accounts. This information can help
    adversaries determine which local accounts exist on a system to aid in follow-on
    behavior.
author: Alejandro Ortuno, oscd.community, CheraghiMilad
date: '2020-10-08'
modified: '2024-12-10'
tags:
    - attack.discovery
    - attack.t1087.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1087.001/T1087.001.md
    - https://my.f5.com/manage/s/article/K589
    - https://man.freebsd.org/cgi/man.cgi?pwd_mkdb
falsepositives:
    - Legitimate administration activities
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection_1:
        Image|endswith: /lastlog
    selection_2:
        CommandLine|contains: '''x:0:'''
    selection_3:
        Image|endswith:
            - /cat
            - /ed
            - /head
            - /more
            - /nano
            - /tail
            - /vi
            - /vim
            - /less
            - /emacs
            - /sqlite3
            - /makemap
        CommandLine|contains:
            - /etc/passwd
            - /etc/shadow
            - /etc/sudoers
            - /etc/spwd.db
            - /etc/pwd.db
            - /etc/master.passwd
    selection_4:
        Image|endswith: /id
    selection_5:
        Image|endswith: /lsof
        CommandLine|contains: -u
    condition: 1 of selection*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:15:55.889397+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-13T20:15:55.889397+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:15:55.889404+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:15:55.889406+00:00'
