title: Devtoolslauncher.exe Executes Specified Binary
id: cc268ac1-42d9-40fd-9ed3-8c4e1a5b87e6
status: test
level: high
author: Beyu Denis, oscd.community (rule), @_felamos (idea)
description: The Devtoolslauncher.exe executes other binary
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Devtoolslauncher/
    - https://twitter.com/_felamos/status/1179811992841797632
falsepositives:
    - Legitimate use of devtoolslauncher.exe by legitimate user
tags:
    - attack.defense-evasion
    - attack.t1218
date: '2019-10-12'
modified: '2021-11-27'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \devtoolslauncher.exe
        CommandLine|contains: LaunchForDeploy
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:41:03.274116+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:41:03.274116+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:41:03.274139+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:41:03.274141+00:00'
