title: Scheduled Task/Job At
id: d2d642d7-b393-43fe-bae4-e81ed5915c4b
status: stable
level: low
author: Ömer Günal, oscd.community
description: 'Detects the use of at/atd which are utilities that are used to schedule
    tasks.

    They are often abused by adversaries to maintain persistence or to perform task
    scheduling for initial or recurring execution of malicious code

    '
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1053.002/T1053.002.md
falsepositives:
    - Legitimate administration activities
tags:
    - attack.persistence
    - attack.t1053.002
date: '2020-10-06'
modified: '2022-07-07'
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith:
            - /at
            - /atd
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:35:54.392229+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:35:54.392229+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:35:54.392242+00:00'
