id: 835e75bf-4bfd-47a4-b8a6-b766cac8bcb7
title: Uncommon Child Process Of Setres.EXE
status: test
level: high
description: 'Detects uncommon child process of Setres.EXE.

    Setres.EXE is a Windows server only process and tool that can be used to set the
    screen resolution.

    It can potentially be abused in order to launch any arbitrary file with a name
    containing the word "choice" from the current execution path.

    '
author: '@gott_cyber, Nasreddine Bencherchali (Nextron Systems)'
date: '2022-12-11'
modified: '2024-06-26'
tags:
    - attack.defense-evasion
    - attack.t1218
    - attack.t1202
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Setres/
    - https://twitter.com/0gtweet/status/1583356502340870144
    - https://strontic.github.io/xcyclopedia/library/setres.exe-0E30E4C09637D7A128A37B59A3BC4D09.html
    - https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc731033(v=ws.11)
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \setres.exe
        Image|contains: \choice
    filter_main_legit_location:
        Image|endswith:
            - C:\Windows\System32\choice.exe
            - C:\Windows\SysWOW64\choice.exe
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:58.248007+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:58.248007+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:58.248015+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:58.248017+00:00'
