title: XBAP Execution From Uncommon Locations Via PresentationHost.EXE
id: d22e2925-cfd8-463f-96f6-89cec9d9bc5f
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: 'Detects the execution of ".xbap" (Browser Applications) files via PresentationHost.EXE
    from an uncommon location. These files can be abused to run malicious ".xbap"
    files any bypass AWL

    '
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Presentationhost/
falsepositives:
    - Legitimate ".xbap" being executed via "PresentationHost"
tags:
    - attack.defense-evasion
    - attack.execution
    - attack.t1218
date: '2022-07-01'
modified: '2023-11-09'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \presentationhost.exe
        OriginalFileName: PresentationHost.exe
    selection_cli:
        CommandLine|contains: .xbap
    filter_main_generic:
        CommandLine|contains:
            - ' C:\Windows\'
            - ' C:\Program Files'
    condition: all of selection* and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:48:43.397704+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:48:43.397704+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:48:43.397723+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:48:43.397725+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:48:43.397727+00:00'
