title: Suspicious Serv-U Process Pattern
id: 58f4ea09-0fc2-4520-ba18-b85c540b0eaf
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects a suspicious process pattern which could be a sign of an exploited
    Serv-U service
references:
    - https://www.microsoft.com/security/blog/2021/07/13/microsoft-discovers-threat-actor-targeting-solarwinds-serv-u-software-with-0-day-exploit/
falsepositives:
    - Legitimate uses in which users or programs use the SSH service of Serv-U for
        remote command execution
tags:
    - attack.credential-access
    - attack.t1555
    - cve.2021-35211
date: '2021-07-14'
modified: '2022-07-14'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \Serv-U.exe
        Image|endswith:
            - \cmd.exe
            - \powershell.exe
            - \pwsh.exe
            - \wscript.exe
            - \cscript.exe
            - \sh.exe
            - \bash.exe
            - \schtasks.exe
            - \regsvr32.exe
            - \wmic.exe
            - \mshta.exe
            - \rundll32.exe
            - \msiexec.exe
            - \forfiles.exe
            - \scriptrunner.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:41:39.923864+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:41:39.923864+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:41:39.923878+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:41:39.923880+00:00'
