id: 9b5de532-a757-4d70-946c-1f3e44f48b4d
title: Shell Execution GCC  - Linux
status: experimental
level: high
description: 'Detects the use of the "gcc" utility to execute a shell. Such behavior
    may be associated with privilege escalation, unauthorized command execution, or
    to break out from restricted environments.

    '
author: Li Ling, Andy Parkidomo, Robert Rakowski, Blake Hartstein (Bloomberg L.P.)
date: '2024-09-02'
tags:
    - attack.discovery
    - attack.t1083
references:
    - https://gtfobins.github.io/gtfobins/gcc/#shell
    - https://gtfobins.github.io/gtfobins/c89/#shell
    - https://gtfobins.github.io/gtfobins/c99/#shell
    - https://www.elastic.co/guide/en/security/current/linux-restricted-shell-breakout-via-linux-binary-s.html
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection_img:
        Image|endswith:
            - /c89
            - /c99
            - /gcc
        CommandLine|contains: -wrapper
    selection_cli:
        CommandLine|contains:
            - /bin/bash,-s
            - /bin/dash,-s
            - /bin/fish,-s
            - /bin/sh,-s
            - /bin/zsh,-s
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:17:07.537149+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-26T02:17:07.537149+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:17:07.537170+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:17:07.537174+00:00'
