id: 4ac47ed3-44c2-4b1f-9d51-bf46e8914126
title: TrustedPath UAC Bypass Pattern
status: test
level: critical
description: Detects indicators of a UAC bypass method by mocking directories
author: Florian Roth (Nextron Systems)
date: '2021-08-27'
tags:
    - attack.defense-evasion
    - attack.t1548.002
references:
    - https://medium.com/tenable-techblog/uac-bypass-by-mocking-trusted-directories-24a96675f6e
    - https://www.wietzebeukema.nl/blog/hijacking-dlls-in-windows
    - https://github.com/netero1010/TrustedPath-UACBypass-BOF
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|contains: C:\Windows \System32\
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:32:14.837047+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:32:14.837047+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:32:14.837072+00:00'
