title: Suspicious MSDT Parent Process
id: 7a74da6b-ea76-47db-92cc-874ad90df734
status: test
level: high
author: Nextron Systems
description: Detects msdt.exe executed by a suspicious parent as seen in CVE-2022-30190
    / Follina exploitation
references:
    - https://twitter.com/nao_sec/status/1530196847679401984
    - https://app.any.run/tasks/713f05d2-fe78-4b9d-a744-f7c133e3fafb/
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1036
    - attack.t1218
date: '2022-06-01'
modified: '2023-02-06'
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|endswith:
            - \cmd.exe
            - \cscript.exe
            - \mshta.exe
            - \powershell.exe
            - \pwsh.exe
            - \regsvr32.exe
            - \rundll32.exe
            - \schtasks.exe
            - \wmic.exe
            - \wscript.exe
            - \wsl.exe
    selection_msdt:
        Image|endswith: \msdt.exe
        OriginalFileName: msdt.exe
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:49:30.239576+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:49:30.239576+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:49:30.239592+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:49:30.239593+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:49:30.239595+00:00'
