id: 224f140f-3553-4cd1-af78-13d81bf9f7cc
title: Potential RDP Session Hijacking Activity
status: test
level: medium
description: Detects potential RDP Session Hijacking activity on Windows systems
author: '@juju4'
date: '2022-12-27'
modified: '2024-12-01'
tags:
    - attack.execution
references:
    - https://twitter.com/Moti_B/status/909449115477659651
falsepositives:
    - Administrative activity
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \tscon.exe
        OriginalFileName: tscon.exe
    selection_integrity:
        IntegrityLevel:
            - System
            - S-1-16-16384
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:25:35.341549+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:25:35.341549+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:25:35.341612+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:25:35.341617+00:00'
        -   source_field: IntegrityLevel
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:25:35.341620+00:00'
