title: Suspicious WmiPrvSE Child Process
id: 8a582fe2-0882-4b89-a82a-da6b2dc32937
status: test
level: high
author: Vadim Khrykov (ThreatIntel), Cyb3rEng, Florian Roth (Nextron Systems)
description: Detects suspicious and uncommon child processes of WmiPrvSE
references:
    - https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
    - https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/02bcbfc2bfb8b4da601bb30de0344ae453aa1afe/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml
    - https://blog.osarmor.com/319/onenote-attachment-delivers-asyncrat-malware/
    - https://twitter.com/ForensicITGuy/status/1334734244120309760
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.defense-evasion
    - attack.t1047
    - attack.t1204.002
    - attack.t1218.010
date: '2021-08-23'
modified: '2023-11-10'
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|endswith: \wbem\WmiPrvSE.exe
    selection_children_1:
        Image|endswith:
            - \certutil.exe
            - \cscript.exe
            - \mshta.exe
            - \msiexec.exe
            - \regsvr32.exe
            - \rundll32.exe
            - \verclsid.exe
            - \wscript.exe
    selection_children_2:
        Image|endswith: \cmd.exe
        CommandLine|contains:
            - cscript
            - mshta
            - powershell
            - pwsh
            - regsvr32
            - rundll32
            - wscript
    filter_main_werfault:
        Image|endswith: \WerFault.exe
    filter_main_wmiprvse:
        Image|endswith: \WmiPrvSE.exe
    filter_main_msiexec:
        Image|endswith: \msiexec.exe
        CommandLine|contains: '/i '
    condition: selection_parent and 1 of selection_children_* and not 1 of filter_main_*
related:
    -   id: 692f0bec-83ba-4d04-af7e-e884a96059b6
        type: similar
    -   id: d21374ff-f574-44a7-9998-4a8c8bf33d7d
        type: similar
    -   id: 18cf6cf0-39b0-4c22-9593-e244bdc9a2d4
        type: obsolete
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:43:12.087286+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:43:12.087286+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:43:12.087302+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:43:12.087304+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:43:12.087305+00:00'
