title: Sysmon Driver Unloaded Via Fltmc.EXE
id: 4d7cda18-1b12-4e52-b45c-d28653210df8
status: test
level: high
author: Kirill Kiryanov, oscd.community
description: Detects possible Sysmon filter driver unloaded via fltmc.exe
references:
    - https://www.darkoperator.com/blog/2018/10/5/operating-offensively-against-sysmon
falsepositives:
    - Unlikely
tags:
    - attack.defense-evasion
    - attack.t1070
    - attack.t1562
    - attack.t1562.002
date: '2019-10-23'
modified: '2023-02-13'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \fltMC.exe
        OriginalFileName: fltMC.exe
    selection_cli:
        CommandLine|contains|all:
            - unload
            - sysmon
    condition: all of selection_*
related:
    -   id: 4931188c-178e-4ee7-a348-39e8a7a56821
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:49:26.578706+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:49:26.578706+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:49:26.578722+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:49:26.578725+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:49:26.578726+00:00'
