id: ae215552-081e-44c7-805f-be16f975c8a2
title: Suspicious Debugger Registration Cmdline
status: test
level: high
description: Detects the registration of a debugger for a program that is available
    in the logon screen (sticky key backdoor).
author: Florian Roth (Nextron Systems), oscd.community, Jonhnathan Ribeiro
date: '2019-09-06'
modified: '2022-08-06'
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1546.008
references:
    - https://blogs.technet.microsoft.com/jonathantrull/2016/10/03/detecting-sticky-key-backdoors/
    - https://bazaar.abuse.ch/sample/6f3aa9362d72e806490a8abce245331030d1ab5ac77e400dd475748236a6cc81/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        CommandLine|contains: \CurrentVersion\Image File Execution Options\
    selection2:
        CommandLine|contains:
            - sethc.exe
            - utilman.exe
            - osk.exe
            - magnify.exe
            - narrator.exe
            - displayswitch.exe
            - atbroker.exe
            - HelpPane.exe
    condition: all of selection*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:38.021666+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:38.021666+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:38.021672+00:00'
