id: 4b046706-5789-4673-b111-66f25fe99534
title: Deleted Data Overwritten Via Cipher.EXE
status: test
level: medium
description: 'Detects usage of the "cipher" built-in utility in order to overwrite
    deleted data from disk.

    Adversaries may destroy data and files on specific systems or in large numbers
    on a network to interrupt availability to systems, services, and network resources.

    Data destruction is likely to render stored data irrecoverable by forensic techniques
    through overwriting files or data on local and remote drives

    '
author: frack113
date: '2021-12-26'
modified: '2023-02-21'
tags:
    - attack.impact
    - attack.t1485
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1485/T1485.md#atomic-test-3---overwrite-deleted-data-on-c-drive
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        OriginalFileName: CIPHER.EXE
        Image|endswith: \cipher.exe
    selection_cli:
        CommandLine|contains: ' /w:'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:29:00.153982+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:29:00.153982+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:29:00.153996+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:29:00.153998+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:29:00.153999+00:00'
