title: File Decryption Using Gpg4win
id: 037dcd71-33a8-4392-bb01-293c94663e5a
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects usage of Gpg4win to decrypt files
references:
    - https://blogs.vmware.com/security/2022/11/batloader-the-evasive-downloader-malware.html
    - https://www.gpg4win.de/documentation.html
    - https://news.sophos.com/en-us/2022/01/19/zloader-installs-remote-access-backdoors-and-delivers-cobalt-strike/
falsepositives:
    - Unknown
tags:
    - attack.execution
date: '2023-08-09'
logsource:
    category: process_creation
    product: windows
detection:
    selection_metadata:
        Image|endswith:
            - \gpg.exe
            - \gpg2.exe
        Description: GnuPG’s OpenPGP tool
    selection_cli:
        CommandLine|contains|all:
            - ' -d '
            - passphrase
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:59.106885+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:59.106885+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:44:59.106901+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: device.desc
            mapped_at: '2025-12-04T01:44:59.106903+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:44:59.106904+00:00'
