id: 84b1706c-932a-44c4-ae28-892b28a25b94
title: OneNote.EXE Execution of Malicious Embedded Scripts
status: test
level: high
description: 'Detects the execution of malicious OneNote documents that contain embedded
    scripts.

    When a user clicks on a OneNote attachment and then on the malicious link inside
    the ".one" file, it exports and executes the malicious embedded script from specific
    directories.

    '
author: '@kostastsale'
date: '2023-02-02'
tags:
    - attack.defense-evasion
    - attack.t1218.001
references:
    - https://bazaar.abuse.ch/browse/tag/one/
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \onenote.exe
        Image|endswith:
            - \cmd.exe
            - \cscript.exe
            - \mshta.exe
            - \powershell.exe
            - \pwsh.exe
            - \wscript.exe
        CommandLine|contains:
            - \exported\
            - \onenoteofflinecache_files\
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:22.287683+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:22.287683+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:22.287689+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:22.287691+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:22.287692+00:00'
