id: 2c32b543-1058-4808-91c6-5b31b8bed6c5
title: PUA - Crassus Execution
status: test
level: high
description: Detects Crassus, a Windows privilege escalation discovery tool, based
    on PE metadata characteristics.
author: pH-T (Nextron Systems)
date: '2023-04-17'
tags:
    - attack.discovery
    - attack.t1590.001
references:
    - https://github.com/vu-ls/Crassus
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \Crassus.exe
        OriginalFileName: Crassus.exe
        Description|contains: Crassus
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:48.426707+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:48.426707+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:48.426713+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:48.426714+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: message
            mapped_at: '2025-11-13T20:20:48.426715+00:00'
