id: 883faa95-175a-4e22-8181-e5761aeb373c
title: Suspicious Service Binary Directory
status: test
level: high
description: Detects a service binary running in a suspicious directory
author: Florian Roth (Nextron Systems)
date: '2021-03-09'
modified: '2022-10-09'
tags:
    - attack.defense-evasion
    - attack.t1202
references:
    - https://blog.truesec.com/2021/03/07/exchange-zero-day-proxylogon-and-hafnium/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|contains:
            - \Users\Public\
            - \$Recycle.bin
            - \Users\All Users\
            - \Users\Default\
            - \Users\Contacts\
            - \Users\Searches\
            - C:\Perflogs\
            - \config\systemprofile\
            - \Windows\Fonts\
            - \Windows\IME\
            - \Windows\addins\
        ParentImage|endswith:
            - \services.exe
            - \svchost.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:49.501263+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:49.501263+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:49.501272+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:49.501274+00:00'
