id: 9e716b33-63b2-46da-86a4-bd3c3b9b5dfb
title: Certificate Exported Via PowerShell
status: test
level: medium
description: Detects calls to cmdlets that are used to export certificates from the
    local certificate store. Threat actors were seen abusing this to steal private
    keys from compromised machines.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-05-18'
tags:
    - attack.credential-access
    - attack.execution
    - attack.t1552.004
    - attack.t1059.001
references:
    - https://us-cert.cisa.gov/ncas/analysis-reports/ar21-112a
    - https://learn.microsoft.com/en-us/powershell/module/pki/export-pfxcertificate?view=windowsserver2022-ps
    - https://www.splunk.com/en_us/blog/security/breaking-the-chain-defending-against-certificate-services-abuse.html
falsepositives:
    - Legitimate certificate exports by administrators. Additional filters might be
        required.
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''aa7a3fce-bef5-4311-9cc1-5f04bb8c308c''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - 'Export-PfxCertificate '
            - 'Export-Certificate '
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:32:45.134943+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:32:45.134943+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:32:45.134956+00:00'
