id: 53b1b378-9b06-4992-b972-dde6e423d2b4
title: Credentials In Files
status: test
level: high
description: Detecting attempts to extract passwords with grep and laZagne
author: Igor Fits, Mikhail Larin, oscd.community
date: '2020-10-19'
modified: '2021-11-27'
tags:
    - attack.credential-access
    - attack.t1552.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.001/T1552.001.md
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: macos
detection:
    selection1:
        Image|endswith: /grep
        CommandLine|contains: password
    selection2:
        CommandLine|contains: laZagne
    condition: 1 of selection*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:13:05.125188+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-11-26T02:13:05.125188+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:13:05.125203+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:13:05.125205+00:00'
