title: System Network Connections Discovery - Linux
id: 4c519226-f0cd-4471-bd2f-6fbb2bb68a79
status: test
level: low
author: Daniil Yugoslavskiy, oscd.community
description: Detects usage of system utilities to discover system network connections
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1049/T1049.md
falsepositives:
    - Legitimate activities
tags:
    - attack.discovery
    - attack.t1049
date: '2020-10-19'
modified: '2023-01-17'
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith:
            - /who
            - /w
            - /last
            - /lsof
            - /netstat
    filter_landscape_sysinfo:
        ParentCommandLine|contains: /usr/bin/landscape-sysinfo
        Image|endswith: /who
    condition: selection and not 1 of filter_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:35:57.774942+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:35:57.774942+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:35:57.774965+00:00'
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-12-04T01:35:57.774968+00:00'
