id: 93199800-b52a-4dec-b762-75212c196542
title: PUA - RunXCmd Execution
status: test
level: high
description: Detects the use of the RunXCmd tool to execute commands with System or
    TrustedInstaller accounts
author: Florian Roth (Nextron Systems)
date: '2022-01-24'
modified: '2023-02-14'
tags:
    - attack.execution
    - attack.t1569.002
    - attack.s0029
references:
    - https://www.d7xtech.com/free-software/runx/
    - https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Legitimate use by administrators
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_account:
        CommandLine|contains:
            - ' /account=system '
            - ' /account=ti '
    selection_exec:
        CommandLine|contains: /exec=
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:56.575119+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:56.575119+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:56.575133+00:00'
