id: 6ff08e55-ea53-4f27-94a1-eff92e6d9d5c
title: System Information Discovery Via Sysctl - MacOS
status: experimental
level: medium
description: 'Detects the execution of "sysctl" with specific arguments that have
    been used by threat actors and malware. It provides system hardware information.

    This process is primarily used to detect and avoid virtualization and analysis
    environments.

    '
author: Pratinav Chandra
date: '2024-05-27'
tags:
    - attack.defense-evasion
    - attack.t1497.001
    - attack.discovery
    - attack.t1082
references:
    - https://www.loobins.io/binaries/sysctl/#
    - https://evasions.checkpoint.com/techniques/macos.html
    - https://www.welivesecurity.com/2019/04/09/oceanlotus-macos-malware-update/
    - https://www.sentinelone.com/labs/20-common-tools-techniques-used-by-macos-threat-actors-malware/
    - https://objective-see.org/blog/blog_0x1E.html
    - https://www.virustotal.com/gui/file/1c547a064494a35d6b5e6b459de183ab2720a22725e082bed6f6629211f7abc1/behavior
    - https://www.virustotal.com/gui/file/b4b1fc65f87b3dcfa35e2dbe8e0a34ad9d8a400bec332025c0a2e200671038aa/behavior
falsepositives:
    - Legitimate administrative activities
taxonomy: sigma
logsource:
    category: process_creation
    product: macos
detection:
    selection_img:
        Image|endswith: /sysctl
        CommandLine|contains: sysctl
    selection_cmd:
        CommandLine|contains:
            - hw.
            - kern.
            - machdep.
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:14:25.790204+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-11-13T20:14:25.790204+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:14:25.790210+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:14:25.790211+00:00'
