id: 022eaba8-f0bf-4dd9-9217-4604b0bb3bb0
title: HackTool - Wmiexec Default Powershell Command
status: test
level: high
description: Detects the execution of PowerShell with a specific flag sequence that
    is used by the Wmiexec script
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-03-08'
tags:
    - attack.defense-evasion
    - attack.lateral-movement
references:
    - https://github.com/fortra/impacket/blob/f4b848fa27654ca95bc0f4c73dbba8b9c2c9f30a/examples/wmiexec.py
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains: -NoP -NoL -sta -NonI -W Hidden -Exec Bypass -Enc
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:19:50.298241+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:19:50.298241+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:19:50.298255+00:00'
