id: ea0cdc3e-2239-4f26-a947-4e8f8224e464
title: Suspicious File Encoded To Base64 Via Certutil.EXE
status: test
level: high
description: Detects the execution of certutil with the "encode" flag to encode a
    file to base64 where the extensions of the file is suspicious
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-05-15'
modified: '2024-03-05'
tags:
    - attack.defense-evasion
    - attack.t1027
references:
    - https://www.virustotal.com/gui/file/35c22725a92d5cb1016b09421c0a6cdbfd860fd4778b3313669b057d4a131cb7/behavior
    - https://www.virustotal.com/gui/file/427616528b7dbc4a6057ac89eb174a3a90f7abcf3f34e5a359b7a910d82f7a72/behavior
    - https://www.virustotal.com/gui/file/34de4c8beded481a4084a1fd77855c3e977e8ac643e5c5842d0f15f7f9b9086f/behavior
    - https://www.virustotal.com/gui/file/4abe1395a09fda06d897a9c4eb247278c1b6cddda5d126ce5b3f4f499e3b8fa2/behavior
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''e62a9f0c-ca1e-46b2-85d5-a6da77f86d1a''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \certutil.exe
        OriginalFileName: CertUtil.exe
    selection_cli:
        CommandLine|contains|windash: -encode
    selection_extension:
        CommandLine|contains:
            - .acl
            - .bat
            - .doc
            - .gif
            - .jpeg
            - .jpg
            - .mp3
            - .pdf
            - .png
            - .ppt
            - .tmp
            - .xls
            - .xml
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:14.455194+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:14.455194+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:14.455199+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:14.455201+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:14.455202+00:00'
