title: DD File Overwrite
id: 2953194b-e33c-4859-b9e8-05948c167447
status: test
level: low
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research), MSTIC
description: Detects potential overwriting and deletion of a file using DD.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1485/T1485.md#atomic-test-2---macoslinux---overwrite-file-with-dd
falsepositives:
    - Any user deleting files that way.
tags:
    - attack.impact
    - attack.t1485
date: '2021-10-15'
modified: '2022-07-07'
logsource:
    category: process_creation
    product: linux
detection:
    selection1:
        Image:
            - /bin/dd
            - /usr/bin/dd
    selection2:
        CommandLine|contains: of=
    selection3:
        CommandLine|contains:
            - if=/dev/zero
            - if=/dev/null
    condition: all of selection*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:32.381089+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:32.381089+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:36:32.381118+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:36:32.381120+00:00'
