id: 66c3b204-9f88-4d0a-a7f7-8a57d521ca55
title: Potential Crypto Mining Activity
status: stable
level: high
description: Detects command line parameters or strings often used by crypto miners
author: Florian Roth (Nextron Systems)
date: '2021-10-26'
modified: '2023-02-13'
tags:
    - attack.impact
    - attack.t1496
references:
    - https://www.poolwatch.io/coin/monero
falsepositives:
    - Legitimate use of crypto miners
    - Some build frameworks
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - ' --cpu-priority='
            - --donate-level=0
            - ' -o pool.'
            - ' --nicehash'
            - ' --algo=rx/0 '
            - stratum+tcp://
            - stratum+udp://
            - LS1kb25hdGUtbGV2ZWw9
            - 0tZG9uYXRlLWxldmVsP
            - tLWRvbmF0ZS1sZXZlbD
            - c3RyYXR1bSt0Y3A6Ly
            - N0cmF0dW0rdGNwOi8v
            - zdHJhdHVtK3RjcDovL
            - c3RyYXR1bSt1ZHA6Ly
            - N0cmF0dW0rdWRwOi8v
            - zdHJhdHVtK3VkcDovL
    filter:
        CommandLine|contains:
            - ' pool.c '
            - ' pool.o '
            - gcc -
    condition: selection and not filter
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:36:55.146011+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:36:55.146011+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:36:55.146026+00:00'
