title: Potential Process Execution Proxy Via CL_Invocation.ps1
id: a0459f02-ac51-4c09-b511-b8c9203fc429
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems), oscd.community, Natalia Shornikova
description: Detects calls to "SyncInvoke" that is part of the "CL_Invocation.ps1"
    script to proxy execution using "System.Diagnostics.Process"
references:
    - https://lolbas-project.github.io/lolbas/Scripts/Cl_invocation/
    - https://twitter.com/bohops/status/948061991012327424
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1216
date: '2020-10-14'
modified: '2023-08-17'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains: 'SyncInvoke '
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:50:49.994905+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:50:49.994905+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:50:49.994930+00:00'
