title: Potential Discovery Activity Using Find - MacOS
id: 85de3a19-b675-4a51-bfc6-b11a5186c971
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects usage of "find" binary in a suspicious manner to perform discovery
references:
    - https://github.com/SaiSathvik1/Linux-Privilege-Escalation-Notes
falsepositives:
    - Unknown
tags:
    - attack.discovery
    - attack.t1083
date: '2022-12-28'
logsource:
    category: process_creation
    product: macos
detection:
    selection:
        Image|endswith: /find
        CommandLine|contains:
            - -perm -4000
            - -perm -2000
            - -perm 0777
            - -perm -222
            - -perm -o w
            - -perm -o x
            - -perm -u=s
            - -perm -g=s
    condition: selection
related:
    -   id: 8344c0e5-5783-47cc-9cf9-a0f7fd03e6cf
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:34:34.174420+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-12-04T01:34:34.174420+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:34:34.174437+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:34:34.174439+00:00'
