id: 34ebb878-1b15-4895-b352-ca2eeb99b274
title: Suspicious Execution of Shutdown
status: test
level: medium
description: Use of the commandline to shutdown or reboot windows
author: frack113
date: '2022-01-01'
tags:
    - attack.impact
    - attack.t1529
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1529/T1529.md
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/shutdown
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \shutdown.exe
        CommandLine|contains:
            - '/r '
            - '/s '
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:27:42.544040+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:27:42.544040+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:27:42.544053+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:27:42.544056+00:00'
