id: faa48cae-6b25-4f00-a094-08947fef582f
title: Rar Usage with Password and Compression Level
status: test
level: high
description: Detects the use of rar.exe, on the command line, to create an archive
    with password protection or with a specific compression level. This is pretty
    indicative of malicious actions.
author: '@ROxPinTeddy'
date: '2020-05-12'
modified: '2022-03-16'
tags:
    - attack.collection
    - attack.t1560.001
references:
    - https://labs.sentinelone.com/the-anatomy-of-an-apt-attack-and-cobaltstrike-beacons-encoded-configuration/
    - https://ss64.com/bash/rar.html
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md
falsepositives:
    - Legitimate use of Winrar command line version
    - Other command line tools, that use these flags
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_password:
        CommandLine|contains: ' -hp'
    selection_other:
        CommandLine|contains:
            - ' -m'
            - ' a '
    condition: selection_password and selection_other
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:35:06.678459+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:35:06.678459+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:35:06.678497+00:00'
