title: Indirect Inline Command Execution Via Bash.EXE
id: 5edc2273-c26f-406c-83f3-f4d948e740dd
status: test
level: medium
author: frack113
description: 'Detects execution of Microsoft bash launcher with the "-c" flag.

    This can be used to potentially bypass defenses and execute Linux or Windows-based
    binaries directly via bash.

    '
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Bash/
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1202
date: '2021-11-24'
modified: '2023-08-15'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - :\Windows\System32\bash.exe
            - :\Windows\SysWOW64\bash.exe
        OriginalFileName: Bash.exe
    selection_cli:
        CommandLine|contains: ' -c '
    condition: all of selection_*
related:
    -   id: 2d22a514-e024-4428-9dba-41505bd63a5b
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:43:39.733597+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:43:39.733597+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:43:39.733615+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:43:39.733617+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:43:39.733618+00:00'
