title: Msiexec Quiet Installation
id: 79a87aa6-e4bd-42fc-a5bb-5e6fbdcd62f5
status: test
level: medium
author: frack113
description: 'Adversaries may abuse msiexec.exe to proxy execution of malicious payloads.

    Msiexec.exe is the command-line utility for the Windows Installer and is thus
    commonly associated with executing installation packages (.msi)

    '
references:
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/msiexec
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.007/T1218.007.md
    - https://twitter.com/_st0pp3r_/status/1583914244344799235
falsepositives:
    - WindowsApps installing updates via the quiet flag
tags:
    - attack.defense-evasion
    - attack.t1218.007
date: '2022-01-16'
modified: '2024-12-01'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \msiexec.exe
        OriginalFileName: msiexec.exe
    selection_cli:
        CommandLine|contains|windash:
            - -i
            - -package
            - -a
            - -j
    selection_quiet:
        CommandLine|contains|windash: -q
    filter_user_temp:
        ParentImage|startswith: C:\Users\
        ParentImage|contains: \AppData\Local\Temp\
    filter_system_temp:
        ParentImage|startswith: C:\Windows\Temp\
    filter_ccm:
        ParentImage: C:\Windows\CCM\Ccm32BitLauncher.exe
        IntegrityLevel:
            - System
            - S-1-16-16384
    condition: all of selection_* and not 1 of filter_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:41:37.068172+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:41:37.068172+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:41:37.068190+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:41:37.068192+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:41:37.068194+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:41:37.068196+00:00'
        -   source_field: IntegrityLevel
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:41:37.068204+00:00'
