id: 204b17ae-4007-471b-917b-b917b315c5db
title: Greedy File Deletion Using Del
status: test
level: medium
description: Detects execution of the "del" builtin command to remove files using
    greedy/wildcard expression. This is often used by malware to delete content of
    folders that perhaps contains the initial malware infection or to delete evidence.
author: frack113 , X__Junior (Nextron Systems)
date: '2021-12-02'
modified: '2023-09-11'
tags:
    - attack.defense-evasion
    - attack.t1070.004
references:
    - https://www.joesandbox.com/analysis/509330/0/html#1044F3BDBE3BB6F734E357235F4D5898582D
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/erase
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \cmd.exe
        OriginalFileName: Cmd.Exe
    selection_del:
        CommandLine|contains:
            - 'del '
            - 'erase '
    selection_extensions:
        CommandLine|contains:
            - \\*.au3
            - \\*.dll
            - \\*.exe
            - \\*.js
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:31:21.143659+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:31:21.143659+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:31:21.143676+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:31:21.143677+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:31:21.143679+00:00'
