id: 4b991083-3d0e-44ce-8fc4-b254025d8d4b
title: Unusual Parent Process For Cmd.EXE
status: test
level: medium
description: Detects suspicious parent process for cmd.exe
author: Tim Rauch, Elastic (idea)
date: '2022-09-21'
modified: '2023-12-05'
tags:
    - attack.execution
    - attack.t1059
references:
    - https://www.elastic.co/guide/en/security/current/unusual-parent-process-for-cmd.exe.html
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \cmd.exe
        ParentImage|endswith:
            - \csrss.exe
            - \ctfmon.exe
            - \dllhost.exe
            - \epad.exe
            - \FlashPlayerUpdateService.exe
            - \GoogleUpdate.exe
            - \jucheck.exe
            - \jusched.exe
            - \LogonUI.exe
            - \lsass.exe
            - \regsvr32.exe
            - \SearchIndexer.exe
            - \SearchProtocolHost.exe
            - \SIHClient.exe
            - \sihost.exe
            - \slui.exe
            - \spoolsv.exe
            - \sppsvc.exe
            - \taskhostw.exe
            - \unsecapp.exe
            - \WerFault.exe
            - \wermgr.exe
            - \wlanext.exe
            - \WUDFHost.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:37:09.973332+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:37:09.973332+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:37:09.973363+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:37:09.973367+00:00'
