title: Suspicious Eventlog Clearing or Configuration Change Activity
id: cc36992a-4671-4f21-a91d-6c2b72a2edf5
status: stable
level: high
author: Ecco, Daniil Yugoslavskiy, oscd.community, D3F7A5105
description: 'Detects the clearing or configuration tampering of EventLog using utilities
    such as "wevtutil", "powershell" and "wmic".

    This technique were seen used by threat actors and ransomware strains in order
    to evade defenses.

    '
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.001/T1070.001.md
    - https://eqllib.readthedocs.io/en/latest/analytics/5b223758-07d6-4100-9e11-238cfdd0fe97.html
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/wevtutil
    - https://gist.github.com/fovtran/ac0624983c7722e80a8f5a4babb170ee
    - https://jdhnet.wordpress.com/2017/12/19/changing-the-location-of-the-windows-event-logs/
falsepositives:
    - Admin activity
    - Scripts and administrative tools used in the monitored environment
    - Maintenance activity
tags:
    - attack.defense-evasion
    - attack.t1070.001
    - attack.t1562.002
    - car.2016-04-002
date: '2019-09-26'
modified: '2023-07-13'
logsource:
    category: process_creation
    product: windows
detection:
    selection_wevtutil:
        Image|endswith: \wevtutil.exe
        CommandLine|contains:
            - 'clear-log '
            - ' cl '
            - 'set-log '
            - ' sl '
            - 'lfn:'
    selection_other_ps:
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
        CommandLine|contains:
            - 'Clear-EventLog '
            - 'Remove-EventLog '
            - 'Limit-EventLog '
            - 'Clear-WinEvent '
    selection_other_wmi:
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
            - \wmic.exe
        CommandLine|contains: ClearEventLog
    filter_msiexec:
        ParentImage:
            - C:\Windows\SysWOW64\msiexec.exe
            - C:\Windows\System32\msiexec.exe
        CommandLine|contains: ' sl '
    condition: 1 of selection_* and not 1 of filter_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:50:33.584964+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:50:33.584964+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:50:33.584979+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:50:33.584989+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:50:33.584992+00:00'
