id: 2f869d59-7f6a-4931-992c-cce556ff2d53
title: Potential Adplus.EXE Abuse
status: test
level: high
description: Detects execution of "AdPlus.exe", a binary that is part of the Windows
    SDK that can be used as a LOLBIN in order to dump process memory and execute arbitrary
    commands.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-06-09'
modified: '2023-06-23'
tags:
    - attack.defense-evasion
    - attack.execution
    - attack.t1003.001
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Adplus/
    - https://twitter.com/nas_bench/status/1534916659676422152
    - https://twitter.com/nas_bench/status/1534915321856917506
falsepositives:
    - Legitimate usage of Adplus for debugging purposes
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \adplus.exe
        OriginalFileName: Adplus.exe
    selection_cli:
        CommandLine|contains:
            - ' -hang '
            - ' -pn '
            - ' -pmn '
            - ' -p '
            - ' -po '
            - ' -c '
            - ' -sc '
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:24.788798+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:24.788798+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:24.788807+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:24.788810+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:24.788811+00:00'
