id: c8a5f584-cdc8-42cc-8cce-0398e4265de3
title: Apache Spark Shell Command Injection - ProcessCreation
status: test
level: high
description: Detects attempts to exploit an apache spark server via CVE-2014-6287
    from a commandline perspective
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-07-20'
tags:
    - attack.initial-access
    - attack.t1190
    - cve.2022-33891
references:
    - https://github.com/W01fh4cker/cve-2022-33891/blob/fd973b56e78bca8822caa3a2e3cf1b5aff5d0950/cve_2022_33891_poc.py
    - https://sumsec.me/2022/CVE-2022-33891%20Apache%20Spark%20shell%20command%20injection.html
    - https://github.com/apache/spark/pull/36315/files
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        ParentImage|endswith: \bash
        CommandLine|contains:
            - id -Gn `
            - id -Gn '
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:17:40.176651+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-26T02:17:40.176651+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:17:40.176671+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:17:40.176675+00:00'
