title: MacOS Scripting Interpreter AppleScript
id: 1bc2e6c5-0885-472b-bed6-be5ea8eace55
status: test
level: medium
author: Alejandro Ortuno, oscd.community
description: Detects execution of AppleScript of the macOS scripting language AppleScript.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1059.002/T1059.002.md
    - https://redcanary.com/blog/applescript/
falsepositives:
    - Application installers might contain scripts as part of the installation process.
tags:
    - attack.execution
    - attack.t1059.002
date: '2020-10-21'
modified: '2023-02-01'
logsource:
    category: process_creation
    product: macos
detection:
    selection:
        Image|endswith: /osascript
        CommandLine|contains:
            - ' -e '
            - .scpt
            - .js
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:34:02.301321+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-12-04T01:34:02.301321+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:34:02.301340+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:34:02.301342+00:00'
