id: 85de1f22-d189-44e4-8239-dc276b45379b
title: Curl Web Request With Potential Custom User-Agent
status: test
level: medium
description: Detects execution of "curl.exe" with a potential custom "User-Agent".
    Attackers can leverage this to download or exfiltrate data via "curl" to a domain
    that only accept specific "User-Agent" strings
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-07-27'
tags:
    - attack.execution
references:
    - https://labs.withsecure.com/publications/fin7-target-veeam-servers
    - https://github.com/WithSecureLabs/iocs/blob/344203de742bb7e68bd56618f66d34be95a9f9fc/FIN7VEEAM/iocs.csv
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \curl.exe
        OriginalFileName: curl.exe
    selection_header:
        CommandLine|re: \s-H\s
        CommandLine|contains: 'User-Agent:'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:28:05.581355+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:28:05.581355+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:28:05.581368+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:28:05.581370+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:28:05.581371+00:00'
