title: Enumeration for Credentials in Registry
id: e0b0c2ab-3d52-46d9-8cb7-049dc775fbd1
status: test
level: medium
author: frack113
description: 'Adversaries may search the Registry on compromised systems for insecurely
    stored credentials.

    The Windows Registry stores configuration information that can be used by the
    system or other programs.

    Adversaries may query the Registry looking for credentials and passwords that
    have been stored for use by other programs or services

    '
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.002/T1552.002.md
falsepositives:
    - Unknown
tags:
    - attack.credential-access
    - attack.t1552.002
date: '2021-12-20'
modified: '2022-12-25'
logsource:
    category: process_creation
    product: windows
detection:
    reg:
        Image|endswith: \reg.exe
        CommandLine|contains|all:
            - ' query '
            - '/t '
            - REG_SZ
            - /s
    hive:
        CommandLine|contains|all:
            - '/f '
            - HKLM
            - '/f '
            - HKCU
        CommandLine|contains: HKCU\Software\SimonTatham\PuTTY\Sessions
    condition: reg and hive
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:50:52.011883+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:50:52.011883+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:50:52.011959+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:50:52.011969+00:00'
