id: a015e032-146d-4717-8944-7a1884122111
title: Linux HackTool Execution
status: test
level: high
description: Detects known hacktool execution based on image name.
author: Nasreddine Bencherchali (Nextron Systems), Georg Lauenstein (sure[secure])
date: '2023-01-03'
modified: '2024-09-19'
tags:
    - attack.execution
    - attack.resource-development
    - attack.t1587
references:
    - https://github.com/Gui774ume/ebpfkit
    - https://github.com/pathtofile/bad-bpf
    - https://github.com/carlospolop/PEASS-ng
    - https://github.com/t3l3machus/hoaxshell
    - https://github.com/t3l3machus/Villain
    - https://github.com/HavocFramework/Havoc
    - https://github.com/1N3/Sn1per
    - https://github.com/Ne0nd0g/merlin
    - https://github.com/Pennyw0rth/NetExec/
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection_c2_frameworks:
        Image|endswith:
            - /crackmapexec
            - /havoc
            - /merlin-agent
            - /merlinServer-Linux-x64
            - /msfconsole
            - /msfvenom
            - /ps-empire server
            - /ps-empire
            - /sliver-client
            - /sliver-server
            - /Villain.py
    selection_c2_framework_cobaltstrike:
        Image|contains:
            - /cobaltstrike
            - /teamserver
    selection_scanners:
        Image|endswith:
            - /autorecon
            - /httpx
            - /legion
            - /naabu
            - /netdiscover
            - /nuclei
            - /recon-ng
    selection_scanners_sniper:
        Image|contains: /sniper
    selection_web_enum:
        Image|endswith:
            - /dirb
            - /dirbuster
            - /eyewitness
            - /feroxbuster
            - /ffuf
            - /gobuster
            - /wfuzz
            - /whatweb
    selection_web_vuln:
        Image|endswith:
            - /joomscan
            - /nikto
            - /wpscan
    selection_exploit_tools:
        Image|endswith:
            - /aircrack-ng
            - /bloodhound-python
            - /bpfdos
            - /ebpfki
            - /evil-winrm
            - /hashcat
            - /hoaxshell.py
            - /hydra
            - /john
            - /ncrack
            - /nxc-ubuntu-latest
            - /pidhide
            - /pspy32
            - /pspy32s
            - /pspy64
            - /pspy64s
            - /setoolkit
            - /sqlmap
            - /writeblocker
    selection_linpeas:
        Image|contains: /linpeas
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:16:49.333371+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-26T02:16:49.333371+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:16:49.333386+00:00'
