title: Suspicious Process Parents
id: cbec226f-63d9-4eca-9f52-dfb6652f24df
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects suspicious parent processes that should not have any children
    or should only have a single possible child program
references:
    - https://twitter.com/x86matthew/status/1505476263464607744?s=12
    - https://svch0st.medium.com/stats-from-hunting-cobalt-strike-beacons-c17e56255f9b
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1036
date: '2022-03-21'
modified: '2022-09-08'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith:
            - \minesweeper.exe
            - \winver.exe
            - \bitsadmin.exe
    selection_special:
        ParentImage|endswith:
            - \csrss.exe
            - \certutil.exe
            - \eventvwr.exe
            - \calc.exe
            - \notepad.exe
    filter_special:
        Image|endswith:
            - \WerFault.exe
            - \wermgr.exe
            - \conhost.exe
            - \mmc.exe
            - \win32calc.exe
            - \notepad.exe
    filter_null:
        Image: null
    condition: selection or ( selection_special and not 1 of filter_* )
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:51:04.488227+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:51:04.488227+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:51:04.488300+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:51:04.488319+00:00'
