title: Enumeration for 3rd Party Creds From CLI
id: 87a476dc-0079-4583-a985-dee7a20a03de
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects processes that query known 3rd party registry keys that holds
    credentials via commandline
references:
    - https://isc.sans.edu/diary/More+Data+Exfiltration/25698
    - https://github.com/synacktiv/Radmin3-Password-Cracker/blob/acfc87393e4b7c06353973a14a6c7126a51f36ac/regkey.txt
    - https://github.com/HyperSine/how-does-MobaXterm-encrypt-password
    - https://book.hacktricks.xyz/windows-hardening/windows-local-privilege-escalation#inside-the-registry
falsepositives:
    - Unknown
tags:
    - attack.credential-access
    - attack.t1552.002
date: '2022-06-20'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - \Software\SimonTatham\PuTTY\Sessions
            - \Software\SimonTatham\PuTTY\SshHostKeys\
            - \Software\Mobatek\MobaXterm\
            - \Software\WOW6432Node\Radmin\v3.0\Server\Parameters\Radmin
            - \Software\Aerofox\FoxmailPreview
            - \Software\Aerofox\Foxmail\V3.1
            - \Software\IncrediMail\Identities
            - \Software\Qualcomm\Eudora\CommandLine
            - \Software\RimArts\B2\Settings
            - \Software\OpenVPN-GUI\configs
            - \Software\Martin Prikryl\WinSCP 2\Sessions
            - \Software\FTPWare\COREFTP\Sites
            - \Software\DownloadManager\Passwords
            - \Software\OpenSSH\Agent\Keys
            - \Software\TightVNC\Server
            - \Software\ORL\WinVNC3\Password
            - \Software\RealVNC\WinVNC4
    condition: selection
related:
    -   id: e0b0c2ab-3d52-46d9-8cb7-049dc775fbd1
        type: derived
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:43:08.031458+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:43:08.031458+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:43:08.031471+00:00'
