id: 5cdb711b-5740-4fb2-ba88-f7945027afac
title: Rundll32 UNC Path Execution
status: test
level: high
description: Detects rundll32 execution where the DLL is located on a remote location
    (share)
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-08-10'
tags:
    - attack.defense-evasion
    - attack.execution
    - attack.t1021.002
    - attack.t1218.011
references:
    - https://www.cybereason.com/blog/rundll32-the-infamous-proxy-for-executing-malicious-code
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \rundll32.exe
        OriginalFileName: RUNDLL32.EXE
        CommandLine|contains: rundll32
    selection_cli:
        CommandLine|contains: ' \\'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:48.428208+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:48.428208+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:48.428214+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:48.428216+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:48.428217+00:00'
