id: cec8e918-30f7-4e2d-9bfa-a59cc97ae60f
title: OpenWith.exe Executes Specified Binary
status: test
level: high
description: The OpenWith.exe executes other binary
author: Beyu Denis, oscd.community (rule), @harr0ey (idea)
date: '2019-10-12'
modified: '2021-11-27'
tags:
    - attack.defense-evasion
    - attack.t1218
references:
    - https://github.com/LOLBAS-Project/LOLBAS/blob/4db780e0f0b2e2bb8cb1fa13e09196da9b9f1834/yml/LOLUtilz/OSBinaries/Openwith.yml
    - https://twitter.com/harr0ey/status/991670870384021504
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \OpenWith.exe
        CommandLine|contains: /c
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:29:17.761794+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:29:17.761794+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:29:17.761825+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:29:17.761828+00:00'
