title: Remote Access Tool - ScreenConnect Installation Execution
id: 75bfe6e6-cd8e-429e-91d3-03921e1d7962
status: test
level: medium
author: Florian Roth (Nextron Systems)
description: Detects ScreenConnect program starts that establish a remote access to
    a system.
references:
    - https://www.anomali.com/blog/probable-iranian-cyber-actors-static-kitten-conducting-cyberespionage-campaign-targeting-uae-and-kuwait-government-agencies
falsepositives:
    - Legitimate use by administrative staff
tags:
    - attack.initial-access
    - attack.t1133
date: '2021-02-11'
modified: '2024-02-26'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - e=Access&
            - y=Guest&
            - '&p='
            - '&c='
            - '&k='
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:42:34.598153+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:42:34.598153+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:42:34.598167+00:00'
