id: b4dc61f5-6cce-468e-a608-b48b469feaa2
title: DirLister Execution
status: test
level: low
description: Detect the usage of "DirLister.exe" a utility for quickly listing folder
    or drive contents. It was seen used by BlackCat ransomware to create a list of
    accessible directories and files.
author: frack113
date: '2022-08-20'
modified: '2023-02-04'
tags:
    - attack.discovery
    - attack.t1083
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1083/T1083.md
    - https://news.sophos.com/en-us/2022/07/14/blackcat-ransomware-attacks-not-merely-a-byproduct-of-bad-luck/
falsepositives:
    - Legitimate use by users
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        OriginalFileName: DirLister.exe
        Image|endswith: \dirlister.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:35:33.480432+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:35:33.480432+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:35:33.480458+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:35:33.480461+00:00'
