title: CreateDump Process Dump
id: 515c8be5-e5df-4c5e-8f6d-a4a2f05e4b48
status: test
level: high
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
description: Detects uses of the createdump.exe LOLOBIN utility to dump process memory
references:
    - https://www.crowdstrike.com/blog/overwatch-exposes-aquatic-panda-in-possession-of-log-4-shell-exploit-tools/
    - https://twitter.com/bopin2020/status/1366400799199272960
falsepositives:
    - Command lines that use the same flags
tags:
    - attack.defense-evasion
    - attack.t1036
    - attack.t1003.001
date: '2022-01-04'
modified: '2022-08-19'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \createdump.exe
        OriginalFileName: FX_VER_INTERNALNAME_STR
    selection_cli:
        CommandLine|contains:
            - ' -u '
            - ' --full '
            - ' -f '
            - ' --name '
            - '.dmp '
    condition: all of selection_*
related:
    -   id: 1a1ed54a-2ba4-4221-94d5-01dee560d71e
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:45:50.030668+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:45:50.030668+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:45:50.030686+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:45:50.030688+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:45:50.030690+00:00'
