id: 1cf98dc2-fcb0-47c9-8aea-654c9284d1ae
title: Disk Image Creation Via Hdiutil - MacOS
status: experimental
level: medium
description: Detects the execution of the hdiutil utility in order to create a disk
    image.
author: Omar Khaled (@beacon_exe)
date: '2024-08-10'
tags:
    - attack.exfiltration
references:
    - https://www.loobins.io/binaries/hdiutil/
    - https://www.sentinelone.com/blog/from-the-front-linesunsigned-macos-orat-malware-gambles-for-the-win/
    - https://ss64.com/mac/hdiutil.html
falsepositives:
    - Legitimate usage of hdiutil by administrators and users.
taxonomy: sigma
logsource:
    category: process_creation
    product: macos
detection:
    selection:
        Image|endswith: /hdiutil
        CommandLine|contains: create
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:13:10.911355+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-11-26T02:13:10.911355+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:13:10.911372+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:13:10.911375+00:00'
