title: Remote Access Tool - RURAT Execution From Unusual Location
id: e01fa958-6893-41d4-ae03-182477c5e77d
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects execution of Remote Utilities RAT (RURAT) from an unusual location
    (outside of 'C:\Program Files')
references:
    - https://redcanary.com/blog/misbehaving-rats/
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
date: '2022-09-19'
modified: '2023-03-05'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - \rutserv.exe
            - \rfusclient.exe
        Product: Remote Utilities
    filter:
        Image|startswith:
            - C:\Program Files\Remote Utilities
            - C:\Program Files (x86)\Remote Utilities
    condition: selection and not filter
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:45.434559+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:45.434559+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:44:45.434574+00:00'
        -   source_field: Product
            target_table: process_activity
            target_field: metadata.product.name
            mapped_at: '2025-12-04T01:44:45.434576+00:00'
