id: 07f8bdc2-c9b3-472a-9817-5a670b872f53
title: Potential Reconnaissance For Cached Credentials Via Cmdkey.EXE
status: test
level: high
description: Detects usage of cmdkey to look for cached credentials on the system
author: jmallette, Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron
    Systems)
date: '2019-01-16'
modified: '2024-03-05'
tags:
    - attack.credential-access
    - attack.t1003.005
references:
    - https://www.peew.pw/blog/2017/11/26/exploring-cmdkey-an-edge-case-for-privilege-escalation
    - https://technet.microsoft.com/en-us/library/cc754243(v=ws.11).aspx
    - https://github.com/redcanaryco/atomic-red-team/blob/b27a3cb25025161d49ac861cb216db68c46a3537/atomics/T1003.005/T1003.005.md#atomic-test-1---cached-credential-dump-via-cmdkey
fields:
    - CommandLine
    - ParentCommandLine
    - User
falsepositives:
    - Legitimate administrative tasks
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \cmdkey.exe
        OriginalFileName: cmdkey.exe
    selection_cli:
        CommandLine|contains|windash: ' -l'
    condition: all of selection*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:45.410832+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:45.410832+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:45.410844+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:45.410845+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:45.410847+00:00'
