id: 88a87a10-384b-4ad7-8871-2f9bf9259ce5
title: Suspicious Regsvr32 Execution From Remote Share
status: test
level: high
description: Detects REGSVR32.exe to execute DLL hosted on remote shares
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-10-31'
tags:
    - attack.defense-evasion
    - attack.t1218.010
references:
    - https://thedfirreport.com/2022/10/31/follina-exploit-leads-to-domain-compromise/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \regsvr32.exe
        OriginalFileName: \REGSVR32.EXE
    selection_cli:
        CommandLine|contains: ' \\'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:49.516738+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:49.516738+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:49.516746+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:49.516748+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:49.516749+00:00'
