title: Ie4uinit Lolbin Use From Invalid Path
id: d3bf399f-b0cf-4250-8bb4-dfc192ab81dc
status: test
level: medium
author: frack113
description: Detect use of ie4uinit.exe to execute commands from a specially prepared
    ie4uinit.inf file from a directory other than the usual directories
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Ie4uinit/
    - https://bohops.com/2018/03/10/leveraging-inf-sct-fetch-execute-techniques-for-bypass-evasion-persistence-part-2/
falsepositives:
    - ViberPC updater calls this binary with the following commandline "ie4uinit.exe
        -ClearIconCache"
tags:
    - attack.defense-evasion
    - attack.t1218
date: '2022-05-07'
modified: '2022-05-16'
logsource:
    category: process_creation
    product: windows
detection:
    lolbin:
        Image|endswith: \ie4uinit.exe
        OriginalFileName: IE4UINIT.EXE
    filter_correct:
        CurrentDirectory:
            - c:\windows\system32\
            - c:\windows\sysWOW64\
    filter_missing:
        CurrentDirectory: null
    condition: lolbin and not 1 of filter_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:47:59.498939+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:47:59.498939+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:47:59.498961+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:47:59.498963+00:00'
        -   source_field: CurrentDirectory
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:47:59.498964+00:00'
