title: Execute Pcwrun.EXE To Leverage Follina
id: 6004abd0-afa4-4557-ba90-49d172e0a299
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects indirect command execution via Program Compatibility Assistant
    "pcwrun.exe" leveraging the follina (CVE-2022-30190) vulnerability
references:
    - https://twitter.com/nas_bench/status/1535663791362519040
falsepositives:
    - Unlikely
tags:
    - attack.defense-evasion
    - attack.t1218
    - attack.execution
date: '2022-06-13'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \pcwrun.exe
        CommandLine|contains: ../
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:48:39.596009+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:48:39.596009+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:48:39.596022+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:48:39.596024+00:00'
