id: d78b5d61-187d-44b6-bf02-93486a80de5a
title: HackTool - DInjector PowerShell Cradle Execution
status: test
level: critical
description: Detects the use of the Dinject PowerShell cradle based on the specific
    flags
author: Florian Roth (Nextron Systems)
date: '2021-12-07'
modified: '2023-02-04'
tags:
    - attack.defense-evasion
    - attack.t1055
references:
    - https://web.archive.org/web/20211001064856/https://github.com/snovvcrash/DInjector
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - ' /am51'
            - ' /password'
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:34:47.462638+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:34:47.462638+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:34:47.462661+00:00'
