title: System Information Discovery Using Ioreg
id: 2d5e7a8b-f484-4a24-945d-7f0efd52eab0
status: test
level: medium
author: Joseliyo Sanchez, @Joseliyo_Jstnk
description: 'Detects the use of "ioreg" which will show I/O Kit registry information.

    This process is used for system information discovery.

    It has been observed in-the-wild by calling this process directly or using bash
    and grep to look for specific strings.

    '
references:
    - https://www.virustotal.com/gui/file/0373d78db6c3c0f6f6dcc409821bf89e1ad8c165d6f95c5c80ecdce2219627d7/behavior
    - https://www.virustotal.com/gui/file/4ffdc72d1ff1ee8228e31691020fc275afd1baee5a985403a71ca8c7bd36e2e4/behavior
    - https://www.virustotal.com/gui/file/5907d59ec1303cfb5c0a0f4aaca3efc0830707d86c732ba6b9e842b5730b95dc/behavior
    - https://www.trendmicro.com/en_ph/research/20/k/new-macos-backdoor-connected-to-oceanlotus-surfaces.html
falsepositives:
    - Legitimate administrative activities
tags:
    - attack.discovery
    - attack.t1082
date: '2023-12-20'
modified: '2024-01-02'
logsource:
    category: process_creation
    product: macos
detection:
    selection_img:
        Image|endswith: /ioreg
        CommandLine|contains: ioreg
    selection_cmd1:
        CommandLine|contains:
            - -l
            - -c
    selection_cmd2:
        CommandLine|contains:
            - AppleAHCIDiskDriver
            - IOPlatformExpertDevice
            - Oracle
            - Parallels
            - USB Vendor Name
            - VirtualBox
            - VMware
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:34:06.969343+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-12-04T01:34:06.969343+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:34:06.969361+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:34:06.969362+00:00'
