id: 24c77512-782b-448a-8950-eddb0785fc71
title: SQLite Chromium Profile Data DB Access
status: test
level: high
description: Detect usage of the "sqlite" binary to query databases in Chromium-based
    browsers for potential data stealing.
author: TropChaud
date: '2022-12-19'
modified: '2023-01-19'
tags:
    - attack.credential-access
    - attack.t1539
    - attack.t1555.003
    - attack.collection
    - attack.t1005
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/84d9edaaaa2c5511144521b0e4af726d1c7276ce/atomics/T1539/T1539.md#atomic-test-2---steal-chrome-cookies-windows
    - https://blog.cyble.com/2022/04/21/prynt-stealer-a-new-info-stealer-performing-clipper-and-keylogger-activities/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_sql:
        Product: SQLite
        Image|endswith:
            - \sqlite.exe
            - \sqlite3.exe
    selection_chromium:
        CommandLine|contains:
            - \User Data\
            - \Opera Software\
            - \ChromiumViewer\
    selection_data:
        CommandLine|contains:
            - Login Data
            - Cookies
            - Web Data
            - History
            - Bookmarks
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:47.768838+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:47.768838+00:00'
    detection_fields:
        -   source_field: Product
            target_table: process_activity
            target_field: metadata.product.name
            mapped_at: '2025-11-13T20:20:47.768845+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:47.768847+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:47.768848+00:00'
