title: Suspicious Processes Spawned by WinRM
id: 5cc2cda8-f261-4d88-a2de-e9e193c86716
status: test
level: high
author: Andreas Hunkeler (@Karneades), Markus Neis
description: Detects suspicious processes including shells spawnd from WinRM host
    process
references:
    - Internal Research
falsepositives:
    - Legitimate WinRM usage
tags:
    - attack.t1190
    - attack.initial-access
    - attack.persistence
    - attack.privilege-escalation
date: '2021-05-20'
modified: '2022-07-14'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \wsmprovhost.exe
        Image|endswith:
            - \cmd.exe
            - \sh.exe
            - \bash.exe
            - \powershell.exe
            - \pwsh.exe
            - \wsl.exe
            - \schtasks.exe
            - \certutil.exe
            - \whoami.exe
            - \bitsadmin.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:49:03.397057+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:49:03.397057+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:49:03.397071+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:49:03.397073+00:00'
