title: Shell Execution via Flock - Linux
id: 4b09c71e-4269-4111-9cdd-107d8867f0cc
status: experimental
level: high
author: Li Ling, Andy Parkidomo, Robert Rakowski, Blake Hartstein (Bloomberg L.P.)
description: 'Detects the use of the "flock" command to execute a shell. Such behavior
    may be associated with privilege escalation, unauthorized command execution, or
    to break out from restricted environments.

    '
references:
    - https://gtfobins.github.io/gtfobins/flock/#shell
    - https://www.elastic.co/guide/en/security/current/linux-restricted-shell-breakout-via-linux-binary-s.html
falsepositives:
    - Unknown
tags:
    - attack.discovery
    - attack.t1083
date: '2024-09-02'
logsource:
    category: process_creation
    product: linux
detection:
    selection_img:
        Image|endswith: /flock
        CommandLine|contains: ' -u '
    selection_cli:
        CommandLine|contains:
            - /bin/bash
            - /bin/dash
            - /bin/fish
            - /bin/sh
            - /bin/zsh
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:50.362506+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:50.362506+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:36:50.362560+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:36:50.362565+00:00'
