title: Suspicious Scheduled Task Creation Involving Temp Folder
id: 39019a4e-317f-4ce3-ae63-309a8c6b53c5
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects the creation of scheduled tasks that involves a temporary folder
    and runs only once
references:
    - https://discuss.elastic.co/t/detection-and-response-for-hafnium-activity/266289/3
falsepositives:
    - Administrative activity
    - Software installation
tags:
    - attack.execution
    - attack.persistence
    - attack.t1053.005
date: '2021-03-11'
modified: '2022-10-09'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \schtasks.exe
        CommandLine|contains|all:
            - ' /create '
            - ' /sc once '
            - \Temp\
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:42:34.929293+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:42:34.929293+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:42:34.929307+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:42:34.929309+00:00'
