title: Suspicious Diantz Alternate Data Stream Execution
id: 6b369ced-4b1d-48f1-b427-fdc0de0790bd
status: test
level: medium
author: frack113
description: Compress target file into a cab file stored in the Alternate Data Stream
    (ADS) of the target file.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Diantz/
falsepositives:
    - Very Possible
tags:
    - attack.defense-evasion
    - attack.t1564.004
date: '2021-11-26'
modified: '2022-12-31'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - diantz.exe
            - .cab
        CommandLine|re: :[^\\]
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:43:56.497550+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:43:56.497550+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:43:56.497561+00:00'
