id: e2e80da2-8c66-4e00-ae3c-2eebd29f6b6d
title: Compress Data and Lock With Password for Exfiltration With WINZIP
status: test
level: medium
description: An adversary may compress or encrypt data that is collected prior to
    exfiltration using 3rd party utilities
author: frack113
date: '2021-07-27'
modified: '2022-12-25'
tags:
    - attack.collection
    - attack.t1560.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_winzip:
        CommandLine|contains:
            - winzip.exe
            - winzip64.exe
    selection_password:
        CommandLine|contains: -s"
    selection_other:
        CommandLine|contains:
            - ' -min '
            - ' -a '
    condition: all of selection*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:19:54.589504+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:19:54.589504+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:19:54.589518+00:00'
