id: 88c0f9d8-30a8-4120-bb6b-ebb54abcf2a0
title: File Time Attribute Change
status: test
level: medium
description: Detect file time attribute change to hide new or changes to existing
    files
author: Igor Fits, Mikhail Larin, oscd.community
date: '2020-10-19'
modified: '2022-01-12'
tags:
    - attack.defense-evasion
    - attack.t1070.006
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.006/T1070.006.md
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: macos
detection:
    selection:
        Image|endswith: /touch
        CommandLine|contains:
            - -t
            - -acmr
            - -d
            - -r
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:13:08.649570+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-11-26T02:13:08.649570+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:13:08.649590+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:13:08.649593+00:00'
