id: 04936b66-3915-43ad-a8e5-809eadfd1141
title: Insensitive Subfolder Search Via Findstr.EXE
status: test
level: low
description: 'Detects execution of findstr with the "s" and "i" flags for a "subfolder"
    and "insensitive" search respectively. Attackers sometimes leverage this built-in
    utility to search the system for interesting files or filter through results of
    commands.

    '
author: Furkan CALISKAN, @caliskanfurkan_, @oscd_initiative, Nasreddine Bencherchali
    (Nextron Systems)
date: '2020-10-05'
modified: '2024-03-05'
tags:
    - attack.defense-evasion
    - attack.t1218
    - attack.t1564.004
    - attack.t1552.001
    - attack.t1105
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Findstr/
    - https://oddvar.moe/2018/04/11/putting-data-in-alternate-data-streams-and-how-to-execute-it-part-2/
    - https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
falsepositives:
    - Administrative or software activity
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''bf6c39fc-e203-45b9-9538-05397c1b4f3f''),
    type=<SigmaRelatedType.OBSOLETE: 4>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_findstr:
        CommandLine|contains: findstr
        Image|endswith: findstr.exe
        OriginalFileName: FINDSTR.EXE
    selection_cli_search_subfolder:
        CommandLine|contains|windash: ' -s '
    selection_cli_search_insensitive:
        CommandLine|contains|windash: ' -i '
    condition: selection_findstr and all of selection_cli_search_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:57.124095+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:57.124095+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:57.124099+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:57.124100+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:57.124101+00:00'
