title: Bad Opsec Defaults Sacrificial Processes With Improper Arguments
id: a7c3d773-caef-227e-a7e7-c2f13c622329
status: experimental
level: high
author: Oleg Kolesnikov @securonix invrep_de, oscd.community, Florian Roth (Nextron
    Systems), Christian Burkard (Nextron Systems)
description: 'Detects attackers using tooling with bad opsec defaults.

    E.g. spawning a sacrificial process to inject a capability into the process without
    taking into account how the process is normally run.

    One trivial example of this is using rundll32.exe without arguments as a sacrificial
    process (default in CS, now highlighted by c2lint), running WerFault without arguments
    (Kraken - credit am0nsec), and other examples.

    '
references:
    - https://blog.malwarebytes.com/malwarebytes-news/2020/10/kraken-attack-abuses-wer-service/
    - https://www.cobaltstrike.com/help-opsec
    - https://twitter.com/CyberRaiju/status/1251492025678983169
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/regsvr32
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/rundll32
    - https://learn.microsoft.com/en-us/dotnet/framework/tools/regasm-exe-assembly-registration-tool
    - https://learn.microsoft.com/en-us/dotnet/framework/tools/regsvcs-exe-net-services-installation-tool
falsepositives:
    - Unlikely
tags:
    - attack.defense-evasion
    - attack.t1218.011
date: '2020-10-23'
modified: '2024-08-15'
logsource:
    category: process_creation
    product: windows
detection:
    selection_werfault:
        Image|endswith: \WerFault.exe
        CommandLine|endswith: WerFault.exe
    selection_rundll32:
        Image|endswith: \rundll32.exe
        CommandLine|endswith: rundll32.exe
    selection_regsvcs:
        Image|endswith: \regsvcs.exe
        CommandLine|endswith: regsvcs.exe
    selection_regasm:
        Image|endswith: \regasm.exe
        CommandLine|endswith: regasm.exe
    selection_regsvr32:
        Image|endswith: \regsvr32.exe
        CommandLine|endswith: regsvr32.exe
    filter_optional_edge_update:
        ParentImage|contains: \AppData\Local\Microsoft\EdgeUpdate\Install\{
        Image|endswith: \rundll32.exe
        CommandLine|endswith: rundll32.exe
    filter_optional_chromium_installer:
        ParentImage|contains:
            - \AppData\Local\BraveSoftware\Brave-Browser\Application\
            - \AppData\Local\Google\Chrome\Application\
        ParentImage|endswith: \Installer\setup.exe
        ParentCommandLine|contains: '--uninstall '
        Image|endswith: \rundll32.exe
        CommandLine|endswith: rundll32.exe
    condition: 1 of selection_* and not 1 of filter_optional_*
related:
    -   id: f5647edc-a7bf-4737-ab50-ef8c60dc3add
        type: obsolete
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:48:10.834272+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:48:10.834272+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:48:10.834290+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:48:10.834292+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:48:10.834293+00:00'
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-12-04T01:48:10.834295+00:00'
