id: 51cbac1e-eee3-4a90-b1b7-358efb81fa0a
title: Potential Windows Defender Tampering Via Wmic.EXE
status: test
level: high
description: Detects potential tampering with Windows Defender settings such as adding
    exclusion using wmic
author: frack113
date: '2022-12-11'
modified: '2023-02-14'
tags:
    - attack.credential-access
    - attack.t1546.008
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/5c1e6f1b4fafd01c8d1ece85f510160fc1275fbf/atomics/T1562.001/T1562.001.md
    - https://www.bleepingcomputer.com/news/security/gootkit-malware-bypasses-windows-defender-by-setting-path-exclusions/
    - https://www.bleepingcomputer.com/news/security/iobit-forums-hacked-to-spread-ransomware-to-its-members/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        OriginalFileName: wmic.exe
        Image|endswith: \WMIC.exe
    selection_cli:
        CommandLine|contains: /Namespace:\\root\Microsoft\Windows\Defender
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:25:10.486860+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:25:10.486860+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:25:10.486886+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:25:10.486889+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:25:10.486891+00:00'
