title: Sysinternals PsService Execution
id: 3371f518-5fe3-4cf6-a14b-2a0ae3fd8a4f
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects usage of Sysinternals PsService which can be abused for service
    reconnaissance and tampering
references:
    - https://learn.microsoft.com/en-us/sysinternals/downloads/psservice
falsepositives:
    - Legitimate use of PsService by an administrator
tags:
    - attack.discovery
    - attack.persistence
    - attack.t1543.003
date: '2022-06-16'
modified: '2023-02-24'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        OriginalFileName: psservice.exe
        Image|endswith:
            - \PsService.exe
            - \PsService64.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:42:51.947225+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:42:51.947225+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:42:51.947237+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:42:51.947239+00:00'
