id: 502b42de-4306-40b4-9596-6f590c81f073
title: Local Accounts Discovery
status: test
level: low
description: Local accounts, System Owner/User discovery using operating systems utilities
author: Timur Zinniatullin, Daniil Yugoslavskiy, oscd.community
date: '2019-10-21'
modified: '2023-01-03'
tags:
    - attack.discovery
    - attack.t1033
    - attack.t1087.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1033/T1033.md
falsepositives:
    - Legitimate administrator or user enumerates local users for legitimate reason
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_other_img:
        Image|endswith:
            - \whoami.exe
            - \quser.exe
            - \qwinsta.exe
    selection_other_wmi:
        Image|endswith: \wmic.exe
        CommandLine|contains|all:
            - useraccount
            - get
    selection_other_cmdkey:
        Image|endswith: \cmdkey.exe
        CommandLine|contains: ' /l'
    selection_cmd:
        Image|endswith: \cmd.exe
        CommandLine|contains|all:
            - ' /c'
            - 'dir '
            - \Users\
    filter_cmd:
        CommandLine|contains: ' rmdir '
    selection_net:
        Image|endswith:
            - \net.exe
            - \net1.exe
        CommandLine|contains: user
    filter_net:
        CommandLine|contains:
            - /domain
            - /add
            - /delete
            - /active
            - /expires
            - /passwordreq
            - /scriptpath
            - /times
            - /workstations
    condition: (selection_cmd and not filter_cmd) or (selection_net and not filter_net)
        or 1 of selection_other_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:27:55.165300+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:27:55.165300+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:27:55.165326+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:27:55.165330+00:00'
