title: Potential Amazon SSM Agent Hijacking
id: d20ee2f4-822c-4827-9e15-41500b1fff10
status: test
level: medium
author: Muhammad Faisal
description: Detects potential Amazon SSM agent hijack attempts as outlined in the
    Mitiga research report.
references:
    - https://www.mitiga.io/blog/mitiga-security-advisory-abusing-the-ssm-agent-as-a-remote-access-trojan
    - https://www.bleepingcomputer.com/news/security/amazons-aws-ssm-agent-can-be-used-as-post-exploitation-rat-malware/
    - https://www.helpnetsecurity.com/2023/08/02/aws-instances-attackers-access/
falsepositives:
    - Legitimate activity of system administrators
tags:
    - attack.command-and-control
    - attack.persistence
    - attack.t1219
date: '2023-08-02'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \amazon-ssm-agent.exe
        CommandLine|contains|all:
            - '-register '
            - '-code '
            - '-id '
            - '-region '
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:47:32.975760+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:47:32.975760+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:47:32.975783+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:47:32.975788+00:00'
