id: 03552375-cc2c-4883-bbe4-7958d5a980be
title: HackTool - SILENTTRINITY Stager Execution
status: test
level: high
description: Detects SILENTTRINITY stager use via PE metadata
author: Aleksey Potapov, oscd.community
date: '2019-10-22'
modified: '2023-02-13'
tags:
    - attack.command-and-control
    - attack.t1071
references:
    - https://github.com/byt3bl33d3r/SILENTTRINITY
falsepositives:
    - Unlikely
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''75c505b1-711d-4f68-a357-8c3fe37dbf2d''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Description|contains: st2stager
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Description
            target_table: null
            target_field: null
            mapped_at: null
