title: Connection Proxy
id: 72f4ab3f-787d-495d-a55d-68c2ff46cf4c
status: test
level: low
author: Ömer Günal
description: Detects setting proxy configuration
references:
    - https://attack.mitre.org/techniques/T1090/
falsepositives:
    - Legitimate administration activities
tags:
    - attack.defense-evasion
    - attack.t1090
date: '2020-06-17'
modified: '2022-10-05'
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        CommandLine|contains:
            - http_proxy=
            - https_proxy=
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:44.043253+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:44.043253+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:36:44.043277+00:00'
