title: AspNetCompiler Execution
id: a01b8329-5953-4f73-ae2d-aa01e1f35f00
status: test
level: medium
author: frack113
description: Detects execution of "aspnet_compiler.exe" which can be abused to compile
    and execute C# code.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Aspnet_Compiler/
    - https://ijustwannared.team/2020/08/01/the-curious-case-of-aspnet_compiler-exe/
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1127
date: '2021-11-24'
modified: '2023-08-14'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|contains:
            - C:\Windows\Microsoft.NET\Framework\
            - C:\Windows\Microsoft.NET\Framework64\
        Image|endswith: \aspnet_compiler.exe
    condition: selection
related:
    -   id: 9ccba514-7cb6-4c5c-b377-700758f2f120
        type: similar
    -   id: 4c7f49ee-2638-43bb-b85b-ce676c30b260
        type: similar
    -   id: 9f50fe98-fe5c-4a2d-86c7-fad7f63ed622
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:48:58.080000+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:48:58.080000+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:48:58.080015+00:00'
