title: File Encryption/Decryption Via Gpg4win From Suspicious Locations
id: e1e0b7d7-e10b-4ee4-ac49-a4bda05d320d
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems), X__Junior (Nextron Systems)
description: Detects usage of Gpg4win to encrypt/decrypt files located in potentially
    suspicious locations.
references:
    - https://blogs.vmware.com/security/2022/11/batloader-the-evasive-downloader-malware.html
    - https://news.sophos.com/en-us/2022/01/19/zloader-installs-remote-access-backdoors-and-delivers-cobalt-strike/
falsepositives:
    - Unknown
tags:
    - attack.execution
date: '2022-11-30'
modified: '2023-08-09'
logsource:
    category: process_creation
    product: windows
detection:
    selection_metadata:
        Image|endswith:
            - \gpg.exe
            - \gpg2.exe
        Product: GNU Privacy Guard (GnuPG)
        Description: GnuPG’s OpenPGP tool
    selection_cli:
        CommandLine|contains: -passphrase
    selection_paths:
        CommandLine|contains:
            - :\PerfLogs\
            - :\Temp\
            - :\Users\Public\
            - :\Windows\Temp\
            - \AppData\Local\Temp\
            - \AppData\Roaming\
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:43:20.390292+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:43:20.390292+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:43:20.390307+00:00'
        -   source_field: Product
            target_table: process_activity
            target_field: metadata.product.name
            mapped_at: '2025-12-04T01:43:20.390309+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: device.desc
            mapped_at: '2025-12-04T01:43:20.390310+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:43:20.390312+00:00'
