title: Assembly Loading Via CL_LoadAssembly.ps1
id: c57872c7-614f-4d7f-a40d-b78c8df2d30d
status: test
level: medium
author: frack113, Nasreddine Bencherchali (Nextron Systems)
description: Detects calls to "LoadAssemblyFromPath" or "LoadAssemblyFromNS" that
    are part of the "CL_LoadAssembly.ps1" script. This can be abused to load different
    assemblies and bypass App locker controls.
references:
    - https://bohops.com/2018/01/07/executing-commands-and-bypassing-applocker-with-powershell-diagnostic-scripts/
    - https://lolbas-project.github.io/lolbas/Scripts/CL_LoadAssembly/
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1216
date: '2022-05-21'
modified: '2023-08-17'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - 'LoadAssemblyFromPath '
            - 'LoadAssemblyFromNS '
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:09.546154+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:09.546154+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:44:09.546167+00:00'
