title: Remote Access Tool - AnyDesk Piped Password Via CLI
id: b1377339-fda6-477a-b455-ac0923f9ec2c
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects piping the password to an anydesk instance via CMD and the '--set-password'
    flag.
references:
    - https://redcanary.com/blog/misbehaving-rats/
falsepositives:
    - Legitimate piping of the password to anydesk
    - Some FP could occur with similar tools that uses the same command line '--set-password'
tags:
    - attack.command-and-control
    - attack.t1219
date: '2022-09-28'
modified: '2023-03-05'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - '/c '
            - 'echo '
            - .exe --set-password
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:48:47.248354+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:48:47.248354+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:48:47.248375+00:00'
