id: 0a13e132-651d-11eb-ae93-0242ac130002
title: Audit Policy Tampering Via Auditpol
status: test
level: high
description: 'Threat actors can use auditpol binary to change audit policy configuration
    to impair detection capability.

    This can be carried out by selectively disabling/removing certain audit policies
    as well as restoring a custom policy owned by the threat actor.

    '
author: Janantha Marasinghe (https://github.com/blueteam0ps)
date: '2021-02-02'
modified: '2023-02-22'
tags:
    - attack.defense-evasion
    - attack.t1562.002
references:
    - https://www.microsoft.com/security/blog/2021/01/20/deep-dive-into-the-solorigate-second-stage-activation-from-sunburst-to-teardrop-and-raindrop/
falsepositives:
    - Administrator or administrator scripts might leverage the flags mentioned in
        the detection section. Either way, it should always be monitored
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''c6c56ada-612b-42d1-9a29-adad3c5c2c1e''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \auditpol.exe
        OriginalFileName: AUDITPOL.EXE
    selection_cli:
        CommandLine|contains:
            - disable
            - clear
            - remove
            - restore
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:14.430653+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:14.430653+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:14.430668+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:14.430671+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:14.430673+00:00'
