title: HackTool - SafetyKatz Execution
id: b1876533-4ed5-4a83-90f3-b8645840a413
status: test
level: critical
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects the execution of the hacktool SafetyKatz via PE information and
    default Image name
references:
    - https://github.com/GhostPack/SafetyKatz
falsepositives:
    - Unlikely
tags:
    - attack.credential-access
    - attack.t1003.001
date: '2022-10-20'
modified: '2023-02-04'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \SafetyKatz.exe
        OriginalFileName: SafetyKatz.exe
        Description: SafetyKatz
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:41:42.005514+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:41:42.005514+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:41:42.005529+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:41:42.005531+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: device.desc
            mapped_at: '2025-12-04T01:41:42.005532+00:00'
