title: HackTool - SharpMove Tool Execution
id: 055fb54c-a8f4-4aee-bd44-f74cf30a0d9d
status: test
level: high
author: Luca Di Bartolomeo (CrimpSec)
description: 'Detects the execution of SharpMove, a .NET utility performing multiple
    tasks such as "Task Creation", "SCM" query, VBScript execution using WMI via its
    PE metadata and command line options.

    '
references:
    - https://github.com/0xthirteen/SharpMove/
    - https://pentestlab.blog/tag/sharpmove/
falsepositives:
    - Unknown
tags:
    - attack.lateral-movement
    - attack.t1021.002
date: '2024-01-29'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \SharpMove.exe
        OriginalFileName: SharpMove.exe
    selection_cli_computer:
        CommandLine|contains: computername=
    selection_cli_actions:
        CommandLine|contains:
            - action=create
            - action=dcom
            - action=executevbs
            - action=hijackdcom
            - action=modschtask
            - action=modsvc
            - action=query
            - action=scm
            - action=startservice
            - action=taskscheduler
    condition: selection_img or all of selection_cli_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:42:40.786787+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:42:40.786787+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:42:40.786811+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:42:40.786814+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:42:40.786815+00:00'
