id: 236d8e89-ed95-4789-a982-36f4643738ba
title: Suspicious Persistence Via VMwareToolBoxCmd.EXE VM State Change Script
status: test
level: high
description: Detects execution of the "VMwareToolBoxCmd.exe" with the "script" and
    "set" flag to setup a specific script that's located in a potentially suspicious
    location to run for a specific VM state
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-06-14'
tags:
    - attack.execution
    - attack.persistence
    - attack.t1059
references:
    - https://bohops.com/2021/10/08/analyzing-and-detecting-a-vmtools-persistence-technique/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''7aa4e81a-a65c-4e10-9f81-b200eb229d7d''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_bin_img:
        Image|endswith: \VMwareToolBoxCmd.exe
        OriginalFileName: toolbox-cmd.exe
    selection_bin_cli:
        CommandLine|contains|all:
            - ' script '
            - ' set '
    selection_susp_paths:
        CommandLine|contains:
            - :\PerfLogs\
            - :\Temp\
            - :\Windows\System32\Tasks\
            - :\Windows\Tasks\
            - :\Windows\Temp\
            - \AppData\Local\Temp
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:47.781405+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:47.781405+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:47.781413+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:47.781415+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:47.781416+00:00'
