id: bd8b828d-0dca-48e1-8a63-8a58ecf2644f
title: Group Membership Reconnaissance Via Whoami.EXE
status: test
level: medium
description: Detects the execution of whoami.exe with the /group command line flag
    to show group membership for the current user, account type, security identifiers
    (SID), and attributes.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-02-28'
tags:
    - attack.discovery
    - attack.t1033
references:
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/whoami
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \whoami.exe
        OriginalFileName: whoami.exe
    selection_cli:
        CommandLine|contains:
            - ' /groups'
            - ' -groups'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:35.491872+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:35.491872+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:35.491888+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:35.491891+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:35.491893+00:00'
