id: 78a80655-a51e-4669-bc6b-e9d206a462ee
title: Install Root Certificate
status: test
level: low
description: Detects installation of new certificate on the system which attackers
    may use to avoid warnings when connecting to controlled web servers or C2s
author: Ömer Günal, oscd.community
date: '2020-10-05'
modified: '2022-07-07'
tags:
    - attack.defense-evasion
    - attack.t1553.004
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1553.004/T1553.004.md
falsepositives:
    - Legitimate administration activities
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith:
            - /update-ca-certificates
            - /update-ca-trust
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:15:51.697092+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-13T20:15:51.697092+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:15:51.697101+00:00'
