title: REGISTER_APP.VBS Proxy Execution
id: 1c8774a0-44d4-4db0-91f8-e792359c70bd
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects the use of a Microsoft signed script 'REGISTER_APP.VBS' to register
    a VSS/VDS Provider as a COM+ application.
references:
    - https://twitter.com/sblmsrsn/status/1456613494783160325?s=20
falsepositives:
    - Legitimate usage of the script. Always investigate what's being registered to
        confirm if it's benign
tags:
    - attack.defense-evasion
    - attack.t1218
date: '2022-08-19'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - \register_app.vbs
            - -register
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:47:59.093859+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:47:59.093859+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:47:59.093874+00:00'
