id: ae9d710f-dcd1-4f75-a0a5-93a73b5dda0e
title: Launch Agent/Daemon Execution Via Launchctl
status: experimental
level: medium
description: Detects the execution of programs as Launch Agents or Launch Daemons
    using launchctl on macOS.
author: Pratinav Chandra
date: '2024-05-13'
tags:
    - attack.execution
    - attack.persistence
    - attack.t1569.001
    - attack.t1543.001
    - attack.t1543.004
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1569.001/T1569.001.md
    - https://www.sentinelone.com/labs/20-common-tools-techniques-used-by-macos-threat-actors-malware/
    - https://www.welivesecurity.com/2020/07/16/mac-cryptocurrency-trading-application-rebranded-bundled-malware/
    - https://www.trendmicro.com/en_us/research/18/d/new-macos-backdoor-linked-to-oceanlotus-found.html
    - https://www.loobins.io/binaries/launchctl/
falsepositives:
    - Legitimate administration activities is expected to trigger false positives.
        Investigate the command line being passed to determine if the service or launch
        agent are suspicious.
taxonomy: sigma
logsource:
    category: process_creation
    product: macos
detection:
    selection:
        Image|endswith: /launchctl
        CommandLine|contains:
            - submit
            - load
            - start
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:13:07.017954+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-11-26T02:13:07.017954+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:13:07.017990+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:13:07.017994+00:00'
