id: 19b08b1c-861d-4e75-a1ef-ea0c1baf202b
title: Suspicious Download Via Certutil.EXE
status: test
level: medium
description: Detects the execution of certutil with certain flags that allow the utility
    to download files.
author: Florian Roth (Nextron Systems), Jonhnathan Ribeiro, oscd.community, Nasreddine
    Bencherchali (Nextron Systems)
date: '2023-02-15'
tags:
    - attack.defense-evasion
    - attack.t1027
references:
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/certutil
    - https://forensicitguy.github.io/agenttesla-vba-certutil-download/
    - https://news.sophos.com/en-us/2021/04/13/compromised-exchange-server-hosting-cryptojacker-targeting-other-exchange-servers/
    - https://twitter.com/egre55/status/1087685529016193025
    - https://lolbas-project.github.io/lolbas/Binaries/Certutil/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''13e6fe51-d478-4c7e-b0f2-6da9b400a829''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \certutil.exe
        OriginalFileName: CertUtil.exe
    selection_flags:
        CommandLine|contains:
            - 'urlcache '
            - 'verifyctl '
    selection_http:
        CommandLine|contains: http
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:22.282154+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:22.282154+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:22.282164+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:22.282166+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:22.282168+00:00'
