id: 7679d464-4f74-45e2-9e01-ac66c5eb041a
title: HackTool - SecurityXploded Execution
status: stable
level: critical
description: Detects the execution of SecurityXploded Tools
author: Florian Roth (Nextron Systems)
date: '2018-12-19'
modified: '2023-02-04'
tags:
    - attack.credential-access
    - attack.t1555
references:
    - https://securityxploded.com/
    - https://web.archive.org/web/20200601000524/https://cyberx-labs.com/blog/gangnam-industrial-style-apt-campaign-targets-korean-industrial-companies/
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Company: SecurityXploded
        Image|endswith: PasswordDump.exe
        OriginalFileName|endswith: PasswordDump.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:36:34.260155+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:36:34.260155+00:00'
    detection_fields:
        -   source_field: Company
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:36:34.260172+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:36:34.260175+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:36:34.260177+00:00'
