id: 49f2f17b-b4c8-4172-a68b-d5bf95d05130
title: UAC Bypass via ICMLuaUtil
status: test
level: high
description: Detects the pattern of UAC Bypass using ICMLuaUtil Elevated COM interface
author: Florian Roth (Nextron Systems), Elastic (idea)
date: '2022-09-13'
modified: '2022-09-27'
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
references:
    - https://www.elastic.co/guide/en/security/current/uac-bypass-via-icmluautil-elevated-com-interface.html
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \dllhost.exe
        ParentCommandLine|contains:
            - /Processid:{3E5FC7F9-9A51-4367-9063-A120244FBEC7}
            - /Processid:{D2E7041B-2927-42FB-8E9F-7CE93B6DC937}
    filter:
        Image|endswith: \WerFault.exe
        OriginalFileName: WerFault.exe
    condition: selection and not filter
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:38.015251+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:38.015251+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:38.015258+00:00'
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-11-13T20:20:38.015260+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:38.015261+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:38.015262+00:00'
