id: c73124a7-3e89-44a3-bdc1-25fe4df754b1
title: Copy From VolumeShadowCopy Via Cmd.EXE
status: test
level: high
description: Detects the execution of the builtin "copy" command that targets a shadow
    copy (sometimes used to copy registry hives that are in use)
author: Max Altgelt (Nextron Systems), Tobias Michalski (Nextron Systems)
date: '2021-08-09'
modified: '2023-03-07'
tags:
    - attack.impact
    - attack.t1490
references:
    - https://twitter.com/vxunderground/status/1423336151860002816?s=20
    - https://www.virustotal.com/gui/file/03e9b8c2e86d6db450e5eceec057d7e369ee2389b9daecaf06331a95410aa5f8/detection
    - https://pentestlab.blog/2018/07/04/dumping-domain-password-hashes/
falsepositives:
    - Backup scenarios using the commandline
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - 'copy '
            - \\\?\GLOBALROOT\Device\HarddiskVolumeShadowCopy
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:30:19.667309+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:30:19.667309+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:30:19.667329+00:00'
