id: 7530cd3d-7671-43e3-b209-976966f6ea48
title: Renamed CURL.EXE Execution
status: test
level: medium
description: Detects the execution of a renamed "CURL.exe" binary based on the PE
    metadata fields
author: X__Junior (Nextron Systems)
date: '2023-09-11'
modified: '2023-10-12'
tags:
    - attack.execution
    - attack.t1059
    - attack.defense-evasion
    - attack.t1202
references:
    - https://twitter.com/Kostastsale/status/1700965142828290260
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        OriginalFileName: curl.exe
        Description: The curl executable
    filter_main_img:
        Image|contains: \curl
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:37:16.023255+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:37:16.023255+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:37:16.023289+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: device.desc
            mapped_at: '2025-11-26T02:37:16.023293+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:37:16.023296+00:00'
