title: Use of W32tm as Timer
id: 6da2c9f5-7c53-401b-aacb-92c040ce1215
status: test
level: high
author: frack113
description: When configured with suitable command line arguments, w32tm can act as
    a delay mechanism
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/d0dad62dbcae9c60c519368e82c196a3db577055/atomics/T1124/T1124.md
    - https://blogs.blackberry.com/en/2022/05/dirty-deeds-done-dirt-cheap-russian-rat-offers-backdoor-bargains
falsepositives:
    - Legitimate use
tags:
    - attack.discovery
    - attack.t1124
date: '2022-09-25'
logsource:
    category: process_creation
    product: windows
detection:
    selection_w32tm:
        Image|endswith: \w32tm.exe
        OriginalFileName: w32time.dll
    selection_cmd:
        CommandLine|contains|all:
            - /stripchart
            - '/computer:'
            - '/period:'
            - /dataonly
            - '/samples:'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:50:00.815857+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:50:00.815857+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:50:00.815905+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:50:00.815923+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:50:00.815926+00:00'
