id: ca2092a1-c273-4878-9b4b-0d60115bf5ea
title: Suspicious Encoded PowerShell Command Line
status: test
level: high
description: Detects suspicious powershell process starts with base64 encoded commands
    (e.g. Emotet)
author: Florian Roth (Nextron Systems), Markus Neis, Jonhnathan Ribeiro, Daniil Yugoslavskiy,
    Anton Kutepov, oscd.community
date: '2018-09-03'
modified: '2023-04-06'
tags:
    - attack.execution
    - attack.t1059.001
references:
    - https://app.any.run/tasks/6217d77d-3189-4db2-a957-8ab239f3e01e
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
        OriginalFileName:
            - PowerShell.EXE
            - pwsh.dll
    selection_cli_enc:
        CommandLine|contains: ' -e'
    selection_cli_content:
        CommandLine|contains:
            - ' JAB'
            - ' SUVYI'
            - ' SQBFAFgA'
            - ' aQBlAHgA'
            - ' aWV4I'
            - ' IAA'
            - ' IAB'
            - ' UwB'
            - ' cwB'
    selection_standalone:
        CommandLine|contains:
            - '.exe -ENCOD '
            - ' BA^J e-'
    filter_optional_remote_signed:
        CommandLine|contains: ' -ExecutionPolicy remotesigned '
    condition: selection_img and (all of selection_cli_* or selection_standalone)
        and not 1 of filter_optional_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:30:46.406754+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:30:46.406754+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:30:46.406767+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:30:46.406770+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:30:46.406772+00:00'
