title: Non-privileged Usage of Reg or Powershell
id: 8f02c935-effe-45b3-8fc9-ef8696a9e41d
status: test
level: high
author: Teymur Kheirkhabarov (idea), Ryan Plas (rule), oscd.community
description: Search for usage of reg or Powershell by non-privileged users to modify
    service configuration in registry
references:
    - https://image.slidesharecdn.com/kheirkhabarovoffzonefinal-181117201458/95/hunting-for-privilege-escalation-in-windows-environment-20-638.jpg
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1112
date: '2020-10-05'
modified: '2024-12-01'
logsource:
    category: process_creation
    product: windows
detection:
    selection_cli:
        CommandLine|contains|all:
            - 'reg '
            - add
        CommandLine|contains:
            - powershell
            - set-itemproperty
            - ' sp '
            - new-itemproperty
    selection_data:
        IntegrityLevel:
            - Medium
            - S-1-16-8192
        CommandLine|contains|all:
            - ControlSet
            - Services
        CommandLine|contains:
            - ImagePath
            - FailureCommand
            - ServiceDLL
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:49:03.741853+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:49:03.741853+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:49:03.741867+00:00'
        -   source_field: IntegrityLevel
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:49:03.741869+00:00'
