title: Permission Check Via Accesschk.EXE
id: c625d754-6a3d-4f65-9c9a-536aea960d37
status: test
level: medium
author: Teymur Kheirkhabarov (idea), Mangatas Tondang, oscd.community, Nasreddine
    Bencherchali (Nextron Systems)
description: Detects the usage of the "Accesschk" utility, an access and privilege
    audit tool developed by SysInternal and often being abused by attacker to verify
    process privileges
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment?slide=43
    - https://www.youtube.com/watch?v=JGs-aKf2OtU&ab_channel=OFFZONEMOSCOW
    - https://github.com/carlospolop/PEASS-ng/blob/fa0f2e17fbc1d86f1fd66338a40e665e7182501d/winPEAS/winPEASbat/winPEAS.bat
    - https://github.com/gladiatx0r/Powerless/blob/04f553bbc0c65baf4e57344deff84e3f016e6b51/Powerless.bat
falsepositives:
    - System administrator Usage
tags:
    - attack.discovery
    - attack.t1069.001
date: '2020-10-13'
modified: '2023-02-20'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Product|endswith: AccessChk
        Description|contains: Reports effective permissions
        Image|endswith:
            - \accesschk.exe
            - \accesschk64.exe
        OriginalFileName: accesschk.exe
    selection_cli:
        CommandLine|contains:
            - 'uwcqv '
            - 'kwsu '
            - 'qwsu '
            - 'uwdqs '
    condition: all of selection*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:46:56.143721+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:46:56.143721+00:00'
    detection_fields:
        -   source_field: Product
            target_table: process_activity
            target_field: metadata.product.name
            mapped_at: '2025-12-04T01:46:56.143739+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: device.desc
            mapped_at: '2025-12-04T01:46:56.143740+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:46:56.143742+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:46:56.143743+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:46:56.143745+00:00'
