id: f0cdd048-82dc-4f7a-8a7a-b87a52b6d0fd
title: Potential Commandline Obfuscation Using Escape Characters
status: test
level: medium
description: Detects potential commandline obfuscation using known escape characters
author: juju4
date: '2018-12-11'
modified: '2023-03-03'
tags:
    - attack.defense-evasion
    - attack.t1140
references:
    - https://twitter.com/vysecurity/status/885545634958385153
    - https://twitter.com/Hexacorn/status/885553465417756673
    - https://twitter.com/Hexacorn/status/885570278637678592
    - https://www.mandiant.com/resources/blog/obfuscation-wild-targeted-attackers-lead-way-evasion-techniques
    - https://web.archive.org/web/20190213114956/http://www.windowsinspired.com/understanding-the-command-line-string-and-arguments-received-by-a-windows-program/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - h^t^t^p
            - h"t"t"p
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:35:41.897173+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:35:41.897173+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:35:41.897197+00:00'
