title: Local File Read Using Curl.EXE
id: aa6f6ea6-0676-40dd-b510-6e46f02d8867
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects execution of "curl.exe" with the "file://" protocol handler in
    order to read local files.
references:
    - https://curl.se/docs/manpage.html
falsepositives:
    - Unknown
tags:
    - attack.execution
date: '2023-07-27'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \curl.exe
        OriginalFileName: curl.exe
    selection_cli:
        CommandLine|contains: file:///
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:47:33.405084+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:47:33.405084+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:47:33.405099+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:47:33.405101+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:47:33.405102+00:00'
