id: 3ef5605c-9eb9-47b0-9a71-b727e6aa5c3b
title: Use NTFS Short Name in Image
status: test
level: medium
description: Detect use of the Windows 8.3 short name. Which could be used as a method
    to avoid Image based detection
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: '2022-08-06'
modified: '2023-07-20'
tags:
    - attack.defense-evasion
    - attack.t1564.004
references:
    - https://www.acunetix.com/blog/articles/windows-short-8-3-filenames-web-security-problem/
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-2000-server/cc959352(v=technet.10)
    - https://twitter.com/jonasLyk/status/1555914501802921984
falsepositives:
    - Software Installers
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''dd6b39d9-d9be-4a3b-8fe0-fe3c6a5c1795''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|contains:
            - ~1.bat
            - ~1.dll
            - ~1.exe
            - ~1.hta
            - ~1.js
            - ~1.msi
            - ~1.ps1
            - ~1.tmp
            - ~1.vbe
            - ~1.vbs
            - ~2.bat
            - ~2.dll
            - ~2.exe
            - ~2.hta
            - ~2.js
            - ~2.msi
            - ~2.ps1
            - ~2.tmp
            - ~2.vbe
            - ~2.vbs
    filter_main_generic_parent:
        ParentImage: C:\Windows\explorer.exe
    filter_optional_webex:
        ParentImage|endswith: \WebEx\WebexHost.exe
    filter_optional_thor:
        ParentImage|endswith: \thor\thor64.exe
    filter_optional_winzip:
        Image: C:\PROGRA~1\WinZip\WZPREL~1.EXE
    filter_optional_vcred:
        Image|endswith: \VCREDI~1.EXE
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:21:00.869890+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:21:00.869890+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:21:00.869901+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:21:00.869903+00:00'
