id: 104cdb48-a7a8-4ca7-a453-32942c6e5dcb
title: File Download Using ProtocolHandler.exe
status: test
level: medium
description: 'Detects usage of "ProtocolHandler" to download files. Downloaded files
    will be located in the cache folder (for example - %LOCALAPPDATA%\Microsoft\Windows\INetCache\IE)

    '
author: frack113
date: '2021-07-13'
modified: '2023-11-09'
tags:
    - attack.defense-evasion
    - attack.t1218
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218/T1218.md
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/ProtocolHandler/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \protocolhandler.exe
        OriginalFileName: ProtocolHandler.exe
    selection_cli:
        CommandLine|contains:
            - ftp://
            - http://
            - https://
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:36:39.861468+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:36:39.861468+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:36:39.861485+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:36:39.861487+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:36:39.861489+00:00'
