title: WSL Child Process Anomaly
id: 2267fe65-0681-42ad-9a6d-46553d3f3480
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects uncommon or suspicious child processes spawning from a WSL process.
    This could indicate an attempt to evade parent/child relationship detections or
    persistence attempts via cron using WSL
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Wsl/
    - https://twitter.com/nas_bench/status/1535431474429808642
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.defense-evasion
    - attack.t1218
    - attack.t1202
date: '2023-01-23'
modified: '2023-08-15'
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|endswith:
            - \wsl.exe
            - \wslhost.exe
    selection_children_images:
        Image|endswith:
            - \calc.exe
            - \cmd.exe
            - \cscript.exe
            - \mshta.exe
            - \powershell.exe
            - \pwsh.exe
            - \regsvr32.exe
            - \rundll32.exe
            - \wscript.exe
    selection_children_paths:
        Image|contains:
            - \AppData\Local\Temp\
            - C:\Users\Public\
            - C:\Windows\Temp\
            - C:\Temp\
            - \Downloads\
            - \Desktop\
    condition: selection_parent and 1 of selection_children_*
related:
    -   id: dec44ca7-61ad-493c-bfd7-8819c5faa09b
        type: derived
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:50:24.974620+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:50:24.974620+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:50:24.974637+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:50:24.974639+00:00'
