id: 53821412-17b0-4147-ade0-14faae67d54b
title: System Integrity Protection (SIP) Enumeration
status: test
level: low
description: 'Detects the use of csrutil to view the Configure System Integrity Protection
    (SIP) status. This technique is used in post-exploit scenarios.

    '
author: Joseliyo Sanchez, @Joseliyo_Jstnk
date: '2024-01-02'
tags:
    - attack.discovery
    - attack.t1518.001
references:
    - https://ss64.com/osx/csrutil.html
    - https://objective-see.org/blog/blog_0x6D.html
    - https://www.welivesecurity.com/2017/10/20/osx-proton-supply-chain-attack-elmedia/
    - https://www.virustotal.com/gui/file/05a2adb266ec6c0ba9ed176d87d8530e71e845348c13caf9f60049760c312cd3/behavior
falsepositives:
    - Legitimate administration activities
taxonomy: sigma
logsource:
    category: process_creation
    product: macos
detection:
    selection:
        Image|endswith: /csrutil
        CommandLine|contains: status
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:14:25.836396+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-11-13T20:14:25.836396+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:14:25.836401+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:14:25.836403+00:00'
