title: Suspicious Execution of InstallUtil Without Log
id: d042284c-a296-4988-9be5-f424fadcc28c
status: test
level: medium
author: frack113
description: Uses the .NET InstallUtil.exe application in order to execute image without
    log
references:
    - https://securelist.com/moonbounce-the-dark-side-of-uefi-firmware/105468/
    - https://learn.microsoft.com/en-us/dotnet/framework/tools/installutil-exe-installer-tool
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
date: '2022-01-23'
modified: '2022-02-04'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \InstallUtil.exe
        Image|contains: Microsoft.NET\Framework
        CommandLine|contains|all:
            - '/logfile= '
            - /LogToConsole=false
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:46:30.632807+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:46:30.632807+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:46:30.632822+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:46:30.632824+00:00'
