title: Potentially Suspicious Ping/Copy Command Combination
id: ded2b07a-d12f-4284-9b76-653e37b6c8b0
status: test
level: medium
author: X__Junior (Nextron Systems)
description: 'Detects uncommon and potentially suspicious one-liner command containing
    both "ping" and "copy" at the same time, which is usually used by malware.

    '
references:
    - Internal Research
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1070.004
date: '2023-07-18'
modified: '2024-03-06'
logsource:
    category: process_creation
    product: windows
detection:
    selection_cmd:
        Image|endswith: \cmd.exe
        OriginalFileName: Cmd.Exe
    selection_action:
        CommandLine|contains|all:
            - ping
            - 'copy '
    selection_cli_1:
        CommandLine|contains|windash: ' -n '
    selection_cli_2:
        CommandLine|contains|windash: ' -y '
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:43:47.039715+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:43:47.039715+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:43:47.039758+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:43:47.039792+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:43:47.039811+00:00'
