title: Suspicious Curl Change User Agents - Linux
id: b86d356d-6093-443d-971c-9b07db583c68
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects a suspicious curl process start on linux with set useragent options
references:
    - https://curl.se/docs/manpage.html
falsepositives:
    - Scripts created by developers and admins
    - Administrative activity
tags:
    - attack.command-and-control
    - attack.t1071.001
date: '2022-09-15'
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith: /curl
        CommandLine|contains:
            - ' -A '
            - ' --user-agent '
    condition: selection
related:
    -   id: 3286d37a-00fd-41c2-a624-a672dcd34e60
        type: derived
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:10.199720+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:10.199720+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:36:10.199733+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:36:10.199735+00:00'
