id: 1114e048-b69c-4f41-bc20-657245ae6e3f
title: User Discovery And Export Via Get-ADUser Cmdlet
status: test
level: medium
description: Detects usage of the Get-ADUser cmdlet to collect user information and
    output it to a file
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-09-09'
modified: '2022-11-17'
tags:
    - attack.discovery
    - attack.t1033
references:
    - http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
    - https://www.microsoft.com/en-us/security/blog/2022/10/18/defenders-beware-a-case-for-post-ransomware-investigations/
falsepositives:
    - Legitimate admin scripts may use the same technique, it's better to exclude
        specific computers or users who execute these commands or scripts often
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''c2993223-6da8-4b1a-88ee-668b8bf315e9''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
        OriginalFileName:
            - PowerShell.EXE
            - pwsh.dll
    selection_cli:
        CommandLine|contains|all:
            - 'Get-ADUser '
            - ' -Filter \*'
        CommandLine|contains:
            - ' > '
            - ' | Select '
            - Out-File
            - Set-Content
            - Add-Content
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:38.107491+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:38.107491+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:38.107495+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:38.107497+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:38.107498+00:00'
