id: 867356ee-9352-41c9-a8f2-1be690d78216
title: Potentially Suspicious Regsvr32 HTTP/FTP Pattern
status: test
level: medium
description: Detects regsvr32 execution to download/install/register new DLLs that
    are hosted on Web or FTP servers.
author: Florian Roth (Nextron Systems)
date: '2023-05-24'
modified: '2023-05-26'
tags:
    - attack.defense-evasion
    - attack.t1218.010
references:
    - https://twitter.com/mrd0x/status/1461041276514623491
    - https://twitter.com/tccontre18/status/1480950986650832903
    - https://lolbas-project.github.io/lolbas/Binaries/Regsvr32/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''8e2b24c9-4add-46a0-b4bb-0057b4e6187d''),
    type=<SigmaRelatedType.OBSOLETE: 4>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \regsvr32.exe
        OriginalFileName: REGSVR32.EXE
    selection_flag:
        CommandLine|contains:
            - ' /i'
            - ' -i'
    selection_protocol:
        CommandLine|contains:
            - ftp
            - http
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:31:27.197167+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:31:27.197167+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:31:27.197198+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:31:27.197203+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:31:27.197206+00:00'
