title: HackTool - F-Secure C3 Load by Rundll32
id: b18c9d4c-fac9-4708-bd06-dd5bfacf200f
status: test
level: critical
author: Alfie Champion (ajpc500)
description: F-Secure C3 produces DLLs with a default exported StartNodeRelay function.
references:
    - https://github.com/FSecureLABS/C3/blob/11a081fd3be2aaf2a879f6b6e9a96ecdd24966ef/Src/NodeRelayDll/NodeRelayDll.cpp#L12
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1218.011
date: '2021-06-02'
modified: '2023-03-05'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - rundll32.exe
            - .dll
            - StartNodeRelay
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:43:19.932124+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:43:19.932124+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:43:19.932138+00:00'
