id: c3a99af4-35a9-4668-879e-c09aeb4f2bdf
title: Rundll32 Execution With Uncommon DLL Extension
status: experimental
level: medium
description: Detects the execution of rundll32 with a command line that doesn't contain
    a common extension
author: Tim Shelton, Florian Roth (Nextron Systems), Yassine Oukessou
date: '2022-01-13'
modified: '2024-04-04'
tags:
    - attack.defense-evasion
    - attack.t1218.011
references:
    - https://twitter.com/mrd0x/status/1481630810495139841?s=12
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \rundll32.exe
        OriginalFileName: RUNDLL32.EXE
    filter_main_null:
        CommandLine: null
    filter_main_empty:
        CommandLine: ''
    filter_main_known_extension:
        CommandLine|contains:
            - '.cpl '
            - .cpl,
            - .cpl"
            - .cpl'
            - '.dll '
            - .dll,
            - .dll"
            - .dll'
            - '.inf '
            - .inf,
            - .inf"
            - .inf'
        CommandLine|endswith:
            - .cpl
            - .dll
            - '.inf'
    filter_main_localserver:
        CommandLine|contains: ' -localserver '
    filter_main_zzzzInvokeManagedCustomActionOutOfProc:
        ParentImage|endswith: \msiexec.exe
        CommandLine|contains|all:
            - :\Windows\Installer\
            - .tmp
            - zzzzInvokeManagedCustomActionOutOfProc
    filter_optional_EdgeUpdate:
        ParentCommandLine|contains|all:
            - :\Users\
            - \AppData\Local\Microsoft\EdgeUpdate\Install\{
            - \EDGEMITMP_
            - .tmp\setup.exe
            - --install-archive=
            - --previous-version=
            - --msedgewebview --verbose-logging --do-not-launch-msedge --user-level
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:15.692666+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:15.692666+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:15.692686+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:15.692689+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:15.692691+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:15.692692+00:00'
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-11-13T20:20:15.692694+00:00'
