id: df1f26d3-bea7-4700-9ea2-ad3e990cf90e
title: Node Process Executions
status: test
level: medium
description: Detects the execution of other scripts using the Node executable packaged
    with Adobe Creative Cloud
author: Max Altgelt (Nextron Systems)
date: '2022-04-06'
tags:
    - attack.defense-evasion
    - attack.t1127
    - attack.t1059.007
references:
    - https://twitter.com/mttaggart/status/1511804863293784064
fields:
    - Image
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \Adobe Creative Cloud Experience\libs\node.exe
    filter:
        CommandLine|contains: Adobe Creative Cloud Experience\js
    condition: selection and not filter
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:36:25.856658+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:36:25.856658+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:36:25.856691+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:36:25.856695+00:00'
