id: 129966c9-de17-4334-a123-8b58172e664d
title: Potential Windows Defender AV Bypass Via Dump64.EXE Rename
status: test
level: high
description: 'Detects when a user is potentially trying to bypass the Windows Defender
    AV by renaming a tool to dump64.exe and placing it in the Visual Studio folder.

    Currently the rule is covering only usage of procdump but other utilities can
    be added in order to increase coverage.

    '
author: Austin Songer @austinsonger, Florian Roth (Nextron Systems), Nasreddine Bencherchali
    (Nextron Systems)
date: '2021-11-26'
modified: '2024-06-21'
tags:
    - attack.credential-access
    - attack.t1003.001
references:
    - https://twitter.com/mrd0x/status/1460597833917251595
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_dump:
        Image|startswith: :\Program Files
        Image|contains: \Microsoft Visual Studio\
        Image|endswith: \dump64.exe
    selection_tools_procdump:
        OriginalFileName: procdump
        CommandLine|contains:
            - ' -ma '
            - ' -mp '
    condition: selection_dump and 1 of selection_tools_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:46.939371+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:46.939371+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:46.939376+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:46.939377+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:46.939378+00:00'
