id: 40b95d31-1afc-469e-8d34-9a3a667d058e
title: Suspicious Csi.exe Usage
status: test
level: medium
description: Csi.exe is a signed binary from Microsoft that comes with Visual Studio
    and provides C# interactive capabilities. It can be used to run C# code from a
    file passed as a parameter in command line. Early version of this utility provided
    with Microsoft “Roslyn” Community Technology Preview was named 'rcsi.exe'
author: Konstantin Grishchenko, oscd.community
date: '2020-10-17'
modified: '2022-07-11'
tags:
    - attack.execution
    - attack.t1072
    - attack.defense-evasion
    - attack.t1218
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Csi/
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Rcsi/
    - https://enigma0x3.net/2016/11/21/bypassing-application-whitelisting-by-using-rcsi-exe/
    - https://twitter.com/Z3Jpa29z/status/1317545798981324801
fields:
    - ComputerName
    - User
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Legitimate usage by software developers
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \csi.exe
            - \rcsi.exe
        OriginalFileName:
            - csi.exe
            - rcsi.exe
    selection_cli:
        Company: Microsoft Corporation
    condition: all of selection*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:06.917077+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:06.917077+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:07.841322+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:07.841366+00:00'
        -   source_field: Company
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:20:07.841372+00:00'
