id: 178e615d-e666-498b-9630-9ed363038101
title: Elevated System Shell Spawned From Uncommon Parent Location
status: test
level: medium
description: Detects when a shell program such as the Windows command prompt or PowerShell
    is launched with system privileges from a uncommon parent location.
author: frack113, Tim Shelton (update fp)
date: '2022-12-05'
modified: '2023-11-23'
tags:
    - attack.privilege-escalation
    - attack.defense-evasion
    - attack.execution
    - attack.t1059
references:
    - https://github.com/Wh04m1001/SysmonEoP
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''61065c72-5d7d-44ef-bf41-6a36684b545f''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_shell:
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
            - \cmd.exe
        OriginalFileName:
            - PowerShell.EXE
            - pwsh.dll
            - Cmd.Exe
    selection_user:
        User|contains:
            - AUTHORI
            - AUTORI
        LogonId: '0x3e7'
    filter_main_generic:
        ParentImage|contains:
            - :\Program Files (x86)\
            - :\Program Files\
            - :\ProgramData\
            - :\Windows\System32\
            - :\Windows\SysWOW64\
            - :\Windows\Temp\
            - :\Windows\WinSxS\
    filter_optional_manageengine:
        ParentImage|endswith: :\ManageEngine\ADManager Plus\pgsql\bin\postgres.exe
        Image|endswith: \cmd.exe
    filter_optional_asgard:
        CommandLine|contains: :\WINDOWS\system32\cmd.exe /c "
        CurrentDirectory|contains: :\WINDOWS\Temp\asgard2-agent\
    filter_optional_ibm_spectrumprotect:
        ParentImage|contains: :\IBM\SpectrumProtect\webserver\scripts\
        CommandLine|contains: :\IBM\SpectrumProtect\webserver\scripts\
    filter_main_parent_null:
        ParentImage: null
    filter_main_parent_empty:
        ParentImage: ''
    condition: all of selection_* and not 1 of filter_main_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:30:27.259941+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:30:27.259941+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:30:27.259960+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:30:27.259962+00:00'
        -   source_field: User
            target_table: process_activity
            target_field: actor.user.name
            mapped_at: '2025-11-26T02:30:27.259964+00:00'
        -   source_field: LogonId
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:30:27.259965+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:30:27.259966+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:30:27.259967+00:00'
        -   source_field: CurrentDirectory
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:30:27.259969+00:00'
