title: Potential DLL Sideloading Via DeviceEnroller.EXE
id: e173ad47-4388-4012-ae62-bd13f71c18a8
status: test
level: medium
author: '@gott_cyber'
description: 'Detects the use of the PhoneDeepLink parameter to potentially sideload
    a DLL file that does not exist. This non-existent DLL file is named "ShellChromeAPI.dll".

    Adversaries can drop their own renamed DLL and execute it via DeviceEnroller.exe
    using this parameter

    '
references:
    - https://mobile.twitter.com/0gtweet/status/1564131230941122561
    - https://strontic.github.io/xcyclopedia/library/DeviceEnroller.exe-24BEF0D6B0ECED36BB41831759FDE18D.html
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1574.002
date: '2022-08-29'
modified: '2023-02-04'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \deviceenroller.exe
        OriginalFileName: deviceenroller.exe
    selection_cli:
        CommandLine|contains: /PhoneDeepLink
    condition: all of selection_*
related:
    -   id: ee4c5d06-3abc-48cc-8885-77f1c20f4451
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:49:50.290086+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:49:50.290086+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:49:50.290122+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:49:50.290125+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:49:50.290128+00:00'
