id: 114e7f1c-f137-48c8-8f54-3088c24ce4b9
title: Remote Access Tool - AnyDesk Silent Installation
status: test
level: high
description: Detects AnyDesk Remote Desktop silent installation. Which can be used
    by attackers to gain remote access.
author: Ján Trenčanský
date: '2021-08-06'
modified: '2023-03-05'
tags:
    - attack.command-and-control
    - attack.t1219
references:
    - https://twitter.com/TheDFIRReport/status/1423361119926816776?s=20
    - https://support.anydesk.com/Automatic_Deployment
fields:
    - CommandLine
    - ParentCommandLine
    - CurrentDirectory
falsepositives:
    - Legitimate deployment of AnyDesk
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - --install
            - --start-with-win
            - --silent
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:14.458137+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:14.458137+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:14.458141+00:00'
