title: Interactive AT Job
id: 60fc936d-2eb0-4543-8a13-911c750a1dfc
status: test
level: high
author: E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community
description: Detects an interactive AT job, which may be used as a form of privilege
    escalation.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1053.002/T1053.002.md
    - https://eqllib.readthedocs.io/en/latest/analytics/d8db43cf-ed52-4f5c-9fb3-c9a4b95a0b56.html
falsepositives:
    - Unlikely (at.exe deprecated as of Windows 8)
tags:
    - attack.privilege-escalation
    - attack.t1053.002
date: '2019-10-24'
modified: '2021-11-27'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \at.exe
        CommandLine|contains: interactive
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:45:12.901088+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:45:12.901088+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:45:12.901100+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:45:12.901102+00:00'
