id: 80fc36aa-945e-4181-89f2-2f907ab6775d
title: UAC Bypass Using IEInstal - Process
status: test
level: high
description: Detects the pattern of UAC Bypass using IEInstal.exe (UACMe 64)
author: Christian Burkard (Nextron Systems)
date: '2021-08-30'
modified: '2024-12-01'
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
references:
    - https://github.com/hfiref0x/UACME
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        IntegrityLevel:
            - High
            - System
            - S-1-16-16384
            - S-1-16-12288
        ParentImage|endswith: \ieinstal.exe
        Image|contains: \AppData\Local\Temp\
        Image|endswith: consent.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:19:55.136725+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:19:55.136725+00:00'
    detection_fields:
        -   source_field: IntegrityLevel
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:19:55.136735+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:19:55.136737+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:19:55.136738+00:00'
