id: 33e814e0-1f00-4e43-9c34-31fb7ae2b174
title: ESXi Network Configuration Discovery Via ESXCLI
status: test
level: medium
description: Detects execution of the "esxcli" command with the "network" flag in
    order to retrieve information about the network configuration.
author: Cedric Maurugeon
date: '2023-09-04'
tags:
    - attack.discovery
    - attack.t1033
    - attack.t1007
references:
    - https://www.crowdstrike.com/blog/hypervisor-jackpotting-ecrime-actors-increase-targeting-of-esxi-servers/
    - https://developer.broadcom.com/xapis/esxcli-command-reference/7.0.0/namespace/esxcli_network.html
falsepositives:
    - Legitimate administration activities
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection_img:
        Image|endswith: /esxcli
        CommandLine|contains: network
    selection_cli:
        CommandLine|contains:
            - ' get'
            - ' list'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:17:21.953303+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-26T02:17:21.953303+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:17:21.953319+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:17:21.953322+00:00'
