id: 7f2bb9d5-6395-4de5-969c-70c11fbe6b12
title: Split A File Into Pieces
status: test
level: low
description: Detection use of the command "split" to split files into parts and possible
    transfer.
author: Igor Fits, Mikhail Larin, oscd.community
date: '2020-10-15'
modified: '2021-11-27'
tags:
    - attack.exfiltration
    - attack.t1030
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1030/T1030.md
falsepositives:
    - Legitimate administrative activity
taxonomy: sigma
logsource:
    category: process_creation
    product: macos
detection:
    selection:
        Image|endswith: /split
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:13:21.442844+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-11-26T02:13:21.442844+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:13:21.442896+00:00'
