id: 403ed92c-b7ec-4edd-9947-5b535ee12d46
title: Crontab Enumeration
status: test
level: low
description: Detects usage of crontab to list the tasks of the user
author: Joseliyo Sanchez, @Joseliyo_Jstnk
date: '2023-06-02'
tags:
    - attack.discovery
    - attack.t1007
references:
    - https://blogs.jpcert.or.jp/en/2023/05/gobrat.html
    - https://jstnk9.github.io/jstnk9/research/GobRAT-Malware/
    - https://www.virustotal.com/gui/file/60bcd645450e4c846238cf0e7226dc40c84c96eba99f6b2cffcd0ab4a391c8b3/detection
    - https://www.virustotal.com/gui/file/3e44c807a25a56f4068b5b8186eee5002eed6f26d665a8b791c472ad154585d1/detection
falsepositives:
    - Legitimate use of crontab
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith: /crontab
        CommandLine|contains: ' -l'
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:16:45.359368+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-26T02:16:45.359368+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:16:45.359387+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:16:45.359390+00:00'
