title: Visual Studio NodejsTools PressAnyKey Arbitrary Binary Execution
id: a20391f8-76fb-437b-abc0-dba2df1952c6
status: test
level: medium
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
description: Detects child processes of Microsoft.NodejsTools.PressAnyKey.exe that
    can be used to execute any other binary
references:
    - https://twitter.com/mrd0x/status/1463526834918854661
    - https://gist.github.com/nasbench/a989ce64cefa8081bd50cf6ad8c491b5
falsepositives:
    - Legitimate use by developers as part of NodeJS development with Visual Studio
        Tools
tags:
    - attack.execution
    - attack.defense-evasion
    - attack.t1218
date: '2022-01-11'
modified: '2023-04-11'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \Microsoft.NodejsTools.PressAnyKey.exe
    condition: selection
related:
    -   id: 65c3ca2c-525f-4ced-968e-246a713d164f
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:41:06.921912+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:41:06.921912+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:41:06.921925+00:00'
