id: 797011dc-44f4-4e6f-9f10-a8ceefbe566b
title: WMI Backdoor Exchange Transport Agent
status: test
level: critical
description: Detects a WMI backdoor in Exchange Transport Agents via WMI event filters
author: Florian Roth (Nextron Systems)
date: '2019-10-11'
modified: '2023-02-08'
tags:
    - attack.persistence
    - attack.t1546.003
references:
    - https://twitter.com/cglyer/status/1182389676876980224
    - https://twitter.com/cglyer/status/1182391019633029120
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \EdgeTransport.exe
    filter_conhost:
        Image: C:\Windows\System32\conhost.exe
    filter_oleconverter:
        Image|startswith: C:\Program Files\Microsoft\Exchange Server\
        Image|endswith: \Bin\OleConverter.exe
    condition: selection and not 1 of filter_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:27:15.620944+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:27:15.620944+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:27:15.620975+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:27:15.620979+00:00'
