id: cafeeba3-01da-4ab4-b6c4-a31b1d9730c7
title: PrintBrm ZIP Creation of Extraction
status: test
level: high
description: Detects the execution of the LOLBIN PrintBrm.exe, which can be used to
    create or extract ZIP files. PrintBrm.exe should not be run on a normal workstation.
author: frack113
date: '2022-05-02'
tags:
    - attack.command-and-control
    - attack.t1105
    - attack.defense-evasion
    - attack.t1564.004
references:
    - https://lolbas-project.github.io/lolbas/Binaries/PrintBrm/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \PrintBrm.exe
        CommandLine|contains|all:
            - ' -f'
            - .zip
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:28:33.214406+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:28:33.214406+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:28:33.214426+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:28:33.214428+00:00'
