id: 6c8fbee5-dee8-49bc-851d-c3142d02aa47
title: Allow Service Access Using Security Descriptor Tampering Via Sc.EXE
status: test
level: high
description: Detects suspicious DACL modifications to allow access to a service from
    a suspicious trustee. This can be used to override access restrictions set by
    previous ACLs.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-02-28'
tags:
    - attack.persistence
    - attack.t1543.003
references:
    - https://twitter.com/0gtweet/status/1628720819537936386
    - https://itconnect.uw.edu/tools-services-support/it-systems-infrastructure/msinf/other-help/understanding-sddl-syntax/
    - https://learn.microsoft.com/en-us/windows/win32/secauthz/sid-strings
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''a537cfc3-4297-4789-92b5-345bfd845ad0''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_sc:
        Image|endswith: \sc.exe
        OriginalFileName: sc.exe
    selection_sdset:
        CommandLine|contains|all:
            - sdset
            - A;
    selection_trustee:
        CommandLine|contains:
            - ;IU
            - ;SU
            - ;BA
            - ;SY
            - ;WD
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:00.695448+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:00.695448+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:00.695467+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:00.695469+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:00.695470+00:00'
