title: Sdiagnhost Calling Suspicious Child Process
id: f3d39c45-de1a-4486-a687-ab126124f744
status: test
level: high
author: Nextron Systems, @Kostastsale
description: Detects sdiagnhost.exe calling a suspicious child process (e.g. used
    in exploits for Follina / CVE-2022-30190)
references:
    - https://twitter.com/nao_sec/status/1530196847679401984
    - https://doublepulsar.com/follina-a-microsoft-office-code-execution-vulnerability-1a47fce5629e
    - https://app.any.run/tasks/713f05d2-fe78-4b9d-a744-f7c133e3fafb/
    - https://app.any.run/tasks/f420d295-0457-4e9b-9b9e-6732be227583/
    - https://app.any.run/tasks/c4117d9a-f463-461a-b90f-4cd258746798/
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1036
    - attack.t1218
date: '2022-06-01'
modified: '2024-08-23'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \sdiagnhost.exe
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
            - \cmd.exe
            - \mshta.exe
            - \cscript.exe
            - \wscript.exe
            - \taskkill.exe
            - \regsvr32.exe
            - \rundll32.exe
            - \calc.exe
    filter_main_cmd_bits:
        Image|endswith: \cmd.exe
        CommandLine|contains: bits
    filter_main_powershell_noprofile:
        Image|endswith: \powershell.exe
        CommandLine|endswith:
            - -noprofile -
            - -noprofile
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:42:16.914167+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:42:16.914167+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:42:16.914186+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:42:16.914188+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:42:16.914189+00:00'
