id: 6eea1bf6-f8d2-488a-a742-e6ef6c1b67db
title: OMIGOD SCX RunAsProvider ExecuteScript
status: test
level: high
description: 'Rule to detect the use of the SCX RunAsProvider ExecuteScript to execute
    any UNIX/Linux script using the /bin/sh shell.

    Script being executed gets created as a temp file in /tmp folder with a scx* prefix.

    Then it is invoked from the following directory /etc/opt/microsoft/scx/conf/tmpdir/.

    The file in that directory has the same prefix scx*. SCXcore, started as the Microsoft
    Operations Manager UNIX/Linux Agent, is now used in a host of products including

    Microsoft Operations Manager, Microsoft Azure, and Microsoft Operations Management
    Suite.

    '
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research), MSTIC
date: '2021-10-15'
modified: '2022-10-05'
tags:
    - attack.privilege-escalation
    - attack.initial-access
    - attack.execution
    - attack.t1068
    - attack.t1190
    - attack.t1203
references:
    - https://www.wiz.io/blog/omigod-critical-vulnerabilities-in-omi-azure
    - https://github.com/Azure/Azure-Sentinel/pull/3059
falsepositives:
    - Legitimate use of SCX RunAsProvider ExecuteScript.
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        User: root
        LogonId: 0
        CurrentDirectory: /var/opt/microsoft/scx/tmp
        CommandLine|contains: /etc/opt/microsoft/scx/conf/tmpdir/scx
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:15:55.898690+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-13T20:15:55.898690+00:00'
    detection_fields:
        -   source_field: User
            target_table: process_activity
            target_field: actor.user.name
            mapped_at: '2025-11-13T20:15:55.898695+00:00'
        -   source_field: LogonId
            target_table: process_activity
            target_field: actor.process.session.uid
            mapped_at: '2025-11-13T20:15:55.898697+00:00'
        -   source_field: CurrentDirectory
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:15:55.898698+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:15:55.898699+00:00'
