id: 8bc64091-6875-4881-aaf9-7bd25b5dda08
title: Suspicious Process Patterns NTDS.DIT Exfil
status: test
level: high
description: Detects suspicious process patterns used in NTDS.DIT exfiltration
author: Florian Roth (Nextron Systems)
date: '2022-03-11'
modified: '2022-11-10'
tags:
    - attack.credential-access
    - attack.t1003.003
references:
    - https://www.ired.team/offensive-security/credential-access-and-credential-dumping/ntds.dit-enumeration
    - https://www.n00py.io/2022/03/manipulating-user-passwords-without-mimikatz/
    - https://pentestlab.blog/tag/ntds-dit/
    - https://github.com/samratashok/nishang/blob/414ee1104526d7057f9adaeee196d91ae447283e/Gather/Copy-VSS.ps1
    - https://github.com/zcgonvh/NTDSDumpEx
    - https://github.com/rapid7/metasploit-framework/blob/d297adcebb5c1df6fe30b12ca79b161deb71571c/data/post/powershell/NTDSgrab.ps1
    - https://blog.talosintelligence.com/2022/08/recent-cyber-attack.html?m=1
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_tool:
        Image|endswith:
            - \NTDSDump.exe
            - \NTDSDumpEx.exe
        CommandLine|contains|all:
            - ntds.dit
            - system.hiv
        CommandLine|contains: NTDSgrab.ps1
    selection_oneliner_1:
        CommandLine|contains|all:
            - ac i ntds
            - create full
    selection_onliner_2:
        CommandLine|contains|all:
            - '/c copy '
            - \windows\ntds\ntds.dit
    selection_onliner_3:
        CommandLine|contains|all:
            - activate instance ntds
            - create full
    selection_powershell:
        CommandLine|contains|all:
            - powershell
            - ntds.dit
    set1_selection_ntds_dit:
        CommandLine|contains: ntds.dit
    set1_selection_image_folder:
        ParentImage|contains:
            - \apache
            - \tomcat
            - \AppData\
            - \Temp\
            - \Public\
            - \PerfLogs\
        Image|contains:
            - \apache
            - \tomcat
            - \AppData\
            - \Temp\
            - \Public\
            - \PerfLogs\
    condition: 1 of selection* or all of set1*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:49.487530+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:49.487530+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:49.487536+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:49.487538+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:49.487539+00:00'
