title: Decode Base64 Encoded Text -MacOs
id: 719c22d7-c11a-4f2c-93a6-2cfdd5412f68
status: test
level: low
author: Daniil Yugoslavskiy, oscd.community
description: Detects usage of base64 utility to decode arbitrary base64-encoded text
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1027/T1027.md
falsepositives:
    - Legitimate activities
tags:
    - attack.defense-evasion
    - attack.t1027
date: '2020-10-19'
modified: '2022-11-26'
logsource:
    category: process_creation
    product: macos
detection:
    selection:
        Image: /usr/bin/base64
        CommandLine|contains: -d
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:34:15.774304+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-12-04T01:34:15.774304+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:34:15.774327+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:34:15.774329+00:00'
