id: cea72823-df4d-4567-950c-0b579eaf0846
title: Potential Dropper Script Execution Via WScript/CScript
status: test
level: medium
description: Detects wscript/cscript executions of scripts located in user directories
author: Margaritis Dimitrios (idea), Florian Roth (Nextron Systems), oscd.community,
    Nasreddine Bencherchali (Nextron Systems)
date: '2019-01-16'
modified: '2024-01-30'
tags:
    - attack.execution
    - attack.t1059.005
    - attack.t1059.007
references:
    - https://thedfirreport.com/2023/10/30/netsupport-intrusion-results-in-domain-compromise/
    - https://redcanary.com/blog/gootloader/
falsepositives:
    - Some installers might generate a similar behavior. An initial baseline is required
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''1e33157c-53b1-41ad-bbcc-780b80b58288''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_exec:
        Image|endswith:
            - \wscript.exe
            - \cscript.exe
    selection_paths:
        CommandLine|contains:
            - :\Temp\
            - :\Tmp\
            - :\Users\Public\
            - :\Windows\Temp\
            - \AppData\Local\Temp\
    selection_ext:
        CommandLine|contains:
            - .js
            - .jse
            - .vba
            - .vbe
            - .vbs
            - .wsf
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:32:50.306415+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:32:50.306415+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:32:50.306451+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:32:50.306455+00:00'
