title: Suspicious Powercfg Execution To Change Lock Screen Timeout
id: f8d6a15e-4bc8-4c27-8e5d-2b10f0b73e5b
status: test
level: medium
author: frack113
description: Detects suspicious execution of 'Powercfg.exe' to change lock screen
    timeout
references:
    - https://blogs.vmware.com/security/2022/11/batloader-the-evasive-downloader-malware.html
    - https://learn.microsoft.com/en-us/windows-hardware/design/device-experiences/powercfg-command-line-options
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
date: '2022-11-18'
logsource:
    category: process_creation
    product: windows
detection:
    selection_power:
        Image|endswith: \powercfg.exe
        OriginalFileName: PowerCfg.exe
    selection_standby:
        CommandLine|contains|all:
            - '/setacvalueindex '
            - SCHEME_CURRENT
            - SUB_VIDEO
            - VIDEOCONLOCK
            - '-change '
            - -standby-timeout-
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:28.082223+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:28.082223+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:44:28.082238+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:44:28.082239+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:44:28.082241+00:00'
