title: DumpStack.log Defender Evasion
id: 4f647cfa-b598-4e12-ad69-c68dd16caef8
status: test
level: critical
author: Florian Roth (Nextron Systems)
description: Detects the use of the filename DumpStack.log to evade Microsoft Defender
references:
    - https://twitter.com/mrd0x/status/1479094189048713219
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
date: '2022-01-06'
modified: '2022-06-17'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \DumpStack.log
    selection_download:
        CommandLine|contains: ' -o DumpStack.log'
    condition: 1 of selection*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:43:59.838618+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:43:59.838618+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:43:59.838633+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:43:59.838635+00:00'
