id: 16c37b52-b141-42a5-a3ea-bbe098444397
title: Suspect Svchost Activity
status: test
level: high
description: It is extremely abnormal for svchost.exe to spawn without any CLI arguments
    and is normally observed when a malicious process spawns the process and injects
    code into the process memory space.
author: David Burkett, @signalblur
date: '2019-12-28'
modified: '2022-06-27'
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1055
references:
    - https://web.archive.org/web/20180718061628/https://securitybytes.io/blue-team-fundamentals-part-two-windows-processes-759fe15965e2
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Rpcnet.exe / rpcnetp.exe which is a lojack style software. https://www.blackhat.com/docs/us-14/materials/us-14-Kamlyuk-Kamluk-Computrace-Backdoor-Revisited.pdf
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|endswith: svchost.exe
        Image|endswith: \svchost.exe
    filter:
        ParentImage|endswith:
            - \rpcnet.exe
            - \rpcnetp.exe
        CommandLine: null
    condition: selection and not filter
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:30.320407+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:30.320407+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:30.320417+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:30.320418+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:30.320420+00:00'
