title: Powershell Token Obfuscation - Process Creation
id: deb9b646-a508-44ee-b7c9-d8965921c6b6
status: test
level: high
author: frack113
description: Detects TOKEN OBFUSCATION technique from Invoke-Obfuscation
references:
    - https://github.com/danielbohannon/Invoke-Obfuscation
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1027.009
date: '2022-12-27'
modified: '2024-08-11'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|re|all:
            - \w+`(\w+|-|.)`[\w+|\s]
            - '"(\{\d\})+"\s*-f'
        CommandLine|re: (?i)\$\{`?e`?n`?v`?:`?p`?a`?t`?h`?\}
    filter_main_envpath:
        CommandLine|contains: ${env:path}
    condition: selection and not 1 of filter_main_*
related:
    -   id: f3a98ce4-6164-4dd4-867c-4d83de7eca51
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:40:49.721086+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:40:49.721086+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:40:49.721101+00:00'
