title: Renamed PAExec Execution
id: c4e49831-1496-40cf-8ce1-b53f942b02f9
status: test
level: high
author: Florian Roth (Nextron Systems), Jason Lynch
description: Detects execution of renamed version of PAExec. Often used by attackers
references:
    - https://www.poweradmin.com/paexec/
    - https://summit.fireeye.com/content/dam/fireeye-www/summit/cds-2018/presentations/cds18-technical-s05-att&cking-fin7.pdf
falsepositives:
    - Weird admins that rename their tools
    - Software companies that bundle PAExec with their software and rename it, so
        that it is less embarrassing
    - When executed with the "-s" flag. PAExec will copy itself to the "C:\Windows\"
        directory with a different name. Usually like this "PAExec-[XXXXX]-[ComputerName]"
tags:
    - attack.defense-evasion
    - attack.t1202
date: '2021-05-22'
modified: '2024-11-23'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Description: PAExec Application
        OriginalFileName: PAExec.exe
        Product|contains: PAExec
        Hashes|contains:
            - IMPHASH=11D40A7B7876288F919AB819CC2D9802
            - IMPHASH=6444f8a34e99b8f7d9647de66aabe516
            - IMPHASH=dfd6aa3f7b2b1035b76b718f1ddc689f
            - IMPHASH=1a6cca4d5460b1710a12dea39e4a592c
    filter_main_known_location:
        Image|endswith: \paexec.exe
        Image|startswith: C:\Windows\PAExec-
    condition: selection and not 1 of filter_main_*
related:
    -   id: 7b0666ad-3e38-4e3d-9bab-78b06de85f7b
        type: obsolete
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:48:26.829003+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:48:26.829003+00:00'
    detection_fields:
        -   source_field: Description
            target_table: process_activity
            target_field: device.desc
            mapped_at: '2025-12-04T01:48:26.829020+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:48:26.829022+00:00'
        -   source_field: Product
            target_table: process_activity
            target_field: metadata.product.name
            mapped_at: '2025-12-04T01:48:26.829023+00:00'
        -   source_field: Hashes
            target_table: process_activity
            target_field: process.file.hashes.value
            mapped_at: '2025-12-04T01:48:26.829025+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:48:26.829026+00:00'
