id: 550bbb84-ce5d-4e61-84ad-e590f0024dcd
title: File Encryption Using Gpg4win
status: test
level: medium
description: Detects usage of Gpg4win to encrypt files
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-08-09'
tags:
    - attack.execution
references:
    - https://blogs.vmware.com/security/2022/11/batloader-the-evasive-downloader-malware.html
    - https://www.gpg4win.de/documentation.html
    - https://news.sophos.com/en-us/2022/01/19/zloader-installs-remote-access-backdoors-and-delivers-cobalt-strike/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_metadata:
        Image|endswith:
            - \gpg.exe
            - \gpg2.exe
        Description: GnuPG’s OpenPGP tool
    selection_cli:
        CommandLine|contains|all:
            - ' -c '
            - passphrase
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:39.715263+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:39.715263+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:39.715270+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: message
            mapped_at: '2025-11-13T20:20:39.715272+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:39.715274+00:00'
