id: 62e0298b-e994-4189-bc87-bc699aa62d97
title: Potential Suspicious Registry File Imported Via Reg.EXE
status: test
level: medium
description: Detects the import of '.reg' files from suspicious paths using the 'reg.exe'
    utility
author: frack113, Nasreddine Bencherchali
date: '2022-08-01'
modified: '2023-02-05'
tags:
    - attack.t1112
    - attack.defense-evasion
references:
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/reg-import
falsepositives:
    - Legitimate import of keys
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''73bba97f-a82d-42ce-b315-9182e76c57b1''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \reg.exe
        OriginalFileName: reg.exe
    selection_cli:
        CommandLine|contains: ' import '
    selection_paths:
        CommandLine|contains:
            - C:\Users\
            - '%temp%'
            - '%tmp%'
            - '%appdata%'
            - \AppData\Local\Temp\
            - C:\Windows\Temp\
            - C:\ProgramData\
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:52.622431+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:52.622431+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:52.622441+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:52.622443+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:52.622445+00:00'
