id: e212d415-0e93-435f-9e1a-f29005bb4723
title: Suspicious Remote Child Process From Outlook
status: test
level: high
description: Detects a suspicious child process spawning from Outlook where the image
    is located in a remote location (SMB/WebDav shares).
author: Markus Neis, Nasreddine Bencherchali (Nextron Systems)
date: '2018-12-27'
modified: '2023-02-09'
tags:
    - attack.execution
    - attack.t1059
    - attack.t1202
references:
    - https://github.com/sensepost/ruler
    - https://www.fireeye.com/blog/threat-research/2018/12/overruled-containing-a-potentially-destructive-adversary.html
    - https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=49
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''208748f7-881d-47ac-a29c-07ea84bf691d''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \outlook.exe
        Image|startswith: \\
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:31:19.211699+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:31:19.211699+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:31:19.211721+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:31:19.211735+00:00'
