id: d937b75f-a665-4480-88a5-2f20e9f9b22a
title: Possible Privilege Escalation via Weak Service Permissions
status: test
level: high
description: Detection of sc.exe utility spawning by user with Medium integrity level
    to change service ImagePath or FailureCommand
author: Teymur Kheirkhabarov
date: '2019-10-26'
modified: '2024-12-01'
tags:
    - attack.persistence
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1574.011
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
    - https://pentestlab.blog/2017/03/30/weak-service-permissions/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    scbynonadmin:
        Image|endswith: \sc.exe
        IntegrityLevel:
            - Medium
            - S-1-16-8192
    selection_binpath:
        CommandLine|contains|all:
            - config
            - binPath
    selection_failure:
        CommandLine|contains|all:
            - failure
            - command
    condition: scbynonadmin and 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:59.045843+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:59.045843+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:59.045899+00:00'
        -   source_field: IntegrityLevel
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:20:59.045904+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:59.045907+00:00'
