title: Process Creation Using Sysnative Folder
id: 3c1b5fb0-c72f-45ba-abd1-4d4c353144ab
status: test
level: medium
author: Max Altgelt (Nextron Systems)
description: Detects process creation events that use the Sysnative folder (common
    for CobaltStrike spawns)
references:
    - https://thedfirreport.com/2021/08/29/cobalt-strike-a-defenders-guide/
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1055
date: '2022-08-23'
modified: '2023-12-14'
logsource:
    category: process_creation
    product: windows
detection:
    sysnative:
        CommandLine|contains: :\Windows\Sysnative\
        Image|contains: :\Windows\Sysnative\
    condition: sysnative
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:40:54.977403+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:40:54.977403+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:40:54.977418+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:40:54.977420+00:00'
