id: 480e7e51-e797-47e3-8d72-ebfce65b6d8d
title: Python Spawning Pretty TTY on Windows
status: test
level: high
description: Detects python spawning a pretty tty
author: Nextron Systems
date: '2022-06-03'
tags:
    - attack.execution
    - attack.t1059
references:
    - https://www.volexity.com/blog/2022/06/02/zero-day-exploitation-of-atlassian-confluence/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''899133d5-4d7c-4a7f-94ee-27355c879d90''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - python.exe
            - python3.exe
            - python2.exe
    selection_cli_1:
        CommandLine|contains|all:
            - import pty
            - .spawn(
    selection_cli_2:
        CommandLine|contains: from pty import spawn
    condition: selection_img and 1 of selection_cli_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:35:59.255085+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:35:59.255085+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:35:59.255109+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:35:59.255112+00:00'
