title: HackTool - CrackMapExec Execution Patterns
id: 058f4380-962d-40a5-afce-50207d36d7e2
status: stable
level: high
author: Thomas Patzke
description: Detects various execution patterns of the CrackMapExec pentesting framework
references:
    - https://github.com/byt3bl33d3r/CrackMapExec
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1047
    - attack.t1053
    - attack.t1059.003
    - attack.t1059.001
    - attack.s0106
date: '2020-05-22'
modified: '2023-11-06'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - cmd.exe /Q /c * 1> \\*\*\* 2>&1
            - cmd.exe /C * > \\*\*\* 2>&1
            - cmd.exe /C * > *\Temp\* 2>&1
            - powershell.exe -exec bypass -noni -nop -w 1 -C "
            - 'powershell.exe -noni -nop -w 1 -enc '
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:45:48.720001+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:45:48.720001+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:45:48.720014+00:00'
