id: c9d8b7fd-78e4-44fe-88f6-599135d46d60
title: Security Software Discovery - Linux
status: test
level: low
description: Detects usage of system utilities (only grep and egrep for now) to discover
    security software discovery
author: Daniil Yugoslavskiy, oscd.community
date: '2020-10-19'
modified: '2022-11-27'
tags:
    - attack.discovery
    - attack.t1518.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1518.001/T1518.001.md
falsepositives:
    - Legitimate activities
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith:
            - /grep
            - /egrep
        CommandLine|contains:
            - nessusd
            - td-agent
            - packetbeat
            - filebeat
            - auditbeat
            - osqueryd
            - cbagentd
            - falcond
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:15:51.723928+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-13T20:15:51.723928+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:15:51.723934+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:15:51.723936+00:00'
