id: 5b80a791-ad9b-4b75-bcc1-ad4e1e89c200
title: File With Suspicious Extension Downloaded Via Bitsadmin
status: test
level: high
description: Detects usage of bitsadmin downloading a file with a suspicious extension
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: '2022-06-28'
modified: '2023-05-30'
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.t1197
    - attack.s0190
    - attack.t1036.003
references:
    - https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin
    - https://isc.sans.edu/diary/22264
    - https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \bitsadmin.exe
        OriginalFileName: bitsadmin.exe
    selection_flags:
        CommandLine|contains:
            - ' /transfer '
            - ' /create '
            - ' /addfile '
    selection_extension:
        CommandLine|contains:
            - .7z
            - .asax
            - .ashx
            - .asmx
            - .asp
            - .aspx
            - .bat
            - .cfm
            - .cgi
            - .chm
            - .cmd
            - .dll
            - .gif
            - .jpeg
            - .jpg
            - .jsp
            - .jspx
            - .log
            - .png
            - .ps1
            - .psm1
            - .rar
            - .scf
            - .sct
            - .txt
            - .vbe
            - .vbs
            - .war
            - .wsf
            - .wsh
            - .xll
            - .zip
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:24.099497+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:24.099497+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:24.099505+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:24.099507+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:24.099509+00:00'
