title: Delete Important Scheduled Task
id: dbc1f800-0fe0-4bc0-9c66-292c2abe3f78
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects when adversaries stop services or processes by deleting their
    respective scheduled tasks in order to conduct data destructive activities
references:
    - Internal Research
falsepositives:
    - Unlikely
tags:
    - attack.impact
    - attack.t1489
date: '2022-09-09'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \schtasks.exe
        CommandLine|contains|all:
            - /delete
            - /tn
        CommandLine|contains:
            - \Windows\BitLocker
            - \Windows\ExploitGuard
            - \Windows\SystemRestore\SR
            - \Windows\UpdateOrchestrator\
            - \Windows\Windows Defender\
            - \Windows\WindowsBackup\
            - \Windows\WindowsUpdate\
    condition: selection
related:
    -   id: 9e3cb244-bdb8-4632-8c90-6079c8f4f16d
        type: similar
    -   id: 7595ba94-cf3b-4471-aa03-4f6baa9e5fad
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:45:17.067432+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:45:17.067432+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:45:17.067446+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:45:17.067448+00:00'
