title: Permission Misconfiguration Reconnaissance Via Findstr.EXE
id: 47e4bab7-c626-47dc-967b-255608c9a920
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: 'Detects usage of findstr with the "EVERYONE" or "BUILTIN" keywords.

    This was seen being used in combination with "icacls" and other utilities to spot
    misconfigured files or folders permissions.

    '
references:
    - https://www.absolomb.com/2018-01-26-Windows-Privilege-Escalation-Guide/
falsepositives:
    - Unknown
tags:
    - attack.credential-access
    - attack.t1552.006
date: '2022-08-12'
modified: '2023-11-11'
logsource:
    category: process_creation
    product: windows
detection:
    selection_findstr_img:
        Image|endswith:
            - \find.exe
            - \findstr.exe
        OriginalFileName:
            - FIND.EXE
            - FINDSTR.EXE
    selection_findstr_cli:
        CommandLine|contains:
            - '"Everyone"'
            - '''Everyone'''
            - '"BUILTIN\"'
            - '''BUILTIN\'''
    selection_special:
        CommandLine|contains|all:
            - 'icacls '
            - 'findstr '
            - Everyone
    condition: all of selection_findstr_* or selection_special
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:50:49.248873+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:50:49.248873+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:50:49.248898+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:50:49.248900+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:50:49.248902+00:00'
