id: 99793437-3e16-439b-be0f-078782cf953d
title: Tap Installer Execution
status: test
level: medium
description: Well-known TAP software installation. Possible preparation for data exfiltration
    using tunneling techniques
author: Daniil Yugoslavskiy, Ian Davis, oscd.community
date: '2019-10-24'
modified: '2023-12-11'
tags:
    - attack.exfiltration
    - attack.t1048
references:
    - https://community.openvpn.net/openvpn/wiki/ManagingWindowsTAPDrivers
falsepositives:
    - Legitimate OpenVPN TAP installation
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \tapinstall.exe
    filter_optional_avast:
        Image|contains:
            - :\Program Files\Avast Software\SecureLine VPN\
            - :\Program Files (x86)\Avast Software\SecureLine VPN\
    filter_optional_openvpn:
        Image|contains: :\Program Files\OpenVPN Connect\drivers\tap\
    filter_optional_protonvpn:
        Image|contains: :\Program Files (x86)\Proton Technologies\ProtonVPNTap\installer\
    condition: selection and not 1 of filter_optional_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:35:24.357705+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:35:24.357705+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:35:24.357721+00:00'
