id: c260b6db-48ba-4b4a-a76f-2f67644e99d2
title: HackTool - Covenant PowerShell Launcher
status: test
level: high
description: Detects suspicious command lines used in Covenant luanchers
author: Florian Roth (Nextron Systems), Jonhnathan Ribeiro, oscd.community
date: '2020-06-04'
modified: '2023-02-21'
tags:
    - attack.execution
    - attack.defense-evasion
    - attack.t1059.001
    - attack.t1564.003
references:
    - https://posts.specterops.io/covenant-v0-5-eee0507b85ba
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_1:
        CommandLine|contains|all:
            - -Sta
            - -Nop
            - -Window
            - Hidden
        CommandLine|contains:
            - -Command
            - -EncodedCommand
    selection_2:
        CommandLine|contains:
            - 'sv o (New-Object IO.MemorySteam);sv d '
            - mshta file.hta
            - GruntHTTP
            - -EncodedCommand cwB2ACAAbwAgA
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:30.318933+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:30.318933+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:30.318938+00:00'
