id: 52ff7941-8211-46f9-84f8-9903efb7077d
title: HackTool - PPID Spoofing SelectMyParent Tool Execution
status: test
level: high
description: Detects the use of parent process ID spoofing tools like Didier Stevens
    tool SelectMyParent
author: Florian Roth (Nextron Systems)
date: '2022-07-23'
modified: '2024-11-23'
tags:
    - attack.defense-evasion
    - attack.t1134.004
references:
    - https://pentestlab.blog/2020/02/24/parent-pid-spoofing/
    - https://www.picussecurity.com/resource/blog/how-to-detect-parent-pid-ppid-spoofing-attacks
    - https://www.ired.team/offensive-security/defense-evasion/parent-process-id-ppid-spoofing
    - https://www.virustotal.com/gui/search/filename%253A*spoof*%2520filename%253A*ppid*/files
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \SelectMyParent.exe
        CommandLine|contains:
            - PPID-spoof
            - ppid_spoof
            - spoof-ppid
            - spoof_ppid
            - ppidspoof
            - spoofppid
            - spoofedppid
            - ' -spawnto '
        OriginalFileName|contains:
            - PPID-spoof
            - ppid_spoof
            - spoof-ppid
            - spoof_ppid
            - ppidspoof
            - spoofppid
            - spoofedppid
        Description: SelectMyParent
        Hashes|contains:
            - IMPHASH=04D974875BD225F00902B4CAD9AF3FBC
            - IMPHASH=A782AF154C9E743DDF3F3EB2B8F3D16E
            - IMPHASH=89059503D7FBF470E68F7E63313DA3AD
            - IMPHASH=CA28337632625C8281AB8A130B3D6BAD
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:33:25.813960+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:33:25.813960+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:33:25.814028+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:33:25.814031+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:33:25.814033+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: device.desc
            mapped_at: '2025-11-26T02:33:25.814034+00:00'
        -   source_field: Hashes
            target_table: process_activity
            target_field: process.file.hashes.value
            mapped_at: '2025-11-26T02:33:25.814035+00:00'
