id: 15619216-e993-4721-b590-4c520615a67d
title: Potential Meterpreter/CobaltStrike Activity
status: test
level: high
description: Detects the use of getsystem Meterpreter/Cobalt Strike command by detecting
    a specific service starting
author: Teymur Kheirkhabarov, Ecco, Florian Roth
date: '2019-10-26'
modified: '2023-02-05'
tags:
    - attack.privilege-escalation
    - attack.t1134.001
    - attack.t1134.002
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
    - https://blog.cobaltstrike.com/2014/04/02/what-happens-when-i-type-getsystem/
fields:
    - ComputerName
    - User
    - CommandLine
falsepositives:
    - Commandlines containing components like cmd accidentally
    - Jobs and services started with cmd
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        ParentImage|endswith: \services.exe
    selection_technique_1:
        CommandLine|contains|all:
            - /c
            - echo
            - \pipe\
        CommandLine|contains:
            - cmd
            - '%COMSPEC%'
    selection_technique_2:
        CommandLine|contains|all:
            - rundll32
            - .dll,a
            - '/p:'
    filter_defender:
        CommandLine|contains: MpCmdRun
    condition: selection_img and 1 of selection_technique_* and not 1 of filter_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:06.189528+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:06.189528+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:06.189539+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:06.189542+00:00'
