id: 5a3164f2-b373-4152-93cf-090b13c12d27
title: Potentially Suspicious Child Process Of VsCode
status: test
level: medium
description: Detects uncommon or suspicious child processes spawning from a VsCode
    "code.exe" process. This could indicate an attempt of persistence via VsCode tasks
    or terminal profiles.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-01-26'
modified: '2023-10-25'
tags:
    - attack.execution
    - attack.defense-evasion
    - attack.t1218
    - attack.t1202
references:
    - https://twitter.com/nas_bench/status/1618021838407495681
    - https://twitter.com/nas_bench/status/1618021415852335105
falsepositives:
    - In development environment where VsCode is used heavily. False positives may
        occur when developers use task to compile or execute different types of code.
        Remove or add processes accordingly
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|endswith: \code.exe
    selection_children_images:
        Image|endswith:
            - \calc.exe
            - \regsvr32.exe
            - \rundll32.exe
            - \cscript.exe
            - \wscript.exe
    selection_children_cli:
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
            - \cmd.exe
        CommandLine|contains:
            - Invoke-Expressions
            - IEX
            - Invoke-Command
            - ICM
            - DownloadString
            - rundll32
            - regsvr32
            - wscript
            - cscript
    selection_children_paths:
        Image|contains:
            - :\Users\Public\
            - :\Windows\Temp\
            - :\Temp\
    condition: selection_parent and 1 of selection_children_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:09.444682+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:09.444682+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:09.444693+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:09.444696+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:09.444699+00:00'
