title: Network Sniffing - MacOs
id: adc9bcc4-c39c-4f6b-a711-1884017bf043
status: test
level: informational
author: Alejandro Ortuno, oscd.community
description: 'Detects the usage of tooling to sniff network traffic.

    An adversary may place a network interface into promiscuous mode to passively
    access data in transit over the network, or use span ports to capture a larger
    amount of data.

    '
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1040/T1040.md
falsepositives:
    - Legitimate administration activities
tags:
    - attack.discovery
    - attack.credential-access
    - attack.t1040
date: '2020-10-14'
modified: '2022-11-26'
logsource:
    category: process_creation
    product: macos
detection:
    selection:
        Image|endswith:
            - /tcpdump
            - /tshark
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:34:27.498260+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-12-04T01:34:27.498260+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:34:27.498278+00:00'
