title: Renamed Office Binary Execution
id: 0b0cd537-fc77-4e6e-a973-e53495c1083d
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects the execution of a renamed office binary
references:
    - https://infosec.exchange/@sbousseaden/109542254124022664
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
date: '2022-12-20'
modified: '2023-11-13'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        OriginalFileName:
            - Excel.exe
            - MSACCESS.EXE
            - MSPUB.EXE
            - OneNote.exe
            - OneNoteM.exe
            - OUTLOOK.EXE
            - POWERPNT.EXE
            - WinWord.exe
        Description:
            - Microsoft Access
            - Microsoft Excel
            - Microsoft OneNote
            - Microsoft Outlook
            - Microsoft PowerPoint
            - Microsoft Publisher
            - Microsoft Word
            - Sent to OneNote Tool
    filter_main_legit_names:
        Image|endswith:
            - \EXCEL.exe
            - \excelcnv.exe
            - \MSACCESS.exe
            - \MSPUB.EXE
            - \ONENOTE.EXE
            - \ONENOTEM.EXE
            - \OUTLOOK.EXE
            - \POWERPNT.EXE
            - \WINWORD.exe
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:46:46.099827+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:46:46.099827+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:46:46.099842+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: device.desc
            mapped_at: '2025-12-04T01:46:46.099844+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:46:46.099846+00:00'
