id: c2c76b77-32be-4d1f-82c9-7e544bdfe0eb
title: Potential Suspicious Activity Using SeCEdit
status: test
level: medium
description: Detects potential suspicious behaviour using secedit.exe. Such as exporting
    or modifying the security policy
author: Janantha Marasinghe
date: '2022-11-18'
modified: '2022-12-30'
tags:
    - attack.discovery
    - attack.persistence
    - attack.defense-evasion
    - attack.credential-access
    - attack.privilege-escalation
    - attack.t1562.002
    - attack.t1547.001
    - attack.t1505.005
    - attack.t1556.002
    - attack.t1562
    - attack.t1574.007
    - attack.t1564.002
    - attack.t1546.008
    - attack.t1546.007
    - attack.t1547.014
    - attack.t1547.010
    - attack.t1547.002
    - attack.t1557
    - attack.t1082
references:
    - https://blueteamops.medium.com/secedit-and-i-know-it-595056dee53d
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/secedit
falsepositives:
    - Legitimate administrative use
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \secedit.exe
        OriginalFileName: SeCEdit
    selection_flags_discovery:
        CommandLine|contains|all:
            - /export
            - /cfg
    selection_flags_configure:
        CommandLine|contains|all:
            - /configure
            - /db
    condition: selection_img and (1 of selection_flags_*)
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:32:47.508877+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:32:47.508877+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:32:47.508893+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:32:47.508895+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:32:47.508896+00:00'
