id: 07e3cb2c-0608-410d-be4b-1511cb1a0448
title: Tamper Windows Defender Remove-MpPreference
status: test
level: high
description: Detects attempts to remove Windows Defender configurations using the
    'MpPreference' cmdlet
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-08-05'
tags:
    - attack.defense-evasion
    - attack.t1562.001
references:
    - https://techcommunity.microsoft.com/t5/core-infrastructure-and-security/windows-10-controlled-folder-access-event-search/ba-p/2326088
falsepositives:
    - Legitimate PowerShell scripts
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''ae2bdd58-0681-48ac-be7f-58ab4e593458''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_remove:
        CommandLine|contains: Remove-MpPreference
    selection_tamper:
        CommandLine|contains:
            - '-ControlledFolderAccessProtectedFolders '
            - '-AttackSurfaceReductionRules_Ids '
            - '-AttackSurfaceReductionRules_Actions '
            - '-CheckForSignaturesBeforeRunningScan '
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:24.780762+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:24.780762+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:24.780768+00:00'
