title: HackTool - SharpWSUS/WSUSpendu Execution
id: b0ce780f-10bd-496d-9067-066d23dc3aa5
status: experimental
level: high
author: '@Kostastsale, Nasreddine Bencherchali (Nextron Systems)'
description: 'Detects the execution of SharpWSUS or WSUSpendu, utilities that allow
    for lateral movement through WSUS.

    Windows Server Update Services (WSUS) is a critical component of Windows systems
    and is frequently configured in a way that allows an attacker to circumvent internal
    networking limitations.

    '
references:
    - https://labs.nettitude.com/blog/introducing-sharpwsus/
    - https://github.com/nettitude/SharpWSUS
    - https://web.archive.org/web/20210512154016/https://github.com/AlsidOfficial/WSUSpendu/blob/master/WSUSpendu.ps1
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.lateral-movement
    - attack.t1210
date: '2022-10-07'
modified: '2024-08-23'
logsource:
    category: process_creation
    product: windows
detection:
    selection_wsuspendu_inject:
        CommandLine|contains: ' -Inject '
    selection_wsuspendu_payload:
        CommandLine|contains:
            - ' -PayloadArgs '
            - ' -PayloadFile '
    selection_sharpwsus_commands:
        CommandLine|contains:
            - ' approve '
            - ' create '
            - ' check '
            - ' delete '
    selection_sharpwsus_flags:
        CommandLine|contains:
            - ' /payload:'
            - ' /payload='
            - ' /updateid:'
            - ' /updateid='
    condition: all of selection_wsuspendu_* or all of selection_sharpwsus_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:21.243718+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:21.243718+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:44:21.243757+00:00'
