title: Cloudflared Tunnel Connections Cleanup
id: 7050bba1-1aed-454e-8f73-3f46f09ce56a
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects execution of the "cloudflared" tool with the tunnel "cleanup"
    flag in order to cleanup tunnel connections.
references:
    - https://github.com/cloudflare/cloudflared
    - https://developers.cloudflare.com/cloudflare-one/connections/connect-apps
falsepositives:
    - Legitimate usage of Cloudflared.
tags:
    - attack.command-and-control
    - attack.t1102
    - attack.t1090
    - attack.t1572
date: '2023-05-17'
modified: '2023-12-21'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - ' tunnel '
            - 'cleanup '
        CommandLine|contains:
            - '-config '
            - '-connector-id '
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:38.718308+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:38.718308+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:44:38.718320+00:00'
