id: 54773c5f-f1cc-4703-9126-2f797d96a69d
title: PUA - Advanced Port Scanner Execution
status: test
level: medium
description: Detects the use of Advanced Port Scanner.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2021-12-18'
modified: '2023-02-07'
tags:
    - attack.discovery
    - attack.t1046
    - attack.t1135
references:
    - https://github.com/3CORESec/MAL-CL/tree/master/Descriptors/Other/Advanced%20Port%20Scanner
falsepositives:
    - Legitimate administrative use
    - Tools with similar commandline (very rare)
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|contains: \advanced_port_scanner
        OriginalFileName|contains: advanced_port_scanner
        Description|contains: Advanced Port Scanner
    selection_cli:
        CommandLine|contains|all:
            - /portable
            - /lng
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:30.330161+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:30.330161+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:30.330167+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:30.330168+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: message
            mapped_at: '2025-11-13T20:20:30.330170+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:30.330171+00:00'
