title: Potential RDP Tunneling Via Plink
id: f38ce0b9-5e97-4b47-a211-7dc8d8b871da
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Execution of plink to perform data exfiltration and tunneling
references:
    - https://www.microsoft.com/security/blog/2022/07/26/malicious-iis-extensions-quietly-open-persistent-backdoors-into-servers/
falsepositives:
    - Unknown
tags:
    - attack.command-and-control
    - attack.t1572
date: '2022-08-04'
modified: '2023-01-27'
logsource:
    category: process_creation
    product: windows
detection:
    selection_a:
        Image|endswith: \plink.exe
        CommandLine|contains: :127.0.0.1:3389
    selection_b1:
        Image|endswith: \plink.exe
        CommandLine|contains: :3389
    selection_b2:
        CommandLine|contains:
            - ' -P 443'
            - ' -P 22'
    condition: selection_a or all of selection_b*
related:
    -   id: f7d7ebd5-a016-46e2-9c54-f9932f2d386d
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:41:55.805608+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:41:55.805608+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:41:55.805626+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:41:55.805833+00:00'
