title: Obfuscated IP Via CLI
id: 56d19cb4-6414-4769-9644-1ed35ffbb148
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems), X__Junior (Nextron Systems)
description: Detects usage of an encoded/obfuscated version of an IP address (hex,
    octal, etc.) via command line
references:
    - https://h.43z.one/ipconverter/
    - https://twitter.com/Yasser_Elsnbary/status/1553804135354564608
falsepositives:
    - Unknown
tags:
    - attack.discovery
date: '2022-08-03'
modified: '2023-11-06'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \ping.exe
            - \arp.exe
    selection_ip_1:
        CommandLine|contains:
            - ' 0x'
            - //0x
            - .0x
            - .00x
    selection_ip_2:
        CommandLine|contains|all:
            - http://%
            - '%2e'
    selection_ip_3:
        CommandLine|re|all:
            - https?://[0-9]{1,3}\.[0-9]{1,3}\.0[0-9]{3,4}
            - https?://[0-9]{1,3}\.0[0-9]{3,7}
            - https?://0[0-9]{3,11}
            - https?://(0[0-9]{1,11}\.){3}0[0-9]{1,11}
            - https?://0[0-9]{1,11}
            - ' [0-7]{7,13}'
    filter_main_valid_ip:
        CommandLine|re: https?://((25[0-5]|(2[0-4]|1\d|[1-9])?\d)(\.|\b)){4}
    condition: selection_img and 1 of selection_ip_* and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:46:19.217337+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:46:19.217337+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:46:19.217351+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:46:19.217353+00:00'
