id: dcdbc940-0bff-46b2-95f3-2d73f848e33b
title: Suspicious Spool Service Child Process
status: test
level: high
description: Detects suspicious print spool service (spoolsv.exe) child processes.
author: Justin C. (@endisphotic), @dreadphones (detection), Thomas Patzke (Sigma rule)
date: '2021-07-11'
modified: '2024-12-01'
tags:
    - attack.execution
    - attack.t1203
    - attack.privilege-escalation
    - attack.t1068
references:
    - https://github.com/microsoft/Microsoft-365-Defender-Hunting-Queries/blob/efa17a600b43c897b4b7463cc8541daa1987eeb4/Exploits/Print%20Spooler%20RCE/Suspicious%20Spoolsv%20Child%20Process.md
fields:
    - Image
    - CommandLine
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    spoolsv:
        ParentImage|endswith: \spoolsv.exe
        IntegrityLevel:
            - System
            - S-1-16-16384
    suspicious_unrestricted:
        Image|endswith:
            - \gpupdate.exe
            - \whoami.exe
            - \nltest.exe
            - \taskkill.exe
            - \wmic.exe
            - \taskmgr.exe
            - \sc.exe
            - \findstr.exe
            - \curl.exe
            - \wget.exe
            - \certutil.exe
            - \bitsadmin.exe
            - \accesschk.exe
            - \wevtutil.exe
            - \bcdedit.exe
            - \fsutil.exe
            - \cipher.exe
            - \schtasks.exe
            - \write.exe
            - \wuauclt.exe
            - \systeminfo.exe
            - \reg.exe
            - \query.exe
    suspicious_net:
        Image|endswith:
            - \net.exe
            - \net1.exe
    suspicious_net_filter:
        CommandLine|contains: start
    suspicious_cmd:
        Image|endswith: \cmd.exe
    suspicious_cmd_filter:
        CommandLine|contains:
            - .spl
            - route add
            - program files
    suspicious_netsh:
        Image|endswith: \netsh.exe
    suspicious_netsh_filter:
        CommandLine|contains:
            - add portopening
            - rule name
    suspicious_powershell:
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
    suspicious_powershell_filter:
        CommandLine|contains: .spl
    suspicious_rundll32_img:
        Image|endswith: \rundll32.exe
        OriginalFileName: RUNDLL32.EXE
    suspicious_rundll32_cli:
        CommandLine|endswith: rundll32.exe
    condition: spoolsv and ( suspicious_unrestricted or (suspicious_net and not suspicious_net_filter)
        or (suspicious_cmd and not suspicious_cmd_filter) or (suspicious_netsh and
        not suspicious_netsh_filter) or (suspicious_powershell and not suspicious_powershell_filter)
        or all of suspicious_rundll32_* )
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:38.096672+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:38.096672+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:38.096676+00:00'
        -   source_field: IntegrityLevel
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:20:38.096678+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:38.096679+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:38.096680+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:38.096681+00:00'
