id: c363385c-f75d-4753-a108-c1a8e28bdbda
title: Potential Manage-bde.wsf Abuse To Proxy Execution
status: test
level: high
description: Detects potential abuse of the "manage-bde.wsf" script as a LOLBIN to
    proxy execution
author: oscd.community, Natalia Shornikova, Nasreddine Bencherchali (Nextron Systems)
date: '2020-10-13'
modified: '2023-02-03'
tags:
    - attack.defense-evasion
    - attack.t1216
references:
    - https://lolbas-project.github.io/lolbas/Scripts/Manage-bde/
    - https://gist.github.com/bohops/735edb7494fe1bd1010d67823842b712
    - https://twitter.com/bohops/status/980659399495741441
    - https://twitter.com/JohnLaTwC/status/1223292479270600706
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1216/T1216.md
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_wscript_img:
        Image|endswith: \wscript.exe
        OriginalFileName: wscript.exe
    selection_wscript_cli:
        CommandLine|contains: manage-bde.wsf
    selection_parent:
        ParentImage|endswith:
            - \cscript.exe
            - \wscript.exe
        ParentCommandLine|contains: manage-bde.wsf
    selection_filter_cmd:
        Image|endswith: \cmd.exe
    condition: all of selection_wscript_* or (selection_parent and not selection_filter_cmd)
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:36:07.210020+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:36:07.210020+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:36:07.210033+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:36:07.210038+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:36:07.210039+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:36:07.210040+00:00'
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-11-26T02:36:07.210041+00:00'
