id: 590a5f4c-6c8c-4f10-8307-89afe9453a9d
title: Suspicious Child Process Created as System
status: test
level: high
description: Detection of child processes spawned with SYSTEM privileges by parents
    with LOCAL SERVICE or NETWORK SERVICE accounts
author: Teymur Kheirkhabarov, Roberto Rodriguez (@Cyb3rWard0g), Open Threat Research
    (OTR)
date: '2019-10-26'
modified: '2024-12-01'
tags:
    - attack.privilege-escalation
    - attack.t1134.002
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
    - https://foxglovesecurity.com/2016/09/26/rotten-potato-privilege-escalation-from-service-accounts-to-system/
    - https://github.com/antonioCoco/RogueWinRM
    - https://twitter.com/Cyb3rWard0g/status/1453123054243024897
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
    definition: 'Requirements: ParentUser field needs sysmon >= 13.30'
detection:
    selection:
        ParentUser|contains:
            - AUTHORI
            - AUTORI
        ParentUser|endswith:
            - \NETWORK SERVICE
            - \LOCAL SERVICE
        User|contains:
            - AUTHORI
            - AUTORI
        User|endswith:
            - \SYSTEM
            - \Système
            - \СИСТЕМА
        IntegrityLevel:
            - System
            - S-1-16-16384
    filter_rundll32:
        Image|endswith: \rundll32.exe
        CommandLine|contains: DavSetCookie
    condition: selection and not 1 of filter_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:25:21.123023+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:25:21.123023+00:00'
    detection_fields:
        -   source_field: ParentUser
            target_table: process_activity
            target_field: process.parent_process.session.issuer
            mapped_at: '2025-11-26T02:25:24.888365+00:00'
        -   source_field: User
            target_table: process_activity
            target_field: actor.user.name
            mapped_at: '2025-11-26T02:25:24.888384+00:00'
        -   source_field: IntegrityLevel
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:25:24.888385+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:25:24.888387+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:25:24.888388+00:00'
