id: 74a12f18-505c-4114-8d0b-8448dd5485c6
title: PUA - Nimgrab Execution
status: test
level: high
description: Detects the usage of nimgrab, a tool bundled with the Nim programming
    framework and used for downloading files.
author: frack113
date: '2022-08-28'
modified: '2024-11-23'
tags:
    - attack.command-and-control
    - attack.t1105
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/28d190330fe44de6ff4767fc400cc10fa7cd6540/atomics/T1105/T1105.md
falsepositives:
    - Legitimate use of Nim on a developer systems
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_name:
        Image|endswith: \nimgrab.exe
    selection_hashes:
        Hashes|contains:
            - MD5=2DD44C3C29D667F5C0EF5F9D7C7FFB8B
            - SHA256=F266609E91985F0FE3E31C5E8FAEEEC4FFA5E0322D8B6F15FE69F4C5165B9559
            - IMPHASH=C07FDDD21D123EA9B3A08EEF44AAAC45
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:32:55.169774+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:32:55.169774+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:32:55.169796+00:00'
        -   source_field: Hashes
            target_table: process_activity
            target_field: process.file.hashes.value
            mapped_at: '2025-11-26T02:32:55.169799+00:00'
