id: cc9d3712-6310-4320-b2df-7cb408274d53
title: Rebuild Performance Counter Values Via Lodctr.EXE
status: test
level: medium
description: Detects the execution of "lodctr.exe" to rebuild the performance counter
    registry values. This can be abused by attackers by providing a malicious config
    file to overwrite performance counter configuration to confuse and evade monitoring
    and security solutions.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-06-15'
modified: '2024-03-05'
tags:
    - attack.execution
references:
    - https://learn.microsoft.com/en-us/windows/security/identity-protection/virtual-smart-cards/virtual-smart-card-tpmvscmgr
falsepositives:
    - Legitimate usage by an administrator
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \lodctr.exe
        OriginalFileName: LODCTR.EXE
    selection_cli:
        CommandLine|contains|windash: ' -r'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:30.331989+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:30.331989+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:30.331995+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:30.331996+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:30.331997+00:00'
