id: 145322e4-0fd3-486b-81ca-9addc75736d8
title: Use of UltraVNC Remote Access Software
status: test
level: medium
description: An adversary may use legitimate desktop support and remote access software,to
    establish an interactive command and control channel to target systems within
    networks
author: frack113
date: '2022-10-02'
tags:
    - attack.command-and-control
    - attack.t1219
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/9e5b12c4912c07562aec7500447b11fa3e17e254/atomics/T1219/T1219.md
falsepositives:
    - Legitimate use
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Description: VNCViewer
        Product: UltraVNC VNCViewer
        Company: UltraVNC
        OriginalFileName: VNCViewer.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:32:35.053747+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:32:35.053747+00:00'
    detection_fields:
        -   source_field: Description
            target_table: process_activity
            target_field: device.desc
            mapped_at: '2025-11-26T02:32:35.053766+00:00'
        -   source_field: Product
            target_table: process_activity
            target_field: metadata.product.name
            mapped_at: '2025-11-26T02:32:35.053768+00:00'
        -   source_field: Company
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:32:35.053769+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:32:35.053771+00:00'
