title: CodePage Modification Via MODE.COM To Russian Language
id: 12fbff88-16b5-4b42-9754-cd001a789fb3
status: test
level: medium
author: Joseliyo Sanchez, @Joseliyo_Jstnk
description: 'Detects a CodePage modification using the "mode.com" utility to Russian
    language.

    This behavior has been used by threat actors behind Dharma ransomware.

    '
references:
    - https://learn.microsoft.com/en-us/windows/win32/intl/code-page-identifiers
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/mode
    - https://strontic.github.io/xcyclopedia/library/mode.com-59D1ED51ACB8C3D50F1306FD75F20E99.html
    - https://www.virustotal.com/gui/file/5e75ef02517afd6e8ba6462b19217dc4a5a574abb33d10eb0f2bab49d8d48c22/behavior
falsepositives:
    - Russian speaking people changing the CodePage
tags:
    - attack.defense-evasion
    - attack.t1036
date: '2024-01-17'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \mode.com
        OriginalFileName: MODE.COM
    selection_cli:
        CommandLine|contains|all:
            - ' con '
            - ' cp '
            - ' select='
        CommandLine|endswith:
            - =1251
            - =866
    condition: all of selection_*
related:
    -   id: d48c5ffa-3b02-4c0f-9a9e-3c275650dd0e
        type: derived
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:45:10.811295+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:45:10.811295+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:45:10.811310+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:45:10.811312+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:45:10.811314+00:00'
