title: PowerShell Set-Acl On Windows Folder
id: 0944e002-e3f6-4eb5-bf69-3a3067b53d73
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects PowerShell scripts to set the ACL to a file in the Windows folder
references:
    - https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.security/set-acl?view=powershell-5.1
    - https://github.com/redcanaryco/atomic-red-team/blob/74438b0237d141ee9c99747976447dc884cb1a39/atomics/T1505.005/T1505.005.md
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
date: '2022-10-18'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        OriginalFileName:
            - PowerShell.EXE
            - pwsh.dll
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
    selection_cmdlet:
        CommandLine|contains|all:
            - 'Set-Acl '
            - '-AclObject '
    selection_paths:
        CommandLine|contains:
            - -Path "C:\Windows
            - -Path 'C:\Windows
            - -Path %windir%
            - -Path $env:windir
    selection_permissions:
        CommandLine|contains:
            - FullControl
            - Allow
    condition: all of selection_*
related:
    -   id: cae80281-ef23-44c5-873b-fd48d2666f49
        type: derived
    -   id: bdeb2cff-af74-4094-8426-724dc937f20a
        type: derived
    -   id: 3bf1d859-3a7e-44cb-8809-a99e066d3478
        type: derived
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:50:38.532134+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:50:38.532134+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:50:38.532150+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:50:38.532151+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:50:38.532153+00:00'
