title: PsExec Service Child Process Execution as LOCAL SYSTEM
id: 7c0dcd3d-acf8-4f71-9570-f448b0034f94
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects suspicious launch of the PSEXESVC service on this system and
    a sub process run as LOCAL_SYSTEM (-s), which means that someone remotely started
    a command on this system running it with highest privileges and not only the privileges
    of the login user account (e.g. the administrator account)
references:
    - https://learn.microsoft.com/en-us/sysinternals/downloads/psexec
falsepositives:
    - Users that debug Microsoft Intune issues using the commands mentioned in the
        official documentation; see https://learn.microsoft.com/en-us/mem/intune/apps/intune-management-extension
tags:
    - attack.execution
date: '2022-07-21'
modified: '2023-02-28'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage: C:\Windows\PSEXESVC.exe
        User|contains:
            - AUTHORI
            - AUTORI
    condition: selection
related:
    -   id: fa91cc36-24c9-41ce-b3c8-3bbc3f2f67ba
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:51:04.828559+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:51:04.828559+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:51:04.828574+00:00'
        -   source_field: User
            target_table: process_activity
            target_field: actor.user.name
            mapped_at: '2025-12-04T01:51:04.828576+00:00'
