title: Potential LethalHTA Technique Execution
id: ed5d72a6-f8f4-479d-ba79-02f6a80d7471
status: test
level: high
author: Markus Neis
description: Detects potential LethalHTA technique where the "mshta.exe" is spawned
    by an "svchost.exe" process
references:
    - https://codewhitesec.blogspot.com/2018/07/lethalhta.html
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1218.005
date: '2018-06-07'
modified: '2023-02-07'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \svchost.exe
        Image|endswith: \mshta.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:45:16.166006+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:45:16.166006+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:45:16.166021+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:45:16.166023+00:00'
