id: aa0b3a82-eacc-4ec3-9150-b5a9a3e3f82f
title: Potential Download/Upload Activity Using Type Command
status: test
level: medium
description: Detects usage of the "type" command to download/upload data from WebDAV
    server
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-12-14'
tags:
    - attack.command-and-control
    - attack.t1105
references:
    - https://mr0range.com/a-new-lolbin-using-the-windows-type-command-to-upload-download-files-81d7b6179e22
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_upload:
        CommandLine|contains|all:
            - 'type '
            - ' > \\'
    selection_download:
        CommandLine|contains|all:
            - type \\
            - ' > '
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:58.252255+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:58.252255+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:58.252262+00:00'
