id: 9fb6b26e-7f9e-4517-a48b-8cac4a1b6c60
title: Uncommon FileSystem Load Attempt By Format.com
status: test
level: high
description: 'Detects the execution of format.com with an uncommon filesystem selection
    that could indicate a defense evasion activity in which "format.com" is used to
    load malicious DLL files or other programs.

    '
author: Florian Roth (Nextron Systems)
date: '2022-01-04'
modified: '2024-05-13'
tags:
    - attack.defense-evasion
references:
    - https://twitter.com/0gtweet/status/1477925112561209344
    - https://twitter.com/wdormann/status/1478011052130459653?s=20
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \format.com
        CommandLine|contains: '/fs:'
    filter_main_known_fs:
        CommandLine|contains:
            - /fs:exFAT
            - /fs:FAT
            - /fs:NTFS
            - /fs:ReFS
            - /fs:UDF
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:37.989063+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:37.989063+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:37.989078+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:37.989080+00:00'
