id: 472159c5-31b9-4f56-b794-b766faa8b0a7
title: Suspicious LSASS Access Via MalSecLogon
status: test
level: high
description: Detects suspicious access to LSASS handle via a call trace to "seclogon.dll"
    with a suspicious access right.
author: Samir Bousseaden (original elastic rule), Nasreddine Bencherchali (Nextron
    Systems)
date: '2022-06-29'
tags:
    - attack.credential-access
    - attack.t1003.001
references:
    - https://twitter.com/SBousseaden/status/1541920424635912196
    - https://github.com/elastic/detection-rules/blob/2bc1795f3d7bcc3946452eb4f07ae799a756d94e/rules/windows/credential_access_lsass_handle_via_malseclogon.toml
    - https://splintercod3.blogspot.com/p/the-hidden-side-of-seclogon-part-3.html
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_access
    product: windows
detection:
    selection:
        TargetImage|endswith: \lsass.exe
        SourceImage|endswith: \svchost.exe
        GrantedAccess: '0x14c0'
        CallTrace|contains: seclogon.dll
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: process_access
            mapped_at: '2025-11-26T02:24:15.242493+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:24:15.242493+00:00'
    detection_fields:
        -   source_field: TargetImage
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-11-26T02:24:15.242527+00:00'
        -   source_field: SourceImage
            target_table: process_activity
            target_field: actor.process.name
            mapped_at: '2025-11-26T02:24:15.242532+00:00'
        -   source_field: GrantedAccess
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:24:15.242535+00:00'
        -   source_field: CallTrace
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:24:15.242538+00:00'
