id: aaf46cdc-934e-4284-b329-34aa701e3771
title: Uncommon Child Process Of BgInfo.EXE
status: test
level: medium
description: Detects uncommon child processes of "BgInfo.exe" which could be a sign
    of potential abuse of the binary to proxy execution via external VBScript
author: Nasreddine Bencherchali (Nextron Systems), Beyu Denis, oscd.community
date: '2019-10-26'
modified: '2023-08-16'
tags:
    - attack.execution
    - attack.t1059.005
    - attack.defense-evasion
    - attack.t1218
    - attack.t1202
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Bginfo/
    - https://oddvar.moe/2017/05/18/bypassing-application-whitelisting-with-bginfo/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''811f459f-9231-45d4-959a-0266c6311987''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith:
            - \bginfo.exe
            - \bginfo64.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:28:20.875449+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:28:20.875449+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:28:20.875464+00:00'
