id: 9cfc00b6-bfb7-49ce-9781-ef78503154bb
title: Wlrmdr.EXE Uncommon Argument Or Child Process
status: test
level: medium
description: 'Detects the execution of "Wlrmdr.exe" with the "-u" command line flag
    which allows anything passed to it to be an argument of the ShellExecute API,
    which would allow an attacker to execute arbitrary binaries.

    This detection also focuses on any uncommon child processes spawned from "Wlrmdr.exe"
    as a supplement for those that posses "ParentImage" telemetry.

    '
author: frack113, manasmbellani
date: '2022-02-16'
modified: '2024-03-06'
tags:
    - attack.defense-evasion
    - attack.t1218
references:
    - https://twitter.com/0gtweet/status/1493963591745220608?s=20&t=xUg9DsZhJy1q9bPTUWgeIQ
    - https://lolbas-project.github.io/lolbas/Binaries/Wlrmdr/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|endswith: \wlrmdr.exe
    selection_child_img:
        Image|endswith: \wlrmdr.exe
        OriginalFileName: WLRMNDR.EXE
    selection_child_cli:
        CommandLine|contains|all|windash:
            - '-s '
            - '-f '
            - '-t '
            - '-m '
            - '-a '
            - '-u '
    filter_main_winlogon:
        ParentImage: C:\Windows\System32\winlogon.exe
    filter_main_empty:
        ParentImage:
            - ''
            - '-'
    filter_main_null:
        ParentImage: null
    condition: selection_parent or (all of selection_child_* and not 1 of filter_main_*)
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:32:52.918797+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:32:52.918797+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:32:52.918831+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:32:52.918835+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:32:52.918838+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:32:52.918841+00:00'
