title: Potentially Suspicious Windows App Activity
id: f91ed517-a6ba-471d-9910-b3b4a398c0f3
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects potentially suspicious child process of applications launched
    from inside the WindowsApps directory. This could be a sign of a rogue ".appx"
    package installation/execution
references:
    - https://news.sophos.com/en-us/2021/11/11/bazarloader-call-me-back-attack-abuses-windows-10-apps-mechanism/
    - https://www.sentinelone.com/labs/inside-malicious-windows-apps-for-malware-deployment/
falsepositives:
    - Legitimate packages that make use of external binaries such as Windows Terminal
tags:
    - attack.defense-evasion
date: '2023-01-12'
modified: '2023-08-31'
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|contains: C:\Program Files\WindowsApps\
    selection_susp_img:
        Image|endswith:
            - \cmd.exe
            - \cscript.exe
            - \mshta.exe
            - \powershell.exe
            - \pwsh.exe
            - \regsvr32.exe
            - \rundll32.exe
            - \wscript.exe
    selection_susp_cli:
        CommandLine|contains:
            - cmd /c
            - Invoke-
            - Base64
    filter_optional_terminal:
        ParentImage|contains: :\Program Files\WindowsApps\Microsoft.WindowsTerminal
        ParentImage|endswith: \WindowsTerminal.exe
        Image|endswith:
            - \powershell.exe
            - \cmd.exe
            - \pwsh.exe
    condition: selection_parent and 1 of selection_susp_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:50:31.712592+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:50:31.712592+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:50:31.712624+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:50:31.712632+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:50:31.712635+00:00'
