title: Regsvr32 Execution From Highly Suspicious Location
id: 327ff235-94eb-4f06-b9de-aaee571324be
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects execution of regsvr32 where the DLL is located in a highly suspicious
    locations
references:
    - Internal Research
falsepositives:
    - Unlikely
tags:
    - attack.defense-evasion
    - attack.t1218.010
date: '2023-05-26'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \regsvr32.exe
        OriginalFileName: REGSVR32.EXE
    selection_path_1:
        CommandLine|contains:
            - :\PerfLogs\
            - :\Temp\
            - \Windows\Registration\CRMLog
            - \Windows\System32\com\dmp\
            - \Windows\System32\FxsTmp\
            - \Windows\System32\Microsoft\Crypto\RSA\MachineKeys\
            - \Windows\System32\spool\drivers\color\
            - \Windows\System32\spool\PRINTERS\
            - \Windows\System32\spool\SERVERS\
            - \Windows\System32\Tasks_Migrated\
            - \Windows\System32\Tasks\Microsoft\Windows\SyncCenter\
            - \Windows\SysWOW64\com\dmp\
            - \Windows\SysWOW64\FxsTmp\
            - \Windows\SysWOW64\Tasks\Microsoft\Windows\PLA\System\
            - \Windows\SysWOW64\Tasks\Microsoft\Windows\SyncCenter\
            - \Windows\Tasks\
            - \Windows\Tracing\
    selection_path_2:
        CommandLine|contains:
            - ' "C:\'
            - ' C:\'
            - ' ''C:\'
            - D:\
    selection_exclude_known_dirs:
        CommandLine|contains:
            - C:\Program Files (x86)\
            - C:\Program Files\
            - C:\ProgramData\
            - C:\Users\
            - ' C:\Windows\'
            - ' "C:\Windows\'
            - ' ''C:\Windows\'
    filter_main_empty:
        CommandLine: ''
    filter_main_null:
        CommandLine: null
    condition: selection_img and (selection_path_1 or (selection_path_2 and not selection_exclude_known_dirs))
        and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:45:20.818527+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:45:20.818527+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:45:20.818548+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:45:20.818550+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:45:20.818552+00:00'
