id: 970007b7-ce32-49d0-a4a4-fbef016950bd
title: Potential Configuration And Service Reconnaissance Via Reg.EXE
status: test
level: medium
description: Detects the usage of "reg.exe" in order to query reconnaissance information
    from the registry. Adversaries may interact with the Windows registry to gather
    information about credentials, the system, configuration, and installed software.
author: Timur Zinniatullin, oscd.community
date: '2019-10-21'
modified: '2023-02-05'
tags:
    - attack.discovery
    - attack.t1012
    - attack.t1007
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1012/T1012.md
falsepositives:
    - Discord
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \reg.exe
        OriginalFileName: reg.exe
    selection_flag:
        CommandLine|contains: query
    selection_key:
        CommandLine|contains:
            - currentVersion\windows
            - winlogon\
            - currentVersion\shellServiceObjectDelayLoad
            - currentVersion\run
            - currentVersion\policies\explorer\run
            - currentcontrolset\services
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:19:57.930179+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:19:57.930179+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:19:57.930194+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:19:57.930197+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:19:57.930199+00:00'
