id: 5e6a80c8-2d45-4633-9ef4-fa2671a39c5c
title: Suspicious Parent Double Extension File Execution
status: test
level: high
description: Detect execution of suspicious double extension files in ParentCommandLine
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: '2023-01-06'
modified: '2023-02-28'
tags:
    - attack.defense-evasion
    - attack.t1036.007
references:
    - https://www.virustotal.com/gui/file/7872d8845a332dce517adae9c3389fde5313ff2fed38c2577f3b498da786db68/behavior
    - https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/bluebottle-banks-targeted-africa
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''1cdd9a09-06c9-4769-99ff-626e2b3991b8''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith:
            - .doc.lnk
            - .docx.lnk
            - .xls.lnk
            - .xlsx.lnk
            - .ppt.lnk
            - .pptx.lnk
            - .rtf.lnk
            - .pdf.lnk
            - .txt.lnk
            - .doc.js
            - .docx.js
            - .xls.js
            - .xlsx.js
            - .ppt.js
            - .pptx.js
            - .rtf.js
            - .pdf.js
            - .txt.js
        ParentCommandLine|contains:
            - .doc.lnk
            - .docx.lnk
            - .xls.lnk
            - .xlsx.lnk
            - .ppt.lnk
            - .pptx.lnk
            - .rtf.lnk
            - .pdf.lnk
            - .txt.lnk
            - .doc.js
            - .docx.js
            - .xls.js
            - .xlsx.js
            - .ppt.js
            - .pptx.js
            - .rtf.js
            - .pdf.js
            - .txt.js
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:15.007417+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:15.007417+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:15.007448+00:00'
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-11-13T20:20:15.007452+00:00'
