title: RunDLL32 Spawning Explorer
id: caa06de8-fdef-4c91-826a-7f9e163eef4b
status: test
level: high
author: elhoim, CD_ROM_
description: Detects RunDLL32.exe spawning explorer.exe as child, which is very uncommon,
    often observes Gamarue spawning the explorer.exe process in an unusual way
references:
    - https://redcanary.com/blog/intelligence-insights-november-2021/
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1218.011
date: '2022-04-27'
modified: '2022-05-25'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \rundll32.exe
        Image|endswith: \explorer.exe
    filter:
        ParentCommandLine|contains: \shell32.dll,Control_RunDLL
    condition: selection and not filter
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:48:15.488598+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:48:15.488598+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:48:15.488612+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:48:15.488614+00:00'
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-12-04T01:48:15.488616+00:00'
