id: 0f6da907-5854-4be6-859a-e9958747b0aa
title: Potential DLL Injection Via AccCheckConsole
status: test
level: medium
description: 'Detects the execution "AccCheckConsole" a command-line tool for verifying
    the accessibility implementation of an application''s UI.

    One of the tests that this checker can run are called "verification routine",
    which tests for things like Consistency, Navigation, etc.

    The tool allows a user to provide a DLL that can contain a custom "verification
    routine". An attacker can build such DLLs and pass it via the CLI, which would
    then be loaded in the context of the "AccCheckConsole" utility.

    '
author: Florian Roth (Nextron Systems)
date: '2022-01-06'
modified: '2024-08-29'
tags:
    - attack.execution
    - detection.threat-hunting
references:
    - https://gist.github.com/bohops/2444129419c8acf837aedda5f0e7f340
    - https://twitter.com/bohops/status/1477717351017680899?s=12
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/AccCheckConsole/
falsepositives:
    - Legitimate use of the UI Accessibility Checker
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \AccCheckConsole.exe
        OriginalFileName: AccCheckConsole.exe
    selection_cli:
        CommandLine|contains:
            - ' -hwnd'
            - ' -process '
            - ' -window '
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:49.514655+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:49.514655+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:49.514660+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:49.514662+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:49.514663+00:00'
