title: Sdclt Child Processes
id: da2738f2-fadb-4394-afa7-0a0674885afa
status: test
level: medium
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
description: A General detection for sdclt spawning new processes. This could be an
    indicator of sdclt being used for bypass UAC techniques.
references:
    - https://github.com/OTRF/detection-hackathon-apt29/issues/6
    - https://github.com/OTRF/ThreatHunter-Playbook/blob/2d4257f630f4c9770f78d0c1df059f891ffc3fec/docs/evals/apt29/detections/3.B.2_C36B49B5-DF58-4A34-9FE9-56189B9DEFEA.md
falsepositives:
    - Unknown
tags:
    - attack.privilege-escalation
    - attack.t1548.002
date: '2020-05-02'
modified: '2021-11-27'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \sdclt.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:46:24.081689+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:46:24.081689+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:46:24.081702+00:00'
