id: 4b60e6f2-bf39-47b4-b4ea-398e33cfe253
title: CMSTP UAC Bypass via COM Object Access
status: stable
level: high
description: Detects UAC Bypass Attempt Using Microsoft Connection Manager Profile
    Installer Autoelevate-capable COM Objects (e.g. UACMe ID of 41, 43, 58 or 65)
author: Nik Seetharaman, Christian Burkard (Nextron Systems)
date: '2019-07-31'
modified: '2024-12-01'
tags:
    - attack.execution
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
    - attack.t1218.003
    - attack.g0069
    - car.2019-04-001
references:
    - https://web.archive.org/web/20190720093911/http://www.endurant.io/cmstp/detecting-cmstp-enabled-code-execution-and-uac-bypass-with-sysmon/
    - https://twitter.com/hFireF0X/status/897640081053364225
    - https://medium.com/falconforce/falconfriday-detecting-uac-bypasses-0xff16-86c2a9107abf
    - https://github.com/hfiref0x/UACME
falsepositives:
    - Legitimate CMSTP use (unlikely in modern enterprise environments)
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \DllHost.exe
        ParentCommandLine|contains:
            - ' /Processid:{3E5FC7F9-9A51-4367-9063-A120244FBEC7}'
            - ' /Processid:{3E000D72-A845-4CD9-BD83-80C07C3B881F}'
            - ' /Processid:{BD54C901-076B-434E-B6C7-17C531F4AB41}'
            - ' /Processid:{D2E7041B-2927-42FB-8E9F-7CE93B6DC937}'
            - ' /Processid:{E9495B87-D950-4AB5-87A5-FF6D70BF3E90}'
        IntegrityLevel:
            - High
            - System
            - S-1-16-16384
            - S-1-16-12288
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:58.271111+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:58.271111+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:58.271123+00:00'
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-11-13T20:20:58.271125+00:00'
        -   source_field: IntegrityLevel
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:20:58.271126+00:00'
