title: User Added To Root/Sudoers Group Using Usermod
id: 6a50f16c-3b7b-42d1-b081-0fdd3ba70a73
status: test
level: medium
author: TuanLe (GTSC)
description: Detects usage of the "usermod" binary to add users add users to the root
    or suoders groups
references:
    - https://pberba.github.io/security/2021/11/23/linux-threat-hunting-for-persistence-account-creation-manipulation/
    - https://www.configserverfirewall.com/ubuntu-linux/ubuntu-add-user-to-root-group/
falsepositives:
    - Legitimate administrator activities
tags:
    - attack.privilege-escalation
    - attack.persistence
date: '2022-12-21'
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith: /usermod
        CommandLine|contains:
            - -aG root
            - -aG sudoers
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:27.738882+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:27.738882+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:36:27.738901+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:36:27.738903+00:00'
