id: fadb84f0-4e84-4f6d-a1ce-9ef2bffb6ccd
title: Cloudflared Portable Execution
status: test
level: medium
description: 'Detects the execution of the "cloudflared" binary from a non standard
    location.

    '
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-12-20'
tags:
    - attack.command-and-control
    - attack.t1090.001
references:
    - https://developers.cloudflare.com/cloudflare-one/connections/connect-networks/do-more-with-tunnels/trycloudflare/
    - https://github.com/cloudflare/cloudflared
    - https://www.intrinsec.com/akira_ransomware/
    - https://www.guidepointsecurity.com/blog/tunnel-vision-cloudflared-abused-in-the-wild/
    - https://github.com/cloudflare/cloudflared/releases
falsepositives:
    - Legitimate usage of Cloudflared portable versions
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \cloudflared.exe
    filter_main_admin_location:
        Image|contains:
            - :\Program Files (x86)\cloudflared\
            - :\Program Files\cloudflared\
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:38.649281+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:38.649281+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:38.649290+00:00'
