id: 6345b048-8441-43a7-9bed-541133633d7a
title: ManageEngine Endpoint Central Dctask64.EXE Potential Abuse
status: test
level: high
description: 'Detects the execution of "dctask64.exe", a signed binary by ZOHO Corporation
    part of ManageEngine Endpoint Central.

    This binary can be abused for DLL injection, arbitrary command and process execution.

    '
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: '2020-01-28'
modified: '2024-04-22'
tags:
    - attack.defense-evasion
    - attack.t1055.001
references:
    - https://twitter.com/gN3mes1s/status/1222088214581825540
    - https://twitter.com/gN3mes1s/status/1222095963789111296
    - https://twitter.com/gN3mes1s/status/1222095371175911424
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \dctask64.exe
        Hashes|contains:
            - 6834B1B94E49701D77CCB3C0895E1AFD
            - 1BB6F93B129F398C7C4A76BB97450BBA
            - FAA2AC19875FADE461C8D89DCF2710A3
            - F1039CED4B91572AB7847D26032E6BBF
    selection_cli:
        CommandLine|contains:
            - ' executecmd64 '
            - ' invokeexe '
            - ' injectDll '
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:31:11.308502+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:31:11.308502+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:31:11.308522+00:00'
        -   source_field: Hashes
            target_table: process_activity
            target_field: process.file.hashes.value
            mapped_at: '2025-11-26T02:31:11.308523+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:31:11.308525+00:00'
