id: 4809c683-059b-4935-879d-36835986f8cf
title: System Information Discovery Using System_Profiler
status: test
level: medium
description: 'Detects the execution of "system_profiler" with specific "Data Types"
    that have been seen being used by threat actors and malware. It provides system
    hardware and software configuration information.

    This process is primarily used for system information discovery. However, "system_profiler"
    can also be used to determine if virtualization software is being run for defense
    evasion purposes.

    '
author: Stephen Lincoln `@slincoln_aiq` (AttackIQ)
date: '2024-01-02'
tags:
    - attack.discovery
    - attack.defense-evasion
    - attack.t1082
    - attack.t1497.001
references:
    - https://www.trendmicro.com/en_za/research/20/k/new-macos-backdoor-connected-to-oceanlotus-surfaces.html
    - https://www.sentinelone.com/wp-content/uploads/pdf-gen/1630910064/20-common-tools-techniques-used-by-macos-threat-actors-malware.pdf
    - https://ss64.com/mac/system_profiler.html
    - https://objective-see.org/blog/blog_0x62.html
    - https://www.welivesecurity.com/2019/04/09/oceanlotus-macos-malware-update/
    - https://gist.github.com/nasbench/9a1ba4bc7094ea1b47bc42bf172961af
falsepositives:
    - Legitimate administrative activities
taxonomy: sigma
logsource:
    category: process_creation
    product: macos
detection:
    selection_img:
        Image|endswith: /system_profiler
        CommandLine|contains: system_profiler
    selection_cmd:
        CommandLine|contains:
            - SPApplicationsDataType
            - SPHardwareDataType
            - SPNetworkDataType
            - SPUSBDataType
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:13:16.469482+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-11-26T02:13:16.469482+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:13:16.469497+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:13:16.469499+00:00'
