id: 91a2c315-9ee6-4052-a853-6f6a8238f90d
title: Findstr GPP Passwords
status: test
level: high
description: Look for the encrypted cpassword value within Group Policy Preference
    files on the Domain Controller. This value can be decrypted with gpp-decrypt.
author: frack113
date: '2021-12-27'
modified: '2023-11-11'
tags:
    - attack.credential-access
    - attack.t1552.006
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.006/T1552.006.md#atomic-test-1---gpp-passwords-findstr
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \find.exe
            - \findstr.exe
        OriginalFileName:
            - FIND.EXE
            - FINDSTR.EXE
    selection_cli:
        CommandLine|contains|all:
            - cpassword
            - \sysvol\
            - .xml
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:33:33.586647+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:33:33.586647+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:33:33.586659+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:33:33.586660+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:33:33.586662+00:00'
