id: 85c312b7-f44d-4a51-a024-d671c40b49fc
title: Service StartupType Change Via Sc.EXE
status: test
level: medium
description: Detect the use of "sc.exe" to change the startup type of a service to
    "disabled" or "demand"
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-08-01'
modified: '2023-03-04'
tags:
    - attack.execution
    - attack.defense-evasion
    - attack.t1562.001
references:
    - https://www.virustotal.com/gui/file/38283b775552da8981452941ea74191aa0d203edd3f61fb2dee7b0aea3514955
falsepositives:
    - False positives may occur with troubleshooting scripts
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \sc.exe
        OriginalFileName: sc.exe
    selection_cli:
        CommandLine|contains|all:
            - ' config '
            - start
        CommandLine|contains:
            - disabled
            - demand
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:26:11.851607+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:26:11.851607+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:26:11.851647+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:26:11.851652+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:26:11.851656+00:00'
