id: 7a01183d-71a2-46ad-ad5c-acd989ac1793
title: UAC Bypass Abusing Winsat Path Parsing - Process
status: test
level: high
description: Detects the pattern of UAC Bypass using a path parsing issue in winsat.exe
    (UACMe 52)
author: Christian Burkard (Nextron Systems)
date: '2021-08-30'
modified: '2024-12-01'
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
references:
    - https://github.com/hfiref0x/UACME
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        IntegrityLevel:
            - High
            - System
            - S-1-16-16384
            - S-1-16-12288
        ParentImage|endswith: \AppData\Local\Temp\system32\winsat.exe
        ParentCommandLine|contains: C:\Windows \system32\winsat.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:26:55.940696+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:26:55.940696+00:00'
    detection_fields:
        -   source_field: IntegrityLevel
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:26:55.940728+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:26:55.940731+00:00'
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-11-26T02:26:55.940735+00:00'
