id: 526be59f-a573-4eea-b5f7-f0973207634d
title: New Process Created Via Wmic.EXE
status: test
level: medium
description: Detects new process creation using WMIC via the "process call create"
    flag
author: Michael Haag, Florian Roth (Nextron Systems), juju4, oscd.community
date: '2019-01-16'
modified: '2023-02-14'
tags:
    - attack.execution
    - attack.t1047
    - car.2016-03-002
references:
    - https://www.sans.org/blog/wmic-for-incident-response/
    - https://github.com/redcanaryco/atomic-red-team/blob/84215139ee5127f8e3a117e063b604812bd71928/atomics/T1047/T1047.md#atomic-test-5---wmi-execute-local-process
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''3c89a1e8-0fba-449e-8f1b-8409d6267ec8''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \wmic.exe
        OriginalFileName: wmic.exe
    selection_cli:
        CommandLine|contains|all:
            - process
            - call
            - create
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:36:25.399887+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:36:25.399887+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:36:25.399916+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:36:25.399920+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:36:25.399923+00:00'
