id: 38646daa-e78f-4ace-9de0-55547b2d30da
title: PUA - Seatbelt Execution
status: test
level: high
description: Detects the execution of the PUA/Recon tool Seatbelt via PE information
    of command line parameters
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-10-18'
modified: '2023-02-04'
tags:
    - attack.discovery
    - attack.t1526
    - attack.t1087
    - attack.t1083
references:
    - https://github.com/GhostPack/Seatbelt
    - https://www.bluetangle.dev/2022/08/fastening-seatbelt-on-threat-hunting.html
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \Seatbelt.exe
        OriginalFileName: Seatbelt.exe
        Description: Seatbelt
        CommandLine|contains:
            - ' DpapiMasterKeys'
            - ' InterestingProcesses'
            - ' InterestingFiles'
            - ' CertificateThumbprints'
            - ' ChromiumBookmarks'
            - ' ChromiumHistory'
            - ' ChromiumPresence'
            - ' CloudCredentials'
            - ' CredEnum'
            - ' CredGuard'
            - ' FirefoxHistory'
            - ' ProcessCreationEvents'
    selection_group_list:
        CommandLine|contains:
            - ' -group=misc'
            - ' -group=remote'
            - ' -group=chromium'
            - ' -group=slack'
            - ' -group=system'
            - ' -group=user'
            - ' -group=all'
    selection_group_output:
        CommandLine|contains: ' -outputfile='
    condition: selection_img or all of selection_group_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:15.023429+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:15.023429+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:15.023439+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:15.023441+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: message
            mapped_at: '2025-11-13T20:20:15.023442+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:15.023443+00:00'
