id: 9847f263-4a81-424f-970c-875dab15b79b
title: Suspicious TSCON Start as SYSTEM
status: test
level: high
description: Detects a tscon.exe start as LOCAL SYSTEM
author: Florian Roth (Nextron Systems)
date: '2018-03-17'
modified: '2022-05-27'
tags:
    - attack.command-and-control
    - attack.t1219
references:
    - http://www.korznikov.com/2017/03/0-day-or-feature-privilege-escalation.html
    - https://medium.com/@networksecurity/rdp-hijacking-how-to-hijack-rds-and-remoteapp-sessions-transparently-to-move-through-an-da2a1e73a5f6
    - https://www.ired.team/offensive-security/lateral-movement/t1076-rdp-hijacking-for-lateral-movement
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        User|contains:
            - AUTHORI
            - AUTORI
        Image|endswith: \tscon.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:31:10.866059+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:31:10.866059+00:00'
    detection_fields:
        -   source_field: User
            target_table: process_activity
            target_field: actor.user.name
            mapped_at: '2025-11-26T02:31:10.866072+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:31:10.866074+00:00'
