id: 99c8be4f-3087-4f9f-9c24-8c7e257b442e
title: Setup16.EXE Execution With Custom .Lst File
status: experimental
level: medium
description: 'Detects the execution of "Setup16.EXE" and old installation utility
    with a custom ".lst" file.

    These ".lst" file can contain references to external program that "Setup16.EXE"
    will execute.

    Attackers and adversaries might leverage this as a living of the land utility.

    '
author: frack113
date: '2024-12-01'
tags:
    - attack.defense-evasion
    - attack.t1574.005
references:
    - https://www.hexacorn.com/blog/2024/10/12/the-sweet16-the-oldbin-lolbin-called-setup16-exe/
falsepositives:
    - On modern Windows system, the "Setup16" utility is practically never used, hence
        false positive should be very rare.
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage: C:\Windows\SysWOW64\setup16.exe
        ParentCommandLine|contains: ' -m '
    filter_optional_valid_path:
        Image|startswith: C:\~MSSETUP.T\
    condition: selection and not 1 of filter_optional_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:31:49.895719+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:31:49.895719+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:31:49.895739+00:00'
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-11-26T02:31:49.895741+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:31:49.895742+00:00'
