title: Malicious Windows Script Components File Execution by TAEF Detection
id: 634b00d5-ccc3-4a06-ae3b-0ec8444dd51b
status: test
level: low
author: Agro (@agro_sev) oscd.community
description: 'Windows Test Authoring and Execution Framework (TAEF) framework allows
    you to run automation by executing tests files written on different languages
    (C, C#, Microsoft COM Scripting interfaces

    Adversaries may execute malicious code (such as WSC file with VBScript, dll and
    so on) directly by running te.exe

    '
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Te/
    - https://twitter.com/pabraeken/status/993298228840992768
    - https://learn.microsoft.com/en-us/windows-hardware/drivers/taef/
falsepositives:
    - It's not an uncommon to use te.exe directly to execute legal TAEF tests
tags:
    - attack.defense-evasion
    - attack.t1218
date: '2020-10-13'
modified: '2021-11-27'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \te.exe
        ParentImage|endswith: \te.exe
        OriginalFileName: \te.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:42:11.224021+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:42:11.224021+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:42:11.224046+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:42:11.224049+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:42:11.224050+00:00'
