id: 37db85d1-b089-490a-a59a-c7b6f984f480
title: Sysmon Discovery Via Default Driver Altitude Using Findstr.EXE
status: test
level: high
description: Detects usage of "findstr" with the argument "385201". Which could indicate
    potential discovery of an installed Sysinternals Sysmon service using the default
    driver altitude (even if the name is changed).
author: frack113
date: '2021-12-16'
modified: '2023-11-14'
tags:
    - attack.discovery
    - attack.t1518.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1518.001/T1518.001.md#atomic-test-5---security-software-discovery---sysmon-service
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \find.exe
            - \findstr.exe
        OriginalFileName:
            - FIND.EXE
            - FINDSTR.EXE
    selection_cli:
        CommandLine|contains: ' 385201'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:19:52.652508+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:19:52.652508+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:19:52.652517+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:19:52.652519+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:19:52.652522+00:00'
