id: 75d0a94e-6252-448d-a7be-d953dff527bb
title: Remote XSL Execution Via Msxsl.EXE
status: test
level: high
description: Detects the execution of the "msxsl" binary with an "http" keyword in
    the command line. This might indicate a potential remote execution of XSL files.
author: Swachchhanda Shrawan Poudel
date: '2023-11-09'
tags:
    - attack.defense-evasion
    - attack.t1220
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1220/T1220.md
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Msxsl/
falsepositives:
    - Msxsl is not installed by default and is deprecated, so unlikely on most systems.
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \msxsl.exe
        CommandLine|contains: http
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:30:22.184046+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:30:22.184046+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:30:22.184063+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:30:22.184065+00:00'
