title: Lolbin Runexehelper Use As Proxy
id: cd71385d-fd9b-4691-9b98-2b1f7e508714
status: test
level: medium
author: frack113
description: Detect usage of the "runexehelper.exe" binary as a proxy to launch other
    programs
references:
    - https://twitter.com/0gtweet/status/1206692239839289344
    - https://lolbas-project.github.io/lolbas/Binaries/Runexehelper/
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1218
date: '2022-12-29'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \runexehelper.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:49:13.157900+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:49:13.157900+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:49:13.157912+00:00'
