title: Disabled Volume Snapshots
id: dee4af55-1f22-4e1d-a9d2-4bdc7ecb472a
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects commands that temporarily turn off Volume Snapshots
references:
    - https://twitter.com/0gtweet/status/1354766164166115331
falsepositives:
    - Legitimate administration
tags:
    - attack.defense-evasion
    - attack.t1562.001
date: '2021-01-28'
modified: '2023-12-15'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - \Services\VSS\Diag
            - /d Disabled
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:42:24.419624+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:42:24.419624+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:42:24.419642+00:00'
