title: Suspicious Invoke-WebRequest Execution
id: 5e3cc4d8-3e68-43db-8656-eaaeefdec9cc
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects a suspicious call to Invoke-WebRequest cmdlet where the and output
    is located in a suspicious location
references:
    - https://www.sentinelone.com/blog/living-off-windows-defender-lockbit-ransomware-sideloads-cobalt-strike-through-microsoft-security-tool/
falsepositives:
    - Unknown
tags:
    - attack.command-and-control
    - attack.t1105
date: '2022-08-02'
modified: '2024-02-23'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
        OriginalFileName:
            - PowerShell.EXE
            - pwsh.dll
    selection_commands:
        CommandLine|contains:
            - 'curl '
            - Invoke-WebRequest
            - 'iwr '
            - 'wget '
    selection_flags:
        CommandLine|contains:
            - ' -ur'
            - ' -o'
    selection_susp_locations:
        CommandLine|contains:
            - \AppData\
            - \Desktop\
            - \Temp\
            - \Users\Public\
            - '%AppData%'
            - '%Public%'
            - '%Temp%'
            - '%tmp%'
            - :\Windows\
    condition: all of selection_*
related:
    -   id: e218595b-bbe7-4ee5-8a96-f32a24ad3468
        type: derived
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:43:37.676502+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:43:37.676502+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:43:37.676517+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:43:37.676519+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:43:37.676520+00:00'
