id: d81871ef-5738-47ab-9797-7a9c90cd4bfb
title: Php Inline Command Execution
status: test
level: medium
description: Detects execution of php using the "-r" flag. This is could be used as
    a way to launch a reverse shell or execute live php code.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-01-02'
tags:
    - attack.execution
    - attack.t1059
references:
    - https://www.php.net/manual/en/features.commandline.php
    - https://www.revshells.com/
    - https://pentestmonkey.net/cheat-sheet/shells/reverse-shell-cheat-sheet
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \php.exe
        OriginalFileName: php.exe
    selection_cli:
        CommandLine|contains: ' -r'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:19:56.661867+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:19:56.661867+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:19:56.661881+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:19:56.661882+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:19:56.661884+00:00'
