id: 90d50722-0483-4065-8e35-57efaadd354d
title: Arbitrary MSI Download Via Devinit.EXE
status: test
level: medium
description: Detects a certain command line flag combination used by "devinit.exe",
    which can be abused as a LOLBIN to download arbitrary MSI packages on a Windows
    system
author: Florian Roth (Nextron Systems)
date: '2022-01-11'
modified: '2023-04-06'
tags:
    - attack.execution
    - attack.defense-evasion
    - attack.t1218
references:
    - https://twitter.com/mrd0x/status/1460815932402679809
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Devinit/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - ' -t msi-install '
            - ' -i http'
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:49.496348+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:49.496348+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:49.496357+00:00'
