id: f8be3e82-46a3-4e4e-ada5-8e538ae8b9c9
title: Credential Dumping Activity By Python Based Tool
status: stable
level: high
description: Detects LSASS process access for potential credential dumping by a Python-like
    tool such as LaZagne or Pypykatz.
author: Bhabesh Raj, Jonhnathan Ribeiro
date: '2023-11-27'
modified: '2023-11-29'
tags:
    - attack.credential-access
    - attack.t1003.001
    - attack.s0349
references:
    - https://twitter.com/bh4b3sh/status/1303674603819081728
    - https://github.com/skelsec/pypykatz
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''4b9a8556-99c4-470b-a40c-9c8d02c77ed0''),
    type=<SigmaRelatedType.OBSOLETE: 4>), SigmaRelatedItem(id=UUID(''7186e989-4ed7-4f4e-a656-4674b9e3e48b''),
    type=<SigmaRelatedType.OBSOLETE: 4>)])'
taxonomy: sigma
logsource:
    category: process_access
    product: windows
detection:
    selection:
        TargetImage|endswith: \lsass.exe
        CallTrace|contains|all:
            - _ctypes.pyd+
            - :\Windows\System32\KERNELBASE.dll+
            - :\Windows\SYSTEM32\ntdll.dll+
        CallTrace|contains:
            - python27.dll+
            - python3*.dll+
        GrantedAccess: '0x1FFFFF'
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_access
            mapped_at: '2025-11-13T20:18:47.658732+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:18:47.658732+00:00'
    detection_fields:
        -   source_field: TargetImage
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-11-13T20:18:49.687757+00:00'
        -   source_field: CallTrace
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:18:49.687789+00:00'
        -   source_field: GrantedAccess
            target_table: process_activity
            target_field: requested_permissions
            mapped_at: '2025-11-13T20:18:49.687807+00:00'
