id: f4a623c2-4ef5-4c33-b811-0642f702c9f1
title: Visual Studio Code Tunnel Shell Execution
status: test
level: medium
description: Detects the execution of a shell (powershell, bash, wsl...) via Visual
    Studio Code tunnel. Attackers can abuse this functionality to establish a C2 channel
    and execute arbitrary commands on the system.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-10-25'
tags:
    - attack.command-and-control
    - attack.t1071.001
references:
    - https://ipfyx.fr/post/visual-studio-code-tunnel/
    - https://badoption.eu/blog/2023/01/31/code_c2.html
    - https://code.visualstudio.com/docs/remote/tunnels
falsepositives:
    - Legitimate use of Visual Studio Code tunnel and running code from there
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|contains: \servers\Stable-
        ParentImage|endswith: \server\node.exe
        ParentCommandLine|contains: .vscode-server
    selection_child_1:
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
        CommandLine|contains: \terminal\browser\media\shellIntegration.ps1
    selection_child_2:
        Image|endswith:
            - \wsl.exe
            - \bash.exe
    condition: selection_parent and 1 of selection_child_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:38.105783+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:38.105783+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:38.105788+00:00'
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-11-13T20:20:38.105790+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:38.105791+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:38.105796+00:00'
