title: Suspicious PowerShell Encoded Command Patterns
id: b9d9cc83-380b-4ba3-8d8f-60c0e7e2930c
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects PowerShell command line patterns in combincation with encoded
    commands that often appear in malware infection chains
references:
    - https://app.any.run/tasks/b9040c63-c140-479b-ad59-f1bb56ce7a97/
falsepositives:
    - Other tools that work with encoded scripts in the command line instead of script
        files
tags:
    - attack.execution
    - attack.t1059.001
date: '2022-05-24'
modified: '2023-01-05'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
        OriginalFileName:
            - PowerShell.Exe
            - pwsh.dll
    selection_flags:
        CommandLine|contains:
            - ' -e '
            - ' -en '
            - ' -enc '
            - ' -enco'
    selection_encoded:
        CommandLine|contains:
            - ' JAB'
            - ' SUVYI'
            - ' SQBFAFgA'
            - ' aWV4I'
            - ' IAB'
            - ' PAA'
            - ' aQBlAHgA'
    filter_gcworker:
        ParentImage|contains:
            - C:\Packages\Plugins\Microsoft.GuestConfiguration.ConfigurationforWindows\
            - \gc_worker.exe
    condition: all of selection_* and not 1 of filter_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:46:17.825610+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:46:17.825610+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:46:17.825623+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:46:17.825624+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:46:17.825626+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:46:17.825627+00:00'
