title: Potential Command Line Path Traversal Evasion Attempt
id: 1327381e-6ab0-4f38-b583-4c1b8346a56b
status: test
level: medium
author: Christian Burkard (Nextron Systems)
description: Detects potential evasion or obfuscation attempts using bogus path traversal
    via the commandline
references:
    - https://twitter.com/hexacorn/status/1448037865435320323
    - https://twitter.com/Gal_B1t/status/1062971006078345217
falsepositives:
    - Google Drive
    - Citrix
tags:
    - attack.defense-evasion
    - attack.t1036
date: '2021-10-26'
modified: '2023-03-29'
logsource:
    category: process_creation
    product: windows
detection:
    selection_1:
        Image|contains: \Windows\
        CommandLine|contains:
            - \..\Windows\
            - \..\System32\
            - \..\..\
    selection_2:
        CommandLine|contains: .exe\..\
    filter_optional_google_drive:
        CommandLine|contains: \Google\Drive\googledrivesync.exe\..\
    filter_optional_citrix:
        CommandLine|contains: \Citrix\Virtual Smart Card\Citrix.Authentication.VirtualSmartcard.Launcher.exe\..\
    condition: 1 of selection_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:43:15.599497+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:43:15.599497+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:43:15.599514+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:43:15.599516+00:00'
