id: a238b5d0-ce2d-4414-a676-7a531b3d13d6
title: ETW Trace Evasion Activity
status: test
level: high
description: 'Detects command line activity that tries to clear or disable any ETW
    trace log which could be a sign of logging evasion.

    '
author: '@neu5ron, Florian Roth (Nextron Systems), Jonhnathan Ribeiro, oscd.community'
date: '2019-03-22'
modified: '2022-06-28'
tags:
    - attack.defense-evasion
    - attack.t1070
    - attack.t1562.006
    - car.2016-04-002
references:
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/wevtutil
    - https://abuse.io/lockergoga.txt
    - https://medium.com/palantir/tampering-with-windows-event-tracing-background-offense-and-defense-4be7ac62ac63
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_clear_1:
        CommandLine|contains|all:
            - cl
            - /Trace
    selection_clear_2:
        CommandLine|contains|all:
            - clear-log
            - /Trace
    selection_disable_1:
        CommandLine|contains|all:
            - sl
            - /e:false
    selection_disable_2:
        CommandLine|contains|all:
            - set-log
            - /e:false
    selection_disable_3:
        CommandLine|contains|all:
            - logman
            - update
            - trace
            - --p
            - -ets
    selection_pwsh_remove:
        CommandLine|contains: Remove-EtwTraceProvider
    selection_pwsh_set:
        CommandLine|contains|all:
            - Set-EtwTraceProvider
            - '0x11'
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:03.216581+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:03.216581+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:03.216593+00:00'
