title: Suspicious Persistence Via VMwareToolBoxCmd.EXE VM State Change Script
id: 236d8e89-ed95-4789-a982-36f4643738ba
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects execution of the "VMwareToolBoxCmd.exe" with the "script" and
    "set" flag to setup a specific script that's located in a potentially suspicious
    location to run for a specific VM state
references:
    - https://bohops.com/2021/10/08/analyzing-and-detecting-a-vmtools-persistence-technique/
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.persistence
    - attack.t1059
date: '2023-06-14'
logsource:
    category: process_creation
    product: windows
detection:
    selection_bin_img:
        Image|endswith: \VMwareToolBoxCmd.exe
        OriginalFileName: toolbox-cmd.exe
    selection_bin_cli:
        CommandLine|contains|all:
            - ' script '
            - ' set '
    selection_susp_paths:
        CommandLine|contains:
            - :\PerfLogs\
            - :\Temp\
            - :\Windows\System32\Tasks\
            - :\Windows\Tasks\
            - :\Windows\Temp\
            - \AppData\Local\Temp
    condition: all of selection_*
related:
    -   id: 7aa4e81a-a65c-4e10-9f81-b200eb229d7d
        type: derived
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:48:40.359974+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:48:40.359974+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:48:40.359993+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:48:40.359995+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:48:40.359997+00:00'
