id: bafac3d6-7de9-4dd9-8874-4a1194b493ed
title: Abusing Print Executable
status: test
level: medium
description: Attackers can use print.exe for remote file copy
author: Furkan CALISKAN, @caliskanfurkan_, @oscd_initiative
date: '2020-10-05'
modified: '2022-07-07'
tags:
    - attack.defense-evasion
    - attack.t1218
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Print/
    - https://twitter.com/Oddvarmoe/status/985518877076541440
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \print.exe
        CommandLine|startswith: print
        CommandLine|contains|all:
            - /D
            - .exe
    filter_print:
        CommandLine|contains: print.exe
    condition: selection and not filter_print
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:33.270073+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:33.270073+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:33.270077+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:33.270079+00:00'
