id: fcdf69e5-a3d3-452a-9724-26f2308bf2b1
title: Phishing Pattern ISO in Archive
status: test
level: high
description: Detects cases in which an ISO files is opend within an archiver like
    7Zip or Winrar, which is a sign of phishing as threat actors put small ISO files
    in archives as email attachments to bypass certain filters and protective measures
    (mark of web)
author: Florian Roth (Nextron Systems)
date: '2022-06-07'
tags:
    - attack.initial-access
    - attack.t1566
references:
    - https://twitter.com/1ZRR4H/status/1534259727059787783
    - https://app.any.run/tasks/e1fe6a62-bce8-4323-a49a-63795d9afd5d/
falsepositives:
    - Legitimate cases in which archives contain ISO or IMG files and the user opens
        the archive and the image via clicking and not extraction
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith:
            - \Winrar.exe
            - \7zFM.exe
            - \peazip.exe
        Image|endswith:
            - \isoburn.exe
            - \PowerISO.exe
            - \ImgBurn.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:38.638853+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:38.638853+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:38.638858+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:38.638860+00:00'
