id: ad720b90-25ad-43ff-9b5e-5c841facc8e5
title: User Added to Local Administrators Group
status: test
level: medium
description: Detects addition of users to the local administrator group via "Net"
    or "Add-LocalGroupMember".
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: '2022-08-12'
modified: '2023-03-02'
tags:
    - attack.persistence
    - attack.t1098
references:
    - https://blog.talosintelligence.com/2022/08/recent-cyber-attack.html?m=1
falsepositives:
    - Administrative activity
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''ffa28e60-bdb1-46e0-9f82-05f7a61cc06e''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''10fb649c-3600-4d37-b1e6-56ea90bb7e09''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_main:
        CommandLine|contains|all:
            - 'localgroup '
            - ' /add'
            - 'Add-LocalGroupMember '
            - ' -Group '
    selection_group:
        CommandLine|contains:
            - ' administrators '
            - ' administrateur'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:33.266544+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:33.266544+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:33.266551+00:00'
