id: f14e169e-9978-4c69-acb3-1cff8200bc36
title: Suspicious GrpConv Execution
status: test
level: high
description: Detects the suspicious execution of a utility to convert Windows 3.x
    .grp files or for persistence purposes by malicious software or actors
author: Florian Roth (Nextron Systems)
date: '2022-05-19'
tags:
    - attack.persistence
    - attack.t1547
references:
    - https://twitter.com/0gtweet/status/1526833181831200770
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - grpconv.exe -o
            - grpconv -o
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:37:00.230512+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:37:00.230512+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:37:00.230523+00:00'
