title: Linux Webshell Indicators
id: 818f7b24-0fba-4c49-a073-8b755573b9c7
status: test
level: high
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
description: Detects suspicious sub processes of web server processes
references:
    - https://www.acunetix.com/blog/articles/web-shells-101-using-php-introduction-web-shells-part-2/
    - https://media.defense.gov/2020/Jun/09/2002313081/-1/-1/0/CSI-DETECT-AND-PREVENT-WEB-SHELL-MALWARE-20200422.PDF
falsepositives:
    - Web applications that invoke Linux command line tools
tags:
    - attack.persistence
    - attack.t1505.003
date: '2021-10-15'
modified: '2022-12-28'
logsource:
    category: process_creation
    product: linux
detection:
    selection_general:
        ParentImage|endswith:
            - /httpd
            - /lighttpd
            - /nginx
            - /apache2
            - /node
            - /caddy
    selection_tomcat:
        ParentCommandLine|contains|all:
            - /bin/java
            - tomcat
    selection_websphere:
        ParentCommandLine|contains|all:
            - /bin/java
            - websphere
    sub_processes:
        Image|endswith:
            - /whoami
            - /ifconfig
            - /ip
            - /bin/uname
            - /bin/cat
            - /bin/crontab
            - /hostname
            - /iptables
            - /netstat
            - /pwd
            - /route
    condition: 1 of selection_* and sub_processes
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:20.879483+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:20.879483+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:36:20.879504+00:00'
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-12-04T01:36:20.879506+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:36:20.879507+00:00'
