id: cb5a2333-56cf-4562-8fcb-22ba1bca728d
title: Obfuscated IP Download Activity
status: test
level: medium
description: Detects use of an encoded/obfuscated version of an IP address (hex, octal...)
    in an URL combined with a download command
author: Florian Roth (Nextron Systems), X__Junior (Nextron Systems)
date: '2022-08-03'
modified: '2023-11-06'
tags:
    - attack.discovery
references:
    - https://h.43z.one/ipconverter/
    - https://twitter.com/Yasser_Elsnbary/status/1553804135354564608
    - https://twitter.com/fr0s7_/status/1712780207105404948
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_command:
        CommandLine|contains:
            - Invoke-WebRequest
            - 'iwr '
            - 'wget '
            - 'curl '
            - DownloadFile
            - DownloadString
    selection_ip_1:
        CommandLine|contains:
            - ' 0x'
            - //0x
            - .0x
            - .00x
    selection_ip_2:
        CommandLine|contains|all:
            - http://%
            - '%2e'
    selection_ip_3:
        CommandLine|re|all:
            - https?://[0-9]{1,3}\.[0-9]{1,3}\.0[0-9]{3,4}
            - https?://[0-9]{1,3}\.0[0-9]{3,7}
            - https?://0[0-9]{3,11}
            - https?://(0[0-9]{1,11}\.){3}0[0-9]{1,11}
            - https?://0[0-9]{1,11}
            - ' [0-7]{7,13}'
    filter_main_valid_ip:
        CommandLine|re: https?://((25[0-5]|(2[0-4]|1\d|[1-9])?\d)(\.|\b)){4}
    condition: selection_command and 1 of selection_ip_* and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:56.580387+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:56.580387+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:56.580401+00:00'
