id: 1a5fefe6-734f-452e-a07d-fc1c35bce4b2
title: Firewall Rule Deleted Via Netsh.EXE
status: test
level: medium
description: Detects the removal of a port or application rule in the Windows Firewall
    configuration using netsh
author: frack113
date: '2022-08-14'
modified: '2023-02-10'
tags:
    - attack.defense-evasion
    - attack.t1562.004
references:
    - https://app.any.run/tasks/8bbd5b4c-b82d-4e6d-a3ea-d454594a37cc/
falsepositives:
    - Legitimate administration activity
    - Software installations and removal
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \netsh.exe
        OriginalFileName: netsh.exe
    selection_cli:
        CommandLine|contains|all:
            - firewall
            - 'delete '
    filter_optional_dropbox:
        ParentImage|endswith: \Dropbox.exe
        CommandLine|contains: name=Dropbox
    condition: all of selection_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:34:03.877023+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:34:03.877023+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:34:03.877035+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:34:03.877037+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:34:03.877038+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:34:03.877039+00:00'
