id: 48bbc537-b652-4b4e-bd1d-281172df448f
title: Sysinternals PsSuspend Execution
status: test
level: medium
description: Detects usage of Sysinternals PsSuspend which can be abused to suspend
    critical processes
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-03-23'
tags:
    - attack.discovery
    - attack.persistence
    - attack.t1543.003
references:
    - https://learn.microsoft.com/en-us/sysinternals/downloads/pssuspend
    - https://twitter.com/0gtweet/status/1638069413717975046
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''4beb6ae0-f85b-41e2-8f18-8668abc8af78''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        OriginalFileName: pssuspend.exe
        Image|endswith:
            - \pssuspend.exe
            - \pssuspend64.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:46.923834+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:46.923834+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:46.923844+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:46.923846+00:00'
