title: HackTool - RemoteKrbRelay Execution
id: a7664b14-75fb-4a50-a223-cb9bc0afbacf
status: experimental
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: 'Detects the use of RemoteKrbRelay, a Kerberos relaying tool via CommandLine
    flags and PE metadata.

    '
references:
    - https://github.com/CICADA8-Research/RemoteKrbRelay
falsepositives:
    - Unlikely
tags:
    - attack.credential-access
    - attack.t1558.003
date: '2024-06-27'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \RemoteKrbRelay.exe
        OriginalFileName: RemoteKrbRelay.exe
    selection_cli_required:
        CommandLine|contains|all:
            - ' -clsid '
            - ' -target '
            - ' -victim '
    selection_cli_attack_smb:
        CommandLine|contains|all:
            - '-smb '
            - '--smbkeyword '
        CommandLine|contains:
            - interactive
            - secrets
            - service-add
    selection_cli_attack_rbcd_main:
        CommandLine|contains: '-rbcd '
    selection_cli_attack_rbcd_options:
        CommandLine|contains:
            - '-cn '
            - '--computername '
    selection_cli_attack_changepass:
        CommandLine|contains: '-chp '
        CommandLine|contains|all:
            - '-chpPass '
            - '-chpUser '
    selection_cli_attack_addgrpname:
        CommandLine|contains|all:
            - '-addgroupmember '
            - '-group '
            - '-groupuser '
    condition: selection_img or selection_cli_required or all of selection_cli_attack_rbcd_*
        or selection_cli_attack_changepass or selection_cli_attack_addgrpname or selection_cli_attack_smb
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:42:06.129476+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:42:06.129476+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:42:06.129490+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:42:06.129492+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:42:06.129493+00:00'
