title: System Information Discovery Using sw_vers
id: 5de06a6f-673a-4fc0-8d48-bcfe3837b033
status: test
level: medium
author: Joseliyo Sanchez, @Joseliyo_Jstnk
description: Detects the use of "sw_vers" for system information discovery
references:
    - https://www.virustotal.com/gui/file/d3fa64f63563fe958b75238742d1e473800cb5f49f5cb79d38d4aa3c93709026/behavior
    - https://www.virustotal.com/gui/file/03b71eaceadea05bc0eea5cddecaa05f245126d6b16cfcd0f3ba0442ac58dab3/behavior
    - https://ss64.com/osx/sw_vers.html
falsepositives:
    - Legitimate administrative activities
tags:
    - attack.discovery
    - attack.t1082
date: '2023-12-20'
logsource:
    category: process_creation
    product: macos
detection:
    selection_image:
        Image|endswith: /sw_vers
    selection_options:
        CommandLine|contains:
            - -buildVersion
            - -productName
            - -productVersion
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:34:40.944544+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-12-04T01:34:40.944544+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:34:40.944558+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:34:40.944560+00:00'
