title: Java Running with Remote Debugging
id: 8f88e3f6-2a49-48f5-a5c4-2f7eedf78710
status: test
level: medium
author: Florian Roth (Nextron Systems)
description: Detects a JAVA process running with remote debugging allowing more than
    just localhost to connect
references:
    - https://dzone.com/articles/remote-debugging-java-applications-with-jdwp
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Unknown
tags:
    - attack.t1203
    - attack.execution
date: '2019-01-16'
modified: '2023-02-01'
logsource:
    category: process_creation
    product: windows
detection:
    selection_jdwp_transport:
        CommandLine|contains: transport=dt_socket,address=
    selection_old_jvm_version:
        CommandLine|contains:
            - jre1.
            - jdk1.
    exclusion:
        CommandLine|contains:
            - address=127.0.0.1
            - address=localhost
    condition: all of selection_* and not exclusion
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:41:30.638558+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:41:30.638558+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:41:30.638571+00:00'
