id: b7966f4a-b333-455b-8370-8ca53c229762
title: Dropping Of Password Filter DLL
status: test
level: medium
description: Detects dropping of dll files in system32 that may be used to retrieve
    user credentials from LSASS
author: Sreeman
date: '2020-10-29'
modified: '2022-10-09'
tags:
    - attack.credential-access
    - attack.t1556.002
references:
    - https://pentestlab.blog/2020/02/10/credential-access-password-filter-dll/
    - https://github.com/3gstudent/PasswordFilter/tree/master/PasswordFilter
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_cmdline:
        CommandLine|contains|all:
            - HKLM\SYSTEM\CurrentControlSet\Control\Lsa
            - scecli\0*
            - reg add
    condition: selection_cmdline
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:34:49.474023+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:34:49.474023+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:34:49.474040+00:00'
