id: d65aee4d-2292-4cea-b832-83accd6cfa43
title: Arbitrary Binary Execution Using GUP Utility
status: test
level: medium
description: Detects execution of the Notepad++ updater (gup) to launch other commands
    or executables
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-06-10'
modified: '2023-03-02'
tags:
    - attack.execution
references:
    - https://twitter.com/nas_bench/status/1535322445439180803
falsepositives:
    - Other parent binaries using GUP not currently identified
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \gup.exe
        Image|endswith: \explorer.exe
    filter:
        Image|endswith: \explorer.exe
        CommandLine|contains: \Notepad++\notepad++.exe
    filter_parent:
        ParentImage|contains: \Notepad++\updater\
    filter_null:
        CommandLine: null
    condition: selection and not 1 of filter*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:35:23.471651+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:35:23.471651+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:35:23.471683+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:35:23.471687+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:35:23.471690+00:00'
