id: 94771a71-ba41-4b6e-a757-b531372eaab6
title: File Download From Browser Process Via Inline URL
status: test
level: medium
description: Detects execution of a browser process with a URL argument pointing to
    a file with a potentially interesting extension. This can be abused to download
    arbitrary files or to hide from the user for example by launching the browser
    in a minimized state.
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: '2022-01-11'
modified: '2023-11-09'
tags:
    - attack.command-and-control
    - attack.t1105
references:
    - https://twitter.com/mrd0x/status/1478116126005641220
    - https://lolbas-project.github.io/lolbas/Binaries/Msedge/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \brave.exe
            - \chrome.exe
            - \msedge.exe
            - \opera.exe
            - \vivaldi.exe
    selection_http:
        CommandLine|contains: http
    selection_extensions:
        CommandLine|endswith:
            - .7z
            - .dat
            - .dll
            - .exe
            - .hta
            - .ps1
            - .psm1
            - .txt
            - .vbe
            - .vbs
            - .zip
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:47.774238+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:47.774238+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:47.774244+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:47.774246+00:00'
