title: Suspicious Chromium Browser Instance Executed With Custom Extension
id: 27ba3207-dd30-4812-abbf-5d20c57d474e
status: test
level: high
author: Aedan Russell, frack113, X__Junior (Nextron Systems)
description: Detects a suspicious process spawning a Chromium based browser process
    with the 'load-extension' flag to start an instance with a custom extension
references:
    - https://redcanary.com/blog/chromeloader/
    - https://emkc.org/s/RJjuLa
    - https://www.mandiant.com/resources/blog/lnk-between-browsers
falsepositives:
    - Unknown
tags:
    - attack.persistence
    - attack.t1176
date: '2022-06-19'
modified: '2023-11-28'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith:
            - \cmd.exe
            - \cscript.exe
            - \mshta.exe
            - \powershell.exe
            - \pwsh.exe
            - \regsvr32.exe
            - \rundll32.exe
            - \wscript.exe
        Image|endswith:
            - \brave.exe
            - \chrome.exe
            - \msedge.exe
            - \opera.exe
            - \vivaldi.exe
        CommandLine|contains: --load-extension=
    condition: selection
related:
    -   id: 88d6e60c-759d-4ac1-a447-c0f1466c2d21
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:46:27.012089+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:46:27.012089+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:46:27.012110+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:46:27.012112+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:46:27.012113+00:00'
