title: Ufw Force Stop Using Ufw-Init
id: 84c9e83c-599a-458a-a0cb-0ecce44e807a
status: test
level: medium
author: Joseliyo Sanchez, @Joseliyo_Jstnk
description: Detects attempts to force stop the ufw using ufw-init
references:
    - https://blogs.blackberry.com/
    - https://twitter.com/Joseliyo_Jstnk/status/1620131033474822144
falsepositives:
    - Network administrators
tags:
    - attack.defense-evasion
    - attack.t1562.004
date: '2023-01-18'
logsource:
    category: process_creation
    product: linux
detection:
    selection_init:
        CommandLine|contains|all:
            - -ufw-init
            - force-stop
    selection_ufw:
        CommandLine|contains|all:
            - ufw
            - disable
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 2
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:48.555302+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:48.555302+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:36:48.555351+00:00'
