id: 9fff585c-c33e-4a86-b3cd-39312079a65f
title: Taskmgr as LOCAL_SYSTEM
status: test
level: high
description: Detects the creation of taskmgr.exe process in context of LOCAL_SYSTEM
author: Florian Roth (Nextron Systems)
date: '2018-03-18'
modified: '2022-05-27'
tags:
    - attack.defense-evasion
    - attack.t1036
references:
    - Internal Research
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        User|contains:
            - AUTHORI
            - AUTORI
        Image|endswith: \taskmgr.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:00.681470+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:00.681470+00:00'
    detection_fields:
        -   source_field: User
            target_table: process_activity
            target_field: actor.user.name
            mapped_at: '2025-11-13T20:20:00.681494+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:00.681497+00:00'
