id: 23ceaf5c-b6f1-4a32-8559-f2ff734be516
title: Dumping Process via Sqldumper.exe
status: test
level: medium
description: Detects process dump via legitimate sqldumper.exe binary
author: Kirill Kiryanov, oscd.community
date: '2020-10-08'
modified: '2021-11-27'
tags:
    - attack.credential-access
    - attack.t1003.001
references:
    - https://twitter.com/countuponsec/status/910977826853068800
    - https://twitter.com/countuponsec/status/910969424215232518
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Sqldumper/
falsepositives:
    - Legitimate MSSQL Server actions
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \sqldumper.exe
        CommandLine|contains:
            - '0x0110'
            - 0x01100:40
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:59.145903+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:59.145903+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:59.145910+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:59.145911+00:00'
