title: Potential Mpclient.DLL Sideloading Via Defender Binaries
id: 7002aa10-b8d4-47ae-b5ba-51ab07e228b9
status: test
level: high
author: Bhabesh Raj
description: Detects potential sideloading of "mpclient.dll" by Windows Defender processes
    ("MpCmdRun" and "NisSrv") from their non-default directory.
references:
    - https://www.sentinelone.com/blog/living-off-windows-defender-lockbit-ransomware-sideloads-cobalt-strike-through-microsoft-security-tool
falsepositives:
    - Unlikely
tags:
    - attack.defense-evasion
    - attack.t1574.002
date: '2022-08-01'
modified: '2023-08-04'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - \MpCmdRun.exe
            - \NisSrv.exe
    filter_main_known_locations:
        Image|startswith:
            - C:\Program Files (x86)\Windows Defender\
            - C:\Program Files\Microsoft Security Client\
            - C:\Program Files\Windows Defender\
            - C:\ProgramData\Microsoft\Windows Defender\Platform\
            - C:\Windows\WinSxS\
    condition: selection and not 1 of filter_main_*
related:
    -   id: 418dc89a-9808-4b87-b1d7-e5ae0cb6effc
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:47:32.168703+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:47:32.168703+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:47:32.168717+00:00'
