title: Suspicious Double Extension File Execution
id: 1cdd9a09-06c9-4769-99ff-626e2b3991b8
status: stable
level: critical
author: Florian Roth (Nextron Systems), @blu3_team (idea), Nasreddine Bencherchali
    (Nextron Systems)
description: Detects suspicious use of an .exe extension after a non-executable file
    extension like .pdf.exe, a set of spaces or underlines to cloak the executable
    file in spear phishing campaigns
references:
    - https://blu3-team.blogspot.com/2019/06/misleading-extensions-xlsexe-docexe.html
    - https://twitter.com/blackorbird/status/1140519090961825792
falsepositives:
    - Unknown
tags:
    - attack.initial-access
    - attack.t1566.001
date: '2019-06-26'
modified: '2023-02-28'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - .doc.exe
            - .docx.exe
            - .xls.exe
            - .xlsx.exe
            - .ppt.exe
            - .pptx.exe
            - .rtf.exe
            - .pdf.exe
            - .txt.exe
            - '      .exe'
            - ______.exe
            - .doc.js
            - .docx.js
            - .xls.js
            - .xlsx.js
            - .ppt.js
            - .pptx.js
            - .rtf.js
            - .pdf.js
            - .txt.js
        CommandLine|contains:
            - .doc.exe
            - .docx.exe
            - .xls.exe
            - .xlsx.exe
            - .ppt.exe
            - .pptx.exe
            - .rtf.exe
            - .pdf.exe
            - .txt.exe
            - '      .exe'
            - ______.exe
            - .doc.js
            - .docx.js
            - .xls.js
            - .xlsx.js
            - .ppt.js
            - .pptx.js
            - .rtf.js
            - .pdf.js
            - .txt.js
    condition: selection
related:
    -   id: 5e6a80c8-2d45-4633-9ef4-fa2671a39c5c
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:45:53.686738+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:45:53.686738+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:45:53.686757+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:45:53.686765+00:00'
