title: Always Install Elevated Windows Installer
id: cd951fdc-4b2f-47f5-ba99-a33bf61e3770
status: test
level: medium
author: Teymur Kheirkhabarov (idea), Mangatas Tondang (rule), oscd.community
description: Detects Windows Installer service (msiexec.exe) trying to install MSI
    packages with SYSTEM privilege
references:
    - https://image.slidesharecdn.com/kheirkhabarovoffzonefinal-181117201458/95/hunting-for-privilege-escalation-in-windows-environment-48-638.jpg
falsepositives:
    - System administrator usage
    - Anti virus products
    - WindowsApps located in "C:\Program Files\WindowsApps\"
tags:
    - attack.privilege-escalation
    - attack.t1548.002
date: '2020-10-13'
modified: '2024-12-01'
logsource:
    category: process_creation
    product: windows
detection:
    selection_user:
        User|contains:
            - AUTHORI
            - AUTORI
    selection_image_1:
        Image|contains|all:
            - \Windows\Installer\
            - msi
        Image|endswith: tmp
    selection_image_2:
        Image|endswith: \msiexec.exe
        IntegrityLevel:
            - System
            - S-1-16-16384
    filter_installer:
        ParentImage: C:\Windows\System32\services.exe
    filter_repair:
        CommandLine|endswith: \system32\msiexec.exe /V
        ParentCommandLine|endswith: \system32\msiexec.exe /V
    filter_sophos:
        ParentImage|startswith: C:\ProgramData\Sophos\
    filter_avira:
        ParentImage|startswith: C:\ProgramData\Avira\
    filter_avast:
        ParentImage|startswith:
            - C:\Program Files\Avast Software\
            - C:\Program Files (x86)\Avast Software\
    filter_google_update:
        ParentImage|startswith:
            - C:\Program Files\Google\Update\
            - C:\Program Files (x86)\Google\Update\
    condition: 1 of selection_image_* and selection_user and not 1 of filter_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:43:40.156087+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:43:40.156087+00:00'
    detection_fields:
        -   source_field: User
            target_table: process_activity
            target_field: actor.user.name
            mapped_at: '2025-12-04T01:43:40.156104+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:43:40.156106+00:00'
        -   source_field: IntegrityLevel
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:43:40.156108+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:43:40.156109+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:43:40.156111+00:00'
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-12-04T01:43:40.156112+00:00'
