id: 093d68c7-762a-42f4-9f46-95e79142571a
title: Shell Execution via Nice - Linux
status: experimental
level: high
description: 'Detects the use of the "nice" utility to execute a shell. Such behavior
    may be associated with privilege escalation, unauthorized command execution, or
    to break out from restricted environments.

    '
author: Li Ling, Andy Parkidomo, Robert Rakowski, Blake Hartstein (Bloomberg L.P.)
date: '2024-09-02'
tags:
    - attack.discovery
    - attack.t1083
references:
    - https://gtfobins.github.io/gtfobins/nice/#shell
    - https://www.elastic.co/guide/en/security/current/linux-restricted-shell-breakout-via-linux-binary-s.html
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith: /nice
        CommandLine|endswith:
            - /bin/bash
            - /bin/dash
            - /bin/fish
            - /bin/sh
            - /bin/zsh
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:15:55.894624+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-13T20:15:55.894624+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:15:55.894631+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:15:55.894633+00:00'
