id: 53ef0cef-fa24-4f25-a34a-6c72dfa2e6e2
title: Query Usage To Exfil Data
status: test
level: medium
description: Detects usage of "query.exe" a system binary to exfil information such
    as "sessions" and "processes" for later use
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-08-01'
modified: '2023-01-19'
tags:
    - attack.execution
references:
    - https://twitter.com/MichalKoczwara/status/1553634816016498688
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: :\Windows\System32\query.exe
        CommandLine|contains:
            - session >
            - process >
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:30:10.025126+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:30:10.025126+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:30:10.025156+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:30:10.025160+00:00'
