id: f4264e47-f522-4c38-a420-04525d5b880f
title: Renamed AutoIt Execution
status: test
level: high
description: 'Detects the execution of a renamed AutoIt2.exe or AutoIt3.exe.

    AutoIt is a scripting language and automation tool for Windows systems. While
    primarily used for legitimate automation tasks, it can be misused in cyber attacks.

    Attackers can leverage AutoIt to create and distribute malware, including keyloggers,
    spyware, and botnets. A renamed AutoIt executable is particularly suspicious.

    '
author: Florian Roth (Nextron Systems)
date: '2023-06-04'
modified: '2024-11-23'
tags:
    - attack.defense-evasion
    - attack.t1027
references:
    - https://twitter.com/malmoeb/status/1665463817130725378?s=12&t=C0_T_re0wRP_NfKa27Xw9w
    - https://www.autoitscript.com/site/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_1:
        CommandLine|contains:
            - ' /AutoIt3ExecuteScript'
            - ' /ErrorStdOut'
    selection_2:
        Hashes|contains:
            - IMPHASH=FDC554B3A8683918D731685855683DDF
            - IMPHASH=CD30A61B60B3D60CECDB034C8C83C290
            - IMPHASH=F8A00C72F2D667D2EDBB234D0C0AE000
    selection_3:
        OriginalFileName:
            - AutoIt3.exe
            - AutoIt2.exe
            - AutoIt.exe
    filter_main_legit_name:
        Image|endswith:
            - \AutoIt.exe
            - \AutoIt2.exe
            - \AutoIt3_x64.exe
            - \AutoIt3.exe
    condition: 1 of selection_* and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:30.338486+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:30.338486+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:30.338492+00:00'
        -   source_field: Hashes
            target_table: process_activity
            target_field: process.file.hashes.value
            mapped_at: '2025-11-13T20:20:30.338493+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:30.338495+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:30.338496+00:00'
