id: 1b3b01c7-84e9-4072-86e5-fc285a41ff23
title: Nslookup PowerShell Download Cradle - ProcessCreation
status: test
level: medium
description: Detects suspicious powershell download cradle using nslookup. This cradle
    uses nslookup to extract payloads from DNS records
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-09-05'
modified: '2022-12-19'
tags:
    - attack.defense-evasion
references:
    - https://twitter.com/Alh4zr3d/status/1566489367232651264
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''72671447-4352-4413-bb91-b85569687135''),
    type=<SigmaRelatedType.OBSOLETE: 4>), SigmaRelatedItem(id=UUID(''999bff6d-dc15-44c9-9f5c-e1051bfc86e1''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|contains: \nslookup.exe
        OriginalFileName: \nslookup.exe
    selection_cmd:
        ParentImage|endswith:
            - \powershell.exe
            - \pwsh.exe
        CommandLine|contains:
            - ' -q=txt '
            - ' -querytype=txt '
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:24.079506+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:24.079506+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:24.079516+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:24.079519+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:24.079521+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:24.079522+00:00'
