id: 087790e3-3287-436c-bccf-cbd0184a7db1
title: Potential CommandLine Path Traversal Via Cmd.EXE
status: test
level: high
description: Detects potential path traversal attempt via cmd.exe. Could indicate
    possible command/argument confusion/hijacking
author: xknow @xknow_infosec, Tim Shelton
date: '2020-06-11'
modified: '2023-03-06'
tags:
    - attack.execution
    - attack.t1059.003
references:
    - https://hackingiscool.pl/cmdhijack-command-argument-confusion-with-path-traversal-in-cmd-exe/
    - https://twitter.com/Oddvarmoe/status/1270633613449723905
falsepositives:
    - Java tools are known to produce false-positive when loading libraries
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        ParentImage|endswith: \cmd.exe
        Image|endswith: \cmd.exe
        OriginalFileName: cmd.exe
    selection_flags:
        ParentCommandLine|contains:
            - /c
            - /k
            - /r
        CommandLine|contains:
            - /c
            - /k
            - /r
    selection_path_traversal:
        ParentCommandLine: /../../
        CommandLine|contains: /../../
    filter_java:
        CommandLine|contains: \Tasktop\keycloak\bin\/../../jre\bin\java
    condition: all of selection_* and not 1 of filter_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:41.443426+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:41.443426+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:41.443441+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:41.443444+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:41.443447+00:00'
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-11-13T20:20:41.443450+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:41.443452+00:00'
