id: f9999590-1f94-4a34-a91e-951e47bedefd
title: Suspicious Provlaunch.EXE Child Process
status: test
level: high
description: Detects suspicious child processes of "provlaunch.exe" which might indicate
    potential abuse to proxy execution.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-08-08'
tags:
    - attack.defense-evasion
    - attack.t1218
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Provlaunch/
    - https://twitter.com/0gtweet/status/1674399582162153472
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''7f5d1c9a-3e83-48df-95a7-2b98aae6c13c''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''2a4b3e61-9d22-4e4a-b60f-6e8f0cde6f25''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''7021255e-5db3-4946-a8b9-0ba7a4644a69''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|endswith: \provlaunch.exe
    selection_child:
        Image|endswith:
            - \calc.exe
            - \cmd.exe
            - \cscript.exe
            - \mshta.exe
            - \notepad.exe
            - \powershell.exe
            - \pwsh.exe
            - \regsvr32.exe
            - \rundll32.exe
            - \wscript.exe
        Image|contains:
            - :\PerfLogs\
            - :\Temp\
            - :\Users\Public\
            - \AppData\Temp\
            - \Windows\System32\Tasks\
            - \Windows\Tasks\
            - \Windows\Temp\
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:36:00.390337+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:36:00.390337+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:36:00.390355+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:36:00.390357+00:00'
