title: Shell Execution via Git - Linux
id: 47b3bbd4-1bf7-48cc-84ab-995362aaa75a
status: experimental
level: high
author: Li Ling, Andy Parkidomo, Robert Rakowski, Blake Hartstein (Bloomberg L.P.)
description: 'Detects the use of the "git" utility to execute a shell. Such behavior
    may be associated with privilege escalation, unauthorized command execution, or
    to break out from restricted environments.

    '
references:
    - https://gtfobins.github.io/gtfobins/git/#shell
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1059
date: '2024-09-02'
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        ParentImage|endswith: /git
        ParentCommandLine|contains|all:
            - ' -p '
            - help
        CommandLine|contains:
            - bash 0<&1
            - dash 0<&1
            - sh 0<&1
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:26.504778+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:26.504778+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:36:26.504798+00:00'
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-12-04T01:36:26.504801+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:36:26.504803+00:00'
