title: HackTool - SharpChisel Execution
id: cf93e05e-d798-4d9e-b522-b0248dc61eaf
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects usage of the Sharp Chisel via the commandline arguments
references:
    - https://github.com/shantanu561993/SharpChisel
    - https://www.sentinelone.com/labs/wading-through-muddy-waters-recent-activity-of-an-iranian-state-sponsored-threat-actor/
falsepositives:
    - Unlikely
tags:
    - attack.command-and-control
    - attack.t1090.001
date: '2022-09-05'
modified: '2023-02-13'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \SharpChisel.exe
        Product: SharpChisel
    condition: selection
related:
    -   id: 8b0e12da-d3c3-49db-bb4f-256703f380e5
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:47:33.718236+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:47:33.718236+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:47:33.718249+00:00'
        -   source_field: Product
            target_table: process_activity
            target_field: metadata.product.name
            mapped_at: '2025-12-04T01:47:33.718251+00:00'
