title: Suspicious Scheduled Task Name As GUID
id: ff2fff64-4cd6-4a2b-ba7d-e28a30bbe66b
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects creation of a scheduled task with a GUID like name
references:
    - https://thedfirreport.com/2022/10/31/follina-exploit-leads-to-domain-compromise/
    - https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/
falsepositives:
    - Legitimate software naming their tasks as GUIDs
tags:
    - attack.execution
    - attack.t1053.005
date: '2022-10-31'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \schtasks.exe
        CommandLine|contains: '/Create '
    selection_tn:
        CommandLine|contains:
            - /TN "{
            - /TN '{
            - /TN {
    selection_end:
        CommandLine|contains:
            - '}"'
            - '}'''
            - '} '
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:46:47.679354+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:46:47.679354+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:46:47.679369+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:46:47.679371+00:00'
