id: 6004abd0-afa4-4557-ba90-49d172e0a299
title: Execute Pcwrun.EXE To Leverage Follina
status: test
level: high
description: Detects indirect command execution via Program Compatibility Assistant
    "pcwrun.exe" leveraging the follina (CVE-2022-30190) vulnerability
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-06-13'
tags:
    - attack.defense-evasion
    - attack.t1218
    - attack.execution
references:
    - https://twitter.com/nas_bench/status/1535663791362519040
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \pcwrun.exe
        CommandLine|contains: ../
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:47.778036+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:47.778036+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:47.778044+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:47.778045+00:00'
