id: 6640f31c-01ad-49b5-beb5-83498a5cd8bd
title: Potential Arbitrary Code Execution Via Node.EXE
status: test
level: high
description: Detects the execution node.exe which is shipped with multiple software
    such as VMware, Adobe...etc. In order to execute arbitrary code. For example to
    establish reverse shell as seen in Log4j attacks...etc
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-09-09'
modified: '2023-02-03'
tags:
    - attack.defense-evasion
    - attack.t1127
references:
    - http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
    - https://www.sprocketsecurity.com/resources/crossing-the-log4j-horizon-a-vulnerability-with-no-return
    - https://www.rapid7.com/blog/post/2022/01/18/active-exploitation-of-vmware-horizon-servers/
    - https://nodejs.org/api/cli.html
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_main:
        Image|endswith: \node.exe
        CommandLine|contains:
            - ' -e '
            - ' --eval '
    selection_action_reverse_shell:
        CommandLine|contains|all:
            - .exec(
            - net.socket
            - .connect
            - child_process
    condition: selection_main and 1 of selection_action_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:03.233803+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:03.233803+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:03.233810+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:03.233811+00:00'
