id: 48917adc-a28e-4f5d-b729-11e75da8941f
title: Suspicious Windows Defender Folder Exclusion Added Via Reg.EXE
status: test
level: medium
description: Detects the usage of "reg.exe" to add Defender folder exclusions. Qbot
    has been seen using this technique to add exclusions for folders within AppData
    and ProgramData.
author: frack113
date: '2022-02-13'
modified: '2023-02-04'
tags:
    - attack.defense-evasion
    - attack.t1562.001
references:
    - https://thedfirreport.com/2022/02/07/qbot-likes-to-move-it-move-it/
    - https://redcanary.com/threat-detection-report/threats/qbot/
falsepositives:
    - Legitimate use
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \reg.exe
        CommandLine|contains:
            - SOFTWARE\Microsoft\Windows Defender\Exclusions\Paths
            - SOFTWARE\Microsoft\Microsoft Antimalware\Exclusions\Paths
        CommandLine|contains|all:
            - 'ADD '
            - '/t '
            - 'REG_DWORD '
            - '/v '
            - '/d '
            - '0'
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:24.104438+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:24.104438+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:24.104446+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:24.104448+00:00'
