id: eb1c4225-1c23-4241-8dd4-051389fde4ce
title: Suspicious DumpMinitool Execution
status: test
level: high
description: Detects suspicious ways to use the "DumpMinitool.exe" binary
author: Florian Roth (Nextron Systems)
date: '2022-04-06'
modified: '2023-04-12'
tags:
    - attack.defense-evasion
    - attack.t1036
    - attack.t1003.001
references:
    - https://twitter.com/mrd0x/status/1511415432888131586
    - https://twitter.com/mrd0x/status/1511489821247684615
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/DumpMinitool/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - \DumpMinitool.exe
            - \DumpMinitool.x86.exe
            - \DumpMinitool.arm64.exe
        OriginalFileName:
            - DumpMinitool.exe
            - DumpMinitool.x86.exe
            - DumpMinitool.arm64.exe
    filter_folder:
        Image|contains:
            - \Microsoft Visual Studio\
            - \Extensions\
    susp_flags:
        CommandLine|contains: .txt
    cmd_has_flags:
        CommandLine|contains:
            - ' Full'
            - ' Mini'
            - ' WithHeap'
    filter_cmd_misses_flags:
        CommandLine|contains: --dumpType
    condition: selection and ( ( not filter_folder ) or susp_flags or ( cmd_has_flags
        and not filter_cmd_misses_flags ) )
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:27:38.532556+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:27:38.532556+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:27:38.532573+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:27:38.532575+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:27:38.532577+00:00'
