title: Sysinternals PsSuspend Suspicious Execution
id: 4beb6ae0-f85b-41e2-8f18-8668abc8af78
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects suspicious execution of Sysinternals PsSuspend, where the utility
    is used to suspend critical processes such as AV or EDR to bypass defenses
references:
    - https://learn.microsoft.com/en-us/sysinternals/downloads/pssuspend
    - https://twitter.com/0gtweet/status/1638069413717975046
falsepositives:
    - Unlikely
tags:
    - attack.defense-evasion
    - attack.t1562.001
date: '2023-03-23'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        OriginalFileName: pssuspend.exe
        Image|endswith:
            - \pssuspend.exe
            - \pssuspend64.exe
    selection_cli:
        CommandLine|contains: msmpeng.exe
    condition: all of selection_*
related:
    -   id: 48bbc537-b652-4b4e-bd1d-281172df448f
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:46.753648+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:46.753648+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:44:46.753660+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:44:46.753662+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:44:46.753663+00:00'
