id: a77c1610-fc73-4019-8e29-0f51efc04a51
title: Potential Dosfuscation Activity
status: test
level: medium
description: Detects possible payload obfuscation via the commandline
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: '2022-02-15'
modified: '2023-03-06'
tags:
    - attack.execution
    - attack.t1059
references:
    - https://www.fireeye.com/content/dam/fireeye-www/blog/pdfs/dosfuscation-report.pdf
    - https://github.com/danielbohannon/Invoke-DOSfuscation
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - ^^
            - ^|^
            - ',;,'
            - ;;;;
            - ;; ;;
            - (,(,
            - '%COMSPEC:~'
            - ' c^m^d'
            - ^c^m^d
            - ' c^md'
            - ' cm^d'
            - ^cm^d
            - ' s^et '
            - ' s^e^t '
            - ' se^t '
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:06.219215+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:06.219215+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:06.219220+00:00'
