id: 114de787-4eb2-48cc-abdb-c0b449f93ea4
title: Suspicious X509Enrollment - Process Creation
status: test
level: medium
description: Detect use of X509Enrollment
author: frack113
date: '2022-12-23'
tags:
    - attack.defense-evasion
    - attack.t1553.004
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=42
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=41
    - https://learn.microsoft.com/en-us/dotnet/api/microsoft.hpc.scheduler.store.cx509enrollmentwebclassfactoryclass?view=hpc-sdk-5.1.6115
falsepositives:
    - Legitimate administrative script
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''504d63cb-0dba-4d02-8531-e72981aace2c''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - X509Enrollment.CBinaryConverter
            - 884e2002-217d-11da-b2a4-000e7bbb2b09
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:09.472712+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:09.472712+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:09.472719+00:00'
