title: WMIC Remote Command Execution
id: 7773b877-5abb-4a3e-b9c9-fd0369b59b00
status: test
level: medium
author: frack113, Nasreddine Bencherchali (Nextron Systems)
description: Detects the execution of WMIC to query information on a remote system
references:
    - https://securelist.com/moonbounce-the-dark-side-of-uefi-firmware/105468/
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/wmic
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1047
date: '2023-02-14'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \WMIC.exe
        OriginalFileName: wmic.exe
    selection_cli:
        CommandLine|contains: '/node:'
    filter_localhost:
        CommandLine|contains:
            - '/node:127.0.0.1 '
            - '/node:localhost '
    condition: all of selection_* and not 1 of filter_*
related:
    -   id: e42af9df-d90b-4306-b7fb-05c863847ebd
        type: obsolete
    -   id: 09af397b-c5eb-4811-b2bb-08b3de464ebf
        type: obsolete
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:49:40.041155+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:49:40.041155+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:49:40.041169+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:49:40.041170+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:49:40.041172+00:00'
