title: Potential Password Spraying Attempt Using Dsacls.EXE
id: bac9fb54-2da7-44e9-988f-11e9a5edbc0c
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects possible password spraying attempts using Dsacls
references:
    - https://www.ired.team/offensive-security-experiments/active-directory-kerberos-abuse/using-dsacls-to-check-ad-object-permissions#password-spraying-anyone
    - https://ss64.com/nt/dsacls.html
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc771151(v=ws.11)
falsepositives:
    - Legitimate use of dsacls to bind to an LDAP session
tags:
    - attack.defense-evasion
    - attack.t1218
date: '2022-06-20'
modified: '2023-02-04'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \dsacls.exe
        OriginalFileName: DSACLS.EXE
    selection_cli:
        CommandLine|contains|all:
            - '/user:'
            - '/passwd:'
    condition: all of selection*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:28.403877+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:28.403877+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:44:28.403894+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:44:28.403896+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:44:28.403897+00:00'
