id: cf93e05e-d798-4d9e-b522-b0248dc61eaf
title: HackTool - SharpChisel Execution
status: test
level: high
description: Detects usage of the Sharp Chisel via the commandline arguments
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-09-05'
modified: '2023-02-13'
tags:
    - attack.command-and-control
    - attack.t1090.001
references:
    - https://github.com/shantanu561993/SharpChisel
    - https://www.sentinelone.com/labs/wading-through-muddy-waters-recent-activity-of-an-iranian-state-sponsored-threat-actor/
falsepositives:
    - Unlikely
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''8b0e12da-d3c3-49db-bb4f-256703f380e5''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \SharpChisel.exe
        Product: SharpChisel
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:42.450589+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:42.450589+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:42.450596+00:00'
        -   source_field: Product
            target_table: process_activity
            target_field: metadata.product.name
            mapped_at: '2025-11-13T20:20:42.450599+00:00'
