title: New Root Certificate Installed Via CertMgr.EXE
id: ff992eac-6449-4c60-8c1d-91c9722a1d48
status: test
level: medium
author: oscd.community, @redcanary, Zach Stanford @svch0st
description: 'Detects execution of "certmgr" with the "add" flag in order to install
    a new certificate on the system.

    Adversaries may install a root certificate on a compromised system to avoid warnings
    when connecting to adversary controlled web servers.

    '
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1553.004/T1553.004.md
    - https://securelist.com/to-crypt-or-to-mine-that-is-the-question/86307/
falsepositives:
    - Help Desk or IT may need to manually add a corporate Root CA on occasion. Need
        to test if GPO push doesn't trigger FP
tags:
    - attack.defense-evasion
    - attack.t1553.004
date: '2023-03-05'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \CertMgr.exe
        OriginalFileName: CERTMGT.EXE
    selection_cli:
        CommandLine|contains|all:
            - /add
            - root
    condition: all of selection_*
related:
    -   id: 42821614-9264-4761-acfc-5772c3286f76
        type: derived
    -   id: 46591fae-7a4c-46ea-aec3-dff5e6d785dc
        type: obsolete
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:45:13.420062+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:45:13.420062+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:45:13.420075+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:45:13.420077+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:45:13.420078+00:00'
