id: f5e3b62f-e577-4e59-931e-0a15b2b94e1e
title: HackTool - Htran/NATBypass Execution
status: test
level: high
description: Detects executable names or flags used by Htran or Htran-like tools (e.g.
    NATBypass)
author: Florian Roth (Nextron Systems)
date: '2022-12-27'
modified: '2023-02-04'
tags:
    - attack.command-and-control
    - attack.t1090
    - attack.s0040
references:
    - https://github.com/HiwinCN/HTran
    - https://github.com/cw1997/NATBypass
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \htran.exe
            - \lcx.exe
    selection_cli:
        CommandLine|contains:
            - '.exe -tran '
            - '.exe -slave '
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:34:02.329311+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:34:02.329311+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:34:02.329343+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:34:02.329347+00:00'
