title: File Download with Headless Browser
id: 0e8cfe08-02c9-4815-a2f8-0d157b7ed33e
status: test
level: high
author: Sreeman, Florian Roth (Nextron Systems)
description: Detects execution of chromium based browser in headless mode using the
    "dump-dom" command line to download files
references:
    - https://twitter.com/mrd0x/status/1478234484881436672?s=12
    - https://www.trendmicro.com/en_us/research/23/e/managed-xdr-investigation-of-ducktail-in-trend-micro-vision-one.html
falsepositives:
    - Unknown
tags:
    - attack.command-and-control
    - attack.t1105
date: '2022-01-04'
modified: '2023-05-12'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - \brave.exe
            - \chrome.exe
            - \msedge.exe
            - \opera.exe
            - \vivaldi.exe
        CommandLine|contains|all:
            - --headless
            - dump-dom
            - http
    condition: selection
related:
    -   id: ef9dcfed-690c-4c5d-a9d1-482cd422225c
        type: derived
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:36.006597+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:36.006597+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:44:36.006610+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:44:36.006611+00:00'
