id: a31eeaed-3fd5-478e-a8ba-e62c6b3f9ecc
title: Raccine Uninstall
status: test
level: high
description: Detects commands that indicate a Raccine removal from an end system.
    Raccine is a free ransomware protection tool.
author: Florian Roth (Nextron Systems)
date: '2021-01-21'
modified: '2022-10-09'
tags:
    - attack.defense-evasion
    - attack.t1562.001
references:
    - https://github.com/Neo23x0/Raccine
falsepositives:
    - Legitimate deinstallation by administrative staff
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        CommandLine|contains|all:
            - 'taskkill '
            - RaccineSettings.exe
    selection2:
        CommandLine|contains|all:
            - reg.exe
            - delete
            - Raccine Tray
    selection3:
        CommandLine|contains|all:
            - schtasks
            - /DELETE
            - Raccine Rules Updater
    condition: 1 of selection*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:58.254050+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:58.254050+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:58.254058+00:00'
