id: b0524451-19af-4efa-a46f-562a977f792e
title: ShimCache Flush
status: stable
level: high
description: Detects actions that clear the local ShimCache and remove forensic evidence
author: Florian Roth (Nextron Systems)
date: '2021-02-01'
tags:
    - attack.defense-evasion
    - attack.t1112
references:
    - https://medium.com/@blueteamops/shimcache-flush-89daff28d15e
fields:
    - Image
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection1a:
        CommandLine|contains|all:
            - rundll32
            - apphelp.dll
    selection1b:
        CommandLine|contains:
            - ShimFlushCache
            - '#250'
    selection2a:
        CommandLine|contains|all:
            - rundll32
            - kernel32.dll
    selection2b:
        CommandLine|contains:
            - BaseFlushAppcompatCache
            - '#46'
    condition: ( selection1a and selection1b ) or ( selection2a and selection2b )
ocsf_mapping:
    class_name: process_activity
    activity_id: UNMAPPED
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:29:28.840896+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:29:28.840896+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:29:28.840908+00:00'
