id: 6a69f62d-ce75-4b57-8dce-6351eb55b362
title: Esentutl Steals Browser Information
status: test
level: medium
description: One way Qbot steals sensitive information is by extracting browser data
    from Internet Explorer and Microsoft Edge by using the built-in utility esentutl.exe
author: frack113
date: '2022-02-13'
modified: '2024-03-05'
tags:
    - attack.collection
    - attack.t1005
references:
    - https://thedfirreport.com/2022/02/07/qbot-likes-to-move-it-move-it/
    - https://redcanary.com/threat-detection-report/threats/qbot/
    - https://thedfirreport.com/2022/10/31/follina-exploit-leads-to-domain-compromise/
falsepositives:
    - Legitimate use
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \esentutl.exe
        OriginalFileName: esentutl.exe
    selection_flag:
        CommandLine|contains|windash: -r
    selection_webcache:
        CommandLine|contains: \Windows\WebCache
    condition: all of selection*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:44.253623+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:44.253623+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:44.253647+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:44.253651+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:44.253654+00:00'
