id: f26eb764-fd89-464b-85e2-dc4a8e6e77b8
title: Suspicious Electron Application Child Processes
status: test
level: medium
description: 'Detects suspicious child processes of electron apps (teams, discord,
    slack, etc.). This could be a potential sign of ".asar" file tampering (See reference
    section for more information) or binary execution proxy through specific CLI arguments
    (see related rule)

    '
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-10-21'
modified: '2024-07-12'
tags:
    - attack.execution
references:
    - https://taggart-tech.com/quasar-electron/
    - https://github.com/mttaggart/quasar
    - https://positive.security/blog/ms-officecmd-rce
    - https://lolbas-project.github.io/lolbas/Binaries/Msedge/
    - https://lolbas-project.github.io/lolbas/Binaries/Teams/
    - https://lolbas-project.github.io/lolbas/Binaries/msedgewebview2/
    - https://medium.com/@MalFuzzer/one-electron-to-rule-them-all-dc2e9b263daf
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''378a05d8-963c-46c9-bcce-13c7657eac99''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|endswith:
            - \chrome.exe
            - \discord.exe
            - \GitHubDesktop.exe
            - \keybase.exe
            - \msedge.exe
            - \msedgewebview2.exe
            - \msteams.exe
            - \slack.exe
            - \teams.exe
    selection_child_image:
        Image|endswith:
            - \cmd.exe
            - \cscript.exe
            - \mshta.exe
            - \powershell.exe
            - \pwsh.exe
            - \regsvr32.exe
            - \whoami.exe
            - \wscript.exe
    selection_child_paths:
        Image|contains:
            - :\ProgramData\
            - :\Temp\
            - \AppData\Local\Temp\
            - \Users\Public\
            - \Windows\Temp\
    filter_optional_discord:
        ParentImage|endswith: \Discord.exe
        Image|endswith: \cmd.exe
        CommandLine|contains: \NVSMI\nvidia-smi.exe
    condition: selection_parent and 1 of selection_child_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:36.489678+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:36.489678+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:36.489684+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:36.489686+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:36.489687+00:00'
