title: Suspicious Process Created Via Wmic.EXE
id: 3c89a1e8-0fba-449e-8f1b-8409d6267ec8
status: test
level: high
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
description: Detects WMIC executing "process call create" with suspicious calls to
    processes such as "rundll32", "regsrv32", etc.
references:
    - https://thedfirreport.com/2020/10/08/ryuks-return/
    - https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ransomware-hive-conti-avoslocker
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1047
date: '2020-10-12'
modified: '2023-02-14'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - 'process '
            - 'call '
            - 'create '
        CommandLine|contains:
            - rundll32
            - bitsadmin
            - regsvr32
            - 'cmd.exe /c '
            - 'cmd.exe /k '
            - 'cmd.exe /r '
            - 'cmd /c '
            - 'cmd /k '
            - 'cmd /r '
            - powershell
            - pwsh
            - certutil
            - cscript
            - wscript
            - mshta
            - \Users\Public\
            - \Windows\Temp\
            - \AppData\Local\
            - '%temp%'
            - '%tmp%'
            - '%ProgramData%'
            - '%appdata%'
            - '%comspec%'
            - '%localappdata%'
    condition: selection
related:
    -   id: 526be59f-a573-4eea-b5f7-f0973207634d
        type: derived
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:48:26.413153+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:48:26.413153+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:48:26.413169+00:00'
