title: Security Privileges Enumeration Via Whoami.EXE
id: 97a80ec7-0e2f-4d05-9ef4-65760e634f6b
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects a whoami.exe executed with the /priv command line flag instructing
    the tool to show all current user privileges. This is often used after a privilege
    escalation attempt.
references:
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/whoami
falsepositives:
    - Unknown
tags:
    - attack.privilege-escalation
    - attack.discovery
    - attack.t1033
date: '2021-05-05'
modified: '2023-02-28'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \whoami.exe
        OriginalFileName: whoami.exe
    selection_cli:
        CommandLine|contains:
            - ' /priv'
            - ' -priv'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:48:21.447074+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:48:21.447074+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:48:21.447091+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:48:21.447093+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:48:21.447094+00:00'
