id: 584bca0f-3608-4402-80fd-4075ff6072e3
title: Potential CommandLine Obfuscation Using Unicode Characters From Suspicious
    Image
status: test
level: high
description: 'Detects potential commandline obfuscation using unicode characters.

    Adversaries may attempt to make an executable or file difficult to discover or
    analyze by encrypting, encoding, or otherwise obfuscating its contents on the
    system or in transit.

    '
author: frack113, Florian Roth (Nextron Systems), Josh Nickels
date: '2024-09-02'
modified: '2024-09-05'
tags:
    - attack.defense-evasion
    - attack.t1027
references:
    - https://www.wietzebeukema.nl/blog/windows-command-line-obfuscation
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1027/T1027.md#atomic-test-6---dlp-evasion-via-sensitive-data-in-vba-macro-over-http
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''e0552b19-5a83-4222-b141-b36184bb8d79''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''ad691d92-15f2-4181-9aa4-723c74f9ddc3''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''2c0d2d7b-30d6-4d14-9751-7b9113042ab9''),
    type=<SigmaRelatedType.OBSOLETE: 4>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \cmd.exe
            - \cscript.exe
            - \powershell.exe
            - \pwsh.exe
            - \wscript.exe
        OriginalFileName:
            - Cmd.EXE
            - cscript.exe
            - PowerShell.EXE
            - pwsh.dll
            - wscript.exe
    selection_special_chars:
        CommandLine|contains:
            - ˣ
            - ˪
            - ˢ
            - ∕
            - ⁄
            - ―
            - —
            -  
            - ¯
            - ®
            - ¶
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:38.060297+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:38.060297+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:38.060302+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:38.060304+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:38.060305+00:00'
