title: Potential Arbitrary Command Execution Using Msdt.EXE
id: 258fc8ce-8352-443a-9120-8a11e4857fa5
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects processes leveraging the "ms-msdt" handler or the "msdt.exe"
    binary to execute arbitrary commands as seen in the follina (CVE-2022-30190) vulnerability
references:
    - https://twitter.com/nao_sec/status/1530196847679401984
    - https://app.any.run/tasks/713f05d2-fe78-4b9d-a744-f7c133e3fafb/
    - https://twitter.com/_JohnHammond/status/1531672601067675648
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1202
date: '2022-05-29'
modified: '2024-03-13'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \msdt.exe
        OriginalFileName: msdt.exe
    selection_cmd_inline:
        CommandLine|contains: IT_BrowseForFile=
    selection_cmd_answerfile_flag:
        CommandLine|contains: ' PCWDiagnostic'
    selection_cmd_answerfile_param:
        CommandLine|contains|windash: ' -af '
    condition: selection_img and (selection_cmd_inline or all of selection_cmd_answerfile_*)
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:40:54.041414+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:40:54.041414+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:40:54.041442+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:40:54.041444+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:40:54.041446+00:00'
