title: Atlassian Confluence CVE-2022-26134
id: 7fb14105-530e-4e2e-8cfb-99f7d8700b66
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects spawning of suspicious child processes by Atlassian Confluence
    server which may indicate successful exploitation of CVE-2022-26134
references:
    - https://www.volexity.com/blog/2022/06/02/zero-day-exploitation-of-atlassian-confluence/
falsepositives:
    - Unknown
tags:
    - attack.initial-access
    - attack.execution
    - attack.t1190
    - attack.t1059
    - cve.2022-26134
date: '2022-06-03'
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        ParentImage|startswith: /opt/atlassian/confluence/
        ParentImage|endswith: /java
        CommandLine|contains:
            - /bin/sh
            - bash
            - dash
            - ksh
            - zsh
            - csh
            - fish
            - curl
            - wget
            - python
    condition: selection
related:
    -   id: 245f92e3-c4da-45f1-9070-bc552e06db11
        type: derived
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:19.605349+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:19.605349+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:36:19.605372+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:36:19.605375+00:00'
