id: 4ebc877f-4612-45cb-b3a5-8e3834db36c9
title: Webshell Hacking Activity Patterns
status: test
level: high
description: 'Detects certain parent child patterns found in cases in which a web
    shell is used to perform certain credential dumping or exfiltration activities
    on a compromised system

    '
author: Florian Roth (Nextron Systems)
date: '2022-03-17'
modified: '2023-11-09'
tags:
    - attack.persistence
    - attack.t1505.003
    - attack.t1018
    - attack.t1033
    - attack.t1087
references:
    - https://youtu.be/7aemGhaE9ds?t=641
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_webserver_image:
        ParentImage|endswith:
            - \caddy.exe
            - \httpd.exe
            - \nginx.exe
            - \php-cgi.exe
            - \w3wp.exe
            - \ws_tomcatservice.exe
    selection_webserver_characteristics_tomcat1:
        ParentImage|endswith:
            - \java.exe
            - \javaw.exe
        ParentImage|contains:
            - -tomcat-
            - \tomcat
    selection_webserver_characteristics_tomcat2:
        ParentImage|endswith:
            - \java.exe
            - \javaw.exe
        CommandLine|contains:
            - catalina.jar
            - CATALINA_HOME
    selection_child_1:
        CommandLine|contains|all:
            - rundll32
            - comsvcs
    selection_child_2:
        CommandLine|contains|all:
            - ' -hp'
            - ' a '
            - ' -m'
    selection_child_3:
        CommandLine|contains|all:
            - net
            - ' user '
            - ' /add'
    selection_child_4:
        CommandLine|contains|all:
            - net
            - ' localgroup '
            - ' administrators '
            - /add
    selection_child_5:
        Image|endswith:
            - \ntdsutil.exe
            - \ldifde.exe
            - \adfind.exe
            - \procdump.exe
            - \Nanodump.exe
            - \vssadmin.exe
            - \fsutil.exe
    selection_child_6:
        CommandLine|contains:
            - ' -decode '
            - ' -NoP '
            - ' -W Hidden '
            - ' /decode '
            - ' /ticket:'
            - ' sekurlsa'
            - .dmp full
            - .downloadfile(
            - .downloadstring(
            - FromBase64String
            - process call create
            - 'reg save '
            - whoami /priv
    condition: 1 of selection_webserver_* and 1 of selection_child_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:37:16.519240+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:37:16.519240+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:37:16.519306+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:37:16.519312+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:37:16.519314+00:00'
