title: AddinUtil.EXE Execution From Uncommon Directory
id: 6120ac2a-a34b-42c0-a9bd-1fb9f459f348
status: test
level: medium
author: Michael McKinley (@McKinleyMike), Tony Latteri (@TheLatteri)
description: Detects execution of the Add-In deployment cache updating utility (AddInutil.exe)
    from a non-standard directory.
references:
    - https://www.blue-prints.blog/content/blog/posts/lolbin/addinutil-lolbas.html
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1218
date: '2023-09-18'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \addinutil.exe
        OriginalFileName: AddInUtil.exe
    filter_main_legit_location:
        Image|contains:
            - :\Windows\Microsoft.NET\Framework\
            - :\Windows\Microsoft.NET\Framework64\
            - :\Windows\WinSxS\
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:48:00.214815+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:48:00.214815+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:48:00.214833+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:48:00.215055+00:00'
