title: Potentially Suspicious Usage Of Qemu
id: 5fc297ae-25b6-488a-8f25-cc12ac29b744
status: experimental
level: medium
author: Muhammad Faisal (@faisalusuf), Hunter Juhan (@threatHNTR)
description: 'Detects potentially suspicious execution of the Qemu utility in a Windows
    environment.

    Threat actors have leveraged this utility and this technique for achieving network
    access as reported by Kaspersky.

    '
references:
    - https://securelist.com/network-tunneling-with-qemu/111803/
    - https://www.qemu.org/docs/master/system/invocation.html#hxtool-5
falsepositives:
    - Unknown
tags:
    - attack.command-and-control
    - attack.t1090
    - attack.t1572
date: '2024-06-03'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - -m 1M
            - -m 2M
            - -m 3M
        CommandLine|contains|all:
            - restrict=off
            - '-netdev '
            - connect=
            - -nographic
    filter_main_normal_usecase:
        CommandLine|contains:
            - ' -cdrom '
            - ' type=virt '
            - ' -blockdev '
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:48:39.969022+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:48:39.969022+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:48:39.969059+00:00'
