id: 9a7a0393-2144-4626-9bf1-7c2f5a7321db
title: System Network Connections Discovery - MacOs
status: test
level: informational
description: Detects usage of system utilities to discover system network connections
author: Daniil Yugoslavskiy, oscd.community
date: '2020-10-19'
modified: '2022-12-28'
tags:
    - attack.discovery
    - attack.t1049
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1049/T1049.md
falsepositives:
    - Legitimate activities
taxonomy: sigma
logsource:
    category: process_creation
    product: macos
detection:
    selection:
        Image|endswith:
            - /who
            - /w
            - /last
            - /lsof
            - /netstat
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:13:08.114028+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-11-26T02:13:08.114028+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:13:08.114069+00:00'
