id: 2158f96f-43c2-43cb-952a-ab4580f32382
title: Screen Capture Activity Via Psr.EXE
status: test
level: medium
description: Detects execution of Windows Problem Steps Recorder (psr.exe), a utility
    used to record the user screen and clicks.
author: Beyu Denis, oscd.community
date: '2019-10-12'
modified: '2024-01-04'
tags:
    - attack.collection
    - attack.t1113
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Psr/
    - https://web.archive.org/web/20200229201156/https://www.sans.org/cyber-security-summit/archives/file/summit-archive-1493861893.pdf
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \Psr.exe
        CommandLine|contains:
            - /start
            - -start
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:32:37.351989+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:32:37.351989+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:32:37.352018+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:32:37.352022+00:00'
