title: Potential Xterm Reverse Shell
id: 4e25af4b-246d-44ea-8563-e42aacab006b
status: test
level: medium
author: '@d4ns4n_'
description: Detects usage of "xterm" as a potential reverse shell tunnel
references:
    - https://pentestmonkey.net/cheat-sheet/shells/reverse-shell-cheat-sheet
    - https://www.revshells.com/
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1059
date: '2023-04-24'
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|contains: xterm
        CommandLine|contains: -display
        CommandLine|endswith: :1
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:35.567382+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:35.567382+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:36:35.567395+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:36:35.567397+00:00'
