title: Copy .DMP/.DUMP Files From Remote Share Via Cmd.EXE
id: 044ba588-dff4-4918-9808-3f95e8160606
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects usage of the copy builtin cmd command to copy files with the
    ".dmp"/".dump" extension from a remote share
references:
    - https://thedfirreport.com/2022/09/26/bumblebee-round-two/
falsepositives:
    - Unknown
tags:
    - attack.credential-access
date: '2022-09-27'
modified: '2023-09-12'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \cmd.exe
        OriginalFileName: Cmd.Exe
    selection_cli:
        CommandLine|contains|all:
            - 'copy '
            - ' \\'
        CommandLine|contains:
            - .dmp
            - .dump
            - .hdmp
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:48:50.177838+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:48:50.177838+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:48:50.177861+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:48:50.177863+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:48:50.177866+00:00'
