id: 84c9e83c-599a-458a-a0cb-0ecce44e807a
title: Ufw Force Stop Using Ufw-Init
status: test
level: medium
description: Detects attempts to force stop the ufw using ufw-init
author: Joseliyo Sanchez, @Joseliyo_Jstnk
date: '2023-01-18'
tags:
    - attack.defense-evasion
    - attack.t1562.004
references:
    - https://blogs.blackberry.com/
    - https://twitter.com/Joseliyo_Jstnk/status/1620131033474822144
falsepositives:
    - Network administrators
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection_init:
        CommandLine|contains|all:
            - -ufw-init
            - force-stop
    selection_ufw:
        CommandLine|contains|all:
            - ufw
            - disable
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:15:55.913130+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-13T20:15:55.913130+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:15:55.913136+00:00'
