id: b6b49cd1-34d6-4ead-b1bf-176e9edba9a4
title: Potential PowerShell Obfuscation Via Reversed Commands
status: test
level: high
description: Detects the presence of reversed PowerShell commands in the CommandLine.
    This is often used as a method of obfuscation by attackers
author: Teymur Kheirkhabarov (idea), Vasiliy Burov (rule), oscd.community, Tim Shelton
date: '2020-10-11'
modified: '2023-05-31'
tags:
    - attack.defense-evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
references:
    - https://2019.offzone.moscow/ru/report/hunting-for-powershell-abuses/
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=66
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
        OriginalFileName:
            - PowerShell.EXE
            - pwsh.dll
    selection_cli:
        CommandLine|contains:
            - hctac
            - kaerb
            - dnammoc
            - ekovn
            - eliFd
            - rahc
            - etirw
            - golon
            - tninon
            - eddih
            - tpircS
            - ssecorp
            - llehsrewop
            - esnopser
            - daolnwod
            - tneilCbeW
            - tneilc
            - ptth
            - elifotevas
            - 46esab
            - htaPpmeTteG
            - tcejbO
            - maerts
            - hcaerof
            - retupmoc
    filter_main_encoded_keyword:
        CommandLine|contains:
            - ' -EncodedCommand '
            - ' -enc '
    condition: all of selection_* and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:57.131033+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:57.131033+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:57.131037+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:57.131039+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:57.131040+00:00'
