title: DNS Exfiltration and Tunneling Tools Execution
id: 98a96a5a-64a0-4c42-92c5-489da3866cb0
status: test
level: high
author: Daniil Yugoslavskiy, oscd.community
description: Well-known DNS Exfiltration tools execution
references:
    - https://github.com/iagox86/dnscat2
    - https://github.com/yarrick/iodine
falsepositives:
    - Unlikely
tags:
    - attack.exfiltration
    - attack.t1048.001
    - attack.command-and-control
    - attack.t1071.004
    - attack.t1132.001
date: '2019-10-24'
modified: '2021-11-27'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \iodine.exe
        Image|contains: \dnscat2
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:47:53.038937+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:47:53.038937+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:47:53.038950+00:00'
