title: Copying Sensitive Files with Credential Data
id: e7be6119-fc37-43f0-ad4f-1f3f99be2f9f
status: test
level: high
author: Teymur Kheirkhabarov, Daniil Yugoslavskiy, oscd.community
description: Files with well-known filenames (sensitive files with credential data)
    copying
references:
    - https://room362.com/post/2013/2013-06-10-volume-shadow-copy-ntdsdit-domain-hashes-remotely-part-1/
    - https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
    - https://dfironthemountain.wordpress.com/2018/12/06/locked-file-access-using-esentutl-exe/
    - https://github.com/LOLBAS-Project/LOLBAS/blob/2cc01b01132b5c304027a658c698ae09dd6a92bf/yml/OSBinaries/Esentutl.yml
falsepositives:
    - Copying sensitive files for legitimate use (eg. backup) or forensic investigation
        by legitimate incident responder or forensic investigator.
tags:
    - attack.credential-access
    - attack.t1003.002
    - attack.t1003.003
    - car.2013-07-001
    - attack.s0404
date: '2019-10-22'
modified: '2024-06-04'
logsource:
    category: process_creation
    product: windows
detection:
    selection_esent_img:
        Image|endswith: \esentutl.exe
        OriginalFileName: \esentutl.exe
    selection_esent_cli:
        CommandLine|contains|windash:
            - vss
            - ' /m '
            - ' /y '
    selection_susp_paths:
        CommandLine|contains:
            - \config\RegBack\sam
            - \config\RegBack\security
            - \config\RegBack\system
            - \config\sam
            - \config\security
            - '\config\system '
            - \repair\sam
            - \repair\security
            - \repair\system
            - \windows\ntds\ntds.dit
    condition: all of selection_esent_* or selection_susp_paths
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:49:10.089797+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:49:10.089797+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:49:10.089817+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:49:10.089819+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:49:10.089820+00:00'
