id: c615d676-f655-46b9-b913-78729021e5d7
title: Data Export From MSSQL Table Via BCP.EXE
status: experimental
level: medium
description: 'Detects the execution of the BCP utility in order to export data from
    the database.

    Attackers were seen saving their malware to a database column or table and then
    later extracting it via "bcp.exe" into a file.

    '
author: Omar Khaled (@beacon_exe), MahirAli Khan (in/mahiralikhan), Nasreddine Bencherchali
    (Nextron Systems)
date: '2024-08-20'
tags:
    - attack.execution
    - attack.t1048
references:
    - https://docs.microsoft.com/en-us/sql/tools/bcp-utility
    - https://asec.ahnlab.com/en/61000/
    - https://asec.ahnlab.com/en/78944/
    - https://www.huntress.com/blog/attacking-mssql-servers
    - https://www.huntress.com/blog/attacking-mssql-servers-pt-ii
    - https://news.sophos.com/en-us/2024/08/07/sophos-mdr-hunt-tracks-mimic-ransomware-campaign-against-organizations-in-india/
    - https://research.nccgroup.com/2018/03/10/apt15-is-alive-and-strong-an-analysis-of-royalcli-and-royaldns/
falsepositives:
    - Legitimate data export operations.
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \bcp.exe
        OriginalFileName: BCP.exe
    selection_cli:
        CommandLine|contains:
            - ' out '
            - ' queryout '
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:33:26.874659+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:33:26.874659+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:33:26.874679+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:33:26.874681+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:33:26.874683+00:00'
