title: Time Machine Backup Deletion Attempt Via Tmutil - MacOS
id: 452df256-da78-427a-866f-49fa04417d74
status: experimental
level: medium
author: Pratinav Chandra
description: 'Detects deletion attempts of MacOS Time Machine backups via the native
    backup utility "tmutil".

    An adversary may perform this action before launching a ransonware attack to prevent
    the victim from restoring their files.

    '
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1490/T1490.md#atomic-test-12---disable-time-machine
    - https://www.loobins.io/binaries/tmutil/
falsepositives:
    - Legitimate activities
tags:
    - attack.impact
    - attack.t1490
date: '2024-05-29'
logsource:
    category: process_creation
    product: macos
detection:
    selection_img:
        Image|endswith: /tmutil
        CommandLine|contains: tmutil
    selection_cmd:
        CommandLine|contains: delete
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:34:09.698197+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-12-04T01:34:09.698197+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:34:09.698210+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:34:09.698212+00:00'
