id: 379fa130-190e-4c3f-b7bc-6c8e834485f3
title: File Deletion Via Del
status: test
level: low
description: 'Detects execution of the builtin "del"/"erase" commands in order to
    delete files.

    Adversaries may delete files left behind by the actions of their intrusion activity.

    Malware, tools, or other non-native files dropped or created on a system by an
    adversary may leave traces to indicate to what was done within a network and how.

    Removal of these files can occur during an intrusion, or as part of a post-intrusion
    process to minimize the adversary''s footprint.

    '
author: frack113
date: '2022-01-15'
modified: '2024-03-05'
tags:
    - attack.defense-evasion
    - attack.t1070.004
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.004/T1070.004.md
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/erase
falsepositives:
    - False positives levels will differ Depending on the environment. You can use
        a combination of ParentImage and other keywords from the CommandLine field
        to filter legitimate activity
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \cmd.exe
        OriginalFileName: Cmd.Exe
    selection_del:
        CommandLine|contains:
            - 'del '
            - 'erase '
    selection_flags:
        CommandLine|contains|windash:
            - ' -f'
            - ' -s'
            - ' -q'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:26:54.643258+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:26:54.643258+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:26:54.643288+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:26:54.643292+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:26:54.643294+00:00'
