id: de16d92c-c446-4d53-8938-10aeef41c8b6
title: Computer Password Change Via Ksetup.EXE
status: test
level: medium
description: Detects password change for the computer's domain account or host principal
    via "ksetup.exe"
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-04-06'
tags:
    - attack.execution
references:
    - https://twitter.com/Oddvarmoe/status/1641712700605513729
    - https://learn.microsoft.com/en-gb/windows-server/administration/windows-commands/ksetup
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \ksetup.exe
        OriginalFileName: ksetup.exe
    selection_cli:
        CommandLine|contains: ' /setcomputerpassword '
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:31:46.014911+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:31:46.014911+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:31:46.014922+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:31:46.014924+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:31:46.014933+00:00'
