id: 2ddef153-167b-4e89-86b6-757a9e65dcac
title: File Download Via Bitsadmin To A Suspicious Target Folder
status: test
level: high
description: Detects usage of bitsadmin downloading a file to a suspicious target
    folder
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: '2022-06-28'
modified: '2023-05-30'
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.t1197
    - attack.s0190
    - attack.t1036.003
references:
    - https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin
    - https://isc.sans.edu/diary/22264
    - https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/
    - https://blog.talosintelligence.com/breaking-the-silence-recent-truebot-activity/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \bitsadmin.exe
        OriginalFileName: bitsadmin.exe
    selection_flags:
        CommandLine|contains:
            - ' /transfer '
            - ' /create '
            - ' /addfile '
    selection_folder:
        CommandLine|contains:
            - :\Perflogs
            - :\ProgramData\
            - :\Temp\
            - :\Users\Public\
            - :\Windows\
            - \AppData\Local\Temp\
            - \AppData\Roaming\
            - \Desktop\
            - '%ProgramData%'
            - '%public%'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:19:57.241085+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:19:57.241085+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:19:57.241116+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:19:57.241120+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:19:57.241123+00:00'
