title: PowerShell Base64 Encoded Invoke Keyword
id: 6385697e-9f1b-40bd-8817-f4a91f40508e
status: test
level: high
author: pH-T (Nextron Systems), Harjot Singh, @cyb3rjy0t
description: Detects UTF-8 and UTF-16 Base64 encoded powershell 'Invoke-' calls
references:
    - https://thedfirreport.com/2022/05/09/seo-poisoning-a-gootloader-story/
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1059.001
    - attack.defense-evasion
    - attack.t1027
date: '2022-05-20'
modified: '2023-04-06'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
        OriginalFileName:
            - PowerShell.EXE
            - pwsh.dll
    selection_cli_enc:
        CommandLine|contains: ' -e'
    selection_cli_invoke:
        CommandLine|contains:
            - SQBuAHYAbwBrAGUALQ
            - kAbgB2AG8AawBlAC0A
            - JAG4AdgBvAGsAZQAtA
            - SW52b2tlL
            - ludm9rZS
            - JbnZva2Ut
    condition: all of selection_*
related:
    -   id: fd6e2919-3936-40c9-99db-0aa922c356f7
        type: obsolete
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:45:38.512937+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:45:38.512937+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:45:38.512959+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:45:38.512961+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:45:38.512962+00:00'
