id: 2d2f44ff-4611-4778-a8fc-323a0e9850cc
title: Inline Python Execution - Spawn Shell Via OS System Library
status: experimental
level: high
description: 'Detects execution of inline Python code via the "-c" in order to call
    the "system" function from the "os" library, and spawn a shell.

    '
author: Li Ling, Andy Parkidomo, Robert Rakowski, Blake Hartstein (Bloomberg L.P.)
date: '2024-09-02'
tags:
    - attack.execution
    - attack.t1059
references:
    - https://gtfobins.github.io/gtfobins/python/#shell
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection_img:
        Image|endswith:
            - /python
            - /python2
            - /python3
        Image|contains:
            - /python2.
            - /python3.
    selection_cli:
        CommandLine|contains|all:
            - ' -c '
            - os.system(
        CommandLine|contains:
            - /bin/bash
            - /bin/dash
            - /bin/fish
            - /bin/sh
            - /bin/zsh
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:15:55.278708+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-13T20:15:55.278708+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:15:55.278718+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:15:55.278720+00:00'
