title: Suspicious Registry Modification From ADS Via Regini.EXE
id: 77946e79-97f1-45a2-84b4-f37b5c0d8682
status: test
level: high
author: Eli Salem, Sander Wiebing, oscd.community
description: Detects the import of an alternate data stream with regini.exe, regini.exe
    can be used to modify registry keys.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Regini/
    - https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/regini
fields:
    - ParentImage
    - CommandLine
falsepositives:
    - Unknown
tags:
    - attack.t1112
    - attack.defense-evasion
date: '2020-10-12'
modified: '2023-02-08'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \regini.exe
        OriginalFileName: REGINI.EXE
    selection_re:
        CommandLine|re: :[^ \\]
    condition: all of selection_*
related:
    -   id: 5f60740a-f57b-4e76-82a1-15b6ff2cb134
        type: derived
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:45:30.941387+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:45:30.941387+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:45:30.941404+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:45:30.941406+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:45:30.941408+00:00'
