id: 174afcfa-6e40-4ae9-af64-496546389294
title: Credential Dumping Attempt Via Svchost
status: test
level: high
description: Detects when a process tries to access the memory of svchost to potentially
    dump credentials.
author: Florent Labouyrie
date: '2021-04-30'
modified: '2022-10-09'
tags:
    - attack.t1548
references:
    - Internal Research
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_access
    product: windows
detection:
    selection:
        TargetImage|endswith: \svchost.exe
        GrantedAccess: '0x143a'
    filter_main_known_processes:
        SourceImage|endswith:
            - \services.exe
            - \msiexec.exe
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_access
            mapped_at: '2025-11-13T20:18:52.359071+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:18:52.359071+00:00'
    detection_fields:
        -   source_field: TargetImage
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-11-13T20:18:52.359124+00:00'
        -   source_field: GrantedAccess
            target_table: process_activity
            target_field: requested_permissions
            mapped_at: '2025-11-13T20:18:52.359128+00:00'
        -   source_field: SourceImage
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-11-13T20:18:52.359130+00:00'
