title: ESXi VSAN Information Discovery Via ESXCLI
id: d54c2f06-aca9-4e2b-81c9-5317858f4b79
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems), Cedric Maurugeon
description: Detects execution of the "esxcli" command with the "vsan" flag in order
    to retrieve information about virtual storage. Seen used by malware such as DarkSide.
references:
    - https://www.trendmicro.com/en_us/research/21/e/darkside-linux-vms-targeted.html
    - https://www.trendmicro.com/en_us/research/22/a/analysis-and-Impact-of-lockbit-ransomwares-first-linux-and-vmware-esxi-variant.html
    - https://developer.broadcom.com/xapis/esxcli-command-reference/7.0.0/namespace/esxcli_vsan.html
falsepositives:
    - Legitimate administration activities
tags:
    - attack.discovery
    - attack.t1033
    - attack.t1007
date: '2023-09-04'
logsource:
    category: process_creation
    product: linux
detection:
    selection_img:
        Image|endswith: /esxcli
        CommandLine|contains: vsan
    selection_cli:
        CommandLine|contains:
            - ' get'
            - ' list'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:48.173310+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:48.173310+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:36:48.173333+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:36:48.173335+00:00'
