id: a16980c2-0c56-4de0-9a79-17971979efdd
title: Cmd.EXE Missing Space Characters Execution Anomaly
status: test
level: high
description: 'Detects Windows command lines that miss a space before or after the
    /c flag when running a command using the cmd.exe.

    This could be a sign of obfuscation of a fat finger problem (typo by the developer).

    '
author: Florian Roth (Nextron Systems)
date: '2022-08-23'
modified: '2023-03-06'
tags:
    - attack.execution
    - attack.t1059.001
references:
    - https://twitter.com/cyb3rops/status/1562072617552678912
    - https://ss64.com/nt/cmd.html
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        CommandLine|contains:
            - cmd.exe/c
            - \cmd/c
            - '"cmd/c'
            - cmd.exe/k
            - \cmd/k
            - '"cmd/k'
            - cmd.exe/r
            - \cmd/r
            - '"cmd/r'
    selection2:
        CommandLine|contains:
            - /cwhoami
            - /cpowershell
            - /cschtasks
            - /cbitsadmin
            - /ccertutil
            - /kwhoami
            - /kpowershell
            - /kschtasks
            - /kbitsadmin
            - /kcertutil
    selection3:
        CommandLine|contains:
            - cmd.exe /c
            - cmd /c
            - cmd.exe /k
            - cmd /k
            - cmd.exe /r
            - cmd /r
    filter_generic:
        CommandLine|contains:
            - 'cmd.exe /c '
            - 'cmd /c '
            - 'cmd.exe /k '
            - 'cmd /k '
            - 'cmd.exe /r '
            - 'cmd /r '
    filter_fp:
        CommandLine|contains: AppData\Local\Programs\Microsoft VS Code\resources\app\node_modules
        CommandLine|endswith: cmd.exe/c .
        CommandLine: cmd.exe /c
    condition: 1 of selection* and not 1 of filter_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:28:14.499269+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:28:14.499269+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:28:14.499299+00:00'
