id: 22236d75-d5a0-4287-bf06-c93b1770860f
title: Triple Cross eBPF Rootkit Install Commands
status: test
level: high
description: Detects default install commands of the Triple Cross eBPF rootkit based
    on the "deployer.sh" script
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-07-05'
tags:
    - attack.defense-evasion
    - attack.t1014
references:
    - https://github.com/h3xduck/TripleCross/blob/1f1c3e0958af8ad9f6ebe10ab442e75de33e91de/apps/deployer.sh
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith: /sudo
        CommandLine|contains|all:
            - ' tc '
            - ' enp0s3 '
        CommandLine|contains:
            - ' qdisc '
            - ' filter '
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:15:56.754559+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-13T20:15:56.754559+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:15:56.754572+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:15:56.754574+00:00'
