id: 322ed9ec-fcab-4f67-9a34-e7c6aef43614
title: New Port Forwarding Rule Added Via Netsh.EXE
status: test
level: medium
description: Detects the execution of netsh commands that configure a new port forwarding
    (PortProxy) rule
author: Florian Roth (Nextron Systems), omkar72, oscd.community, Swachchhanda Shrawan
    Poudel
date: '2019-01-29'
modified: '2023-09-01'
tags:
    - attack.lateral-movement
    - attack.defense-evasion
    - attack.command-and-control
    - attack.t1090
references:
    - https://www.fireeye.com/blog/threat-research/2019/01/bypassing-network-restrictions-through-rdp-tunneling.html
    - https://adepts.of0x.cc/netsh-portproxy-code/
    - https://www.dfirnotes.net/portproxy_detection/
falsepositives:
    - Legitimate administration activity
    - WSL2 network bridge PowerShell script used for WSL/Kubernetes/Docker (e.g. https://github.com/microsoft/WSL/issues/4150#issuecomment-504209723)
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \netsh.exe
        OriginalFileName: netsh.exe
    selection_cli_1:
        CommandLine|contains|all:
            - interface
            - portproxy
            - add
            - v4tov4
    selection_cli_2:
        CommandLine|contains|all:
            - 'i '
            - 'p '
            - 'a '
            - 'v '
    selection_cli_3:
        CommandLine|contains|all:
            - connectp
            - listena
            - c=
    condition: selection_img and 1 of selection_cli_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:35:54.484905+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:35:54.484905+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:35:54.484926+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:35:54.484929+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:35:54.484931+00:00'
