title: Credentials from Password Stores - Keychain
id: b120b587-a4c2-4b94-875d-99c9807d6955
status: test
level: medium
author: Tim Ismilyaev, oscd.community, Florian Roth (Nextron Systems)
description: Detects passwords dumps from Keychain
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1555.001/T1555.001.md
    - https://gist.github.com/Capybara/6228955
falsepositives:
    - Legitimate administration activities
tags:
    - attack.credential-access
    - attack.t1555.001
date: '2020-10-19'
modified: '2021-11-27'
logsource:
    category: process_creation
    product: macos
detection:
    selection1:
        Image: /usr/bin/security
        CommandLine|contains:
            - find-certificate
            - ' export '
    selection2:
        CommandLine|contains:
            - ' dump-keychain '
            - ' login-keychain '
    condition: 1 of selection*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:34:36.512188+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-12-04T01:34:36.512188+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:34:36.512207+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:34:36.512209+00:00'
