title: Disk Image Mounting Via Hdiutil - MacOS
id: bf241472-f014-4f01-a869-96f99330ca8c
status: experimental
level: medium
author: Omar Khaled (@beacon_exe)
description: Detects the execution of the hdiutil utility in order to mount disk images.
references:
    - https://www.loobins.io/binaries/hdiutil/
    - https://www.sentinelone.com/blog/from-the-front-linesunsigned-macos-orat-malware-gambles-for-the-win/
    - https://ss64.com/mac/hdiutil.html
falsepositives:
    - Legitimate usage of hdiutil by administrators and users.
tags:
    - attack.initial-access
    - attack.t1566.001
    - attack.t1560.001
date: '2024-08-10'
logsource:
    category: process_creation
    product: macos
detection:
    selection:
        Image|endswith: /hdiutil
        CommandLine|contains:
            - 'attach '
            - 'mount '
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:34:21.514782+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-12-04T01:34:21.514782+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:34:21.514821+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:34:21.514823+00:00'
