id: 9ccba514-7cb6-4c5c-b377-700758f2f120
title: Suspicious Child Process of AspNetCompiler
status: test
level: high
description: Detects potentially suspicious child processes of "aspnet_compiler.exe".
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-08-14'
tags:
    - attack.defense-evasion
    - attack.t1127
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Aspnet_Compiler/
    - https://ijustwannared.team/2020/08/01/the-curious-case-of-aspnet_compiler-exe/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''4c7f49ee-2638-43bb-b85b-ce676c30b260''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''9f50fe98-fe5c-4a2d-86c7-fad7f63ed622''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''a01b8329-5953-4f73-ae2d-aa01e1f35f00''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|endswith: \aspnet_compiler.exe
    selection_child:
        Image|endswith:
            - \calc.exe
            - \notepad.exe
        Image|contains:
            - \Users\Public\
            - \AppData\Local\Temp\
            - \AppData\Local\Roaming\
            - :\Temp\
            - :\Windows\Temp\
            - :\Windows\System32\Tasks\
            - :\Windows\Tasks\
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:30:45.876902+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:30:45.876902+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:30:45.876917+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:30:45.876920+00:00'
