title: Time Travel Debugging Utility Usage
id: 0b4ae027-2a2d-4b93-8c7e-962caaba5b2a
status: test
level: high
author: Ensar Şamil, @sblmsrsn, @oscd_initiative
description: Detects usage of Time Travel Debugging Utility. Adversaries can execute
    malicious processes and dump processes, such as lsass.exe, via tttracer.exe.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Tttracer/
    - https://twitter.com/mattifestation/status/1196390321783025666
    - https://twitter.com/oulusoyum/status/1191329746069655553
falsepositives:
    - Legitimate usage by software developers/testers
tags:
    - attack.defense-evasion
    - attack.credential-access
    - attack.t1218
    - attack.t1003.001
date: '2020-10-06'
modified: '2022-10-09'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \tttracer.exe
    condition: selection
related:
    -   id: e76c8240-d68f-4773-8880-5c6f63595aaf
        type: derived
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:46:49.307977+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:46:49.307977+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:46:49.307990+00:00'
