id: a7ee1722-c3c5-aeff-3212-c777e4733217
title: Disable Windows Defender AV Security Monitoring
status: test
level: high
description: Detects attackers attempting to disable Windows Defender using Powershell
author: ok @securonix invrep-de, oscd.community, frack113
date: '2020-10-12'
modified: '2022-11-18'
tags:
    - attack.defense-evasion
    - attack.t1562.001
references:
    - https://research.nccgroup.com/2020/06/23/wastedlocker-a-new-ransomware-variant-developed-by-the-evil-corp-group/
    - https://rvsec0n.wordpress.com/2020/01/24/malwares-that-bypass-windows-defender/
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
falsepositives:
    - Minimal, for some older versions of dev tools, such as pycharm, developers were
        known to sometimes disable Windows Defender to improve performance, but this
        generally is not considered a good security practice.
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_pwsh_binary:
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
        OriginalFileName:
            - PowerShell.EXE
            - pwsh.dll
    selection_pwsh_cli:
        CommandLine|contains:
            - -DisableBehaviorMonitoring $true
            - -DisableRuntimeMonitoring $true
    selection_sc_binary:
        Image|endswith: \sc.exe
        OriginalFileName: sc.exe
    selection_sc_tamper_cmd_stop:
        CommandLine|contains|all:
            - stop
            - WinDefend
    selection_sc_tamper_cmd_delete:
        CommandLine|contains|all:
            - delete
            - WinDefend
    selection_sc_tamper_cmd_disabled:
        CommandLine|contains|all:
            - config
            - WinDefend
            - start=disabled
    condition: all of selection_pwsh_* or (selection_sc_binary and 1 of selection_sc_tamper_*)
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:30:42.879051+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:30:42.879051+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:30:42.879076+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:30:42.879080+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:30:42.879083+00:00'
