title: Suspicious Advpack Call Via Rundll32.EXE
id: a1473adb-5338-4a20-b4c3-126763e2d3d3
status: test
level: high
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
description: Detects execution of "rundll32" calling "advpack.dll" with potential
    obfuscated ordinal calls in order to leverage the "RegisterOCX" function
references:
    - https://twitter.com/Hexacorn/status/1224848930795552769
    - http://www.hexacorn.com/blog/2020/02/05/stay-positive-lolbins-not/
falsepositives:
    - Unlikely
tags:
    - attack.defense-evasion
date: '2023-05-17'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \rundll32.exe
        OriginalFileName: RUNDLL32.EXE
        CommandLine|contains: rundll32
    selection_cli_dll:
        CommandLine|contains: advpack
    selection_cli_ordinal:
        CommandLine|contains|all:
            - '#+'
            - '12'
        CommandLine|contains: '#-'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:43:16.008043+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:43:16.008043+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:43:16.008057+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:43:16.008059+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:43:16.008060+00:00'
