id: fa1a7e52-3d02-435b-81b8-00da14dd66c1
title: Diskshadow Script Mode - Execution From Potential Suspicious Location
status: test
level: medium
description: Detects execution of "Diskshadow.exe" in script mode using the "/s" flag
    where the script is located in a potentially suspicious location.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-09-15'
modified: '2024-03-05'
tags:
    - attack.defense-evasion
    - attack.t1218
references:
    - https://bohops.com/2018/03/26/diskshadow-the-return-of-vss-evasion-persistence-and-active-directory-database-extraction/
    - https://www.ired.team/offensive-security/credential-access-and-credential-dumping/ntds.dit-enumeration
    - https://medium.com/@cyberjyot/lolbin-execution-via-diskshadow-f6ff681a27a4
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/diskshadow
    - https://www.lifars.com/wp-content/uploads/2022/01/GriefRansomware_Whitepaper-2.pdf
    - https://www.zscaler.com/blogs/security-research/technical-analysis-crytox-ransomware
    - https://research.checkpoint.com/2022/evilplayout-attack-against-irans-state-broadcaster/
falsepositives:
    - False positives may occur if you execute the script from one of the paths mentioned
        in the rule. Apply additional filters that fits your org needs.
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''1dde5376-a648-492e-9e54-4241dd9b0c7f''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''9f546b25-5f12-4c8d-8532-5893dcb1e4b8''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''56b1dde8-b274-435f-a73a-fb75eb81262a''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''0c2f8629-7129-4a8a-9897-7e0768f13ff2''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        OriginalFileName: diskshadow.exe
        Image|endswith: \diskshadow.exe
    selection_cli:
        CommandLine|contains|windash: '-s '
    selection_paths:
        CommandLine|contains:
            - :\Temp\
            - :\Windows\Temp\
            - \AppData\Local\
            - \AppData\Roaming\
            - \ProgramData\
            - \Users\Public\
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:37.114334+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:37.114334+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:37.114340+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:37.114341+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:37.114342+00:00'
