title: PowerShell Base64 Encoded IEX Cmdlet
id: 88f680b8-070e-402c-ae11-d2914f2257f1
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects usage of a base64 encoded "IEX" cmdlet in a process command line
references:
    - Internal Research
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1059.001
date: '2019-08-23'
modified: '2023-04-06'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|base64offset|contains:
            - IEX ([
            - iex ([
            - iex (New
            - IEX (New
            - IEX([
            - iex([
            - iex(New
            - IEX(New
            - IEX(('
            - iex(('
        CommandLine|contains:
            - SQBFAFgAIAAoAFsA
            - kARQBYACAAKABbA
            - JAEUAWAAgACgAWw
            - aQBlAHgAIAAoAFsA
            - kAZQB4ACAAKABbA
            - pAGUAeAAgACgAWw
            - aQBlAHgAIAAoAE4AZQB3A
            - kAZQB4ACAAKABOAGUAdw
            - pAGUAeAAgACgATgBlAHcA
            - SQBFAFgAIAAoAE4AZQB3A
            - kARQBYACAAKABOAGUAdw
            - JAEUAWAAgACgATgBlAHcA
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:48:41.296673+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:48:41.296673+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:48:41.296687+00:00'
