title: Domain Trust Discovery Via Dsquery
id: 3bad990e-4848-4a78-9530-b427d854aac0
status: test
level: medium
author: E.M. Anhaus, Tony Lambert, oscd.community, omkar72
description: Detects execution of "dsquery.exe" for domain trust discovery
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1482/T1482.md
    - https://posts.specterops.io/an-introduction-to-manual-active-directory-querying-with-dsquery-and-ldapsearch-84943c13d7eb?gi=41b97a644843
falsepositives:
    - Legitimate use of the utilities by legitimate user for legitimate reason
tags:
    - attack.discovery
    - attack.t1482
date: '2019-10-24'
modified: '2023-02-02'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \dsquery.exe
        OriginalFileName: dsquery.exe
    selection_cli:
        CommandLine|contains: trustedDomain
    condition: all of selection_*
related:
    -   id: b23fcb74-b1cb-4ff7-a31d-bfe2a7ba453b
        type: similar
    -   id: 77815820-246c-47b8-9741-e0def3f57308
        type: obsolete
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:47:16.478676+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:47:16.478676+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:47:16.478689+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:47:16.478691+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:47:16.478692+00:00'
