title: Linux Network Service Scanning Tools Execution
id: 3e102cd9-a70d-4a7a-9508-403963092f31
status: test
level: low
author: Alejandro Ortuno, oscd.community, Georg Lauenstein (sure[secure])
description: Detects execution of network scanning and reconnaisance tools. These
    tools can be used for the enumeration of local or remote network services for
    example.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1046/T1046.md
    - https://github.com/projectdiscovery/naabu
    - https://github.com/Tib3rius/AutoRecon
falsepositives:
    - Legitimate administration activities
tags:
    - attack.discovery
    - attack.t1046
date: '2020-10-21'
modified: '2024-09-19'
logsource:
    category: process_creation
    product: linux
detection:
    selection_netcat:
        Image|endswith:
            - /nc
            - /ncat
            - /netcat
            - /socat
    selection_network_scanning_tools:
        Image|endswith:
            - /autorecon
            - /hping
            - /hping2
            - /hping3
            - /naabu
            - /nmap
            - /nping
            - /telnet
            - /zenmap
    filter_main_netcat_listen_flag:
        CommandLine|contains:
            - ' --listen '
            - ' -l '
    condition: (selection_netcat and not filter_main_netcat_listen_flag) or selection_network_scanning_tools
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:13.932712+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:13.932712+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:36:13.932735+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:36:13.932738+00:00'
