id: 75f7a0e2-7154-4c4d-9eae-5cdb4e0a5c13
title: Write Protect For Storage Disabled
status: test
level: medium
description: 'Detects applications trying to modify the registry in order to disable
    any write-protect property for storage devices.

    This could be a precursor to a ransomware attack and has been an observed technique
    used by cypherpunk group.

    '
author: Sreeman
date: '2021-06-11'
modified: '2024-01-18'
tags:
    - attack.defense-evasion
    - attack.t1562
references:
    - https://www.manageengine.com/products/desktop-central/os-imaging-deployment/media-is-write-protected.html
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - \System\CurrentControlSet\Control
            - Write Protection
            - '0'
            - storage
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:58.264413+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:58.264413+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:58.264423+00:00'
