title: ESXi System Information Discovery Via ESXCLI
id: e80273e1-9faf-40bc-bd85-dbaff104c4e9
status: test
level: medium
author: Cedric Maurugeon
description: Detects execution of the "esxcli" command with the "system" flag in order
    to retrieve information about the different component of the system. Such as accounts,
    modules, NTP, etc.
references:
    - https://www.crowdstrike.com/blog/hypervisor-jackpotting-ecrime-actors-increase-targeting-of-esxi-servers/
    - https://developer.broadcom.com/xapis/esxcli-command-reference/7.0.0/namespace/esxcli_system.html
falsepositives:
    - Legitimate administration activities
tags:
    - attack.discovery
    - attack.t1033
    - attack.t1007
date: '2023-09-04'
logsource:
    category: process_creation
    product: linux
detection:
    selection_img:
        Image|endswith: /esxcli
        CommandLine|contains: system
    selection_cli:
        CommandLine|contains:
            - ' get'
            - ' list'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:23.155801+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:23.155801+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:36:23.155822+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:36:23.155826+00:00'
