id: 38879043-7e1e-47a9-8d46-6bec88e201df
title: Potential Persistence Attempt Via Existing Service Tampering
status: test
level: medium
description: Detects the modification of an existing service in order to execute an
    arbitrary payload when the service is started or killed as a potential method
    for persistence.
author: Sreeman
date: '2020-09-29'
modified: '2023-02-04'
tags:
    - attack.persistence
    - attack.t1543.003
    - attack.t1574.011
references:
    - https://pentestlab.blog/2020/01/22/persistence-modify-existing-service/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_sc:
        CommandLine|contains|all:
            - 'sc '
            - 'config '
            - binpath=
            - 'sc '
            - failure
            - command=
    selection_reg_img:
        CommandLine|contains|all:
            - 'reg '
            - 'add '
            - FailureCommand
            - 'reg '
            - 'add '
            - ImagePath
    selection_reg_ext:
        CommandLine|contains:
            - .sh
            - .exe
            - .dll
            - .bin$
            - .bat
            - .cmd
            - .js
            - .msh$
            - .reg$
            - .scr
            - .ps
            - .vb
            - .jar
            - .pl
    condition: selection_sc or all of selection_reg_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:34.428655+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:34.428655+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:34.428659+00:00'
