id: 41ca393d-538c-408a-ac27-cf1e038be80c
title: Directory Removal Via Rmdir
status: test
level: low
description: 'Detects execution of the builtin "rmdir" command in order to delete
    directories.

    Adversaries may delete files left behind by the actions of their intrusion activity.

    Malware, tools, or other non-native files dropped or created on a system by an
    adversary may leave traces to indicate to what was done within a network and how.

    Removal of these files can occur during an intrusion, or as part of a post-intrusion
    process to minimize the adversary''s footprint.

    '
author: frack113
date: '2022-01-15'
modified: '2023-03-07'
tags:
    - attack.defense-evasion
    - attack.t1070.004
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.004/T1070.004.md
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/erase
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \cmd.exe
        OriginalFileName: Cmd.Exe
    selection_rmdir:
        CommandLine|contains: rmdir
    selection_flags:
        CommandLine|contains:
            - /s
            - /q
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:32:32.079496+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:32:32.079496+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:32:32.079521+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:32:32.079526+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:32:32.079529+00:00'
