title: Suspicious ZipExec Execution
id: 90dcf730-1b71-4ae7-9ffc-6fcf62bd0132
status: test
level: medium
author: frack113
description: ZipExec is a Proof-of-Concept (POC) tool to wrap binary-based tools into
    a password-protected zip file.
references:
    - https://twitter.com/SBousseaden/status/1451237393017839616
    - https://github.com/Tylous/ZipExec
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.defense-evasion
    - attack.t1218
    - attack.t1202
date: '2021-11-07'
modified: '2022-12-25'
logsource:
    category: process_creation
    product: windows
detection:
    run:
        CommandLine|contains|all:
            - /generic:Microsoft_Windows_Shell_ZipFolder:filename=
            - .zip
            - '/pass:'
            - '/user:'
    delete:
        CommandLine|contains|all:
            - /delete
            - Microsoft_Windows_Shell_ZipFolder:filename=
            - .zip
    condition: run or delete
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:43:33.075177+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:43:33.075177+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:43:33.075188+00:00'
