id: 91edcfb1-2529-4ac2-9ecc-7617f895c7e4
title: Weak or Abused Passwords In CLI
status: test
level: medium
description: 'Detects weak passwords or often abused passwords (seen used by threat
    actors) via the CLI.

    An example would be a threat actor creating a new user via the net command and
    providing the password inline

    '
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-09-14'
modified: '2024-02-23'
tags:
    - attack.defense-evasion
    - attack.execution
references:
    - https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/espionage-asia-governments
    - https://thedfirreport.com/2022/09/26/bumblebee-round-two/
    - https://www.microsoft.com/en-us/security/blog/2022/10/25/dev-0832-vice-society-opportunistic-ransomware-campaigns-impacting-us-education-sector/
    - https://www.huntress.com/blog/slashandgrab-screen-connect-post-exploitation-in-the-wild-cve-2024-1709-cve-2024-1708
falsepositives:
    - Legitimate usage of the passwords by users via commandline (should be discouraged)
    - Other currently unknown false positives
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - '123456789'
            - 123123qwE
            - Asd123.aaaa
            - Decryptme
            - P@ssw0rd!
            - Pass8080
            - password123
            - test@202
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:38.031922+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:38.031922+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:38.031926+00:00'
