title: ImagingDevices Unusual Parent/Child Processes
id: f11f2808-adb4-46c0-802a-8660db50fa99
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects unusual parent or children of the ImagingDevices.exe (Windows
    Contacts) process as seen being used with Bumblebee activity
references:
    - https://thedfirreport.com/2022/09/26/bumblebee-round-two/
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.execution
date: '2022-09-27'
modified: '2022-12-29'
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|endswith:
            - \WmiPrvSE.exe
            - \svchost.exe
            - \dllhost.exe
        Image|endswith: \ImagingDevices.exe
    selection_child:
        ParentImage|endswith: \ImagingDevices.exe
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:41:13.827676+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:41:13.827676+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:41:13.827690+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:41:13.827692+00:00'
