title: HackTool - SOAPHound Execution
id: e92a4287-e072-4a40-9739-370c106bb750
status: test
level: high
author: '@kostastsale'
description: 'Detects the execution of SOAPHound, a .NET tool for collecting Active
    Directory data, using specific command-line arguments that may indicate an attempt
    to extract sensitive AD information.

    '
references:
    - https://github.com/FalconForceTeam/SOAPHound
    - https://medium.com/falconforce/soaphound-tool-to-collect-active-directory-data-via-adws-165aca78288c
falsepositives:
    - Unknown
tags:
    - attack.discovery
    - attack.t1087
date: '2024-01-26'
logsource:
    category: process_creation
    product: windows
detection:
    selection_1:
        CommandLine|contains:
            - ' --buildcache '
            - ' --bhdump '
            - ' --certdump '
            - ' --dnsdump '
    selection_2:
        CommandLine|contains:
            - ' -c '
            - ' --cachefilename '
            - ' -o '
            - ' --outputdirectory'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:47:48.230584+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:47:48.230584+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:47:48.230617+00:00'
