id: 220457c1-1c9f-4c2e-afe6-9598926222c1
title: Delete All Scheduled Tasks
status: test
level: high
description: Detects the usage of schtasks with the delete flag and the asterisk symbol
    to delete all tasks from the schedule of the local computer, including tasks scheduled
    by other users.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-09-09'
tags:
    - attack.impact
    - attack.t1489
references:
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks-delete
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \schtasks.exe
        CommandLine|contains|all:
            - ' /delete '
            - /tn \*
            - ' /f'
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:35:14.992619+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:35:14.992619+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:35:14.992641+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:35:14.992644+00:00'
