id: 48a61b29-389f-4032-b317-b30de6b95314
title: Suspicious Plink Port Forwarding
status: test
level: high
description: Detects suspicious Plink tunnel port forwarding to a local port
author: Florian Roth (Nextron Systems)
date: '2021-01-19'
modified: '2022-10-09'
tags:
    - attack.command-and-control
    - attack.t1572
    - attack.lateral-movement
    - attack.t1021.001
references:
    - https://www.real-sec.com/2019/04/bypassing-network-restrictions-through-rdp-tunneling/
    - https://medium.com/@informationsecurity/remote-ssh-tunneling-with-plink-exe-7831072b3d7d
falsepositives:
    - Administrative activity using a remote port forwarding to a local port
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Description: Command-line SSH, Telnet, and Rlogin client
        CommandLine|contains: ' -R '
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:30.853075+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:30.853075+00:00'
    detection_fields:
        -   source_field: Description
            target_table: process_activity
            target_field: message
            mapped_at: '2025-11-13T20:20:30.853130+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:30.853136+00:00'
