title: Pubprn.vbs Proxy Execution
id: 1fb76ab8-fa60-4b01-bddd-71e89bf555da
status: test
level: medium
author: frack113
description: Detects the use of the 'Pubprn.vbs' Microsoft signed script to execute
    commands.
references:
    - https://lolbas-project.github.io/lolbas/Scripts/Pubprn/
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1216.001
date: '2022-05-28'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - \pubprn.vbs
            - 'script:'
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:50:11.865715+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:50:11.865715+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:50:11.865746+00:00'
