title: Arbitrary File Download Via MSOHTMED.EXE
id: 459f2f98-397b-4a4a-9f47-6a5ec2f1c69d
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects usage of "MSOHTMED" to download arbitrary files
references:
    - https://github.com/LOLBAS-Project/LOLBAS/pull/238/files
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.execution
    - attack.t1218
date: '2022-08-19'
modified: '2023-11-09'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \MSOHTMED.exe
        OriginalFileName: MsoHtmEd.exe
    selection_cli:
        CommandLine|contains:
            - ftp://
            - http://
            - https://
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:47:51.936064+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:47:51.936064+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:47:51.936083+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:47:51.936085+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:47:51.936087+00:00'
