id: b17ea6f7-6e90-447e-a799-e6c0a493d6ce
title: Shadow Copies Creation Using Operating Systems Utilities
status: test
level: medium
description: Shadow Copies creation using operating systems utilities, possible credential
    access
author: Teymur Kheirkhabarov, Daniil Yugoslavskiy, oscd.community
date: '2019-10-22'
modified: '2022-11-10'
tags:
    - attack.credential-access
    - attack.t1003
    - attack.t1003.002
    - attack.t1003.003
references:
    - https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
    - https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/tutorial-for-ntds-goodness-vssadmin-wmis-ntdsdit-system/
falsepositives:
    - Legitimate administrator working with shadow copies, access for backup purposes
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
            - \wmic.exe
            - \vssadmin.exe
        OriginalFileName:
            - PowerShell.EXE
            - pwsh.dll
            - wmic.exe
            - VSSADMIN.EXE
    selection_cli:
        CommandLine|contains|all:
            - shadow
            - create
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:57.091040+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:57.091040+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:57.091049+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:57.091051+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:57.091053+00:00'
