title: PUA - DIT Snapshot Viewer
id: d3b70aad-097e-409c-9df2-450f80dc476b
status: test
level: high
author: Furkan Caliskan (@caliskanfurkan_)
description: Detects the use of Ditsnap tool, an inspection tool for Active Directory
    database, ntds.dit.
references:
    - https://thedfirreport.com/2020/06/21/snatch-ransomware/
    - https://web.archive.org/web/20201124182207/https://github.com/yosqueoy/ditsnap
falsepositives:
    - Legitimate admin usage
tags:
    - attack.credential-access
    - attack.t1003.003
date: '2020-07-04'
modified: '2023-02-21'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \ditsnap.exe
        CommandLine|contains: ditsnap.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:43:39.176090+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:43:39.176090+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:43:39.176103+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:43:39.176105+00:00'
