title: Renamed Vmnat.exe Execution
id: 7b4f794b-590a-4ad4-ba18-7964a2832205
status: test
level: high
author: elhoim
description: Detects renamed vmnat.exe or portable version that can be used for DLL
    side-loading
references:
    - https://twitter.com/malmoeb/status/1525901219247845376
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1574.002
date: '2022-09-09'
modified: '2023-02-03'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        OriginalFileName: vmnat.exe
    filter_rename:
        Image|endswith: vmnat.exe
    condition: selection and not 1 of filter_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:50:54.410901+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:50:54.410901+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:50:54.410911+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:50:54.410913+00:00'
