id: 2c1486f5-02e8-4f86-9099-b97f2da4ed77
title: Insecure Proxy/DOH Transfer Via Curl.EXE
status: test
level: medium
description: Detects execution of "curl.exe" with the "insecure" flag over proxy or
    DOH.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-07-27'
tags:
    - attack.execution
references:
    - https://curl.se/docs/manpage.html
falsepositives:
    - Access to badly maintained internal or development systems
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \curl.exe
        OriginalFileName: curl.exe
    selection_cli:
        CommandLine|contains:
            - --doh-insecure
            - --proxy-insecure
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:32:46.891925+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:32:46.891925+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:32:46.891939+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:32:46.891941+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:32:46.891943+00:00'
