id: d047726b-c71c-4048-a99b-2e2f50dc107d
title: Kavremover Dropped Binary LOLBIN Usage
status: test
level: high
description: Detects the execution of a signed binary dropped by Kaspersky Lab Products
    Remover (kavremover) which can be abused as a LOLBIN to execute arbitrary commands
    and binaries.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-11-01'
tags:
    - attack.defense-evasion
    - attack.t1127
references:
    - https://nasbench.medium.com/lolbined-using-kaspersky-endpoint-security-kes-installer-to-execute-arbitrary-commands-1c999f1b7fea
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains: ' run run-cmd '
    filter_main_legit_parents:
        ParentImage|endswith:
            - \cleanapi.exe
            - \kavremover.exe
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:28.739901+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:28.739901+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:28.739906+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:28.739908+00:00'
