id: dfd2fcb7-8bd5-4daa-b132-5adb61d6ad45
title: Windows Hotfix Updates Reconnaissance Via Wmic.EXE
status: test
level: medium
description: Detects the execution of wmic with the "qfe" flag in order to obtain
    information about installed hotfix updates on the system. This is often used by
    pentester and attacker enumeration scripts
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-06-20'
modified: '2023-02-14'
tags:
    - attack.execution
    - attack.t1047
references:
    - https://github.com/carlospolop/PEASS-ng/blob/fa0f2e17fbc1d86f1fd66338a40e665e7182501d/winPEAS/winPEASbat/winPEAS.bat
    - https://sushant747.gitbooks.io/total-oscp-guide/content/privilege_escalation_windows.html
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        OriginalFileName: wmic.exe
        Image|endswith: \WMIC.exe
    selection_cli:
        CommandLine|contains: ' qfe'
    condition: all of selection*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:15.747202+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:15.747202+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:15.747210+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:15.747212+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:15.747213+00:00'
