id: 95361ce5-c891-4b0a-87ca-e24607884a96
title: Binary Padding - MacOS
status: test
level: high
description: Adversaries may use binary padding to add junk data and change the on-disk
    representation of malware. This rule detect using dd and truncate to add a junk
    data to file.
author: Igor Fits, Mikhail Larin, oscd.community
date: '2020-10-19'
modified: '2023-02-17'
tags:
    - attack.defense-evasion
    - attack.t1027.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1027.001/T1027.001.md
    - https://linux.die.net/man/1/truncate
    - https://linux.die.net/man/1/dd
falsepositives:
    - Legitimate script work
taxonomy: sigma
logsource:
    category: process_creation
    product: macos
detection:
    selection_truncate:
        Image|endswith: /truncate
        CommandLine|contains: -s +
    selection_dd:
        Image|endswith: /dd
        CommandLine|contains:
            - if=/dev/zero
            - if=/dev/random
            - if=/dev/urandom
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:14:25.802465+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-11-13T20:14:25.802465+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:14:25.802470+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:14:25.802471+00:00'
