id: 056c7317-9a09-4bd4-9067-d051312752ea
title: Powershell Executed From Headless ConHost Process
status: experimental
level: medium
description: 'Detects the use of powershell commands from headless ConHost window.

    The "--headless" flag hides the windows from the user upon execution.

    '
author: Matt Anderson (Huntress)
date: '2024-07-23'
tags:
    - attack.defense-evasion
    - attack.t1059.001
    - attack.t1059.003
references:
    - https://www.huntress.com/blog/fake-browser-updates-lead-to-boinc-volunteer-computing-software
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''00ca75ab-d5ce-43be-b86c-55ff39c6abfc''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \conhost.exe
        OriginalFileName: CONHOST.EXE
    selection_cli:
        CommandLine|contains|all:
            - --headless
            - powershell
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:27:13.347448+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:27:13.347448+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:27:13.347466+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:27:13.347469+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:27:13.347470+00:00'
