title: Group Membership Reconnaissance Via Whoami.EXE
id: bd8b828d-0dca-48e1-8a63-8a58ecf2644f
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects the execution of whoami.exe with the /group command line flag
    to show group membership for the current user, account type, security identifiers
    (SID), and attributes.
references:
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/whoami
falsepositives:
    - Unknown
tags:
    - attack.discovery
    - attack.t1033
date: '2023-02-28'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \whoami.exe
        OriginalFileName: whoami.exe
    selection_cli:
        CommandLine|contains:
            - ' /groups'
            - ' -groups'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:45:46.026040+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:45:46.026040+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:45:46.026053+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:45:46.026054+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:45:46.026056+00:00'
