id: 970823b7-273b-460a-8afc-3a6811998529
title: Uncommon One Time Only Scheduled Task At 00:00
status: test
level: high
description: Detects scheduled task creation events that include suspicious actions,
    and is run once at 00:00
author: pH-T (Nextron Systems)
date: '2022-07-15'
modified: '2023-02-03'
tags:
    - attack.execution
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1053.005
references:
    - https://www.trendmicro.com/vinfo/us/security/news/ransomware-spotlight/ransomware-spotlight-blackbyte
falsepositives:
    - Software installation
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|contains: \schtasks.exe
        OriginalFileName: schtasks.exe
    selection_cli:
        CommandLine|contains:
            - wscript
            - vbscript
            - cscript
            - 'wmic '
            - wmic.exe
            - regsvr32.exe
            - powershell
            - \AppData\
    selection_time:
        CommandLine|contains|all:
            - once
            - 00:00
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:33:43.926309+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:33:43.926309+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:33:43.926328+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:33:43.926331+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:33:43.926333+00:00'
