id: 1ac14d38-3dfc-4635-92c7-e3fd1c5f5bfc
title: Winrar Compressing Dump Files
status: test
level: medium
description: Detects execution of WinRAR in order to compress a file with a ".dmp"/".dump"
    extension, which could be a step in a process of dump file exfiltration.
author: Florian Roth (Nextron Systems)
date: '2022-01-04'
modified: '2023-09-12'
tags:
    - attack.collection
    - attack.t1560.001
references:
    - https://www.crowdstrike.com/blog/overwatch-exposes-aquatic-panda-in-possession-of-log-4-shell-exploit-tools/
falsepositives:
    - Legitimate use of WinRAR with a command line in which ".dmp" or ".dump" appears
        accidentally
    - Legitimate use of WinRAR to compress WER ".dmp" files for troubleshooting
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''ec570e53-4c76-45a9-804d-dc3f355ff7a7''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \rar.exe
            - \winrar.exe
        Description: Command line RAR
    selection_extension:
        CommandLine|contains:
            - .dmp
            - .dump
            - .hdmp
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:46.937695+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:46.937695+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:46.937706+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: message
            mapped_at: '2025-11-13T20:20:46.937707+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:46.937708+00:00'
