title: Arbitrary File Download Via GfxDownloadWrapper.EXE
id: eee00933-a761-4cd0-be70-c42fe91731e7
status: test
level: medium
author: Victor Sergeev, oscd.community
description: Detects execution of GfxDownloadWrapper.exe with a URL as an argument
    to download file.
references:
    - https://lolbas-project.github.io/lolbas/HonorableMentions/GfxDownloadWrapper/
falsepositives:
    - Unknown
tags:
    - attack.command-and-control
    - attack.t1105
date: '2020-10-09'
modified: '2023-10-18'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \GfxDownloadWrapper.exe
        CommandLine|contains:
            - http://
            - https://
    filter_main_known_urls:
        CommandLine|contains: https://gameplayapi.intel.com/
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:50:37.576542+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:50:37.576542+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:50:37.576554+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:50:37.576556+00:00'
