id: 5687f942-867b-4578-ade7-1e341c46e99a
title: VMToolsd Suspicious Child Process
status: test
level: high
description: Detects suspicious child process creations of VMware Tools process which
    may indicate persistence setup
author: bohops, Bhabesh Raj
date: '2021-10-08'
modified: '2023-07-25'
tags:
    - attack.execution
    - attack.persistence
    - attack.t1059
references:
    - https://bohops.com/2021/10/08/analyzing-and-detecting-a-vmtools-persistence-technique/
    - https://user-images.githubusercontent.com/61026070/136518004-b68cce7d-f9b8-4e9a-9b7b-53b1568a9a94.png
    - https://github.com/vmware/open-vm-tools/blob/master/open-vm-tools/tools.conf
falsepositives:
    - Legitimate use by VM administrator
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|endswith: \vmtoolsd.exe
    selection_img:
        Image|endswith:
            - \cmd.exe
            - \cscript.exe
            - \mshta.exe
            - \powershell.exe
            - \pwsh.exe
            - \regsvr32.exe
            - \rundll32.exe
            - \wscript.exe
        OriginalFileName:
            - Cmd.Exe
            - cscript.exe
            - MSHTA.EXE
            - PowerShell.EXE
            - pwsh.dll
            - REGSVR32.EXE
            - RUNDLL32.EXE
            - wscript.exe
    filter_main_vmwaretools_script:
        Image|endswith: \cmd.exe
        CommandLine|contains:
            - \VMware\VMware Tools\poweron-vm-default.bat
            - \VMware\VMware Tools\poweroff-vm-default.bat
            - \VMware\VMware Tools\resume-vm-default.bat
            - \VMware\VMware Tools\suspend-vm-default.bat
    filter_main_empty:
        Image|endswith: \cmd.exe
        CommandLine: ''
    filter_main_null:
        Image|endswith: \cmd.exe
        CommandLine: null
    condition: all of selection* and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:42.427395+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:42.427395+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:42.427417+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:42.427421+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:42.427424+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:42.427426+00:00'
