title: Potential Browser Data Stealing
id: 47147b5b-9e17-4d76-b8d2-7bac24c5ce1b
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: 'Adversaries may acquire credentials from web browsers by reading files
    specific to the target browser.

    Web browsers commonly save credentials such as website usernames and passwords
    so that they do not need to be entered manually in the future.

    Web browsers typically store the credentials in an encrypted format within a credential
    store.

    '
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1555.003/T1555.003.md
falsepositives:
    - Unknown
tags:
    - attack.credential-access
    - attack.t1555.003
date: '2022-12-23'
modified: '2023-08-29'
logsource:
    category: process_creation
    product: windows
detection:
    selection_cmd:
        CommandLine|contains:
            - copy-item
            - 'copy '
            - 'cpi '
            - ' cp '
            - 'move '
            - move-item
            - ' mi '
            - ' mv '
        Image|endswith:
            - \xcopy.exe
            - \robocopy.exe
        OriginalFileName:
            - XCOPY.EXE
            - robocopy.exe
    selection_path:
        CommandLine|contains:
            - \Amigo\User Data
            - \BraveSoftware\Brave-Browser\User Data
            - \CentBrowser\User Data
            - \Chromium\User Data
            - \CocCoc\Browser\User Data
            - \Comodo\Dragon\User Data
            - \Elements Browser\User Data
            - \Epic Privacy Browser\User Data
            - \Google\Chrome Beta\User Data
            - \Google\Chrome SxS\User Data
            - \Google\Chrome\User Data\
            - \Kometa\User Data
            - \Maxthon5\Users
            - \Microsoft\Edge\User Data
            - \Mozilla\Firefox\Profiles
            - \Nichrome\User Data
            - \Opera Software\Opera GX Stable\
            - \Opera Software\Opera Neon\User Data
            - \Opera Software\Opera Stable\
            - \Orbitum\User Data
            - \QIP Surf\User Data
            - \Sputnik\User Data
            - \Torch\User Data
            - \uCozMedia\Uran\User Data
            - \Vivaldi\User Data
    condition: all of selection_*
related:
    -   id: fc028194-969d-4122-8abe-0470d5b8f12f
        type: derived
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:45:32.855794+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:45:32.855794+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:45:32.855807+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:45:32.855809+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:45:32.855810+00:00'
