id: baef1ec6-2ca9-47a3-97cc-4cf2bda10b77
title: Potential Credential Dumping Attempt Using New NetworkProvider - CLI
status: test
level: high
description: Detects when an attacker tries to add a new network provider in order
    to dump clear text credentials, similar to how the NPPSpy tool does it
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-08-23'
modified: '2023-02-02'
tags:
    - attack.credential-access
    - attack.t1003
references:
    - https://learn.microsoft.com/en-us/troubleshoot/windows-client/setup-upgrade-and-drivers/network-provider-settings-removed-in-place-upgrade
    - https://github.com/gtworek/PSBits/tree/master/PasswordStealing/NPPSpy
falsepositives:
    - Other legitimate network providers used and not filtred in this rule
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''0442defa-b4a2-41c9-ae2c-ea7042fc4701''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - \System\CurrentControlSet\Services\
            - \NetworkProvider
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:32.620354+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:32.620354+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:32.620362+00:00'
