title: PUA - 3Proxy Execution
id: f38a82d2-fba3-4781-b549-525efbec8506
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects the use of 3proxy, a tiny free proxy server
references:
    - https://github.com/3proxy/3proxy
    - https://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
falsepositives:
    - Administrative activity
tags:
    - attack.command-and-control
    - attack.t1572
date: '2022-09-13'
modified: '2023-02-21'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \3proxy.exe
    selection_pe:
        Description: 3proxy - tiny proxy server
    selection_params:
        CommandLine|contains: .exe -i127.0.0.1 -p
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:31.082533+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:31.082533+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:44:31.082559+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: device.desc
            mapped_at: '2025-12-04T01:44:31.082563+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:44:31.082564+00:00'
