id: 208748f7-881d-47ac-a29c-07ea84bf691d
title: Suspicious Outlook Child Process
status: test
level: high
description: Detects a suspicious process spawning from an Outlook process.
author: Michael Haag, Florian Roth (Nextron Systems), Markus Neis, Elastic, FPT.EagleEye
    Team
date: '2022-02-28'
modified: '2023-02-04'
tags:
    - attack.execution
    - attack.t1204.002
references:
    - https://www.hybrid-analysis.com/sample/465aabe132ccb949e75b8ab9c5bda36d80cf2fd503d52b8bad54e295f28bbc21?environmentId=100
    - https://mgreen27.github.io/posts/2018/04/02/DownloadCradle.html
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''438025f9-5856-4663-83f7-52f878a70a50''),
    type=<SigmaRelatedType.DERIVED: 2>), SigmaRelatedItem(id=UUID(''e212d415-0e93-435f-9e1a-f29005bb4723''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \OUTLOOK.EXE
        Image|endswith:
            - \AppVLP.exe
            - \bash.exe
            - \cmd.exe
            - \cscript.exe
            - \forfiles.exe
            - \hh.exe
            - \mftrace.exe
            - \msbuild.exe
            - \msdt.exe
            - \mshta.exe
            - \msiexec.exe
            - \powershell.exe
            - \pwsh.exe
            - \regsvr32.exe
            - \schtasks.exe
            - \scrcons.exe
            - \scriptrunner.exe
            - \sh.exe
            - \svchost.exe
            - \wmic.exe
            - \wscript.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:32:40.703210+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:32:40.703210+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:32:40.703224+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:32:40.703227+00:00'
