id: 22e58743-4ac8-4a9f-bf19-00a0428d8c5f
title: Base64 MZ Header In CommandLine
status: test
level: high
description: Detects encoded base64 MZ header in the commandline
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-07-12'
tags:
    - attack.execution
references:
    - https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - TVqQAAMAAAAEAAAA
            - TVpQAAIAAAAEAA8A
            - TVqAAAEAAAAEABAA
            - TVoAAAAAAAAAAAAA
            - TVpTAQEAAAAEAAAA
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:27:22.550152+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:27:22.550152+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:27:22.550169+00:00'
