title: Suspicious Usage Of Active Directory Diagnostic Tool (ntdsutil.exe)
id: a58353df-af43-4753-bad0-cd83ef35eef5
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects execution of ntdsutil.exe to perform different actions such as
    restoring snapshots...etc.
references:
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc731620(v=ws.11)
    - https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/espionage-asia-governments
falsepositives:
    - Legitimate usage to restore snapshots
    - Legitimate admin activity
tags:
    - attack.credential-access
    - attack.t1003.003
date: '2022-09-14'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \ntdsutil.exe
        OriginalFileName: ntdsutil.exe
    selection_cli:
        CommandLine|contains|all:
            - snapshot
            - 'mount '
            - ac
            - ' i'
            - ' ntds'
    condition: all of selection_*
related:
    -   id: 2afafd61-6aae-4df4-baed-139fa1f4c345
        type: derived
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:47:47.738291+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:47:47.738291+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:47:47.738304+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:47:47.738306+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:47:47.738308+00:00'
