title: Potentially Suspicious Execution From Tmp Folder
id: 312b42b1-bded-4441-8b58-163a3af58775
status: test
level: high
author: Joseliyo Sanchez, @Joseliyo_Jstnk
description: Detects a potentially suspicious execution of a process located in the
    '/tmp/' folder
references:
    - https://blogs.jpcert.or.jp/en/2023/05/gobrat.html
    - https://jstnk9.github.io/jstnk9/research/GobRAT-Malware/
    - https://www.virustotal.com/gui/file/60bcd645450e4c846238cf0e7226dc40c84c96eba99f6b2cffcd0ab4a391c8b3/detection
    - https://www.virustotal.com/gui/file/3e44c807a25a56f4068b5b8186eee5002eed6f26d665a8b791c472ad154585d1/detection
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1036
date: '2023-06-02'
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|startswith: /tmp/
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:00.716932+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:00.716932+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:36:00.716948+00:00'
