title: Renamed Visual Studio Code Tunnel Execution
id: 2cf29f11-e356-4f61-98c0-1bdb9393d6da
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects renamed Visual Studio Code tunnel execution. Attackers can abuse
    this functionality to establish a C2 channel
references:
    - https://ipfyx.fr/post/visual-studio-code-tunnel/
    - https://badoption.eu/blog/2023/01/31/code_c2.html
    - https://code.visualstudio.com/docs/remote/tunnels
falsepositives:
    - Unknown
tags:
    - attack.command-and-control
    - attack.t1071.001
date: '2023-09-28'
logsource:
    category: process_creation
    product: windows
detection:
    selection_image_only_tunnel:
        OriginalFileName: null
        CommandLine|endswith: .exe tunnel
    selection_image_tunnel_args:
        CommandLine|contains|all:
            - .exe tunnel
            - '--name '
            - --accept-server-license-terms
    selection_image_tunnel_service:
        CommandLine|contains|all:
            - 'tunnel '
            - service
            - internal-run
            - tunnel-service.log
    selection_parent_tunnel:
        ParentCommandLine|endswith: ' tunnel'
        Image|endswith: \cmd.exe
        CommandLine|contains|all:
            - '/d /c '
            - \servers\Stable-
            - code-server.cmd
    filter_main_parent_code:
        ParentImage|endswith:
            - \code-tunnel.exe
            - \code.exe
    filter_main_image_code:
        Image|endswith:
            - \code-tunnel.exe
            - \code.exe
    condition: (1 of selection_image_* and not 1 of filter_main_image_*) or (selection_parent_tunnel
        and not 1 of filter_main_parent_*)
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:47:10.155420+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:47:10.155420+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:47:10.155444+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:47:10.155445+00:00'
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-12-04T01:47:10.155447+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:47:10.155448+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:47:10.155449+00:00'
