title: Process Launched Without Image Name
id: f208d6d8-d83a-4c2c-960d-877c37da84e5
status: experimental
level: medium
author: Matt Anderson (Huntress)
description: Detect the use of processes with no name (".exe"), which can be used
    to evade Image-based detections.
references:
    - https://www.huntress.com/blog/fake-browser-updates-lead-to-boinc-volunteer-computing-software
falsepositives:
    - Rare legitimate software.
tags:
    - attack.defense-evasion
date: '2024-07-23'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:47:37.225819+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:47:37.225819+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:47:37.225841+00:00'
