id: fe2f9663-41cb-47e2-b954-8a228f3b9dff
title: Linux Base64 Encoded Shebang In CLI
status: test
level: medium
description: Detects the presence of a base64 version of the shebang in the commandline,
    which could indicate a malicious payload about to be decoded
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-09-15'
tags:
    - attack.defense-evasion
    - attack.t1140
references:
    - https://www.trendmicro.com/pl_pl/research/20/i/the-evolution-of-malicious-shell-scripts.html
    - https://github.com/carlospolop/PEASS-ng/tree/master/linPEAS
falsepositives:
    - Legitimate administration activities
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        CommandLine|contains:
            - IyEvYmluL2Jhc2
            - IyEvYmluL2Rhc2
            - IyEvYmluL3pza
            - IyEvYmluL2Zpc2
            - IyEvYmluL3No
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:15:51.708062+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-13T20:15:51.708062+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:15:51.708067+00:00'
