id: 1dd05363-104e-4b4a-b963-196a534b03a1
title: Potential Suspicious Mofcomp Execution
status: test
level: high
description: 'Detects execution of the "mofcomp" utility as a child of a suspicious
    shell or script running utility or by having a suspicious path in the commandline.

    The "mofcomp" utility parses a file containing MOF statements and adds the classes
    and class instances defined in the file to the WMI repository.

    Attackers abuse this utility to install malicious MOF scripts

    '
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-07-12'
modified: '2023-04-11'
tags:
    - attack.defense-evasion
    - attack.t1218
references:
    - https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
    - https://github.com/The-DFIR-Report/Sigma-Rules/blob/75260568a7ffe61b2458ca05f6f25914efb44337/win_mofcomp_execution.yml
    - https://learn.microsoft.com/en-us/windows/win32/wmisdk/mofcomp
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \mofcomp.exe
        OriginalFileName: mofcomp.exe
    selection_case:
        ParentImage|endswith:
            - \cmd.exe
            - \powershell.exe
            - \pwsh.exe
            - \wsl.exe
            - \wscript.exe
            - \cscript.exe
        CommandLine|contains:
            - \AppData\Local\Temp
            - \Users\Public\
            - \WINDOWS\Temp\
            - '%temp%'
            - '%tmp%'
            - '%appdata%'
    filter_main_wmiprvse:
        ParentImage: C:\Windows\System32\wbem\WmiPrvSE.exe
        CommandLine|contains: C:\Windows\TEMP\
        CommandLine|endswith: .mof
    filter_optional_null_parent:
        CommandLine|contains: C:\Windows\TEMP\
        CommandLine|endswith: .mof
    condition: all of selection_* and not 1 of filter_main_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:19:57.916707+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:19:57.916707+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:19:57.916724+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:19:57.916727+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:19:57.916729+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:19:57.916731+00:00'
