id: a70dcb37-3bee-453a-99df-d0c683151be6
title: Firewall Rule Update Via Netsh.EXE
status: test
level: medium
description: Detects execution of netsh with the "advfirewall" and the "set" option
    in order to set new values for properties of a existing rule
author: X__Junior (Nextron Systems)
date: '2023-07-18'
tags:
    - attack.defense-evasion
references:
    - https://ss64.com/nt/netsh.html
falsepositives:
    - Legitimate administration activity
    - Software installations and removal
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \netsh.exe
        OriginalFileName: netsh.exe
    selection_cli:
        CommandLine|contains|all:
            - ' firewall '
            - ' set '
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:37.133150+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:37.133150+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:37.133156+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:37.133158+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:37.133164+00:00'
