title: Suspicious Splwow64 Without Params
id: 1f1a8509-2cbb-44f5-8751-8e1571518ce2
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects suspicious Splwow64.exe process without any command line parameters
references:
    - https://twitter.com/sbousseaden/status/1429401053229891590?s=12
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1202
date: '2021-08-23'
modified: '2022-12-25'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \splwow64.exe
        CommandLine|endswith: splwow64.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:49:20.512298+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:49:20.512298+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:49:20.512342+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:49:20.512347+00:00'
