id: 5f6a601c-2ecb-498b-9c33-660362323afa
title: Root Certificate Installed From Susp Locations
status: test
level: high
description: Adversaries may install a root certificate on a compromised system to
    avoid warnings when connecting to adversary controlled web servers.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-09-09'
modified: '2023-01-16'
tags:
    - attack.defense-evasion
    - attack.t1553.004
references:
    - https://www.microsoft.com/security/blog/2022/09/07/profiling-dev-0270-phosphorus-ransomware-operations/
    - https://learn.microsoft.com/en-us/powershell/module/pki/import-certificate?view=windowsserver2022-ps
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - Import-Certificate
            - ' -FilePath '
            - Cert:\LocalMachine\Root
        CommandLine|contains:
            - \AppData\Local\Temp\
            - :\Windows\TEMP\
            - \Desktop\
            - \Downloads\
            - \Perflogs\
            - :\Users\Public\
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:28:03.522518+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:28:03.522518+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:28:03.522544+00:00'
