id: 92626ddd-662c-49e3-ac59-f6535f12d189
title: Scheduled Task Creation Via Schtasks.EXE
status: test
level: low
description: Detects the creation of scheduled tasks by user accounts via the "schtasks"
    utility.
author: Florian Roth (Nextron Systems)
date: '2019-01-16'
modified: '2024-01-18'
tags:
    - attack.execution
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1053.005
    - attack.s0111
    - car.2013-08-001
    - stp.1u
references:
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks-create
falsepositives:
    - Administrative activity
    - Software installation
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \schtasks.exe
        CommandLine|contains: ' /create '
    filter_main_system_user:
        User|contains:
            - AUTHORI
            - AUTORI
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:58.229601+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:58.229601+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:58.229635+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:58.229639+00:00'
        -   source_field: User
            target_table: process_activity
            target_field: actor.user.name
            mapped_at: '2025-11-13T20:20:58.229642+00:00'
