id: b86d356d-6093-443d-971c-9b07db583c68
title: Suspicious Curl Change User Agents - Linux
status: test
level: medium
description: Detects a suspicious curl process start on linux with set useragent options
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-09-15'
tags:
    - attack.command-and-control
    - attack.t1071.001
references:
    - https://curl.se/docs/manpage.html
falsepositives:
    - Scripts created by developers and admins
    - Administrative activity
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''3286d37a-00fd-41c2-a624-a672dcd34e60''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith: /curl
        CommandLine|contains:
            - ' -A '
            - ' --user-agent '
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:16:54.548577+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-26T02:16:54.548577+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:16:54.548587+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:16:54.548589+00:00'
