id: 883835a7-df45-43e4-bf1d-4268768afda4
title: Regedit as Trusted Installer
status: test
level: high
description: Detects a regedit started with TrustedInstaller privileges or by ProcessHacker.exe
author: Florian Roth (Nextron Systems)
date: '2021-05-27'
modified: '2022-10-09'
tags:
    - attack.privilege-escalation
    - attack.t1548
references:
    - https://twitter.com/1kwpeter/status/1397816101455765504
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \regedit.exe
        ParentImage|endswith:
            - \TrustedInstaller.exe
            - \ProcessHacker.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:38.002090+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:38.002090+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:38.002096+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:38.002098+00:00'
