id: b3d34dc5-2efd-4ae3-845f-8ec14921f449
title: Browser Started with Remote Debugging
status: test
level: medium
description: Detects browsers starting with the remote debugging flags. Which is a
    technique often used to perform browser injection attacks
author: pH-T (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: '2022-07-27'
modified: '2022-12-23'
tags:
    - attack.credential-access
    - attack.t1185
references:
    - https://yoroi.company/wp-content/uploads/2022/05/EternityGroup_report_compressed.pdf
    - https://www.mdsec.co.uk/2022/10/analysing-lastpass-part-1/
    - https://github.com/defaultnamehere/cookie_crimes/
    - https://github.com/wunderwuzzi23/firefox-cookiemonster
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''3e8207c5-fcd2-4ea6-9418-15d45b4890e4''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_chromium_based:
        CommandLine|contains: ' --remote-debugging-'
    selection_firefox:
        Image|endswith: \firefox.exe
        CommandLine|contains: ' -start-debugger-server'
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:38.030329+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:38.030329+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:38.030335+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:38.030336+00:00'
