title: HackTool - WinRM Access Via Evil-WinRM
id: a197e378-d31b-41c0-9635-cfdf1c1bb423
status: test
level: medium
author: frack113
description: Adversaries may use Valid Accounts to log into a computer using the Remote
    Desktop Protocol (RDP). The adversary may then perform actions as the logged-on
    user.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1021.006/T1021.006.md#atomic-test-3---winrm-access-with-evil-winrm
    - https://github.com/Hackplayers/evil-winrm
falsepositives:
    - Unknown
tags:
    - attack.lateral-movement
    - attack.t1021.006
date: '2022-01-07'
modified: '2023-02-13'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \ruby.exe
        CommandLine|contains|all:
            - '-i '
            - '-u '
            - '-p '
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:51:06.315342+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:51:06.315342+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:51:06.315359+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:51:06.315361+00:00'
