id: e6c54d94-498c-4562-a37c-b469d8e9a275
title: Suspicious PowerShell Download and Execute Pattern
status: test
level: high
description: Detects suspicious PowerShell download patterns that are often used in
    malicious scripts, stagers or downloaders (make sure that your backend applies
    the strings case-insensitive)
author: Florian Roth (Nextron Systems)
date: '2022-02-28'
modified: '2022-03-01'
tags:
    - attack.execution
    - attack.t1059.001
references:
    - https://gist.github.com/jivoi/c354eaaf3019352ce32522f916c03d70
    - https://www.trendmicro.com/en_us/research/22/j/lv-ransomware-exploits-proxyshell-in-attack.html
falsepositives:
    - Software installers that pull packages from remote systems and execute them
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''3b6ab547-8ec2-4991-b9d2-2b06702a48d7''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - IEX ((New-Object Net.WebClient).DownloadString
            - IEX (New-Object Net.WebClient).DownloadString
            - IEX((New-Object Net.WebClient).DownloadString
            - IEX(New-Object Net.WebClient).DownloadString
            - ' -command (New-Object System.Net.WebClient).DownloadFile('
            - ' -c (New-Object System.Net.WebClient).DownloadFile('
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:31:15.973478+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:31:15.973478+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:31:15.973499+00:00'
