title: Suspicious Greedy Compression Using Rar.EXE
id: afe52666-401e-4a02-b4ff-5d128990b8cb
status: test
level: high
author: X__Junior (Nextron Systems), Florian Roth (Nextron Systems)
description: Detects RAR usage that creates an archive from a suspicious folder, either
    a system folder or one of the folders often used by attackers for staging purposes
references:
    - https://decoded.avast.io/martinchlumecky/png-steganography
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1059
date: '2022-12-15'
modified: '2024-01-02'
logsource:
    category: process_creation
    product: windows
detection:
    selection_opt_1:
        Image|endswith: \rar.exe
        Description: Command line RAR
    selection_opt_2:
        CommandLine|contains:
            - '.exe a '
            - ' a -m'
    selection_cli_flags:
        CommandLine|contains|all:
            - ' -hp'
            - ' -r '
    selection_cli_folders:
        CommandLine|contains:
            - ' ?:\\*.'
            - ' ?:\\\*.'
            - ' ?:\$Recycle.bin\'
            - ' ?:\PerfLogs\'
            - ' ?:\Temp'
            - ' ?:\Users\Public\'
            - ' ?:\Windows\'
            - ' %public%'
    condition: 1 of selection_opt_* and all of selection_cli_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:40:50.816384+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:40:50.816384+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:40:50.816412+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: device.desc
            mapped_at: '2025-12-04T01:40:50.816414+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:40:50.816416+00:00'
