title: Potential Suspicious Change To Sensitive/Critical Files
id: 86157017-c2b1-4d4a-8c33-93b8e67e4af4
status: test
level: medium
author: '@d4ns4n_ (Wuerth-Phoenix)'
description: Detects changes of sensitive and critical files. Monitors files that
    you don't expect to change without planning on Linux system.
references:
    - https://learn.microsoft.com/en-us/azure/defender-for-cloud/file-integrity-monitoring-overview#which-files-should-i-monitor
falsepositives:
    - Some false positives are to be expected on user or administrator machines. Apply
        additional filters as needed.
tags:
    - attack.impact
    - attack.t1565.001
date: '2023-05-30'
logsource:
    category: process_creation
    product: linux
detection:
    selection_img_1:
        Image|endswith:
            - /cat
            - /echo
            - /grep
            - /head
            - /more
            - /tail
        CommandLine|contains: '>'
    selection_img_2:
        Image|endswith:
            - /emacs
            - /nano
            - /sed
            - /vi
            - /vim
    selection_paths:
        CommandLine|contains:
            - /bin/login
            - /bin/passwd
            - /boot/
            - /etc/*.conf
            - /etc/cron.
            - /etc/crontab
            - /etc/hosts
            - /etc/init.d
            - /etc/sudoers
            - /opt/bin/
            - /sbin
            - /usr/bin/
            - /usr/local/bin/
    condition: 1 of selection_img_* and selection_paths
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:09.778932+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:09.778932+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:36:09.778946+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:36:09.778947+00:00'
