title: Curl Download And Execute Combination
id: 21dd6d38-2b18-4453-9404-a0fe4a0cc288
status: test
level: high
author: Sreeman, Nasreddine Bencherchali (Nextron Systems)
description: Adversaries can use curl to download payloads remotely and execute them.
    Curl is included by default in Windows 10 build 17063 and later.
references:
    - https://medium.com/@reegun/curl-exe-is-the-new-rundll32-exe-lolbin-3f79c5f35983
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1218
    - attack.command-and-control
    - attack.t1105
date: '2020-01-13'
modified: '2024-03-05'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|windash: ' -c '
        CommandLine|contains|all:
            - 'curl '
            - http
            - -o
            - '&'
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:43:24.474049+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:43:24.474049+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:43:24.474063+00:00'
