title: Active Directory Structure Export Via Ldifde.EXE
id: 4f7a6757-ff79-46db-9687-66501a02d9ec
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects the execution of "ldifde.exe" in order to export organizational
    Active Directory structure.
references:
    - https://businessinsights.bitdefender.com/deep-dive-into-a-backdoordiplomacy-attack-a-study-of-an-attackers-toolkit
    - https://www.documentcloud.org/documents/5743766-Global-Threat-Report-2019.html
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc731033(v=ws.11)
falsepositives:
    - Unknown
tags:
    - attack.exfiltration
date: '2023-03-14'
logsource:
    category: process_creation
    product: windows
detection:
    selection_ldif:
        Image|endswith: \ldifde.exe
        OriginalFileName: ldifde.exe
    selection_cmd:
        CommandLine|contains: -f
    filter_import:
        CommandLine|contains: ' -i'
    condition: all of selection_* and not 1 of filter_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:48:25.592771+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:48:25.592771+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:48:25.592790+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:48:25.592792+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:48:25.592794+00:00'
