id: 9cc85849-3b02-4cb5-b371-3a1ff54f2218
title: File Download From IP URL Via Curl.EXE
status: test
level: medium
description: Detects file downloads directly from IP address URL using curl.exe
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-10-18'
tags:
    - attack.execution
references:
    - https://labs.withsecure.com/publications/fin7-target-veeam-servers
    - https://github.com/WithSecureLabs/iocs/blob/344203de742bb7e68bd56618f66d34be95a9f9fc/FIN7VEEAM/iocs.csv
    - https://github.com/pr0xylife/IcedID/blob/8dd1e218460db4f750d955b4c65b2f918a1db906/icedID_09.28.2023.txt
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''5cb299fc-5fb1-4d07-b989-0644c68b6043''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \curl.exe
        OriginalFileName: curl.exe
    selection_ip:
        CommandLine|re: ://[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}
    selection_http:
        CommandLine|contains: http
    selection_flag:
        CommandLine|contains:
            - ' -O'
            - --remote-name
            - --output
    filter_main_ext:
        CommandLine|endswith:
            - .bat
            - .bat"
            - .dat
            - .dat"
            - .dll
            - .dll"
            - .exe
            - .exe"
            - .gif
            - .gif"
            - .hta
            - .hta"
            - .jpeg
            - .jpeg"
            - .log
            - .log"
            - .msi
            - .msi"
            - .png
            - .png"
            - .ps1
            - .ps1"
            - .psm1
            - .psm1"
            - .vbe
            - .vbe"
            - .vbs
            - .vbs"
            - .bat'
            - .dat'
            - .dll'
            - .exe'
            - .gif'
            - .hta'
            - .jpeg'
            - .log'
            - .msi'
            - .png'
            - .ps1'
            - .psm1'
            - .vbe'
            - .vbs'
    condition: all of selection_* and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:20.266157+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:20.266157+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:20.266162+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:20.266163+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:20.266164+00:00'
