id: 0cf7a157-8879-41a2-8f55-388dd23746b7
title: Linux Recon Indicators
status: test
level: high
description: Detects events with patterns found in commands used for reconnaissance
    on linux systems
author: Florian Roth (Nextron Systems)
date: '2022-06-20'
tags:
    - attack.reconnaissance
    - attack.t1592.004
    - attack.credential-access
    - attack.t1552.001
references:
    - https://github.com/sleventyeleven/linuxprivchecker/blob/0d701080bbf92efd464e97d71a70f97c6f2cd658/linuxprivchecker.py
falsepositives:
    - Legitimate administration activities
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        CommandLine|contains:
            - ' -name .htpasswd'
            - ' -perm -4000 '
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:15:55.886604+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-13T20:15:55.886604+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:15:55.886609+00:00'
