id: 55f0a3a1-846e-40eb-8273-677371b8d912
title: Outlook EnableUnsafeClientMailRules Setting Enabled
status: test
level: high
description: Detects an attacker trying to enable the outlook security setting "EnableUnsafeClientMailRules"
    which allows outlook to run applications or execute macros
author: Markus Neis, Nasreddine Bencherchali (Nextron Systems)
date: '2018-12-27'
modified: '2023-02-09'
tags:
    - attack.execution
    - attack.t1059
    - attack.t1202
references:
    - https://www.fireeye.com/blog/threat-research/2018/12/overruled-containing-a-potentially-destructive-adversary.html
    - https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=44
    - https://support.microsoft.com/en-us/topic/how-to-control-the-rule-actions-to-start-an-application-or-run-a-macro-in-outlook-2016-and-outlook-2013-e4964b72-173c-959d-5d7b-ead562979048
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''6763c6c8-bd01-4687-bc8d-4fa52cf8ba08''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains: \Outlook\Security\EnableUnsafeClientMailRules
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:34:55.664642+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:34:55.664642+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:34:55.664657+00:00'
