id: 8e0bb260-d4b2-4fff-bb8d-3f82118e6892
title: Potentially Suspicious CMD Shell Output Redirect
status: experimental
level: medium
description: 'Detects inline Windows shell commands redirecting output via the ">"
    symbol to a suspicious location.

    This technique is sometimes used by malicious actors in order to redirect the
    output of reconnaissance commands such as "hostname" and "dir" to files for future
    exfiltration.

    '
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-07-12'
modified: '2024-03-19'
tags:
    - attack.defense-evasion
    - attack.t1218
references:
    - https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
falsepositives:
    - Legitimate admin or third party scripts used for diagnostic collection might
        generate some false positives
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''aa2efee7-34dd-446e-8a37-40790a66efd7''),
    type=<SigmaRelatedType.DERIVED: 2>), SigmaRelatedItem(id=UUID(''4f4eaa9f-5ad4-410c-a4be-bc6132b0175a''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \cmd.exe
        OriginalFileName: Cmd.Exe
    selection_cli_1:
        CommandLine|contains:
            - '>?%APPDATA%\'
            - '>?%TEMP%\'
            - '>?%TMP%\'
            - '>?%USERPROFILE%\'
            - '>?C:\ProgramData\'
            - '>?C:\Temp\'
            - '>?C:\Users\Public\'
            - '>?C:\Windows\Temp\'
    selection_cli_2:
        CommandLine|contains:
            - ' >'
            - '">'
            - '''>'
        CommandLine|contains|all:
            - C:\Users\
            - \AppData\Local\
    condition: selection_img and 1 of selection_cli_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:46.921846+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:46.921846+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:46.921850+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:46.921852+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:46.921853+00:00'
