id: 4beb6ae0-f85b-41e2-8f18-8668abc8af78
title: Sysinternals PsSuspend Suspicious Execution
status: test
level: high
description: Detects suspicious execution of Sysinternals PsSuspend, where the utility
    is used to suspend critical processes such as AV or EDR to bypass defenses
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-03-23'
tags:
    - attack.defense-evasion
    - attack.t1562.001
references:
    - https://learn.microsoft.com/en-us/sysinternals/downloads/pssuspend
    - https://twitter.com/0gtweet/status/1638069413717975046
falsepositives:
    - Unlikely
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''48bbc537-b652-4b4e-bd1d-281172df448f''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        OriginalFileName: pssuspend.exe
        Image|endswith:
            - \pssuspend.exe
            - \pssuspend64.exe
    selection_cli:
        CommandLine|contains: msmpeng.exe
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:30.350838+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:30.350838+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:30.350844+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:30.350845+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:30.350846+00:00'
