id: c8da0dfd-4ed0-4b68-962d-13c9c884384e
title: Potential Credential Dumping Via LSASS Process Clone
status: test
level: critical
description: Detects a suspicious LSASS process process clone that could be a sign
    of credential dumping activity
author: Florian Roth (Nextron Systems), Samir Bousseaden
date: '2021-11-27'
modified: '2023-03-02'
tags:
    - attack.credential-access
    - attack.t1003
    - attack.t1003.001
references:
    - https://www.matteomalvica.com/blog/2019/12/02/win-defender-atp-cred-bypass/
    - https://twitter.com/Hexacorn/status/1420053502554951689
    - https://twitter.com/SBousseaden/status/1464566846594691073?s=20
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \Windows\System32\lsass.exe
        Image|endswith: \Windows\System32\lsass.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:28:41.801674+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:28:41.801674+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:28:41.801686+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:28:41.801688+00:00'
