title: Regsvr32 Execution From Potential Suspicious Location
id: 9525dc73-0327-438c-8c04-13c0e037e9da
status: test
level: medium
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
description: Detects execution of regsvr32 where the DLL is located in a potentially
    suspicious location.
references:
    - https://web.archive.org/web/20171001085340/https://subt0x10.blogspot.com/2017/04/bypass-application-whitelisting-script.html
    - https://app.any.run/tasks/34221348-072d-4b70-93f3-aa71f6ebecad/
falsepositives:
    - Some installers might execute "regsvr32" with DLLs located in %TEMP% or in %PROGRAMDATA%.
        Apply additional filters if necessary.
tags:
    - attack.defense-evasion
    - attack.t1218.010
date: '2023-05-26'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \regsvr32.exe
        OriginalFileName: REGSVR32.EXE
    selection_cli:
        CommandLine|contains:
            - :\ProgramData\
            - :\Temp\
            - :\Users\Public\
            - :\Windows\Temp\
            - \AppData\Local\Temp\
            - \AppData\Roaming\
    condition: all of selection_*
related:
    -   id: 8e2b24c9-4add-46a0-b4bb-0057b4e6187d
        type: obsolete
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:46:03.010309+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:46:03.010309+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:46:03.010326+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:46:03.010327+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:46:03.010329+00:00'
