id: dee0a7a3-f200-4112-a99b-952196d81e42
title: DumpMinitool Execution
status: test
level: medium
description: Detects the use of "DumpMinitool.exe" a tool that allows the dump of
    process memory via the use of the "MiniDumpWriteDump"
author: Nasreddine Bencherchali (Nextron Systems), Florian Roth (Nextron Systems)
date: '2022-04-06'
modified: '2023-04-12'
tags:
    - attack.defense-evasion
    - attack.t1036
    - attack.t1003.001
references:
    - https://twitter.com/mrd0x/status/1511415432888131586
    - https://twitter.com/mrd0x/status/1511489821247684615
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/DumpMinitool/
    - https://gist.github.com/nasbench/6d58c3c125e2fa1b8f7a09754c1b087f
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \DumpMinitool.exe
            - \DumpMinitool.x86.exe
            - \DumpMinitool.arm64.exe
        OriginalFileName:
            - DumpMinitool.exe
            - DumpMinitool.x86.exe
            - DumpMinitool.arm64.exe
    selection_cli:
        CommandLine|contains:
            - ' Full'
            - ' Mini'
            - ' WithHeap'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:56.604809+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:56.604809+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:56.604815+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:56.604817+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:56.604818+00:00'
