title: Potential PHP Reverse Shell
id: c6714a24-d7d5-4283-a36b-3ffd091d5f7e
status: test
level: high
author: '@d4ns4n_'
description: 'Detects usage of the PHP CLI with the "-r" flag which allows it to run
    inline PHP code. The rule looks for calls to the "fsockopen" function which allows
    the creation of sockets.

    Attackers often leverage this in combination with functions such as "exec" or
    "fopen" to initiate a reverse shell connection.

    '
references:
    - https://pentestmonkey.net/cheat-sheet/shells/reverse-shell-cheat-sheet
    - https://www.revshells.com/
falsepositives:
    - Unknown
tags:
    - attack.execution
date: '2023-04-07'
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|contains: /php
        CommandLine|contains|all:
            - ' -r '
            - fsockopen
        CommandLine|contains:
            - ash
            - bash
            - bsh
            - csh
            - ksh
            - pdksh
            - sh
            - tcsh
            - zsh
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:22.296827+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:22.296827+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:36:22.296846+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:36:22.296848+00:00'
