id: 213d6a77-3d55-4ce8-ba74-fcfef741974e
title: Private Keys Reconnaissance Via CommandLine Tools
status: test
level: medium
description: Adversaries may search for private key certificate files on compromised
    systems for insecurely stored credential
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: '2021-07-20'
modified: '2023-03-06'
tags:
    - attack.credential-access
    - attack.t1552.004
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.004/T1552.004.md
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_cmd_img:
        Image|endswith: \cmd.exe
        OriginalFileName: Cmd.Exe
    selection_cmd_cli:
        CommandLine|contains: 'dir '
    selection_pwsh_img:
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
        OriginalFileName:
            - PowerShell.EXE
            - pwsh.dll
    selection_pwsh_cli:
        CommandLine|contains: 'Get-ChildItem '
    selection_findstr:
        Image|endswith: \findstr.exe
        OriginalFileName: FINDSTR.EXE
    selection_ext:
        CommandLine|contains:
            - .key
            - .pgp
            - .gpg
            - .ppk
            - .p12
            - .pem
            - .pfx
            - .cer
            - .p7b
            - .asc
    condition: selection_ext and (all of selection_cmd_* or all of selection_pwsh_*
        or selection_findstr)
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:59.059172+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:59.059172+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:59.059181+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:59.059184+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:59.059186+00:00'
