id: 2dbd9d3d-9e27-42a8-b8df-f13825c6c3d5
title: WebDav Client Execution Via Rundll32.EXE
status: test
level: medium
description: 'Detects "svchost.exe" spawning "rundll32.exe" with command arguments
    like "C:\windows\system32\davclnt.dll,DavSetCookie".

    This could be an indicator of exfiltration or use of WebDav to launch code (hosted
    on a WebDav server).

    '
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: '2020-05-02'
modified: '2023-09-18'
tags:
    - attack.exfiltration
    - attack.t1048.003
references:
    - https://github.com/OTRF/detection-hackathon-apt29/issues/17
    - https://github.com/OTRF/ThreatHunter-Playbook/blob/2d4257f630f4c9770f78d0c1df059f891ffc3fec/docs/evals/apt29/detections/7.B.4_C10730EA-6345-4934-AA0F-B0EFCA0C4BA6.md
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|endswith: \svchost.exe
    selection_img:
        Image|endswith: \rundll32.exe
        OriginalFileName: RUNDLL32.EXE
    selection_cli:
        CommandLine|contains: C:\windows\system32\davclnt.dll,DavSetCookie
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:10.266618+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:10.266618+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:10.266631+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:10.266633+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:10.266635+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:10.266637+00:00'
