title: Touch Suspicious Service File
id: 31545105-3444-4584-bebf-c466353230d2
status: test
level: medium
author: Joseliyo Sanchez, @Joseliyo_Jstnk
description: Detects usage of the "touch" process in service file.
references:
    - https://blogs.blackberry.com/
    - https://twitter.com/Joseliyo_Jstnk/status/1620131033474822144
falsepositives:
    - Admin changing date of files.
tags:
    - attack.defense-evasion
    - attack.t1070.006
date: '2023-01-11'
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith: /touch
        CommandLine|contains: ' -t '
        CommandLine|endswith: .service
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:29.537626+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:29.537626+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:36:29.537641+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:36:29.537643+00:00'
