title: Shell Invocation via Apt - Linux
id: bb382fd5-b454-47ea-a264-1828e4c766d6
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: 'Detects the use of the "apt" and "apt-get" commands to execute a shell
    or proxy commands.

    Such behavior may be associated with privilege escalation, unauthorized command
    execution, or to break out from restricted environments.

    '
references:
    - https://gtfobins.github.io/gtfobins/apt/
    - https://gtfobins.github.io/gtfobins/apt-get/
falsepositives:
    - Unknown
tags:
    - attack.discovery
    - attack.t1083
date: '2022-12-28'
modified: '2024-09-02'
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith:
            - /apt
            - /apt-get
        CommandLine|contains: APT::Update::Pre-Invoke::=
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:02.132268+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:02.132268+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:36:02.132287+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:36:02.132289+00:00'
