id: 734f8d9b-42b8-41b2-bcf5-abaf49d5a3c8
title: Remote PowerShell Session Host Process (WinRM)
status: test
level: medium
description: Detects remote PowerShell sections by monitoring for wsmprovhost (WinRM
    host process) as a parent or child process (sign of an active PowerShell remote
    session).
author: Roberto Rodriguez @Cyb3rWard0g
date: '2019-09-12'
modified: '2022-10-09'
tags:
    - attack.execution
    - attack.t1059.001
    - attack.t1021.006
references:
    - https://threathunterplaybook.com/hunts/windows/190511-RemotePwshExecution/notebook.html
fields:
    - ComputerName
    - User
    - CommandLine
falsepositives:
    - Legitimate usage of remote Powershell, e.g. for monitoring purposes.
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \wsmprovhost.exe
        ParentImage|endswith: \wsmprovhost.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:26:15.791736+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:26:15.791736+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:26:15.791760+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:26:15.791764+00:00'
