title: HH.EXE Execution
id: 68c8acb4-1b60-4890-8e82-3ddf7a6dba84
status: test
level: low
author: E.M. Anhaus (originally from Atomic Blue Detections, Dan Beavin), oscd.community
description: Detects the execution of "hh.exe" to open ".chm" files.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.001/T1218.001.md
    - https://eqllib.readthedocs.io/en/latest/analytics/b25aa548-7937-11e9-8f5c-d46d6d62a49e.html
    - https://www.zscaler.com/blogs/security-research/unintentional-leak-glimpse-attack-vectors-apt37
falsepositives:
    - False positives are expected with legitimate ".CHM"
tags:
    - attack.defense-evasion
    - attack.t1218.001
date: '2019-10-24'
modified: '2023-12-11'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        OriginalFileName: HH.exe
        Image|endswith: \hh.exe
    selection_cli:
        CommandLine|contains: .chm
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:46:10.062514+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:46:10.062514+00:00'
    detection_fields:
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:46:10.062527+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:46:10.062529+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:46:10.062530+00:00'
