id: 9a019ffc-3580-4c9d-8d87-079f7e8d3fd4
title: Cloudflared Tunnel Execution
status: test
level: medium
description: Detects execution of the "cloudflared" tool to connect back to a tunnel.
    This was seen used by threat actors to maintain persistence and remote access
    to compromised networks.
author: Janantha Marasinghe, Nasreddine Bencherchali (Nextron Systems)
date: '2023-05-17'
modified: '2023-12-20'
tags:
    - attack.command-and-control
    - attack.t1102
    - attack.t1090
    - attack.t1572
references:
    - https://blog.reconinfosec.com/emergence-of-akira-ransomware-group
    - https://github.com/cloudflare/cloudflared
    - https://developers.cloudflare.com/cloudflare-one/connections/connect-apps
falsepositives:
    - Legitimate usage of Cloudflared tunnel.
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - ' tunnel '
            - ' run '
        CommandLine|contains:
            - '-config '
            - '-credentials-contents '
            - '-credentials-file '
            - '-token '
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:36.504559+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:36.504559+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:36.504563+00:00'
