id: e9142d84-fbe0-401d-ac50-3e519fb00c89
title: WhoAmI as Parameter
status: test
level: high
description: Detects a suspicious process command line that uses whoami as first parameter
    (as e.g. used by EfsPotato)
author: Florian Roth (Nextron Systems)
date: '2021-11-29'
modified: '2022-12-25'
tags:
    - attack.discovery
    - attack.t1033
    - car.2016-03-001
references:
    - https://twitter.com/blackarrowsec/status/1463805700602224645?s=12
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains: .exe whoami
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:04.226672+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:04.226672+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:04.226684+00:00'
