id: ae6f14e6-14de-45b0-9f44-c0986f50dc89
title: Change Default File Association To Executable Via Assoc
status: test
level: high
description: 'Detects when a program changes the default file association of any extension
    to an executable.

    When a file is opened, the default program used to open the file (also called
    the file association or handler) is checked. File association selections are stored
    in the Windows Registry and can be edited by users, administrators, or programs
    that have Registry access or by administrators using the built-in assoc utility.
    Applications can modify the file association for a given file extension to call
    an arbitrary program when a file with the given extension is opened.

    '
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-06-28'
modified: '2023-03-06'
tags:
    - attack.persistence
    - attack.t1546.001
references:
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/assoc
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''3d3aa6cd-6272-44d6-8afc-7e88dfef7061''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \cmd.exe
        OriginalFileName: Cmd.Exe
    selection_cli:
        CommandLine|contains|all:
            - 'assoc '
            - exefile
    filter:
        CommandLine|contains: .exe=exefile
    condition: all of selection_* and not filter
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:09.482681+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:09.482681+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:09.482690+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:09.482692+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:09.482694+00:00'
