id: d55b793d-f847-4eea-b59a-5ab09908ac90
title: Suspicious Child Process Of Veeam Dabatase
status: test
level: critical
description: Detects suspicious child processes of the Veeam service process. This
    could indicate potential RCE or SQL Injection.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-05-04'
tags:
    - attack.initial-access
    - attack.persistence
    - attack.privilege-escalation
references:
    - https://labs.withsecure.com/publications/fin7-target-veeam-servers
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''869b9ca7-9ea2-4a5a-8325-e80e62f75445''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|endswith: \sqlservr.exe
        ParentCommandLine|contains: VEEAMSQL
    selection_child_1:
        Image|endswith:
            - \cmd.exe
            - \powershell.exe
            - \pwsh.exe
            - \wsl.exe
            - \wt.exe
        CommandLine|contains:
            - '-ex '
            - bypass
            - cscript
            - DownloadString
            - http://
            - https://
            - mshta
            - regsvr32
            - rundll32
            - wscript
            - 'copy '
    selection_child_2:
        Image|endswith:
            - \net.exe
            - \net1.exe
            - \netstat.exe
            - \nltest.exe
            - \ping.exe
            - \tasklist.exe
            - \whoami.exe
    condition: selection_parent and 1 of selection_child_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:31:18.168187+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:31:18.168187+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:31:18.168208+00:00'
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-11-26T02:31:18.168211+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:31:18.168212+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:31:18.168214+00:00'
