title: Conhost Spawned By Uncommon Parent Process
id: cbb9e3d1-2386-4e59-912e-62f1484f7a89
status: test
level: medium
author: Tim Rauch, Elastic (idea)
description: Detects when the Console Window Host (conhost.exe) process is spawned
    by an uncommon parent process, which could be indicative of potential code injection
    activity.
references:
    - https://www.elastic.co/guide/en/security/current/conhost-spawned-by-suspicious-parent-process.html
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1059
date: '2022-09-28'
modified: '2023-03-29'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \conhost.exe
        ParentImage|endswith:
            - \explorer.exe
            - \lsass.exe
            - \regsvr32.exe
            - \rundll32.exe
            - \services.exe
            - \smss.exe
            - \spoolsv.exe
            - \svchost.exe
            - \userinit.exe
            - \wininit.exe
            - \winlogon.exe
    filter_main_svchost:
        ParentCommandLine|contains:
            - -k apphost -s AppHostSvc
            - -k imgsvc
            - -k localService -p -s RemoteRegistry
            - -k LocalSystemNetworkRestricted -p -s NgcSvc
            - -k NetSvcs -p -s NcaSvc
            - -k netsvcs -p -s NetSetupSvc
            - -k netsvcs -p -s wlidsvc
            - -k NetworkService -p -s DoSvc
            - -k wsappx -p -s AppXSvc
            - -k wsappx -p -s ClipSVC
    filter_optional_dropbox:
        ParentCommandLine|contains:
            - C:\Program Files (x86)\Dropbox\Client\
            - C:\Program Files\Dropbox\Client\
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:40:59.907745+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:40:59.907745+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:40:59.907758+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:40:59.907760+00:00'
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-12-04T01:40:59.907761+00:00'
