title: DLL Execution Via Register-cimprovider.exe
id: a2910908-e86f-4687-aeba-76a5f996e652
status: test
level: medium
author: Ivan Dyachkov, Yulia Fomina, oscd.community
description: Detects using register-cimprovider.exe to execute arbitrary dll file.
references:
    - https://twitter.com/PhilipTsukerman/status/992021361106268161
    - https://lolbas-project.github.io/lolbas/Binaries/Register-cimprovider/
fields:
    - CommandLine
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1574
date: '2020-10-07'
modified: '2021-11-27'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \register-cimprovider.exe
        CommandLine|contains|all:
            - -path
            - dll
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:42:49.733156+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:42:49.733156+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:42:49.733172+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:42:49.733173+00:00'
