title: AgentExecutor PowerShell Execution
id: 7efd2c8d-8b18-45b7-947d-adfe9ed04f61
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems), memory-shards
description: Detects execution of the AgentExecutor.exe binary. Which can be abused
    as a LOLBIN to execute powershell scripts with the ExecutionPolicy "Bypass" or
    any binary named "powershell.exe" located in the path provided by 6th positional
    argument
references:
    - https://twitter.com/lefterispan/status/1286259016436514816
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Agentexecutor/
    - https://learn.microsoft.com/en-us/mem/intune/apps/intune-management-extension
    - https://twitter.com/jseerden/status/1247985304667066373/photo/1
falsepositives:
    - Legitimate use via Intune management. You exclude script paths and names to
        reduce FP rate
tags:
    - attack.defense-evasion
    - attack.t1218
date: '2022-12-24'
modified: '2024-08-07'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image: \AgentExecutor.exe
        OriginalFileName: AgentExecutor.exe
    selection_cli:
        CommandLine|contains:
            - ' -powershell'
            - ' -remediationScript'
    filter_main_intune:
        ParentImage|endswith: \Microsoft.Management.Services.IntuneWindowsAgent.exe
    condition: all of selection_* and not 1 of filter_main_*
related:
    -   id: c0b40568-b1e9-4b03-8d6c-b096da6da9ab
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:47:44.852702+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:47:44.852702+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:47:44.852719+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:47:44.852721+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:47:44.852722+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:47:44.852724+00:00'
