title: Potential Ransomware or Unauthorized MBR Tampering Via Bcdedit.EXE
id: c9fbe8e9-119d-40a6-9b59-dd58a5d84429
status: test
level: medium
author: '@neu5ron'
description: Detects potential malicious and unauthorized usage of bcdedit.exe
references:
    - https://learn.microsoft.com/en-us/windows-hardware/drivers/devtest/bcdedit--set
    - https://twitter.com/malwrhunterteam/status/1372536434125512712/photo/2
tags:
    - attack.defense-evasion
    - attack.t1070
    - attack.persistence
    - attack.t1542.003
date: '2019-02-07'
modified: '2023-02-15'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \bcdedit.exe
        OriginalFileName: bcdedit.exe
    selection_cli:
        CommandLine|contains:
            - delete
            - deletevalue
            - import
            - safeboot
            - network
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:47:54.405914+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:47:54.405914+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:47:54.405936+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:47:54.405938+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:47:54.405939+00:00'
