title: Service StartupType Change Via PowerShell Set-Service
id: 62b20d44-1546-4e61-afce-8e175eb9473c
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects the use of the PowerShell "Set-Service" cmdlet to change the
    startup type of a service to "disabled" or "manual"
references:
    - https://www.virustotal.com/gui/file/38283b775552da8981452941ea74191aa0d203edd3f61fb2dee7b0aea3514955
falsepositives:
    - False positives may occur with troubleshooting scripts
tags:
    - attack.execution
    - attack.defense-evasion
    - attack.t1562.001
date: '2023-03-04'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \powershell.exe
        OriginalFileName: PowerShell.EXE
    selection_cli:
        CommandLine|contains|all:
            - Set-Service
            - -StartupType
        CommandLine|contains:
            - Disabled
            - Manual
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:47:29.789641+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:47:29.789641+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:47:29.789670+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:47:29.789672+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:47:29.789673+00:00'
