title: Linux Package Uninstall
id: 95d61234-7f56-465c-6f2d-b562c6fedbc4
status: test
level: low
author: Tuan Le (NCSGroup), Nasreddine Bencherchali (Nextron Systems)
description: Detects linux package removal using builtin tools such as "yum", "apt",
    "apt-get" or "dpkg".
references:
    - https://sysdig.com/blog/mitre-defense-evasion-falco
    - https://www.tutorialspoint.com/how-to-install-a-software-on-linux-using-yum-command
    - https://linuxhint.com/uninstall_yum_package/
    - https://linuxhint.com/uninstall-debian-packages/
falsepositives:
    - Administrator or administrator scripts might delete packages for several reasons
        (debugging, troubleshooting).
tags:
    - attack.defense-evasion
    - attack.t1070
date: '2023-03-09'
logsource:
    category: process_creation
    product: linux
detection:
    selection_yum:
        Image|endswith: /yum
        CommandLine|contains:
            - erase
            - remove
    selection_apt:
        Image|endswith:
            - /apt
            - /apt-get
        CommandLine|contains:
            - remove
            - purge
    selection_dpkg:
        Image|endswith: /dpkg
        CommandLine|contains:
            - '--remove '
            - ' -r '
    selection_rpm:
        Image|endswith: /rpm
        CommandLine|contains: ' -e '
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:37.454200+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:37.454200+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:36:37.454222+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:36:37.454224+00:00'
