id: ff3b6b39-e765-42f9-bb2c-ea6761e0e0f6
title: Mstsc.EXE Execution From Uncommon Parent
status: test
level: high
description: Detects potential RDP connection via Mstsc using a local ".rdp" file
    located in suspicious locations.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-04-18'
modified: '2023-04-18'
tags:
    - attack.lateral-movement
references:
    - https://www.blackhillsinfosec.com/rogue-rdp-revisiting-initial-access-methods/
    - https://web.archive.org/web/20230726144748/https://blog.thickmints.dev/mintsights/detecting-rogue-rdp/
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|endswith:
            - \brave.exe
            - \CCleanerBrowser.exe
            - \chrome.exe
            - \chromium.exe
            - \firefox.exe
            - \iexplore.exe
            - \microsoftedge.exe
            - \msedge.exe
            - \opera.exe
            - \vivaldi.exe
            - \whale.exe
            - \outlook.exe
    selection_img:
        Image|endswith: \mstsc.exe
        OriginalFileName: mstsc.exe
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:25:42.288568+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:25:42.288568+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:25:42.288584+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:25:42.288587+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:25:42.288588+00:00'
