title: Ruby Inline Command Execution
id: 20a5ffa1-3848-4584-b6f8-c7c7fd9f69c8
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects execution of ruby using the "-e" flag. This is could be used
    as a way to launch a reverse shell or execute live ruby code.
references:
    - https://pentestmonkey.net/cheat-sheet/shells/reverse-shell-cheat-sheet
    - https://www.revshells.com/
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1059
date: '2023-01-02'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \ruby.exe
        OriginalFileName: ruby.exe
    selection_cli:
        CommandLine|contains: ' -e'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:48:28.975300+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:48:28.975300+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:48:28.975315+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:48:28.975317+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:48:28.975319+00:00'
