id: 214641c2-c579-4ecb-8427-0cf19df6842e
title: Remote File Download Via Desktopimgdownldr Utility
status: test
level: medium
description: Detects the desktopimgdownldr utility being used to download a remote
    file. An adversary may use desktopimgdownldr to download arbitrary files as an
    alternative to certutil.
author: Tim Rauch, Elastic (idea)
date: '2022-09-27'
tags:
    - attack.command-and-control
    - attack.t1105
references:
    - https://www.elastic.co/guide/en/security/current/remote-file-download-via-desktopimgdownldr-utility.html
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \desktopimgdownldr.exe
        ParentImage|endswith: \desktopimgdownldr.exe
        CommandLine|contains: /lockscreenurl:http
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:34.963311+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:34.963311+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:34.963332+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:34.963334+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:34.963336+00:00'
