title: Suspicious FromBase64String Usage On Gzip Archive - Process Creation
id: d75d6b6b-adb9-48f7-824b-ac2e786efe1f
status: test
level: medium
author: frack113
description: Detects attempts of decoding a base64 Gzip archive via PowerShell. This
    technique is often used as a method to load malicious content into memory afterward.
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=43
falsepositives:
    - Legitimate administrative script
tags:
    - attack.command-and-control
    - attack.t1132.001
date: '2022-12-23'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - FromBase64String
            - MemoryStream
            - H4sI
    condition: selection
related:
    -   id: df69cb1d-b891-4cd9-90c7-d617d90100ce
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:49:14.614888+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:49:14.614888+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:49:14.614907+00:00'
