id: 744a188b-0415-4792-896f-11ddb0588dbc
title: Potential Process Injection Via Msra.EXE
status: test
level: high
description: Detects potential process injection via Microsoft Remote Asssistance
    (Msra.exe) by looking at suspicious child processes spawned from the aforementioned
    process. It has been a target used by many threat actors and used for discovery
    and persistence tactics
author: Alexander McDonald
date: '2022-06-24'
modified: '2023-02-03'
tags:
    - attack.defense-evasion
    - attack.t1055
references:
    - https://www.microsoft.com/security/blog/2021/12/09/a-closer-look-at-qakbots-latest-building-blocks-and-how-to-knock-them-down/
    - https://www.fortinet.com/content/dam/fortinet/assets/analyst-reports/ar-qakbot.pdf
falsepositives:
    - Legitimate use of Msra.exe
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \msra.exe
        ParentCommandLine|endswith: msra.exe
        Image|endswith:
            - \arp.exe
            - \cmd.exe
            - \net.exe
            - \netstat.exe
            - \nslookup.exe
            - \route.exe
            - \schtasks.exe
            - \whoami.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:57.129345+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:57.129345+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:57.129350+00:00'
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-11-13T20:20:57.129356+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:57.129357+00:00'
