id: 727454c0-d851-48b0-8b89-385611ab0704
title: Lolbin Unregmp2.exe Use As Proxy
status: test
level: medium
description: Detect usage of the "unregmp2.exe" binary as a proxy to launch a custom
    version of "wmpnscfg.exe"
author: frack113
date: '2022-12-29'
modified: '2024-06-04'
tags:
    - attack.defense-evasion
    - attack.t1218
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Unregmp2/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \unregmp2.exe
        OriginalFileName: unregmp2.exe
    selection_cmd:
        CommandLine|contains|windash: ' /HideWMP'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:26:50.010797+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:26:50.010797+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:26:50.010826+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:26:50.010831+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:26:50.010833+00:00'
