id: 9b0b7ac3-6223-47aa-a3fd-e8f211e637db
title: Changing Existing Service ImagePath Value Via Reg.EXE
status: test
level: medium
description: 'Adversaries may execute their own malicious payloads by hijacking the
    Registry entries used by services.

    Adversaries may use flaws in the permissions for registry to redirect from the
    originally specified executable to one that they control, in order to launch their
    own code at Service start.

    Windows stores local service configuration information in the Registry under HKLM\SYSTEM\CurrentControlSet\Services

    '
author: frack113
date: '2021-12-30'
modified: '2024-03-13'
tags:
    - attack.persistence
    - attack.t1574.011
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1574.011/T1574.011.md#atomic-test-2---service-imagepath-change-with-regexe
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \reg.exe
        CommandLine|contains|all:
            - 'add '
            - SYSTEM\CurrentControlSet\Services\
            - ' ImagePath '
    selection_value:
        CommandLine|contains|windash: ' -d '
    condition: all of selection*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:58.321039+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:58.321039+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:58.321050+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:58.321052+00:00'
