id: 5bb68627-3198-40ca-b458-49f973db8752
title: Rundll32 Execution Without Parameters
status: test
level: high
description: Detects rundll32 execution without parameters as observed when running
    Metasploit windows/smb/psexec exploit module
author: Bartlomiej Czyz, Relativity
date: '2021-01-31'
modified: '2023-02-28'
tags:
    - attack.lateral-movement
    - attack.t1021.002
    - attack.t1570
    - attack.execution
    - attack.t1569.002
references:
    - https://bczyz1.github.io/2021/01/30/psexec.html
fields:
    - ComputerName
    - SubjectUserName
    - CommandLine
    - Image
    - ParentImage
falsepositives:
    - False positives may occur if a user called rundll32 from CLI with no options
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine:
            - rundll32.exe
            - rundll32
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:19.738915+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:19.738915+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:19.738924+00:00'
