id: 36d88494-1d43-4dc0-b3fa-35c8fea0ca9d
title: HackTool - CreateMiniDump Execution
status: test
level: high
description: Detects the use of CreateMiniDump hack tool used to dump the LSASS process
    memory for credential extraction on the attacker's machine
author: Florian Roth (Nextron Systems)
date: '2019-12-22'
modified: '2024-11-23'
tags:
    - attack.credential-access
    - attack.t1003.001
references:
    - https://ired.team/offensive-security/credential-access-and-credential-dumping/dumping-lsass-passwords-without-mimikatz-minidumpwritedump-av-signature-bypass
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \CreateMiniDump.exe
        Hashes|contains: IMPHASH=4a07f944a83e8a7c2525efa35dd30e2f
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:32:20.980213+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:32:20.980213+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:32:20.980268+00:00'
        -   source_field: Hashes
            target_table: process_activity
            target_field: process.file.hashes.value
            mapped_at: '2025-11-26T02:32:20.980274+00:00'
