id: 089fc3d2-71e8-4763-a8a5-c97fbb0a403e
title: Regsvr32 DLL Execution With Suspicious File Extension
status: test
level: high
description: Detects the execution of REGSVR32.exe with DLL files masquerading as
    other files
author: Florian Roth (Nextron Systems), frack113
date: '2021-11-29'
modified: '2023-05-24'
tags:
    - attack.defense-evasion
    - attack.t1218.010
references:
    - https://thedfirreport.com/2021/11/29/continuing-the-bazar-ransomware-story/
    - https://blog.talosintelligence.com/2021/10/threat-hunting-in-large-datasets-by.html
    - https://guides.lib.umich.edu/c.php?g=282942&p=1885348
falsepositives:
    - Unlikely
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''8e2b24c9-4add-46a0-b4bb-0057b4e6187d''),
    type=<SigmaRelatedType.OBSOLETE: 4>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \regsvr32.exe
        OriginalFileName: REGSVR32.EXE
    selection_cli:
        CommandLine|endswith:
            - .bin
            - .bmp
            - .cr2
            - .dat
            - .eps
            - .gif
            - .ico
            - .jpeg
            - .jpg
            - .nef
            - .orf
            - .png
            - .raw
            - .sr2
            - .temp
            - .tif
            - .tiff
            - .tmp
            - .rtf
            - .txt
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:27:18.951658+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:27:18.951658+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:27:18.951672+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:27:18.951674+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:27:18.951675+00:00'
