title: Suspicious Schtasks Schedule Types
id: 24c8392b-aa3c-46b7-a545-43f71657fe98
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects scheduled task creations or modification on a suspicious schedule
    type
references:
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks-change
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks-create
    - http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
falsepositives:
    - Legitimate processes that run at logon. Filter according to your environment
tags:
    - attack.execution
    - attack.t1053.005
date: '2022-09-09'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \schtasks.exe
        OriginalFileName: schtasks.exe
    selection_time:
        CommandLine|contains:
            - ' ONLOGON '
            - ' ONSTART '
            - ' ONCE '
            - ' ONIDLE '
    filter_privs:
        CommandLine|contains:
            - NT AUT
            - ' SYSTEM'
            - HIGHEST
    condition: all of selection_* and not 1 of filter_*
related:
    -   id: 7a02e22e-b885-4404-b38b-1ddc7e65258a
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:47:14.432690+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:47:14.432690+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:47:14.432716+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:47:14.432718+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:47:14.432720+00:00'
