title: Bypass UAC via WSReset.exe
id: d797268e-28a9-49a7-b9a8-2f5039011c5c
status: test
level: high
author: E.M. Anhaus (originally from Atomic Blue Detections, Tony Lambert), oscd.community,
    Florian Roth
description: Detects use of WSReset.exe to bypass User Account Control (UAC). Adversaries
    use this technique to execute privileged processes.
references:
    - https://eqllib.readthedocs.io/en/latest/analytics/532b5ed4-7930-11e9-8f5c-d46d6d62a49e.html
    - https://lolbas-project.github.io/lolbas/Binaries/Wsreset/
    - https://www.activecyber.us/activelabs/windows-uac-bypass
    - https://twitter.com/ReaQta/status/1222548288731217921
falsepositives:
    - Unknown sub processes of Wsreset.exe
tags:
    - attack.privilege-escalation
    - attack.defense-evasion
    - attack.t1548.002
date: '2019-10-24'
modified: '2022-05-13'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \wsreset.exe
    filter:
        Image|endswith: \conhost.exe
        OriginalFileName: CONHOST.EXE
    condition: selection and not filter
related:
    -   id: bdc8918e-a1d5-49d1-9db7-ea0fd91aa2ae
        type: obsolete
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:45:52.802807+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:45:52.802807+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:45:52.802823+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:45:52.802825+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:45:52.802826+00:00'
