title: PUA - Rclone Execution
id: e37db05d-d1f9-49c8-b464-cee1a4b11638
status: test
level: high
author: Bhabesh Raj, Sittikorn S, Aaron Greetham (@beardofbinary) - NCC Group
description: Detects execution of RClone utility for exfiltration as used by various
    ransomwares strains like REvil, Conti, FiveHands, etc
references:
    - https://research.nccgroup.com/2021/05/27/detecting-rclone-an-effective-tool-for-exfiltration/
    - https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware
    - https://us-cert.cisa.gov/ncas/analysis-reports/ar21-126a
    - https://labs.sentinelone.com/egregor-raas-continues-the-chaos-with-cobalt-strike-and-rclone
    - https://www.splunk.com/en_us/blog/security/darkside-ransomware-splunk-threat-update-and-detections.html
fields:
    - CommandLine
    - ParentCommandLine
    - Details
falsepositives:
    - Unknown
tags:
    - attack.exfiltration
    - attack.t1567.002
date: '2021-05-10'
modified: '2023-03-05'
logsource:
    category: process_creation
    product: windows
detection:
    selection_specific_options:
        CommandLine|contains|all:
            - '--config '
            - '--no-check-certificate '
            - ' copy '
    selection_rclone_img:
        Image|endswith: \rclone.exe
        Description: Rsync for cloud storage
    selection_rclone_cli:
        CommandLine|contains:
            - pass
            - user
            - copy
            - sync
            - config
            - lsd
            - remote
            - ls
            - mega
            - pcloud
            - ftp
            - ignore-existing
            - auto-confirm
            - transfers
            - multi-thread-streams
            - 'no-check-certificate '
    condition: selection_specific_options or all of selection_rclone_*
related:
    -   id: a0d63692-a531-4912-ad39-4393325b2a9c
        type: obsolete
    -   id: cb7286ba-f207-44ab-b9e6-760d82b84253
        type: obsolete
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:51:10.057570+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:51:10.057570+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:51:10.057626+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:51:10.057630+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: device.desc
            mapped_at: '2025-12-04T01:51:10.057631+00:00'
