id: 7692f583-bd30-4008-8615-75dab3f08a99
title: Enable BPF Kprobes Tracing
status: test
level: medium
description: Detects common command used to enable bpf kprobes tracing
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-01-25'
tags:
    - attack.execution
    - attack.defense-evasion
references:
    - https://embracethered.com/blog/posts/2021/offensive-bpf-bpftrace/
    - https://bpftrace.org/
    - https://www.kernel.org/doc/html/v5.0/trace/kprobetrace.html
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        CommandLine|contains|all:
            - echo 1 >
            - /sys/kernel/debug/tracing/events/kprobes/
        CommandLine|contains:
            - /myprobe/enable
            - /myretprobe/enable
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:15:51.742197+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-11-13T20:15:51.742197+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:15:51.742205+00:00'
