id: b99a1518-1ad5-4f65-bc95-1ffff97a8fd0
title: HackTool - Inveigh Execution
status: test
level: critical
description: Detects the use of Inveigh a cross-platform .NET IPv4/IPv6 machine-in-the-middle
    tool
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-10-24'
modified: '2023-02-04'
tags:
    - attack.credential-access
    - attack.t1003.001
references:
    - https://github.com/Kevin-Robertson/Inveigh
    - https://thedfirreport.com/2020/11/23/pysa-mespinoza-ransomware/
falsepositives:
    - Very unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \Inveigh.exe
        OriginalFileName:
            - \Inveigh.exe
            - \Inveigh.dll
        Description: Inveigh
        CommandLine|contains:
            - ' -SpooferIP'
            - ' -ReplyToIPs '
            - ' -ReplyToDomains '
            - ' -ReplyToMACs '
            - ' -SnifferIP'
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:32.046215+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:32.046215+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:32.046227+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:32.046229+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: message
            mapped_at: '2025-11-13T20:20:32.046230+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:32.046231+00:00'
