title: RemoteFXvGPUDisablement Abuse Via AtomicTestHarnesses
id: a6fc3c46-23b8-4996-9ea2-573f4c4d88c5
status: test
level: high
author: frack113
description: Detects calls to the AtomicTestHarnesses "Invoke-ATHRemoteFXvGPUDisablementCommand"
    which is designed to abuse the "RemoteFXvGPUDisablement.exe" binary to run custom
    PowerShell code via module load-order hijacking.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218/T1218.md
    - https://github.com/redcanaryco/AtomicTestHarnesses/blob/7e1e4da116801e3d6fcc6bedb207064577e40572/TestHarnesses/T1218_SignedBinaryProxyExecution/InvokeRemoteFXvGPUDisablementCommand.ps1
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1218
date: '2021-07-13'
modified: '2023-05-09'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - Invoke-ATHRemoteFXvGPUDisablementCommand
            - Invoke-ATHRemoteFXvGPUDisableme
    condition: selection
related:
    -   id: f65e22f9-819e-4f96-9c7b-498364ae7a25
        type: similar
    -   id: 38a7625e-b2cb-485d-b83d-aff137d859f4
        type: similar
    -   id: cacef8fc-9d3d-41f7-956d-455c6e881bc5
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:42:05.353392+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:42:05.353392+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:42:05.353404+00:00'
