title: Suspicious File Download From IP Via Wget.EXE - Paths
id: 40aa399c-7b02-4715-8e5f-73572b493f33
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects potentially suspicious file downloads directly from IP addresses
    and stored in suspicious locations using Wget.exe
references:
    - https://www.gnu.org/software/wget/manual/wget.html
falsepositives:
    - Unknown
tags:
    - attack.execution
date: '2024-02-23'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \wget.exe
        OriginalFileName: wget.exe
    selection_ip:
        CommandLine|re: ://[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}
    selection_http:
        CommandLine|contains: http
    selection_flag:
        CommandLine|re: \s-O\s
        CommandLine|contains: --output-document
    selection_paths:
        CommandLine|contains:
            - :\PerfLogs\
            - :\Temp\
            - :\Users\Public\
            - :\Windows\Help\
            - :\Windows\Temp\
            - \Temporary Internet
        CommandLine|contains|all:
            - :\Users\
            - \Favorites\
            - :\Users\
            - \Favourites\
            - :\Users\
            - \Contacts\
            - :\Users\
            - \Pictures\
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:50:15.450497+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:50:15.450497+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:50:15.450516+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:50:15.450518+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:50:15.450520+00:00'
