title: Function Call From Undocumented COM Interface EditionUpgradeManager
id: fb3722e4-1a06-46b6-b772-253e2e7db933
status: test
level: medium
author: oscd.community, Dmitry Uchakin
description: Detects function calls from the EditionUpgradeManager COM interface.
    Which is an interface that is not used by standard executables.
references:
    - https://www.snip2code.com/Snippet/4397378/UAC-bypass-using-EditionUpgradeManager-C/
    - https://gist.github.com/hfiref0x/de9c83966623236f5ebf8d9ae2407611
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
date: '2020-10-07'
modified: '2023-11-30'
logsource:
    category: process_access
    product: windows
detection:
    selection:
        CallTrace|contains: editionupgrademanagerobj.dll
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: process_access
            mapped_at: '2025-12-04T01:40:10.709846+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:40:10.709846+00:00'
    detection_fields:
        -   source_field: CallTrace
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:40:10.709861+00:00'
