id: 13db8d2e-7723-4c2c-93c1-a4d36994f7ef
title: Potential In-Memory Download And Compile Of Payloads
status: test
level: medium
description: Detects potential in-memory downloading and compiling of applets using
    curl and osacompile as seen used by XCSSET malware
author: Sohan G (D4rkCiph3r), Red Canary (idea)
date: '2023-08-22'
tags:
    - attack.command-and-control
    - attack.execution
    - attack.t1059.007
    - attack.t1105
references:
    - https://redcanary.com/blog/mac-application-bundles/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: macos
detection:
    selection:
        CommandLine|contains|all:
            - osacompile
            - curl
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:14:25.795995+00:00'
        product:
            source_field: product
            source_value: macos
            mapped_at: '2025-11-13T20:14:25.795995+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:14:25.796000+00:00'
