id: 71158e3f-df67-472b-930e-7d287acaa3e1
title: Execution Of Non-Existing File
status: test
level: high
description: Checks whether the image specified in a process creation event is not
    a full, absolute path (caused by process ghosting or other unorthodox methods
    to start a process)
author: Max Altgelt (Nextron Systems)
date: '2021-12-09'
modified: '2022-12-14'
tags:
    - attack.defense-evasion
references:
    - https://pentestlaboratories.com/2021/12/08/process-ghosting/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    image_absolute_path:
        Image|contains: \
    filter_null:
        Image: null
    filter_empty:
        Image:
            - '-'
            - ''
    filter_4688:
        Image:
            - System
            - Registry
            - MemCompression
            - vmmem
        CommandLine:
            - Registry
            - MemCompression
            - vmmem
    condition: not image_absolute_path and not 1 of filter*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:07.883234+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:07.883234+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:07.883239+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:07.883241+00:00'
