id: 9f8fc146-1d1a-4dbf-b8fd-dfae15e08541
title: HackTool - SharpLDAPmonitor Execution
status: test
level: medium
description: Detects execution of the SharpLDAPmonitor. Which can monitor the creation,
    deletion and changes to LDAP objects.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-12-30'
modified: '2023-02-14'
tags:
    - attack.discovery
references:
    - https://github.com/p0dalirius/LDAPmonitor
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \SharpLDAPmonitor.exe
        OriginalFileName: SharpLDAPmonitor.exe
    selection_cli:
        CommandLine|contains|all:
            - '/user:'
            - '/pass:'
            - '/dcip:'
    condition: 1 of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:28.752568+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:28.752568+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:28.752577+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:28.752579+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:28.752580+00:00'
