title: Computer Discovery And Export Via Get-ADComputer Cmdlet
id: 435e10e4-992a-4281-96f3-38b11106adde
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects usage of the Get-ADComputer cmdlet to collect computer information
    and output it to a file
references:
    - http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
    - https://www.microsoft.com/en-us/security/blog/2022/10/18/defenders-beware-a-case-for-post-ransomware-investigations/
    - https://www.cisa.gov/uscert/sites/default/files/publications/aa22-320a_joint_csa_iranian_government-sponsored_apt_actors_compromise_federal%20network_deploy_crypto%20miner_credential_harvester.pdf
falsepositives:
    - Legitimate admin scripts may use the same technique, it's better to exclude
        specific computers or users who execute these commands or scripts often
tags:
    - attack.discovery
    - attack.t1033
date: '2022-11-10'
modified: '2022-11-17'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
        OriginalFileName:
            - PowerShell.EXE
            - pwsh.dll
    selection_cli:
        CommandLine|contains|all:
            - 'Get-ADComputer '
            - ' -Filter \*'
        CommandLine|contains:
            - ' > '
            - ' | Select '
            - Out-File
            - Set-Content
            - Add-Content
    condition: all of selection_*
related:
    -   id: db885529-903f-4c5d-9864-28fe199e6370
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:46:09.631575+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:46:09.631575+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:46:09.631590+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:46:09.631592+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:46:09.631593+00:00'
