title: Harvesting Of Wifi Credentials Via Netsh.EXE
id: 42b1a5b8-353f-4f10-b256-39de4467faff
status: test
level: medium
author: Andreas Hunkeler (@Karneades), oscd.community
description: Detect the harvesting of wifi credentials using netsh.exe
references:
    - https://blog.malwarebytes.com/threat-analysis/2020/04/new-agenttesla-variant-steals-wifi-credentials/
falsepositives:
    - Unknown
tags:
    - attack.discovery
    - attack.credential-access
    - attack.t1040
date: '2020-04-20'
modified: '2023-02-13'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \netsh.exe
        OriginalFileName: netsh.exe
    selection_cli:
        CommandLine|contains|all:
            - wlan
            - ' s'
            - ' p'
            - ' k'
            - =clear
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:42:08.922895+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:42:08.922895+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:42:08.922911+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:42:08.922913+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:42:08.922914+00:00'
