title: Suspicious Execution of Shutdown to Log Out
id: ec290c06-9b6b-4338-8b6b-095c0f284f10
status: test
level: medium
author: frack113
description: Detects the rare use of the command line tool shutdown to logoff a user
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/9e5b12c4912c07562aec7500447b11fa3e17e254/atomics/T1529/T1529.md
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/shutdown
falsepositives:
    - Unknown
tags:
    - attack.impact
    - attack.t1529
date: '2022-10-01'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \shutdown.exe
        CommandLine|contains: /l
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:45:43.358221+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:45:43.358221+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:45:43.358234+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:45:43.358236+00:00'
