title: Suspicious Invocation of Shell via AWK - Linux
id: 8c1a5675-cb85-452f-a298-b01b22a51856
status: experimental
level: high
author: Li Ling, Andy Parkidomo, Robert Rakowski, Blake Hartstein (Bloomberg L.P.)
description: 'Detects the execution of "awk" or it''s sibling commands, to invoke
    a shell using the system() function.

    This behavior is commonly associated with attempts to execute arbitrary commands
    or escalate privileges, potentially leading to unauthorized access or further
    exploitation.

    '
references:
    - https://gtfobins.github.io/gtfobins/awk/#shell
    - https://gtfobins.github.io/gtfobins/gawk/#shell
    - https://gtfobins.github.io/gtfobins/nawk/#shell
    - https://gtfobins.github.io/gtfobins/mawk/#shell
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1059
date: '2024-09-02'
logsource:
    category: process_creation
    product: linux
detection:
    selection_img:
        Image|endswith:
            - /awk
            - /gawk
            - /mawk
            - /nawk
        CommandLine|contains: BEGIN {system
    selection_cli:
        CommandLine|contains:
            - /bin/bash
            - /bin/dash
            - /bin/fish
            - /bin/sh
            - /bin/zsh
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:36:08.524270+00:00'
        product:
            source_field: product
            source_value: linux
            mapped_at: '2025-12-04T01:36:08.524270+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:36:08.524292+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:36:08.524294+00:00'
