id: ca387a8e-1c84-4da3-9993-028b45342d30
title: PUA - SoftPerfect Netscan Execution
status: experimental
level: medium
description: 'Detects usage of SoftPerfect''s "netscan.exe". An application for scanning
    networks.

    It is actively used in-the-wild by threat actors to inspect and understand the
    network architecture of a victim.

    '
author: '@d4ns4n_ (Wuerth-Phoenix)'
date: '2024-04-25'
tags:
    - attack.discovery
    - attack.t1046
references:
    - https://www.protect.airbus.com/blog/uncovering-cyber-intruders-netscan/
    - https://secjoes-reports.s3.eu-central-1.amazonaws.com/Sockbot%2Bin%2BGoLand.pdf
    - https://www.sentinelone.com/labs/black-basta-ransomware-attacks-deploy-custom-edr-evasion-tools-tied-to-fin7-threat-actor/
    - https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/yanluowang-ransomware-attacks-continue
    - https://research.nccgroup.com/2022/07/13/climbing-mount-everest-black-byte-bytes-back/
    - https://www.bleepingcomputer.com/news/security/microsoft-exchange-servers-hacked-to-deploy-hive-ransomware/
    - https://www.softperfect.com/products/networkscanner/
falsepositives:
    - Legitimate administrator activity
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \netscan.exe
        Product: Network Scanner
        Description: Application for scanning networks
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:27:05.169046+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:27:05.169046+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:27:05.169089+00:00'
        -   source_field: Product
            target_table: process_activity
            target_field: metadata.product.name
            mapped_at: '2025-11-26T02:27:05.169094+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: device.desc
            mapped_at: '2025-11-26T02:27:05.169097+00:00'
