title: Suspicious Desktopimgdownldr Command
id: bb58aa4a-b80b-415a-a2c0-2f65a4c81009
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects a suspicious Microsoft desktopimgdownldr execution with parameters
    used to download files from the Internet
references:
    - https://labs.sentinelone.com/living-off-windows-land-a-new-native-file-downldr/
    - https://twitter.com/SBousseaden/status/1278977301745741825
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - False positives depend on scripts and administrative tools used in the monitored
        environment
tags:
    - attack.command-and-control
    - attack.t1105
date: '2020-07-03'
modified: '2021-11-27'
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        CommandLine|contains: ' /lockscreenurl:'
    selection1_filter:
        CommandLine|contains:
            - .jpg
            - .jpeg
            - .png
    selection_reg:
        CommandLine|contains|all:
            - reg delete
            - \PersonalizationCSP
    condition: ( selection1 and not selection1_filter ) or selection_reg
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:47:26.461794+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:47:26.461794+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:47:26.461806+00:00'
