id: d4498716-1d52-438f-8084-4a603157d131
title: Password Provided In Command Line Of Net.EXE
status: test
level: medium
description: Detects a when net.exe is called with a password in the command line
author: Tim Shelton (HAWK.IO)
date: '2021-12-09'
modified: '2023-02-21'
tags:
    - attack.defense-evasion
    - attack.initial-access
    - attack.persistence
    - attack.privilege-escalation
    - attack.lateral-movement
    - attack.t1021.002
    - attack.t1078
references:
    - Internal Research
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \net.exe
            - \net1.exe
        OriginalFileName:
            - net.exe
            - net1.exe
    selection_cli:
        CommandLine|contains|all:
            - ' use '
            - :*\
            - /USER:* *
    filter_main_empty:
        CommandLine|endswith: ' '
    condition: all of selection_* and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:33:21.086115+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:33:21.086115+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:33:21.086145+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-26T02:33:21.086149+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:33:21.086157+00:00'
