id: b697e69c-746f-4a86-9f59-7bfff8eab881
title: UAC Bypass Using Disk Cleanup
status: test
level: high
description: Detects the pattern of UAC Bypass using scheduled tasks and variable
    expansion of cleanmgr.exe (UACMe 34)
author: Christian Burkard (Nextron Systems)
date: '2021-08-30'
modified: '2024-12-01'
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
references:
    - https://github.com/hfiref0x/UACME
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|endswith: '"\system32\cleanmgr.exe /autoclean /d C:'
        ParentCommandLine: C:\Windows\system32\svchost.exe -k netsvcs -p -s Schedule
        IntegrityLevel:
            - High
            - System
            - S-1-16-16384
            - S-1-16-12288
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:31.537157+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:31.537157+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:31.537170+00:00'
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-11-13T20:20:31.537172+00:00'
        -   source_field: IntegrityLevel
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:20:31.537173+00:00'
