id: 6d3a3952-6530-44a3-8554-cf17c116c615
title: Potentially Suspicious JWT Token Search Via CLI
status: test
level: medium
description: 'Detects possible search for JWT tokens via CLI by looking for the string
    "eyJ0eX" or "eyJhbG".

    This string is used as an anchor to look for the start of the JWT token used by
    microsoft office and similar apps.

    '
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-10-25'
modified: '2024-10-06'
tags:
    - attack.credential-access
    - attack.t1528
references:
    - https://mrd0x.com/stealing-tokens-from-office-applications/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - eyJ0eXAiOi
            - eyJhbGciOi
            - ' eyJ0eX'
            - ' "eyJ0eX"'
            - ' ''eyJ0eX'''
            - ' eyJhbG'
            - ' "eyJhbG"'
            - ' ''eyJhbG'''
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:30:06.633102+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:30:06.633102+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:30:06.633121+00:00'
