id: 4cbef972-f347-4170-b62a-8253f6168e6d
title: UAC Bypass Using IDiagnostic Profile
status: test
level: high
description: Detects the "IDiagnosticProfileUAC" UAC bypass technique
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-07-03'
modified: '2024-12-01'
tags:
    - attack.execution
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
references:
    - https://github.com/Wh04m1001/IDiagnosticProfileUAC
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \DllHost.exe
        ParentCommandLine|contains: ' /Processid:{12C21EA7-2EB8-4B55-9249-AC243DA8C666}'
        IntegrityLevel:
            - High
            - System
            - S-1-16-16384
            - S-1-16-12288
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:33:48.451953+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:33:48.451953+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:33:48.451966+00:00'
        -   source_field: ParentCommandLine
            target_table: process_activity
            target_field: process.parent_process.cmd_line
            mapped_at: '2025-11-26T02:33:48.451968+00:00'
        -   source_field: IntegrityLevel
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:33:48.451970+00:00'
