title: Remote Code Execute via Winrm.vbs
id: 9df0dd3a-1a5c-47e3-a2bc-30ed177646a0
status: test
level: medium
author: Julia Fomina, oscd.community
description: Detects an attempt to execute code or create service on remote host via
    winrm.vbs.
references:
    - https://twitter.com/bohops/status/994405551751815170
    - https://redcanary.com/blog/lateral-movement-winrm-wmi/
    - https://lolbas-project.github.io/lolbas/Scripts/Winrm/
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1216
date: '2020-10-07'
modified: '2023-03-03'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \cscript.exe
        OriginalFileName: cscript.exe
    selection_cli:
        CommandLine|contains|all:
            - winrm
            - invoke Create wmicimv2/Win32_
            - -r:http
    condition: all of selection*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:44:43.837499+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:44:43.837499+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:44:43.837516+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:44:43.837517+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:44:43.837519+00:00'
