id: 06b401f4-107c-4ff9-947f-9ec1e7649f1e
title: Potential Arbitrary Command Execution Via FTP.EXE
status: test
level: medium
description: Detects execution of "ftp.exe" script with the "-s" or "/s" flag and
    any child processes ran by "ftp.exe".
author: Victor Sergeev, oscd.community
date: '2020-10-09'
modified: '2024-04-23'
tags:
    - attack.execution
    - attack.t1059
    - attack.defense-evasion
    - attack.t1202
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Ftp/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|endswith: \ftp.exe
    selection_child_img:
        Image|endswith: \ftp.exe
        OriginalFileName: ftp.exe
    selection_child_cli:
        CommandLine|contains|windash: '-s:'
    condition: selection_parent or all of selection_child_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:30.857437+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:30.857437+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:30.857462+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:30.857467+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:30.857470+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:30.857473+00:00'
