title: Potential Fake Instance Of Hxtsr.EXE Executed
id: 4e762605-34a8-406d-b72e-c1a089313320
status: test
level: medium
author: Sreeman
description: 'HxTsr.exe is a Microsoft compressed executable file called Microsoft
    Outlook Communications.

    HxTsr.exe is part of Outlook apps, because it resides in a hidden "WindowsApps"
    subfolder of "C:\Program Files".

    Any instances of hxtsr.exe not in this folder may be malware camouflaging itself
    as HxTsr.exe

    '
references:
    - Internal Research
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1036
date: '2020-04-17'
modified: '2024-02-08'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \hxtsr.exe
    filter_main_hxtsr:
        Image|contains: :\program files\windowsapps\microsoft.windowscommunicationsapps_
        Image|endswith: \hxtsr.exe
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:48:23.878533+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:48:23.878533+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:48:23.878548+00:00'
