title: Imports Registry Key From a File
id: 73bba97f-a82d-42ce-b315-9182e76c57b1
status: test
level: medium
author: Oddvar Moe, Sander Wiebing, oscd.community
description: Detects the import of the specified file to the registry with regedit.exe.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Regedit/
    - https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
fields:
    - ParentImage
    - CommandLine
falsepositives:
    - Legitimate import of keys
    - Evernote
tags:
    - attack.t1112
    - attack.defense-evasion
date: '2020-10-07'
modified: '2024-03-13'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \regedit.exe
        OriginalFileName: REGEDIT.EXE
    selection_cli:
        CommandLine|contains:
            - ' /i '
            - ' /s '
            - .reg
    filter_1:
        CommandLine|contains|windash:
            - ' -e '
            - ' -a '
            - ' -c '
    filter_2:
        CommandLine|re: :[^ \\]
    condition: all of selection_* and not all of filter_*
related:
    -   id: 0b80ade5-6997-4b1d-99a1-71701778ea61
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:46:49.888123+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:46:49.888123+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:46:49.888137+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:46:49.888139+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:46:49.888140+00:00'
