id: 1ca6bd18-0ba0-44ca-851c-92ed89a61085
title: UAC Bypass Using Consent and Comctl32 - Process
status: test
level: high
description: Detects the pattern of UAC Bypass using consent.exe and comctl32.dll
    (UACMe 22)
author: Christian Burkard (Nextron Systems)
date: '2021-08-23'
modified: '2024-12-01'
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
references:
    - https://github.com/hfiref0x/UACME
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \consent.exe
        Image|endswith: \werfault.exe
        IntegrityLevel:
            - High
            - System
            - S-1-16-16384
            - S-1-16-12288
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:28:15.119892+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:28:15.119892+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-26T02:28:15.119913+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:28:15.119916+00:00'
        -   source_field: IntegrityLevel
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:28:15.119918+00:00'
