title: Windows Share Mount Via Net.EXE
id: f117933c-980c-4f78-b384-e3d838111165
status: test
level: low
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects when a share is mounted using the "net.exe" utility
references:
    - https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view
falsepositives:
    - Legitimate activity by administrators and scripts
tags:
    - attack.lateral-movement
    - attack.t1021.002
date: '2023-02-02'
modified: '2023-02-21'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \net.exe
            - \net1.exe
        OriginalFileName:
            - net.exe
            - net1.exe
    selection_cli:
        CommandLine|contains:
            - ' use '
            - ' \\'
    condition: all of selection_*
related:
    -   id: 3abd6094-7027-475f-9630-8ab9be7b9725
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:43:44.750175+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:43:44.750175+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:43:44.750189+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:43:44.750191+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:43:44.750193+00:00'
