title: Filter Driver Unloaded Via Fltmc.EXE
id: 4931188c-178e-4ee7-a348-39e8a7a56821
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detect filter driver unloading activity via fltmc.exe
references:
    - https://www.darkoperator.com/blog/2018/10/5/operating-offensively-against-sysmon
    - https://www.cybereason.com/blog/threat-analysis-report-lockbit-2.0-all-paths-lead-to-ransom
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1070
    - attack.t1562
    - attack.t1562.002
date: '2023-02-13'
modified: '2024-06-24'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \fltMC.exe
        OriginalFileName: fltMC.exe
    selection_cli:
        CommandLine|contains: unload
    filter_optional_avira:
        ParentImage|startswith: C:\Users\
        ParentImage|contains: \AppData\Local\Temp\
        ParentImage|endswith: \endpoint-protection-installer-x64.tmp
        CommandLine|endswith: unload rtp_filesystem_filter
    filter_optional_manageengine:
        ParentImage: C:\Program Files (x86)\ManageEngine\uems_agent\bin\dcfaservice64.exe
        CommandLine|endswith: unload DFMFilter
    condition: all of selection_* and not 1 of filter_optional_*
related:
    -   id: 4d7cda18-1b12-4e52-b45c-d28653210df8
        type: derived
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:42:27.220037+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:42:27.220037+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:42:27.220052+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:42:27.220054+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:42:27.220062+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:42:27.220064+00:00'
