id: cc9cbe82-7bc0-4ef5-bc23-bbfb83947be7
title: File Decoded From Base64/Hex Via Certutil.EXE
status: test
level: medium
description: Detects the execution of certutil with either the "decode" or "decodehex"
    flags to decode base64 or hex encoded files. This can be abused by attackers to
    decode an encoded payload before execution
author: Florian Roth (Nextron Systems), Jonhnathan Ribeiro, oscd.community
date: '2023-02-15'
modified: '2024-03-05'
tags:
    - attack.defense-evasion
    - attack.t1027
references:
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/certutil
    - https://unit42.paloaltonetworks.com/new-babyshark-malware-targets-u-s-national-security-think-tanks/
    - https://news.sophos.com/en-us/2021/04/13/compromised-exchange-server-hosting-cryptojacker-targeting-other-exchange-servers/
    - https://twitter.com/JohnLaTwC/status/835149808817991680
    - https://learn.microsoft.com/en-us/archive/blogs/pki/basic-crl-checking-with-certutil
    - https://lolbas-project.github.io/lolbas/Binaries/Certutil/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \certutil.exe
        OriginalFileName: CertUtil.exe
    selection_cli:
        CommandLine|contains|windash:
            - '-decode '
            - '-decodehex '
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:15.744183+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:15.744183+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:15.744187+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:20:15.744188+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:15.744189+00:00'
