title: Xwizard.EXE Execution From Non-Default Location
id: 193d5ccd-6f59-40c6-b5b0-8e32d5ddd3d1
status: test
level: high
author: Christian Burkard (Nextron Systems)
description: 'Detects the execution of Xwizard tool from a non-default directory.

    When executed from a non-default directory, this utility can be abused in order
    to side load a custom version of "xwizards.dll".

    '
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Xwizard/
    - http://www.hexacorn.com/blog/2017/07/31/the-wizard-of-x-oppa-plugx-style/
falsepositives:
    - Windows installed on non-C drive
tags:
    - attack.defense-evasion
    - attack.t1574.002
date: '2021-09-20'
modified: '2024-08-15'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \xwizard.exe
        OriginalFileName: xwizard.exe
    filter_main_legit_location:
        Image|startswith:
            - C:\Windows\System32\
            - C:\Windows\SysWOW64\
            - C:\Windows\WinSxS\
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:41:25.812993+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:41:25.812993+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:41:25.813008+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:41:25.813010+00:00'
