title: Exchange PowerShell Snap-Ins Usage
id: 25676e10-2121-446e-80a4-71ff8506af47
status: test
level: high
author: FPT.EagleEye, Nasreddine Bencherchali (Nextron Systems)
description: Detects adding and using Exchange PowerShell snap-ins to export mailbox
    data. As seen used by HAFNIUM and APT27
references:
    - https://www.volexity.com/blog/2021/03/02/active-exploitation-of-microsoft-exchange-zero-day-vulnerabilities/
    - https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/
    - https://www.intrinsec.com/apt27-analysis/
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1059.001
    - attack.collection
    - attack.t1114
date: '2021-03-03'
modified: '2023-03-24'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
        OriginalFileName:
            - PowerShell.EXE
            - pwsh.dll
    selection_cli:
        CommandLine|contains: Add-PSSnapin
    selection_module:
        CommandLine|contains:
            - Microsoft.Exchange.Powershell.Snapin
            - Microsoft.Exchange.Management.PowerShell.SnapIn
    filter_msiexec:
        ParentImage: C:\Windows\System32\msiexec.exe
        CommandLine|contains: $exserver=Get-ExchangeServer ([Environment]::MachineName)
            -ErrorVariable exerr 2> $null
    condition: all of selection_* and not 1 of filter_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:41:54.860962+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:41:54.860962+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:41:54.860977+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:41:54.860978+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:41:54.860979+00:00'
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-12-04T01:41:54.860981+00:00'
