id: a4e3d776-f12e-42c2-8510-9e6ed1f43ec3
title: Unusual Child Process of dns.exe
status: test
level: high
description: Detects an unexpected process spawning from dns.exe which may indicate
    activity related to remote code execution or other forms of exploitation as seen
    in CVE-2020-1350 (SigRed)
author: Tim Rauch, Elastic (idea)
date: '2022-09-27'
modified: '2023-02-05'
tags:
    - attack.initial-access
    - attack.t1133
references:
    - https://www.elastic.co/guide/en/security/current/unusual-child-process-of-dns-exe.html
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: \dns.exe
    filter:
        Image|endswith: \conhost.exe
    condition: selection and not filter
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:20.231849+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:20.231849+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:20.231861+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:20.231863+00:00'
