id: 5394fcc7-aeb2-43b5-9a09-cac9fc5edcd5
title: Suspicious Execution Location Of Wermgr.EXE
status: test
level: high
description: Detects suspicious Windows Error Reporting manager (wermgr.exe) execution
    location.
author: Florian Roth (Nextron Systems)
date: '2022-10-14'
modified: '2023-08-23'
tags:
    - attack.execution
references:
    - https://www.trendmicro.com/en_us/research/22/j/black-basta-infiltrates-networks-via-qakbot-brute-ratel-and-coba.html
    - https://www.echotrail.io/insights/search/wermgr.exe
    - https://github.com/binderlabs/DirCreate2System
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''396f6630-f3ac-44e3-bfc8-1b161bc00c4e''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \wermgr.exe
    filter_main_legit_location:
        Image|startswith:
            - C:\Windows\System32\
            - C:\Windows\SysWOW64\
            - C:\Windows\WinSxS\
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:29:14.464902+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:29:14.464902+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:29:14.464914+00:00'
