id: f2c64357-b1d2-41b7-849f-34d2682c0fad
title: Suspicious Command Patterns In Scheduled Task Creation
status: experimental
level: high
description: Detects scheduled task creation using "schtasks" that contain potentially
    suspicious or uncommon commands
author: Florian Roth (Nextron Systems)
date: '2022-02-23'
modified: '2024-03-19'
tags:
    - attack.execution
    - attack.t1053.005
references:
    - https://app.any.run/tasks/512c1352-6380-4436-b27d-bb62f0c020d6/
    - https://twitter.com/RedDrip7/status/1506480588827467785
    - https://www.ncsc.gov.uk/static-assets/documents/malware-analysis-reports/devil-bait/NCSC-MAR-Devil-Bait.pdf
falsepositives:
    - Software installers that run from temporary folders and also install scheduled
        tasks are expected to generate some false positives
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_schtasks:
        Image|endswith: \schtasks.exe
        CommandLine|contains: '/Create '
    selection_pattern_1:
        CommandLine|contains:
            - '/sc minute '
            - '/ru system '
    selection_pattern_2:
        CommandLine|contains:
            - cmd /c
            - cmd /k
            - cmd /r
            - 'cmd.exe /c '
            - 'cmd.exe /k '
            - 'cmd.exe /r '
    selection_uncommon:
        CommandLine|contains:
            - ' -decode '
            - ' -enc '
            - ' -w hidden '
            - ' bypass '
            - ' IEX'
            - .DownloadData
            - .DownloadFile
            - .DownloadString
            - '/c start /min '
            - FromBase64String
            - mshta http
            - mshta.exe http
    selection_anomaly_1:
        CommandLine|contains:
            - :\ProgramData\
            - :\Temp\
            - :\Tmp\
            - :\Users\Public\
            - :\Windows\Temp\
            - \AppData\
            - '%AppData%'
            - '%Temp%'
            - '%tmp%'
    selection_anomaly_2:
        CommandLine|contains:
            - cscript
            - curl
            - wscript
    condition: selection_schtasks and ( all of selection_pattern_* or selection_uncommon
        or all of selection_anomaly_* )
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-26T02:29:06.219315+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:29:06.219315+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:29:06.219336+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-26T02:29:06.219340+00:00'
