title: Suspicious X509Enrollment - Process Creation
id: 114de787-4eb2-48cc-abdb-c0b449f93ea4
status: test
level: medium
author: frack113
description: Detect use of X509Enrollment
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=42
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=41
    - https://learn.microsoft.com/en-us/dotnet/api/microsoft.hpc.scheduler.store.cx509enrollmentwebclassfactoryclass?view=hpc-sdk-5.1.6115
falsepositives:
    - Legitimate administrative script
tags:
    - attack.defense-evasion
    - attack.t1553.004
date: '2022-12-23'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - X509Enrollment.CBinaryConverter
            - 884e2002-217d-11da-b2a4-000e7bbb2b09
    condition: selection
related:
    -   id: 504d63cb-0dba-4d02-8531-e72981aace2c
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:42:07.963246+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:42:07.963246+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:42:07.963259+00:00'
