title: Verclsid.exe Runs COM Object
id: d06be4b9-8045-428b-a567-740a26d9db25
status: test
level: medium
author: Victor Sergeev, oscd.community
description: Detects when verclsid.exe is used to run COM object via GUID
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Verclsid/
    - https://gist.github.com/NickTyrer/0598b60112eaafe6d07789f7964290d5
    - https://bohops.com/2018/08/18/abusing-the-com-registry-structure-part-2-loading-techniques-for-evasion-and-persistence/
fields:
    - CommandLine
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1218
date: '2020-10-09'
modified: '2022-07-11'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \verclsid.exe
        OriginalFileName: verclsid.exe
    selection_cli:
        CommandLine|contains|all:
            - /S
            - /C
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:41:40.616801+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:41:40.616801+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:41:40.616816+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:41:40.616818+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:41:40.616819+00:00'
