id: 41f407b5-3096-44ea-a74f-96d04fbc41be
title: Remote Access Tool - AnyDesk Execution With Known Revoked Signing Certificate
status: test
level: medium
description: 'Detects the execution of an AnyDesk binary with a version prior to 8.0.8.

    Prior to version 8.0.8, the Anydesk application used a signing certificate that
    got compromised by threat actors.

    Use this rule to detect instances of older versions of Anydesk using the compromised
    certificate

    This is recommended in order to avoid attackers leveraging the certificate and
    signing their binaries to bypass detections.

    '
author: Sai Prashanth Pulisetti, Nasreddine Bencherchali (Nextron Systems)
date: '2024-02-08'
tags:
    - attack.execution
    - attack.initial-access
references:
    - https://www.bleepingcomputer.com/news/security/anydesk-says-hackers-breached-its-production-servers-reset-passwords/
    - https://anydesk.com/en/changelog/windows
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \AnyDesk.exe
        Description: AnyDesk
        Product: AnyDesk
        Company: AnyDesk Software GmbH
    selection_version:
        FileVersion|startswith:
            - 7.0.
            - 7.1.
            - 8.0.1
            - 8.0.2
            - 8.0.3
            - 8.0.4
            - 8.0.5
            - 8.0.6
            - 8.0.7
    filter_main_uninstall:
        CommandLine|contains:
            - ' --remove'
            - ' --uninstall'
    condition: all of selection_* and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:18.169436+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:18.169436+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:19.725534+00:00'
        -   source_field: Description
            target_table: process_activity
            target_field: message
            mapped_at: '2025-11-13T20:20:19.725555+00:00'
        -   source_field: Product
            target_table: process_activity
            target_field: metadata.product.name
            mapped_at: '2025-11-13T20:20:19.725557+00:00'
        -   source_field: Company
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:20:19.725558+00:00'
        -   source_field: FileVersion
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:20:19.725559+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:19.725560+00:00'
