id: 12b8e9f5-96b2-41e1-9a42-8c6779a5c184
title: Potentially Suspicious Execution Of PDQDeployRunner
status: test
level: medium
description: Detects suspicious execution of "PDQDeployRunner" which is part of the
    PDQDeploy service stack that is responsible for executing commands and packages
    on a remote machines
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-07-22'
modified: '2024-05-02'
tags:
    - attack.execution
references:
    - https://twitter.com/malmoeb/status/1550483085472432128
falsepositives:
    - Legitimate use of the PDQDeploy tool to execute these commands
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''d679950c-abb7-43a6-80fb-2a480c4fc450''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|contains: \PDQDeployRunner-
    selection_child:
        Image|endswith:
            - \bash.exe
            - \certutil.exe
            - \cmd.exe
            - \csc.exe
            - \cscript.exe
            - \dllhost.exe
            - \mshta.exe
            - \msiexec.exe
            - \regsvr32.exe
            - \rundll32.exe
            - \scriptrunner.exe
            - \wmic.exe
            - \wscript.exe
            - \wsl.exe
        Image|contains:
            - :\ProgramData\
            - :\Users\Public\
            - :\Windows\TEMP\
            - \AppData\Local\Temp
        CommandLine|contains:
            - ' -decode '
            - ' -enc '
            - ' -encodedcommand '
            - ' -w hidden'
            - DownloadString
            - FromBase64String
            - http
            - 'iex '
            - Invoke-
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-11-13T20:20:59.071773+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:20:59.071773+00:00'
    detection_fields:
        -   source_field: ParentImage
            target_table: process_activity
            target_field: process.parent_process.name
            mapped_at: '2025-11-13T20:20:59.071783+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:20:59.071786+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-11-13T20:20:59.071788+00:00'
