title: Potential MSTSC Shadowing Activity
id: 6ba5a05f-b095-4f0a-8654-b825f4f16334
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects RDP session hijacking by using MSTSC shadowing
references:
    - https://twitter.com/kmkz_security/status/1220694202301976576
    - https://github.com/kmkz/Pentesting/blob/47592e5e160d3b86c2024f09ef04ceb87d204995/Post-Exploitation-Cheat-Sheet
falsepositives:
    - Unknown
tags:
    - attack.lateral-movement
    - attack.t1563.002
date: '2020-01-24'
modified: '2023-02-05'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - noconsentprompt
            - 'shadow:'
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:42:54.528990+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:42:54.528990+00:00'
    detection_fields:
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:42:54.529002+00:00'
