title: Service Reconnaissance Via Wmic.EXE
id: 76f55eaa-d27f-4213-9d45-7b0e4b60bbae
status: test
level: medium
author: frack113, Nasreddine Bencherchali (Nextron Systems)
description: 'An adversary might use WMI to check if a certain remote service is running
    on a remote device.

    When the test completes, a service information will be displayed on the screen
    if it exists.

    A common feedback message is that "No instance(s) Available" if the service queried
    is not running.

    A common error message is "Node - (provided IP or default) ERROR Description =The
    RPC server is unavailable" if the provided remote host is unreachable

    '
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1047/T1047.md
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/wmic
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1047
date: '2023-02-14'
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: \WMIC.exe
        OriginalFileName: wmic.exe
    selection_cli:
        CommandLine|contains: service
    condition: all of selection_*
related:
    -   id: 68bcd73b-37ef-49cb-95fc-edc809730be6
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 1
    logsource:
        category:
            source_field: category
            source_value: process_creation
            mapped_at: '2025-12-04T01:46:44.321530+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:46:44.321530+00:00'
    detection_fields:
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:46:44.321544+00:00'
        -   source_field: OriginalFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-12-04T01:46:44.321546+00:00'
        -   source_field: CommandLine
            target_table: process_activity
            target_field: process.cmd_line
            mapped_at: '2025-12-04T01:46:44.321547+00:00'
