title: Bitsadmin to Uncommon TLD
id: 9eb68894-7476-4cd6-8752-23b51f5883a7
status: test
level: high
author: Florian Roth (Nextron Systems), Tim Shelton
description: Detects Bitsadmin connections to domains with uncommon TLDs
references:
    - https://twitter.com/jhencinski/status/1102695118455349248
    - https://isc.sans.edu/forums/diary/Investigating+Microsoft+BITS+Activity/23281/
fields:
    - ClientIP
    - c-uri
    - c-useragent
falsepositives:
    - Rare programs that use Bitsadmin and update from regional TLDs e.g. .uk or .ca
tags:
    - attack.command-and-control
    - attack.t1071.001
    - attack.defense-evasion
    - attack.persistence
    - attack.t1197
    - attack.s0190
date: '2019-03-07'
modified: '2023-05-17'
logsource:
    category: proxy
detection:
    selection:
        c-useragent|startswith: Microsoft BITS/
    falsepositives:
        cs-host|endswith:
            - .com
            - .net
            - .org
            - .scdn.co
            - .sfx.ms
    condition: selection and not falsepositives
ocsf_mapping:
    class_name: http_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: proxy
            mapped_at: '2025-12-04T01:34:57.683874+00:00'
    detection_fields:
        -   source_field: c-useragent
            target_table: http_activity
            target_field: http_request.user_agent
            mapped_at: '2025-12-04T01:34:57.683885+00:00'
        -   source_field: cs-host
            target_table: http_activity
            target_field: dst_endpoint.hostname
            mapped_at: '2025-12-04T01:34:57.683887+00:00'
