id: f3f21ce1-cdef-4bfc-8328-ed2e826f5fac
title: HackTool - CobaltStrike Malleable Profile Patterns - Proxy
status: test
level: high
description: Detects cobalt strike malleable profiles patterns (URI, User-Agents,
    Methods).
author: Markus Neis, Florian Roth (Nextron Systems)
date: '2024-02-15'
tags:
    - attack.defense-evasion
    - attack.command-and-control
    - attack.t1071.001
references:
    - https://github.com/rsmudge/Malleable-C2-Profiles/blob/26323784672913923d20c5a638c6ca79459e8529/normal/amazon.profile
    - https://www.hybrid-analysis.com/sample/ee5eca8648e45e2fea9dac0d920ef1a1792d8690c41ee7f20343de1927cc88b9?environmentId=100
    - https://github.com/rsmudge/Malleable-C2-Profiles/blob/26323784672913923d20c5a638c6ca79459e8529/normal/ocsp.profile
    - https://github.com/yeyintminthuhtut/Malleable-C2-Profiles-Collection/
    - https://github.com/rsmudge/Malleable-C2-Profiles/blob/26323784672913923d20c5a638c6ca79459e8529/normal/onedrive_getonly.profile
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''953b895e-5cc9-454b-b183-7f3db555452e''),
    type=<SigmaRelatedType.OBSOLETE: 4>), SigmaRelatedItem(id=UUID(''41b42a36-f62c-4c34-bd40-8cb804a34ad8''),
    type=<SigmaRelatedType.OBSOLETE: 4>), SigmaRelatedItem(id=UUID(''37325383-740a-403d-b1a2-b2b4ab7992e7''),
    type=<SigmaRelatedType.OBSOLETE: 4>), SigmaRelatedItem(id=UUID(''c9b33401-cc6a-4cf6-83bb-57ddcb2407fc''),
    type=<SigmaRelatedType.OBSOLETE: 4>)])'
taxonomy: sigma
logsource:
    category: proxy
detection:
    selection_amazon_1:
        c-useragent: Mozilla/5.0 (Windows NT 6.1; WOW64; Trident/7.0; rv:11.0) like
            Gecko
        cs-method: GET
        c-uri: /s/ref=nb_sb_noss_1/167-3294888-0262949/field-keywords=books
        cs-host: www.amazon.com
        cs-cookie|endswith: =csm-hit=s-24KU11BB82RZSYGJ3BDK|1419899012996
    selection_amazon_2:
        c-useragent: Mozilla/5.0 (Windows NT 6.1; WOW64; Trident/7.0; rv:11.0) like
            Gecko
        cs-method: POST
        c-uri: /N4215/adj/amzn.us.sr.aps
        cs-host: www.amazon.com
    selection_generic_1:
        c-useragent:
            - Mozilla/4.0 (compatible; MSIE 6.0;Windows NT 5.1)
            - Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 6.1; WOW64; Trident/4.0;
                SLCC2; .NET CLR 3.0.30729; .NET4.0C; .NET4.0E )
            - Mozilla/5.0 (Windows; U; MSIE 7.0; Windows NT 5.2) Java/1.5.0_08
    selection_generic_2:
        c-useragent|endswith: ; MANM; MANM)
    selection_oscp:
        c-uri|contains: /oscp/
        cs-host: ocsp.verisign.com
    selection_onedrive:
        cs-method: GET
        c-uri|endswith: \?manifest=wac
        cs-host: onedrive.live.com
    filter_main_onedrive:
        c-uri|startswith: http
        c-uri|contains: ://onedrive.live.com/
    condition: 1 of selection_* and not 1 of filter_main_*
ocsf_mapping:
    class_name: http_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: proxy
            mapped_at: '2025-11-26T02:14:16.274655+00:00'
    detection_fields:
        -   source_field: c-useragent
            target_table: http_activity
            target_field: http_request.user_agent
            mapped_at: '2025-11-26T02:14:17.063975+00:00'
        -   source_field: cs-method
            target_table: http_activity
            target_field: http_request.http_method
            mapped_at: '2025-11-26T02:14:17.063998+00:00'
        -   source_field: c-uri
            target_table: http_activity
            target_field: http_request.url
            mapped_at: '2025-11-26T02:14:17.064003+00:00'
        -   source_field: cs-host
            target_table: http_activity
            target_field: dst_endpoint.hostname
            mapped_at: '2025-11-26T02:14:17.064007+00:00'
        -   source_field: cs-cookie
            target_table: http_activity
            target_field: http_cookies.value
            mapped_at: '2025-11-26T02:14:17.064011+00:00'
