id: fa935401-513b-467b-81f4-f9e77aa0dd78
title: Crypto Miner User Agent
status: test
level: high
description: Detects suspicious user agent strings used by crypto miners in proxy
    logs
author: Florian Roth (Nextron Systems)
date: '2019-10-21'
modified: '2021-11-27'
tags:
    - attack.command-and-control
    - attack.t1071.001
references:
    - https://github.com/xmrig/xmrig/blob/da22b3e6c45825f3ac1f208255126cb8585cd4fc/src/base/kernel/Platform_win.cpp#L65
    - https://github.com/xmrig/xmrig/blob/427b6516e0550200c17ca28675118f0fffcc323f/src/version.h
fields:
    - ClientIP
    - c-uri
    - c-useragent
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: proxy
detection:
    selection:
        c-useragent|startswith:
            - 'XMRig '
            - ccminer
    condition: selection
ocsf_mapping:
    class_name: http_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: proxy
            mapped_at: '2025-11-26T02:14:01.166898+00:00'
    detection_fields:
        -   source_field: c-useragent
            target_table: http_activity
            target_field: http_request.user_agent
            mapped_at: '2025-11-26T02:14:01.166921+00:00'
