id: 894a8613-cf12-48b3-8e57-9085f54aa0c3
title: Potential Base64 Encoded User-Agent
status: test
level: medium
description: Detects User Agent strings that end with an equal sign, which can be
    a sign of base64 encoding.
author: Florian Roth (Nextron Systems), Brian Ingram (update)
date: '2022-07-08'
modified: '2023-05-04'
tags:
    - attack.command-and-control
    - attack.t1071.001
references:
    - https://blogs.jpcert.or.jp/en/2022/07/yamabot.html
    - https://deviceatlas.com/blog/list-of-user-agent-strings#desktop
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''d443095b-a221-4957-a2c4-cd1756c9b747''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: proxy
detection:
    selection:
        c-useragent|endswith: '='
    condition: selection
ocsf_mapping:
    class_name: http_activity
    logsource:
        category:
            source_field: category
            source_value: proxy
            mapped_at: '2025-11-13T20:14:25.892647+00:00'
    detection_fields:
        -   source_field: c-useragent
            target_table: http_activity
            target_field: http_request.user_agent
            mapped_at: '2025-11-13T20:14:25.892651+00:00'
