title: PwnDrp Access
id: 2b1ee7e4-89b6-4739-b7bb-b811b6607e5e
status: test
level: critical
author: Florian Roth (Nextron Systems)
description: Detects downloads from PwnDrp web servers developed for red team testing
    and most likely also used for criminal activity
references:
    - https://breakdev.org/pwndrop/
fields:
    - ClientIP
    - c-uri
    - c-useragent
falsepositives:
    - Unknown
tags:
    - attack.command-and-control
    - attack.t1071.001
    - attack.t1102.001
    - attack.t1102.003
date: '2020-04-15'
modified: '2021-11-27'
logsource:
    category: proxy
detection:
    selection:
        c-uri|contains: /pwndrop/
    condition: selection
ocsf_mapping:
    class_name: http_activity
    activity_id: 3
    logsource:
        category:
            source_field: category
            source_value: proxy
            mapped_at: '2025-12-04T01:34:43.944933+00:00'
    detection_fields:
        -   source_field: c-uri
            target_table: http_activity
            target_field: http_request.url
            mapped_at: '2025-12-04T01:34:43.944944+00:00'
