id: b59c98c6-95e8-4d65-93ee-f594dfb96b17
title: F5 BIG-IP iControl Rest API Command Execution - Proxy
status: test
level: medium
description: Detects POST requests to the F5 BIG-IP iControl Rest API "bash" endpoint,
    which allows the execution of commands on the BIG-IP
author: Nasreddine Bencherchali (Nextron Systems), Thurein Oo
date: '2023-11-08'
tags:
    - attack.initial-access
    - attack.t1190
references:
    - https://f5-sdk.readthedocs.io/en/latest/apidoc/f5.bigip.tm.util.html#module-f5.bigip.tm.util.bash
    - https://community.f5.com/t5/technical-forum/icontrolrest-11-5-execute-bash-command/td-p/203029
    - https://community.f5.com/t5/technical-forum/running-bash-commands-via-rest-api/td-p/272516
falsepositives:
    - Legitimate usage of the BIG IP REST API to execute command for administration
        purposes
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''85254a62-22be-4239-b79c-2ec17e566c37''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: proxy
detection:
    selection:
        cs-method: POST
        c-uri|endswith: /mgmt/tm/util/bash
    condition: selection
ocsf_mapping:
    class_name: http_activity
    logsource:
        category:
            source_field: category
            source_value: proxy
            mapped_at: '2025-11-13T20:14:26.767624+00:00'
    detection_fields:
        -   source_field: cs-method
            target_table: http_activity
            target_field: http_request.http_method
            mapped_at: '2025-11-13T20:14:26.767659+00:00'
        -   source_field: c-uri
            target_table: http_activity
            target_field: http_request.url
            mapped_at: '2025-11-13T20:14:26.767663+00:00'
