title: HackTool - BabyShark Agent Default URL Pattern
id: 304810ed-8853-437f-9e36-c4975c3dfd7e
status: test
level: critical
author: Florian Roth (Nextron Systems)
description: Detects Baby Shark C2 Framework default communication patterns
references:
    - https://nasbench.medium.com/understanding-detecting-c2-frameworks-babyshark-641be4595845
falsepositives:
    - Unlikely
tags:
    - attack.command-and-control
    - attack.t1071.001
date: '2021-06-09'
modified: '2024-02-15'
logsource:
    category: proxy
detection:
    selection:
        c-uri|contains: momyshark\?key=
    condition: selection
ocsf_mapping:
    class_name: http_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: proxy
            mapped_at: '2025-12-04T01:34:47.817108+00:00'
    detection_fields:
        -   source_field: c-uri
            target_table: http_activity
            target_field: http_request.url
            mapped_at: '2025-12-04T01:34:47.817176+00:00'
