title: Download from Suspicious Dyndns Hosts
id: 195c1119-ef07-4909-bb12-e66f5e07bf3c
status: test
level: medium
author: Florian Roth (Nextron Systems)
description: Detects download of certain file types from hosts with dynamic DNS names
    (selected list)
references:
    - https://www.alienvault.com/blogs/security-essentials/dynamic-dns-security-and-potential-threats
fields:
    - cs-ip
    - c-uri
falsepositives:
    - Software downloads
tags:
    - attack.defense-evasion
    - attack.command-and-control
    - attack.t1105
    - attack.t1568
date: '2017-11-08'
modified: '2023-05-18'
logsource:
    category: proxy
detection:
    selection:
        c-uri-extension:
            - exe
            - vbs
            - bat
            - rar
            - ps1
            - doc
            - docm
            - xls
            - xlsm
            - pptm
            - rtf
            - hta
            - dll
            - ws
            - wsf
            - sct
            - zip
        cs-host|endswith:
            - .hopto.org
            - .no-ip.org
            - .no-ip.info
            - .no-ip.biz
            - .no-ip.com
            - .noip.com
            - .ddns.name
            - .myftp.org
            - .myftp.biz
            - .serveblog.net
            - .servebeer.com
            - .servemp3.com
            - .serveftp.com
            - .servequake.com
            - .servehalflife.com
            - .servehttp.com
            - .servegame.com
            - .servepics.com
            - .myvnc.com
            - .ignorelist.com
            - .jkub.com
            - .dlinkddns.com
            - .jumpingcrab.com
            - .ddns.info
            - .mooo.com
            - .dns-dns.com
            - .strangled.net
            - .adultdns.net
            - .craftx.biz
            - .ddns01.com
            - .dns53.biz
            - .dnsapi.info
            - .dnsd.info
            - .dnsdynamic.com
            - .dnsdynamic.net
            - .dnsget.org
            - .fe100.net
            - .flashserv.net
            - .ftp21.net
            - .http01.com
            - .http80.info
            - .https443.com
            - .imap01.com
            - .kadm5.com
            - .mysq1.net
            - .ns360.info
            - .ntdll.net
            - .ole32.com
            - .proxy8080.com
            - .sql01.com
            - .ssh01.com
            - .ssh22.net
            - .tempors.com
            - .tftpd.net
            - .ttl60.com
            - .ttl60.org
            - .user32.com
            - .voip01.com
            - .wow64.net
            - .x64.me
            - .xns01.com
            - .dyndns.org
            - .dyndns.info
            - .dyndns.tv
            - .dyndns-at-home.com
            - .dnsomatic.com
            - .zapto.org
            - .webhop.net
            - .25u.com
            - .slyip.net
    condition: selection
ocsf_mapping:
    class_name: http_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: proxy
            mapped_at: '2025-12-04T01:34:56.662611+00:00'
    detection_fields:
        -   source_field: c-uri-extension
            target_table: http_activity
            target_field: http_request.url
            mapped_at: '2025-12-04T01:34:56.662629+00:00'
        -   source_field: cs-host
            target_table: http_activity
            target_field: dst_endpoint.hostname
            mapped_at: '2025-12-04T01:34:56.662631+00:00'
