id: eb6c2004-1cef-427f-8885-9042974e5eb6
title: Suspicious Network Communication With IPFS
status: test
level: low
description: Detects connections to interplanetary file system (IPFS) containing a
    user's email address which mirrors behaviours observed in recent phishing campaigns
    leveraging IPFS to host credential harvesting webpages.
author: Gavin Knapp
date: '2023-03-16'
tags:
    - attack.credential-access
    - attack.t1056
references:
    - https://blog.talosintelligence.com/ipfs-abuse/
    - https://github.com/Cisco-Talos/IOCs/tree/80caca039988252fbb3f27a2e89c2f2917f582e0/2022/11
    - https://isc.sans.edu/diary/IPFS%20phishing%20and%20the%20need%20for%20correctly%20set%20HTTP%20security%20headers/29638
falsepositives:
    - Legitimate use of IPFS being used in the organisation. However the cs-uri regex
        looking for a user email will likely negate this.
taxonomy: sigma
logsource:
    category: proxy
detection:
    selection:
        cs-uri|re: (?i)(ipfs\.io/|ipfs\.io\s).+\..+@.+\.[a-z]+
    condition: selection
ocsf_mapping:
    class_name: http_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: proxy
            mapped_at: '2025-11-26T02:14:11.463583+00:00'
    detection_fields:
        -   source_field: cs-uri
            target_table: http_activity
            target_field: http_request.url
            mapped_at: '2025-11-26T02:14:12.242909+00:00'
