id: b923f7d6-ac89-4a50-a71a-89fb846b4aa8
title: HackTool - Empire UserAgent URI Combo
status: test
level: high
description: Detects user agent and URI paths used by empire agents
author: Florian Roth (Nextron Systems)
date: '2020-07-13'
modified: '2024-02-26'
tags:
    - attack.defense-evasion
    - attack.command-and-control
    - attack.t1071.001
references:
    - https://github.com/BC-SECURITY/Empire
falsepositives:
    - Valid requests with this exact user agent to server scripts of the defined names
taxonomy: sigma
logsource:
    category: proxy
detection:
    selection:
        c-useragent: Mozilla/5.0 (Windows NT 6.1; WOW64; Trident/7.0; rv:11.0) like
            Gecko
        cs-uri:
            - /admin/get.php
            - /news.php
            - /login/process.php
        cs-method: POST
    condition: selection
ocsf_mapping:
    class_name: http_activity
    activity_id: UNMAPPED
    logsource:
        category:
            source_field: category
            source_value: proxy
            mapped_at: '2025-11-26T02:14:22.382577+00:00'
    detection_fields:
        -   source_field: c-useragent
            target_table: http_activity
            target_field: http_request.user_agent
            mapped_at: '2025-11-26T02:14:22.382602+00:00'
        -   source_field: cs-uri
            target_table: http_activity
            target_field: http_request.url
            mapped_at: '2025-11-26T02:14:22.382605+00:00'
        -   source_field: cs-method
            target_table: http_activity
            target_field: http_request.http_method
            mapped_at: '2025-11-26T02:14:22.382607+00:00'
