id: 7195a772-4b3f-43a4-a210-6a003d65caa1
title: Suspicious User Agent
status: test
level: high
description: Detects suspicious malformed user agent strings in proxy logs
author: Florian Roth (Nextron Systems)
date: '2017-07-08'
modified: '2022-10-31'
tags:
    - attack.command-and-control
    - attack.t1071.001
references:
    - https://github.com/fastly/waf_testbed/blob/8bfc406551f3045e418cbaad7596cff8da331dfc/templates/default/scanners-user-agents.data.erb
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: proxy
detection:
    selection1:
        c-useragent|startswith:
            - user-agent
            - 'Mozilla/3.0 '
            - 'Mozilla/2.0 '
            - 'Mozilla/1.0 '
            - 'Mozilla '
            - ' Mozilla/'
            - Mozila/
            - Mozilla/4.0 (compatible; MSIE 6.0; MS Web Services Client Protocol
    selection2:
        c-useragent|contains:
            - ' (compatible;MSIE '
            - '.0;Windows NT '
            - loader
    selection3:
        c-useragent:
            - _
            - CertUtil URL Agent
            - Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:60.0)
            - Mozilla/5.0 (Windows NT 6.3; WOW64; rv:28.0) Gecko/20100101 Firefox/28.0
            - HTTPS
            - Erbium-UA-4ce7c27cb4be9d32e333bf032c88235a
            - x
            - xxx
    falsepositives:
        c-useragent: Mozilla/3.0 * Acrobat *
        cs-host|endswith:
            - .acrobat.com
            - .adobe.com
            - .adobe.io
    condition: 1 of selection* and not falsepositives
ocsf_mapping:
    class_name: http_activity
    activity_id: UNMAPPED
    logsource:
        category:
            source_field: category
            source_value: proxy
            mapped_at: '2025-11-26T02:13:58.686003+00:00'
    detection_fields:
        -   source_field: c-useragent
            target_table: http_activity
            target_field: http_request.user_agent
            mapped_at: '2025-11-26T02:13:58.686015+00:00'
        -   source_field: cs-host
            target_table: http_activity
            target_field: dst_endpoint.hostname
            mapped_at: '2025-11-26T02:13:58.686017+00:00'
