title: Windows WebDAV User Agent
id: e09aed7a-09e0-4c9a-90dd-f0d52507347e
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects WebDav DownloadCradle
references:
    - https://mgreen27.github.io/posts/2018/04/02/DownloadCradle.html
falsepositives:
    - Administrative scripts that download files from the Internet
    - Administrative scripts that retrieve certain website contents
    - Legitimate WebDAV administration
tags:
    - attack.command-and-control
    - attack.t1071.001
date: '2018-04-06'
modified: '2021-11-27'
logsource:
    category: proxy
detection:
    selection:
        c-useragent|startswith: Microsoft-WebDAV-MiniRedir/
        cs-method: GET
    condition: selection
ocsf_mapping:
    class_name: http_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: proxy
            mapped_at: '2025-12-04T01:34:53.154109+00:00'
    detection_fields:
        -   source_field: c-useragent
            target_table: http_activity
            target_field: http_request.user_agent
            mapped_at: '2025-12-04T01:34:53.154125+00:00'
        -   source_field: cs-method
            target_table: http_activity
            target_field: http_request.http_method
            mapped_at: '2025-12-04T01:34:53.154127+00:00'
