title: Bitsadmin to Uncommon IP Server Address
id: 8ccd35a2-1c7c-468b-b568-ac6cdf80eec3
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects Bitsadmin connections to IP addresses instead of FQDN names
references:
    - https://isc.sans.edu/diary/Microsoft+BITS+Used+to+Download+Payloads/21027
falsepositives:
    - Unknown
tags:
    - attack.command-and-control
    - attack.t1071.001
    - attack.defense-evasion
    - attack.persistence
    - attack.t1197
    - attack.s0190
date: '2022-06-10'
modified: '2022-08-24'
logsource:
    category: proxy
detection:
    selection:
        c-useragent|startswith: Microsoft BITS/
        cs-host|endswith:
            - '1'
            - '2'
            - '3'
            - '4'
            - '5'
            - '6'
            - '7'
            - '8'
            - '9'
    condition: selection
ocsf_mapping:
    class_name: http_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: proxy
            mapped_at: '2025-12-04T01:34:46.693663+00:00'
    detection_fields:
        -   source_field: c-useragent
            target_table: http_activity
            target_field: http_request.user_agent
            mapped_at: '2025-12-04T01:34:46.693676+00:00'
        -   source_field: cs-host
            target_table: http_activity
            target_field: dst_endpoint.hostname
            mapped_at: '2025-12-04T01:34:46.693678+00:00'
