title: Windows PowerShell User Agent
id: c8557060-9221-4448-8794-96320e6f3e74
status: test
level: medium
author: Florian Roth (Nextron Systems)
description: Detects Windows PowerShell Web Access
references:
    - https://msdn.microsoft.com/powershell/reference/5.1/microsoft.powershell.utility/Invoke-WebRequest
falsepositives:
    - Administrative scripts that download files from the Internet
    - Administrative scripts that retrieve certain website contents
tags:
    - attack.defense-evasion
    - attack.command-and-control
    - attack.t1071.001
date: '2017-03-13'
modified: '2021-11-27'
logsource:
    category: proxy
detection:
    selection:
        c-useragent|contains: ' WindowsPowerShell/'
    condition: selection
ocsf_mapping:
    class_name: http_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: proxy
            mapped_at: '2025-12-04T01:35:00.324395+00:00'
    detection_fields:
        -   source_field: c-useragent
            target_table: http_activity
            target_field: http_request.user_agent
            mapped_at: '2025-12-04T01:35:00.324415+00:00'
