title: HTTP Request With Empty User Agent
id: 21e44d78-95e7-421b-a464-ffd8395659c4
status: test
level: medium
author: Florian Roth (Nextron Systems)
description: 'Detects a potentially suspicious empty user agent strings in proxy log.

    Could potentially indicate an uncommon request method.

    '
references:
    - https://twitter.com/Carlos_Perez/status/883455096645931008
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.command-and-control
    - attack.t1071.001
date: '2017-07-08'
modified: '2021-11-27'
logsource:
    category: proxy
detection:
    selection:
        c-useragent: ''
    condition: selection
ocsf_mapping:
    class_name: http_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: proxy
            mapped_at: '2025-12-04T01:34:45.547586+00:00'
    detection_fields:
        -   source_field: c-useragent
            target_table: http_activity
            target_field: http_request.user_agent
            mapped_at: '2025-12-04T01:34:45.549572+00:00'
