id: 53330955-dc52-487f-a3a2-da24dcff99b5
title: New BgInfo.EXE Custom DB Path Registry Configuration
status: test
level: medium
description: Detects setting of a new registry database value related to BgInfo configuration.
    Attackers can for example set this value to save the results of the commands executed
    by BgInfo in order to exfiltrate information.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-08-16'
tags:
    - attack.defense-evasion
    - attack.t1112
references:
    - Internal Research
falsepositives:
    - Legitimate use of external DB to save the results
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        EventType: SetValue
        TargetObject|endswith: \Software\Winternals\BGInfo\Database
    condition: selection
ocsf_mapping:
    class_name: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: EventType
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
