title: Potential Provisioning Registry Key Abuse For Binary Proxy Execution - REG
id: 7021255e-5db3-4946-a8b9-0ba7a4644a69
status: test
level: high
author: Swachchhanda Shrawan Poudel
description: Detects potential abuse of the provisioning registry key for indirect
    command execution through "Provlaunch.exe".
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Provlaunch/
    - https://twitter.com/0gtweet/status/1674399582162153472
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1218
date: '2023-08-02'
modified: '2023-08-17'
logsource:
    category: registry_set
    product: windows
    definition: 'Requirements: The registry key "\SOFTWARE\Microsoft\Provisioning\Commands\"
        and its subkey must be monitored'
detection:
    selection:
        TargetObject|contains: \SOFTWARE\Microsoft\Provisioning\Commands\
    condition: selection
related:
    -   id: 7f5d1c9a-3e83-48df-95a7-2b98aae6c13c
        type: similar
    -   id: f9999590-1f94-4a34-a91e-951e47bedefd
        type: similar
    -   id: 2a4b3e61-9d22-4e4a-b60f-6e8f0cde6f25
        type: similar
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
