id: 4a5f5a5e-ac01-474b-9b4e-d61298c9df1d
title: PowerShell as a Service in Registry
status: test
level: high
description: Detects that a powershell code is written to the registry as a service.
author: oscd.community, Natalia Shornikova
date: '2020-10-06'
modified: '2023-08-17'
tags:
    - attack.execution
    - attack.t1569.002
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: \Services\
        TargetObject|endswith: \ImagePath
        Details|contains:
            - powershell
            - pwsh
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
