id: 9ace0707-b560-49b8-b6ca-5148b42f39fb
title: Potential Persistence Via Logon Scripts - Registry
status: test
level: medium
description: Detects creation of "UserInitMprLogonScript" registry value which can
    be used as a persistence method by malicious actors
author: Tom Ueltschi (@c_APT_ure)
date: '2019-01-12'
modified: '2023-06-09'
tags:
    - attack.t1037.001
    - attack.persistence
    - attack.lateral-movement
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1037.001/T1037.001.md
falsepositives:
    - Investigate the contents of the "UserInitMprLogonScript" value to determine
        of the added script is legitimate
taxonomy: sigma
logsource:
    category: registry_add
    product: windows
detection:
    selection:
        EventType: CreateKey
        TargetObject|contains: UserInitMprLogonScript
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_add
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: EventType
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
