id: f7f9ab88-7557-4a69-b30e-0a8f91b3a0e7
title: Registry Entries For Azorult Malware
status: test
level: critical
description: Detects the presence of a registry key created during Azorult execution
author: Trent Liffick
date: '2020-05-08'
modified: '2021-11-27'
tags:
    - attack.execution
    - attack.t1112
references:
    - https://www.trendmicro.com/vinfo/us/threat-encyclopedia/malware/trojan.win32.azoruit.a
fields:
    - Image
    - TargetObject
    - TargetDetails
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: registry_event
    product: windows
detection:
    selection:
        EventID:
            - 12
            - 13
        TargetObject|contains: SYSTEM\
        TargetObject|endswith: \services\localNETService
    condition: selection
ocsf_mapping:
    class_name: null
    logsource:
        category:
            source_field: category
            source_value: registry_event
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
