id: 62120148-6b7a-42be-8b91-271c04e281a3
title: Suspicious Camera and Microphone Access
status: test
level: high
description: Detects Processes accessing the camera and microphone from suspicious
    folder
author: Den Iuzvyk
date: '2020-06-07'
modified: '2022-10-09'
tags:
    - attack.collection
    - attack.t1125
    - attack.t1123
references:
    - https://medium.com/@7a616368/can-you-track-processes-accessing-the-camera-and-microphone-7e6885b37072
falsepositives:
    - Unlikely, there could be conferencing software running from a Temp folder accessing
        the devices
taxonomy: sigma
logsource:
    category: registry_event
    product: windows
detection:
    selection_1:
        TargetObject|contains|all:
            - \Software\Microsoft\Windows\CurrentVersion\CapabilityAccessManager\ConsentStore\
            - \NonPackaged
    selection_2:
        TargetObject|contains:
            - microphone
            - webcam
    selection_3:
        TargetObject|contains:
            - :#Windows#Temp#
            - :#$Recycle.bin#
            - :#Temp#
            - :#Users#Public#
            - :#Users#Default#
            - :#Users#Desktop#
    condition: all of selection_*
ocsf_mapping:
    class_name: null
    logsource:
        category:
            source_field: category
            source_value: registry_event
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
