title: PUA - Sysinternals Tools Execution - Registry
id: c7da8edc-49ae-45a2-9e61-9fd860e4e73d
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects the execution of some potentially unwanted tools such as PsExec,
    Procdump, etc. (part of the Sysinternals suite) via the creation of the "accepteula"
    registry key.
references:
    - https://twitter.com/Moti_B/status/1008587936735035392
falsepositives:
    - Legitimate use of SysInternals tools. Filter the legitimate paths used in your
        environment
tags:
    - attack.resource-development
    - attack.t1588.002
date: '2022-08-24'
modified: '2023-02-07'
logsource:
    category: registry_add
    product: windows
detection:
    selection:
        EventType: CreateKey
        TargetObject|contains:
            - \Active Directory Explorer
            - \Handle
            - \LiveKd
            - \Process Explorer
            - \ProcDump
            - \PsExec
            - \PsLoglist
            - \PsPasswd
            - \SDelete
            - \Sysinternals
        TargetObject|endswith: \EulaAccepted
    condition: selection
related:
    -   id: 25ffa65d-76d8-4da5-a832-3f2b0136e133
        type: derived
    -   id: 9841b233-8df8-4ad7-9133-b0b4402a9014
        type: obsolete
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_add
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: EventType
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
