title: Potential Persistence Via TypedPaths
id: 086ae989-9ca6-4fe7-895a-759c5544f247
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects modification addition to the 'TypedPaths' key in the user or
    admin registry from a non standard application. Which might indicate persistence
    attempt
references:
    - https://twitter.com/dez_/status/1560101453150257154
    - https://forensafe.com/blogs/typedpaths.html
falsepositives:
    - Unlikely
tags:
    - attack.persistence
date: '2022-08-22'
modified: '2023-08-17'
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: \Software\Microsoft\Windows\CurrentVersion\Explorer\TypedPaths\
    filter:
        Image:
            - C:\Windows\explorer.exe
            - C:\Windows\SysWOW64\explorer.exe
    condition: selection and not filter
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
