id: 28036918-04d3-423d-91c0-55ecf99fb892
title: NET NGenAssemblyUsageLog Registry Key Tamper
status: test
level: high
description: 'Detects changes to the NGenAssemblyUsageLog registry key.

    .NET Usage Log output location can be controlled by setting the NGenAssemblyUsageLog
    CLR configuration knob in the Registry or by configuring an environment variable
    (as described in the next section).

    By simplify specifying an arbitrary value (e.g. fake output location or junk data)
    for the expected value, a Usage Log file for the .NET execution context will not
    be created.

    '
author: frack113
date: '2022-11-18'
modified: '2023-08-17'
tags:
    - attack.defense-evasion
    - attack.t1112
references:
    - https://bohops.com/2021/03/16/investigating-net-clr-usage-log-tampering-techniques-for-edr-evasion/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|endswith: SOFTWARE\Microsoft\.NETFramework\NGenAssemblyUsageLog
    condition: selection
ocsf_mapping:
    class_name: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
