id: 92b0b372-a939-44ed-a11b-5136cf680e27
title: Blue Mockingbird - Registry
status: test
level: high
description: Attempts to detect system changes made by Blue Mockingbird
author: Trent Liffick (@tliffick)
date: '2020-05-14'
modified: '2023-08-17'
tags:
    - attack.execution
    - attack.t1112
    - attack.t1047
references:
    - https://redcanary.com/blog/blue-mockingbird-cryptominer/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''c3198a27-23a0-4c2c-af19-e5328d49680e''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|endswith: \CurrentControlSet\Services\wercplsupport\Parameters\ServiceDll
    condition: selection
ocsf_mapping:
    class_name: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
