id: fc014922-5def-4da9-a0fc-28c973f41bfb
title: Execution DLL of Choice Using WAB.EXE
status: test
level: high
description: This rule detects that the path to the DLL written in the registry is
    different from the default one. Launched WAB.exe tries to load the DLL from Registry.
author: oscd.community, Natalia Shornikova
date: '2020-10-13'
modified: '2023-08-17'
tags:
    - attack.defense-evasion
    - attack.t1218
references:
    - https://github.com/LOLBAS-Project/LOLBAS/blob/8283d8d91552213ded165fd36deb6cb9534cb443/yml/OSBinaries/Wab.yml
    - https://twitter.com/Hexacorn/status/991447379864932352
    - http://www.hexacorn.com/blog/2018/05/01/wab-exe-as-a-lolbin/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|endswith: \Software\Microsoft\WAB\DLLPath
    filter:
        Details: '%CommonProgramFiles%\System\wab32.dll'
    condition: selection and not filter
ocsf_mapping:
    class_name: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
