id: 0cb8d736-995d-4ce7-a31e-1e8d452a1459
title: Potential EventLog File Location Tampering
status: test
level: high
description: Detects tampering with EventLog service "file" key. In order to change
    the default location of an Evtx file. This technique is used to tamper with log
    collection and alerting
author: D3F7A5105
date: '2023-01-02'
modified: '2023-08-17'
tags:
    - attack.defense-evasion
    - attack.t1562.002
references:
    - https://learn.microsoft.com/en-us/windows/win32/eventlog/eventlog-key
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: \SYSTEM\CurrentControlSet\Services\EventLog\
        TargetObject|endswith: \File
    filter:
        Details|contains: \System32\Winevt\Logs\
    condition: selection and not filter
ocsf_mapping:
    class_name: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
