id: ab567429-1dfb-4674-b6d2-979fd2f9d125
title: Internet Explorer DisableFirstRunCustomize Enabled
status: test
level: medium
description: 'Detects changes to the Internet Explorer "DisableFirstRunCustomize"
    value, which prevents Internet Explorer from running the first run wizard the
    first time a user starts the browser after installing Internet Explorer or Windows.

    '
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-05-16'
modified: '2023-08-17'
tags:
    - attack.defense-evasion
references:
    - https://www.ncsc.gov.uk/static-assets/documents/malware-analysis-reports/devil-bait/NCSC-MAR-Devil-Bait.pdf
    - https://unit42.paloaltonetworks.com/operation-ke3chang-resurfaces-with-new-tidepool-malware/
    - https://admx.help/?Category=InternetExplorer&Policy=Microsoft.Policies.InternetExplorer::NoFirstRunCustomise
falsepositives:
    - As this is controlled by group policy as well as user settings. Some false positives
        may occur.
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|endswith: \Microsoft\Internet Explorer\Main\DisableFirstRunCustomize
        Details:
            - DWORD (0x00000001)
            - DWORD (0x00000002)
    filter_main_generic:
        Image:
            - C:\Windows\explorer.exe
            - C:\Windows\System32\ie4uinit.exe
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: '2025-11-13T20:22:05.926252+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:22:05.926252+00:00'
    detection_fields:
        -   source_field: TargetObject
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:22:05.926260+00:00'
        -   source_field: Details
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:22:05.926261+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:22:05.926263+00:00'
