title: Windows Registry Trust Record Modification
id: 295a59c1-7b79-4b47-a930-df12c15fc9c2
status: test
level: medium
author: Antonlovesdnb, Trent Liffick (@tliffick)
description: Alerts on trust record modification within the registry, indicating usage
    of macros
references:
    - https://outflank.nl/blog/2018/01/16/hunting-for-evil-detect-macros-being-executed/
    - http://az4n6.blogspot.com/2016/02/more-on-trust-records-macros-and.html
    - https://twitter.com/inversecos/status/1494174785621819397
falsepositives:
    - This will alert on legitimate macro usage as well, additional tuning is required
tags:
    - attack.initial-access
    - attack.t1566.001
date: '2020-02-19'
modified: '2023-06-21'
logsource:
    category: registry_event
    product: windows
detection:
    selection:
        TargetObject|contains: \Security\Trusted Documents\TrustRecords
    condition: selection
related:
    -   id: a166f74e-bf44-409d-b9ba-ea4b2dd8b3cd
        type: similar
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_event
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
