id: e7b18879-676e-4a0e-ae18-27039185a8e7
title: New Netsh Helper DLL Registered From A Suspicious Location
status: test
level: high
description: 'Detects changes to the Netsh registry key to add a new DLL value that
    is located on a suspicious location. This change might be an indication of a potential
    persistence attempt by adding a malicious Netsh helper

    '
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-11-28'
tags:
    - attack.persistence
    - attack.t1546.007
references:
    - https://www.ired.team/offensive-security/persistence/t1128-netsh-helper-dll
    - https://pentestlab.blog/2019/10/29/persistence-netsh-helper-dll/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''56321594-9087-49d9-bf10-524fe8479452''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''c90362e0-2df3-4e61-94fe-b37615814cb1''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection_target:
        TargetObject|contains: \SOFTWARE\Microsoft\NetSh
    selection_folders_1:
        Details|contains:
            - :\Perflogs\
            - :\Users\Public\
            - :\Windows\Temp\
            - \AppData\Local\Temp\
            - \Temporary Internet
    selection_folders_2:
        Details|contains|all:
            - :\Users\
            - \Favorites\
            - :\Users\
            - \Favourites\
            - :\Users\
            - \Contacts\
            - :\Users\
            - \Pictures\
    condition: selection_target and 1 of selection_folders_*
ocsf_mapping:
    class_name: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
