title: Suspicious Powershell In Registry Run Keys
id: 8d85cf08-bf97-4260-ba49-986a2a65129c
status: test
level: medium
author: frack113, Florian Roth (Nextron Systems)
description: Detects potential PowerShell commands or code within registry run keys
references:
    - https://github.com/frack113/atomic-red-team/blob/a9051c38de8a5320b31c7039efcbd3b56cf2d65a/atomics/T1547.001/T1547.001.md#atomic-test-9---systembc-malware-as-a-service-registry
    - https://www.trendmicro.com/en_us/research/22/j/lv-ransomware-exploits-proxyshell-in-attack.html
falsepositives:
    - Legitimate admin or third party scripts. Baseline according to your environment
tags:
    - attack.persistence
    - attack.t1547.001
date: '2022-03-17'
modified: '2023-08-17'
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: \Software\Microsoft\Windows\CurrentVersion\Run
        Details|contains:
            - powershell
            - 'pwsh '
            - FromBase64String
            - .DownloadFile(
            - .DownloadString(
            - ' -w hidden '
            - ' -w 1 '
            - -windowstyle hidden
            - -window hidden
            - ' -nop '
            - ' -encodedcommand '
            - -ExecutionPolicy Bypass
            - Invoke-Expression
            - IEX (
            - Invoke-Command
            - ICM -
            - Invoke-WebRequest
            - 'IWR '
            - ' -noni '
            - ' -noninteractive '
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
