title: Potential Credential Dumping Attempt Using New NetworkProvider - REG
id: 0442defa-b4a2-41c9-ae2c-ea7042fc4701
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects when an attacker tries to add a new network provider in order
    to dump clear text credentials, similar to how the NPPSpy tool does it
references:
    - https://learn.microsoft.com/en-us/troubleshoot/windows-client/setup-upgrade-and-drivers/network-provider-settings-removed-in-place-upgrade
    - https://github.com/gtworek/PSBits/tree/master/PasswordStealing/NPPSpy
falsepositives:
    - Other legitimate network providers used and not filtred in this rule
tags:
    - attack.credential-access
    - attack.t1003
date: '2022-08-23'
modified: '2023-08-17'
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains|all:
            - \System\CurrentControlSet\Services\
            - \NetworkProvider
    filter:
        TargetObject|contains:
            - \System\CurrentControlSet\Services\WebClient\NetworkProvider
            - \System\CurrentControlSet\Services\LanmanWorkstation\NetworkProvider
            - \System\CurrentControlSet\Services\RDPNP\NetworkProvider
    filter_valid_procs:
        Image: C:\Windows\System32\poqexec.exe
    condition: selection and not 1 of filter*
related:
    -   id: baef1ec6-2ca9-47a3-97cc-4cf2bda10b77
        type: similar
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
