title: Change Winevt Channel Access Permission Via Registry
id: 7d9263bd-dc47-4a58-bc92-5474abab390c
status: experimental
level: high
author: frack113
description: Detects tampering with the "ChannelAccess" registry key in order to change
    access to Windows event channel.
references:
    - https://app.any.run/tasks/77b2e328-8f36-46b2-b2e2-8a80398217ab/
    - https://learn.microsoft.com/en-us/windows/win32/api/winevt/
    - https://itconnect.uw.edu/tools-services-support/it-systems-infrastructure/msinf/other-help/understanding-sddl-syntax/
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1562.002
date: '2022-09-17'
modified: '2024-03-25'
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: \Microsoft\Windows\CurrentVersion\WINEVT\Channels\
        TargetObject|endswith: \ChannelAccess
        Details|contains:
            - (A;;0x1;;;LA)
            - (A;;0x1;;;SY)
            - (A;;0x5;;;BA)
    filter_main_trustedinstaller:
        Image: C:\Windows\servicing\TrustedInstaller.exe
    filter_main_tiworker:
        Image|startswith: C:\Windows\WinSxS\
        Image|endswith: \TiWorker.exe
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
