id: 9827ae57-3802-418f-994b-d5ecf5cd974b
title: Potential Registry Persistence Attempt Via DbgManagedDebugger
status: test
level: medium
description: Detects the addition of the "Debugger" value to the "DbgManagedDebugger"
    key in order to achieve persistence. Which will get invoked when an application
    crashes
author: frack113
date: '2022-08-07'
modified: '2023-08-17'
tags:
    - attack.persistence
    - attack.t1574
references:
    - https://www.hexacorn.com/blog/2013/09/19/beyond-good-ol-run-key-part-4/
    - https://github.com/last-byte/PersistenceSniper
falsepositives:
    - Legitimate use of the key to setup a debugger. Which is often the case on developers
        machines
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|endswith: \Microsoft\.NETFramework\DbgManagedDebugger
    filter:
        Details: '"C:\Windows\system32\vsjitdebugger.exe" PID %d APPDOM %d EXTEXT
            "%s" EVTHDL %d'
    condition: selection and not filter
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
