title: Macro Enabled In A Potentially Suspicious Document
id: a166f74e-bf44-409d-b9ba-ea4b2dd8b3cd
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects registry changes to Office trust records where the path is located
    in a potentially suspicious location
references:
    - https://twitter.com/inversecos/status/1494174785621819397
    - Internal Research
falsepositives:
    - Unlikely
tags:
    - attack.defense-evasion
    - attack.t1112
date: '2023-06-21'
modified: '2023-08-17'
logsource:
    category: registry_set
    product: windows
detection:
    selection_value:
        TargetObject|contains: \Security\Trusted Documents\TrustRecords
    selection_paths:
        TargetObject|contains:
            - /AppData/Local/Microsoft/Windows/INetCache/
            - /AppData/Local/Temp/
            - /PerfLogs/
            - C:/Users/Public/
            - file:///D:/
            - file:///E:/
    condition: all of selection_*
related:
    -   id: 295a59c1-7b79-4b47-a930-df12c15fc9c2
        type: derived
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
