id: 91239011-fe3c-4b54-9f24-15c86bb65913
title: Office Macros Warning Disabled
status: test
level: high
description: Detects registry changes to Microsoft Office "VBAWarning" to a value
    of "1" which enables the execution of all macros, whether signed or unsigned.
author: Trent Liffick (@tliffick), Nasreddine Bencherchali (Nextron Systems)
date: '2020-05-22'
modified: '2024-03-19'
tags:
    - attack.defense-evasion
    - attack.t1112
references:
    - https://twitter.com/inversecos/status/1494174785621819397
    - https://www.mcafee.com/blogs/other-blogs/mcafee-labs/zloader-with-a-new-infection-technique/
    - https://securelist.com/scarcruft-surveilling-north-korean-defectors-and-human-rights-activists/105074/
falsepositives:
    - Unlikely
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''a166f74e-bf44-409d-b9ba-ea4b2dd8b3cd''),
    type=<SigmaRelatedType.OBSOLETE: 4>)])'
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|endswith: \Security\VBAWarnings
        Details: DWORD (0x00000001)
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
