title: ETW Logging Disabled For rpcrt4.dll
id: 90f342e1-1aaa-4e43-b092-39fda57ed11e
status: test
level: low
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects changes to the "ExtErrorInformation" key in order to disable
    ETW logging for rpcrt4.dll
references:
    - http://redplait.blogspot.com/2020/07/whats-wrong-with-etw.html
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1112
    - attack.t1562
date: '2022-12-09'
modified: '2023-08-17'
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|endswith: \Microsoft\Windows NT\Rpc\ExtErrorInformation
        Details:
            - DWORD (0x00000000)
            - DWORD (0x00000002)
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
