id: 75180c5f-4ea1-461a-a4f6-6e4700c065d4
title: Windows Recall Feature Enabled - Registry
status: experimental
level: medium
description: 'Detects the enabling of the Windows Recall feature via registry manipulation.
    Windows Recall can be enabled by setting the value of "DisableAIDataAnalysis"
    to "0".

    Adversaries may enable Windows Recall as part of post-exploitation discovery and
    collection activities.

    This rule assumes that Recall is already explicitly disabled on the host, and
    subsequently enabled by the adversary.

    '
author: Sajid Nawaz Khan
date: '2024-06-02'
tags:
    - attack.collection
    - attack.t1113
references:
    - https://learn.microsoft.com/en-us/windows/client-management/manage-recall
    - https://learn.microsoft.com/en-us/windows/client-management/mdm/policy-csp-windowsai#disableaidataanalysis
falsepositives:
    - Legitimate use/activation of Windows Recall
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''5dfc1465-8f65-4fde-8eb5-6194380c6a62''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''817f252c-5143-4dae-b418-48c3e9f63728''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|endswith: \Software\Policies\Microsoft\Windows\WindowsAI\DisableAIDataAnalysis
        Details: DWORD (0x00000000)
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
