id: a1b1fd53-9c4a-444c-bae0-34a330fc7aa8
title: Potential Persistence Via DLLPathOverride
status: test
level: high
description: Detects when an attacker adds a new "DLLPathOverride" value to the "Natural
    Language" key in order to achieve persistence which will get invoked by "SearchIndexer.exe"
    process
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-07-21'
modified: '2023-08-17'
tags:
    - attack.persistence
references:
    - https://persistence-info.github.io/Data/naturallanguage6.html
    - https://www.hexacorn.com/blog/2018/12/30/beyond-good-ol-run-key-part-98/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection_root:
        TargetObject|contains: \SYSTEM\CurrentControlSet\Control\ContentIndex\Language\
    selection_values:
        TargetObject|contains:
            - \StemmerDLLPathOverride
            - \WBDLLPathOverride
            - \StemmerClass
            - \WBreakerClass
    condition: all of selection_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
