title: Potential COM Object Hijacking Via TreatAs Subkey - Registry
id: 9b0f8a61-91b2-464f-aceb-0527e0a45020
status: test
level: medium
author: Kutepov Anton, oscd.community
description: Detects COM object hijacking via TreatAs subkey
references:
    - https://bohops.com/2018/08/18/abusing-the-com-registry-structure-part-2-loading-techniques-for-evasion-and-persistence/
falsepositives:
    - Maybe some system utilities in rare cases use linking keys for backward compatibility
tags:
    - attack.persistence
    - attack.t1546.015
date: '2019-10-23'
modified: '2023-02-07'
logsource:
    category: registry_add
    product: windows
detection:
    selection:
        EventType: CreateKey
        TargetObject|contains|all:
            - HKU\
            - Classes\CLSID\
            - \TreatAs
    filter_svchost:
        Image: C:\WINDOWS\system32\svchost.exe
    condition: selection and not 1 of filter_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_add
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: EventType
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
