id: 67a6c006-3fbe-46a7-9074-2ba3b82c3000
title: Path To Screensaver Binary Modified
status: test
level: medium
description: Detects value modification of registry key containing path to binary
    used as screensaver.
author: Bartlomiej Czyz @bczyz1, oscd.community
date: '2020-10-11'
modified: '2021-11-27'
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1546.002
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.002/T1546.002.md
    - https://www.welivesecurity.com/wp-content/uploads/2017/08/eset-gazer.pdf
falsepositives:
    - Legitimate modification of screensaver
taxonomy: sigma
logsource:
    category: registry_event
    product: windows
detection:
    selection:
        TargetObject|endswith: \Control Panel\Desktop\SCRNSAVE.EXE
    filter:
        Image|endswith:
            - \rundll32.exe
            - \explorer.exe
    condition: selection and not filter
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_event
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
