title: Driver Added To Disallowed Images In HVCI - Registry
id: 555155a2-03bf-4fe7-af74-d176b3fdbe16
status: experimental
level: high
author: Nasreddine Bencherchali (Nextron Systems), Omar Khaled (@beacon_exe)
description: 'Detects changes to the "HVCIDisallowedImages" registry value to potentially
    add a driver to the list, in order to prevent it from loading.

    '
references:
    - https://github.com/yardenshafir/conference_talks/blob/3de1f5d7c02656c35117f067fbff0a219c304b09/OffensiveCon_2023_Your_Mitigations_are_My_Opportunities.pdf
    - https://x.com/yarden_shafir/status/1822667605175324787
falsepositives:
    - Legitimate usage of this key would also trigger this. Investigate the driver
        being added and make sure its intended
tags:
    - attack.defense-evasion
date: '2023-12-05'
modified: '2024-08-21'
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains|all:
            - \Control\CI\
            - \HVCIDisallowedImages
    condition: selection
related:
    -   id: 44cee399-f6b1-45cc-a87c-ea14c6064d6b
        type: similar
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
