id: c74d7efc-8826-45d9-b8bb-f04fac9e4eff
title: Run Once Task Configuration in Registry
status: test
level: medium
description: Rule to detect the configuration of Run Once registry key. Configured
    payload can be run by runonce.exe /AlternateShellStartup
author: Avneet Singh @v3t0_, oscd.community
date: '2020-11-15'
modified: '2024-03-25'
tags:
    - attack.defense-evasion
    - attack.t1112
references:
    - https://twitter.com/pabraeken/status/990717080805789697
    - https://lolbas-project.github.io/lolbas/Binaries/Runonce/
falsepositives:
    - Legitimate modification of the registry key by legitimate program
taxonomy: sigma
logsource:
    category: registry_event
    product: windows
detection:
    selection:
        TargetObject|contains: \Microsoft\Active Setup\Installed Components
        TargetObject|endswith: \StubPath
    filter_optional_chrome:
        Details|contains|all:
            - C:\Program Files\Google\Chrome\Application\
            - \Installer\chrmstp.exe" --configure-user-settings --verbose-logging
                --system-level
    filter_optional_edge:
        Details|contains:
            - C:\Program Files (x86)\Microsoft\Edge\Application\
            - C:\Program Files\Microsoft\Edge\Application\
        Details|endswith: \Installer\setup.exe" --configure-user-settings --verbose-logging
            --system-level --msedge --channel=stable
    condition: selection and not 1 of filter_optional_*
ocsf_mapping:
    class_name: null
    logsource:
        category:
            source_field: category
            source_value: registry_event
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
