id: 8b7273a4-ba5d-4d8a-b04f-11f2900d043a
title: Hypervisor Enforced Code Integrity Disabled
status: experimental
level: high
description: 'Detects changes to the HypervisorEnforcedCodeIntegrity registry key
    and the "Enabled" value being set to 0 in order to disable the Hypervisor Enforced
    Code Integrity feature. This allows an attacker to load unsigned and untrusted
    code to be run in the kernel

    '
author: Nasreddine Bencherchali (Nextron Systems), Anish Bogati
date: '2023-03-14'
modified: '2024-07-05'
tags:
    - attack.defense-evasion
    - attack.t1562.001
references:
    - https://www.welivesecurity.com/2023/03/01/blacklotus-uefi-bootkit-myth-confirmed/
    - https://github.com/redcanaryco/atomic-red-team/blob/04e487c1828d76df3e834621f4f893ea756d5232/atomics/T1562.001/T1562.001.md#atomic-test-43---disable-hypervisor-enforced-code-integrity-hvci
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|endswith:
            - \Microsoft\Windows\DeviceGuard\HypervisorEnforcedCodeIntegrity
            - \Control\DeviceGuard\HypervisorEnforcedCodeIntegrity
            - \Control\DeviceGuard\Scenarios\HypervisorEnforcedCodeIntegrity\Enabled
        Details: DWORD (0x00000000)
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
