id: ab871450-37dc-4a3a-997f-6662aa8ae0f1
title: Disable Macro Runtime Scan Scope
status: test
level: high
description: Detects tampering with the MacroRuntimeScanScope registry key to disable
    runtime scanning of enabled macros
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-10-25'
modified: '2023-08-17'
tags:
    - attack.defense-evasion
references:
    - https://www.microsoft.com/en-us/security/blog/2018/09/12/office-vba-amsi-parting-the-veil-on-malicious-macros/
    - https://admx.help/?Category=Office2016&Policy=office16.Office.Microsoft.Policies.Windows::L_MacroRuntimeScanScope
    - https://github.com/S3cur3Th1sSh1t/OffensiveVBA/blob/28cc6a2802d8176195ac19b3c8e9a749009a82a3/src/AMSIbypasses.vba
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains|all:
            - \SOFTWARE\
            - \Microsoft\Office\
            - \Common\Security
        TargetObject|endswith: \MacroRuntimeScanScope
        Details: DWORD (0x00000000)
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
