title: Potential Persistence Via CHM Helper DLL
id: 976dd1f2-a484-45ec-aa1d-0e87e882262b
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects when an attacker modifies the registry key "HtmlHelp Author"
    to achieve persistence
references:
    - https://persistence-info.github.io/Data/htmlhelpauthor.html
    - https://www.hexacorn.com/blog/2018/04/22/beyond-good-ol-run-key-part-76/
falsepositives:
    - Unknown
tags:
    - attack.persistence
date: '2022-07-21'
modified: '2023-08-17'
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains:
            - \Software\Microsoft\HtmlHelp Author\Location
            - \Software\WOW6432Node\Microsoft\HtmlHelp Author\Location
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
