title: Creation of a Local Hidden User Account by Registry
id: 460479f3-80b7-42da-9c43-2cc1d54dbccd
status: test
level: high
author: Christian Burkard (Nextron Systems)
description: Sysmon registry detection of a local hidden user account.
references:
    - https://twitter.com/SBousseaden/status/1387530414185664538
falsepositives:
    - Unknown
tags:
    - attack.persistence
    - attack.t1136.001
date: '2021-05-03'
modified: '2022-08-05'
logsource:
    category: registry_event
    product: windows
detection:
    selection:
        TargetObject|contains: \SAM\SAM\Domains\Account\Users\Names\
        TargetObject|endswith: $
        Image|endswith: \lsass.exe
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_event
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
