id: 93d298a1-d28f-47f1-a468-d971e7796679
title: Disable Tamper Protection on Windows Defender
status: test
level: medium
description: Detects disabling Windows Defender Tamper Protection
author: Austin Songer @austinsonger
date: '2021-08-04'
modified: '2023-08-17'
tags:
    - attack.defense-evasion
    - attack.t1562.001
references:
    - https://www.tenforums.com/tutorials/123792-turn-off-tamper-protection-microsoft-defender-antivirus.html
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: \Microsoft\Windows Defender\Features\TamperProtection
        Details: DWORD (0x00000000)
    filter_msmpeng_client:
        Image|startswith: C:\ProgramData\Microsoft\Windows Defender\Platform\
        Image|endswith: \MsMpEng.exe
    filter_msmpeng_domain_controller:
        Image: C:\Program Files\Windows Defender\MsMpEng.exe
    condition: selection and not 1 of filter_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
