title: Antivirus Filter Driver Disallowed On Dev Drive - Registry
id: 31e124fb-5dc4-42a0-83b3-44a69c77b271
status: experimental
level: high
author: '@kostastsale, Nasreddine Bencherchali (Nextron Systems)'
description: 'Detects activity that indicates a user disabling the ability for Antivirus
    mini filter to inspect a "Dev Drive".

    '
references:
    - https://twitter.com/0gtweet/status/1720419490519752955
falsepositives:
    - Unlikely
tags:
    - attack.defense-evasion
    - attack.t1562.001
date: '2023-11-05'
modified: '2024-08-16'
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|endswith: \FilterManager\FltmgrDevDriveAllowAntivirusFilter
        Details: DWORD (0x00000000)
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
