title: Disable Security Events Logging Adding Reg Key MiniNt
id: 919f2ef0-be2d-4a7a-b635-eb2b41fde044
status: test
level: high
author: Ilyas Ochkov, oscd.community
description: Detects the addition of a key 'MiniNt' to the registry. Upon a reboot,
    Windows Event Log service will stopped write events.
references:
    - https://twitter.com/0gtweet/status/1182516740955226112
fields:
    - EventID
    - Image
    - TargetObject
    - NewName
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1562.001
    - attack.t1112
date: '2019-10-25'
modified: '2021-11-27'
logsource:
    category: registry_event
    product: windows
detection:
    selection:
        TargetObject: HKLM\SYSTEM\CurrentControlSet\Control\MiniNt
        EventType: CreateKey
        NewName: HKLM\SYSTEM\CurrentControlSet\Control\MiniNt
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_event
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: EventType
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: NewName
            target_table: null
            target_field: null
            mapped_at: null
