id: d4e2745c-f0c6-4bde-a3ab-b553b3f693cc
title: Persistence Via Disk Cleanup Handler - Autorun
status: test
level: medium
description: 'Detects when an attacker modifies values of the Disk Cleanup Handler
    in the registry to achieve persistence via autorun.

    The disk cleanup manager is part of the operating system.

    It displays the dialog box […] The user has the option of enabling or disabling
    individual handlers by selecting or clearing their check box in the disk cleanup
    manager''s UI.

    Although Windows comes with a number of disk cleanup handlers, they aren''t designed
    to handle files produced by other applications.

    Instead, the disk cleanup manager is designed to be flexible and extensible by
    enabling any developer to implement and register their own disk cleanup handler.

    Any developer can extend the available disk cleanup services by implementing and
    registering a disk cleanup handler.

    '
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-07-21'
modified: '2023-08-17'
tags:
    - attack.persistence
references:
    - https://persistence-info.github.io/Data/diskcleanuphandler.html
    - https://www.hexacorn.com/blog/2018/09/02/beyond-good-ol-run-key-part-86/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    root:
        TargetObject|contains: \SOFTWARE\Microsoft\Windows\CurrentVersion\Explorer\VolumeCaches\
    selection_autorun:
        TargetObject|contains: \Autorun
        Details: DWORD (0x00000001)
    selection_pre_after:
        TargetObject|contains:
            - \CleanupString
            - \PreCleanupString
        Details|contains:
            - cmd
            - powershell
            - rundll32
            - mshta
            - cscript
            - wscript
            - wsl
            - \Users\Public\
            - \Windows\TEMP\
            - \Microsoft\Windows\Start Menu\Programs\Startup\
    condition: root and 1 of selection_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
