id: 7f2954d2-99c2-4d42-a065-ca36740f187b
title: Hypervisor Enforced Paging Translation Disabled
status: experimental
level: high
description: 'Detects changes to the "DisableHypervisorEnforcedPagingTranslation"
    registry value. Where the it is set to "1" in order to disable the Hypervisor
    Enforced Paging Translation feature.

    '
author: Nasreddine Bencherchali (Nextron Systems)
date: '2024-07-05'
tags:
    - attack.defense-evasion
    - attack.t1562.001
references:
    - https://twitter.com/standa_t/status/1808868985678803222
    - https://github.com/AaLl86/WindowsInternals/blob/070dc4f317726dfb6ffd2b7a7c121a33a8659b5e/Slides/Hypervisor-enforced%20Paging%20Translation%20-%20The%20end%20of%20non%20data-driven%20Kernel%20Exploits%20(Recon2024).pdf
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|endswith: \DisableHypervisorEnforcedPagingTranslation
        Details: DWORD (0x00000001)
    condition: selection
ocsf_mapping:
    class_name: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
