id: 41f6531d-af6e-4c6e-918f-b946f2b85a36
title: Potential Persistence Via LSA Extensions
status: test
level: high
description: 'Detects when an attacker modifies the "REG_MULTI_SZ" value named "Extensions"
    to include a custom DLL to achieve persistence via lsass.

    The "Extensions" list contains filenames of DLLs being automatically loaded by
    lsass.exe. Each DLL has its InitializeLsaExtension() method called after loading.

    '
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-07-21'
modified: '2023-08-17'
tags:
    - attack.persistence
references:
    - https://persistence-info.github.io/Data/lsaaextension.html
    - https://twitter.com/0gtweet/status/1476286368385019906
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: \SYSTEM\CurrentControlSet\Control\LsaExtensionConfig\LsaSrv\Extensions
    condition: selection
ocsf_mapping:
    class_name: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
