id: 0c93308a-3f1b-40a9-b649-57ea1a1c1d63
title: Activate Suppression of Windows Security Center Notifications
status: test
level: medium
description: Detect set Notification_Suppress to 1 to disable the Windows security
    center notification
author: frack113
date: '2022-08-19'
modified: '2023-08-17'
tags:
    - attack.defense-evasion
    - attack.t1112
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1112/T1112.md
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|endswith: SOFTWARE\Policies\Microsoft\Windows Defender\UX Configuration\Notification_Suppress
        Details: DWORD (0x00000001)
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
