title: Wdigest CredGuard Registry Modification
id: 1a2d6c47-75b0-45bd-b133-2c0be75349fd
status: test
level: high
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
description: 'Detects potential malicious modification of the property value of IsCredGuardEnabled
    from

    HKLM:\SYSTEM\CurrentControlSet\Control\SecurityProviders\WDigest to disable Cred
    Guard on a system.

    This is usually used with UseLogonCredential to manipulate the caching credentials.

    '
references:
    - https://teamhydra.blog/2020/08/25/bypassing-credential-guard/
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1112
date: '2019-08-25'
modified: '2021-11-27'
logsource:
    category: registry_event
    product: windows
detection:
    selection:
        TargetObject|endswith: \IsCredGuardEnabled
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_event
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
