title: Outlook EnableUnsafeClientMailRules Setting Enabled - Registry
id: 6763c6c8-bd01-4687-bc8d-4fa52cf8ba08
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects an attacker trying to enable the outlook security setting "EnableUnsafeClientMailRules"
    which allows outlook to run applications or execute macros
references:
    - https://support.microsoft.com/en-us/topic/how-to-control-the-rule-actions-to-start-an-application-or-run-a-macro-in-outlook-2016-and-outlook-2013-e4964b72-173c-959d-5d7b-ead562979048
    - https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=44
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1112
date: '2023-02-08'
modified: '2023-08-17'
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|endswith: \Outlook\Security\EnableUnsafeClientMailRules
        Details: DWORD (0x00000001)
    condition: selection
related:
    -   id: c3cefdf4-6703-4e1c-bad8-bf422fc5015a
        type: similar
    -   id: 55f0a3a1-846e-40eb-8273-677371b8d912
        type: similar
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
