title: Hide Schedule Task Via Index Value Tamper
id: 5b16df71-8615-4f7f-ac9b-6c43c0509e61
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: 'Detects when the "index" value of a scheduled task is modified from
    the registry

    Which effectively hides it from any tooling such as "schtasks /query" (Read the
    referenced link for more information about the effects of this technique)

    '
references:
    - https://blog.qualys.com/vulnerabilities-threat-research/2022/06/20/defending-against-scheduled-task-attacks-in-windows-environments
falsepositives:
    - Unlikely
tags:
    - attack.defense-evasion
    - attack.t1562
date: '2022-08-26'
modified: '2023-08-17'
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains|all:
            - \SOFTWARE\Microsoft\Windows NT\CurrentVersion\Schedule\TaskCache\Tree\
            - Index
        Details: DWORD (0x00000000)
    condition: selection
related:
    -   id: acd74772-5f88-45c7-956b-6a7b36c294d2
        type: similar
    -   id: 526cc8bc-1cdc-48ad-8b26-f19bff969cec
        type: similar
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
