id: 9d15044a-7cfe-4d23-8085-6ebc11df7685
title: Potential Persistence Via Visual Studio Tools for Office
status: test
level: medium
description: Detects persistence via Visual Studio Tools for Office (VSTO) add-ins
    in Office applications.
author: Bhabesh Raj
date: '2021-01-10'
modified: '2023-08-28'
tags:
    - attack.t1137.006
    - attack.persistence
references:
    - https://twitter.com/_vivami/status/1347925307643355138
    - https://vanmieghem.io/stealth-outlook-persistence/
falsepositives:
    - Legitimate Addin Installation
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains:
            - \Software\Microsoft\Office\Outlook\Addins\
            - \Software\Microsoft\Office\Word\Addins\
            - \Software\Microsoft\Office\Excel\Addins\
            - \Software\Microsoft\Office\Powerpoint\Addins\
            - \Software\Microsoft\VSTO\Security\Inclusion\
    filter_image:
        Image|endswith:
            - \msiexec.exe
            - \regsvr32.exe
    filter_office:
        Image|endswith:
            - \excel.exe
            - \integrator.exe
            - \OfficeClickToRun.exe
            - \winword.exe
            - \visio.exe
    filter_teams:
        Image|endswith: \Teams.exe
    filter_avg:
        Image: C:\Program Files\AVG\Antivirus\RegSvr.exe
        TargetObject|contains: \Microsoft\Office\Outlook\Addins\Antivirus.AsOutExt\
    condition: selection and not 1 of filter_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: '2025-11-13T20:22:05.847833+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:22:05.847833+00:00'
    detection_fields:
        -   source_field: TargetObject
            target_table: process_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:22:05.847838+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:22:05.847840+00:00'
