id: e6fe26ee-d063-4f5b-b007-39e90aaf50e3
title: Potential Persistence Via AutodialDLL
status: test
level: high
description: Detects change the the "AutodialDLL" key which could be used as a persistence
    method to load custom DLL via the "ws2_32" library
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-08-10'
modified: '2023-08-17'
tags:
    - attack.persistence
references:
    - https://www.hexacorn.com/blog/2015/01/13/beyond-good-ol-run-key-part-24/
    - https://persistence-info.github.io/Data/autodialdll.html
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: \Services\WinSock2\Parameters\AutodialDLL
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
