id: 8218c875-90b9-42e2-b60d-0b0069816d10
title: PowerShell Script Execution Policy Enabled
status: test
level: low
description: Detects the enabling of the PowerShell script execution policy. Once
    enabled, this policy allows scripts to be executed.
author: Nasreddine Bencherchali (Nextron Systems), Thurein Oo
date: '2023-10-18'
tags:
    - attack.execution
references:
    - https://admx.help/?Category=Windows_10_2016&Policy=Microsoft.Policies.PowerShell::EnableScripts
falsepositives:
    - Likely
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''fad91067-08c5-4d1a-8d8c-d96a21b37814''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|endswith: \Policies\Microsoft\Windows\PowerShell\EnableScripts
        Details: DWORD (0x00000001)
    condition: selection
ocsf_mapping:
    class_name: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
