id: 9c226817-8dc9-46c2-a58d-66655aafd7dc
title: Modify User Shell Folders Startup Value
status: test
level: high
description: Detect modification of the startup key to a path where a payload could
    be stored to be launched during startup
author: frack113
date: '2022-10-01'
modified: '2023-08-17'
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1547.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/9e5b12c4912c07562aec7500447b11fa3e17e254/atomics/T1547.001/T1547.001.md
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: SOFTWARE\Microsoft\Windows\CurrentVersion\Explorer\User
            Shell Folders
        TargetObject|endswith: Startup
    condition: selection
ocsf_mapping:
    class_name: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
