id: 44a22d59-b175-4f13-8c16-cbaef5b581ff
title: New File Association Using Exefile
status: test
level: high
description: Detects the abuse of the exefile handler in new file association. Used
    for bypass of security products.
author: Andreas Hunkeler (@Karneades)
date: '2021-11-19'
modified: '2023-08-17'
tags:
    - attack.defense-evasion
references:
    - https://twitter.com/mrd0x/status/1461041276514623491
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: Classes\.
        Details: exefile
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
