title: Potential SentinelOne Shell Context Menu Scan Command Tampering
id: 6c304b02-06e6-402d-8be4-d5833cdf8198
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects potentially suspicious changes to the SentinelOne context menu
    scan command by a process other than SentinelOne.
references:
    - https://mrd0x.com/sentinelone-persistence-via-menu-context/
falsepositives:
    - Unknown
tags:
    - attack.persistence
date: '2024-03-06'
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: \shell\SentinelOneScan\command\
    filter_main_sentinelone_default_scan_binary:
        Details|startswith:
            - C:\Program Files\SentinelOne\Sentinel Agent
            - C:\Program Files (x86)\SentinelOne\Sentinel Agent
        Details|contains: \SentinelScanFromContextMenu.exe
    filter_main_sentinelone_binary:
        Image|endswith:
            - C:\Program Files\SentinelOne\
            - C:\Program Files (x86)\SentinelOne\
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
