id: 7530b96f-ad8e-431d-a04d-ac85cc461fdc
title: Custom File Open Handler Executes PowerShell
status: test
level: high
description: Detects the abuse of custom file open handler, executing powershell
author: CD_R0M_
date: '2022-06-11'
modified: '2023-08-17'
tags:
    - attack.defense-evasion
    - attack.t1202
references:
    - https://news.sophos.com/en-us/2022/02/01/solarmarker-campaign-used-novel-registry-changes-to-establish-persistence/?cmp=30728
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: shell\open\command\
        Details|contains|all:
            - powershell
            - -command
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
