title: Removal Of SD Value to Hide Schedule Task - Registry
id: acd74772-5f88-45c7-956b-6a7b36c294d2
status: test
level: medium
author: Sittikorn S
description: Remove SD (Security Descriptor) value in \Schedule\TaskCache\Tree registry
    hive to hide schedule task. This technique is used by Tarrask malware
references:
    - https://www.microsoft.com/security/blog/2022/04/12/tarrask-malware-uses-scheduled-tasks-for-defense-evasion/
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1562
date: '2022-04-15'
modified: '2023-02-08'
logsource:
    category: registry_delete
    product: windows
detection:
    selection:
        EventType: DeleteKey
        TargetObject|contains|all:
            - \SOFTWARE\Microsoft\Windows NT\CurrentVersion\Schedule\TaskCache\Tree\
            - SD
    condition: selection
related:
    -   id: 526cc8bc-1cdc-48ad-8b26-f19bff969cec
        type: similar
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_delete
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: EventType
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
