id: 480421f9-417f-4d3b-9552-fd2728443ec8
title: Wow6432Node Windows NT CurrentVersion Autorun Keys Modification
status: test
level: medium
description: Detects modification of autostart extensibility point (ASEP) in registry.
author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin,
    oscd.community, Tim Shelton, frack113 (split)
date: '2019-10-25'
modified: '2023-08-17'
tags:
    - attack.persistence
    - attack.t1547.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md
    - https://learn.microsoft.com/en-us/sysinternals/downloads/autoruns
    - https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d
fields:
    - SecurityID
    - ObjectName
    - OldValueType
    - NewValueType
falsepositives:
    - Legitimate software automatically (mostly, during installation) sets up autorun
        keys for legitimate reason
    - Legitimate administrator sets up autorun keys for legitimate reason
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''17f878b8-9968-4578-b814-c4217fc5768c''),
    type=<SigmaRelatedType.OBSOLETE: 4>)])'
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    wow_nt_current_version_base:
        TargetObject|contains: \SOFTWARE\Wow6432Node\Microsoft\Windows NT\CurrentVersion
    wow_nt_current_version:
        TargetObject|contains:
            - \Windows\Appinit_Dlls
            - \Image File Execution Options
            - \Drivers32
    filter:
        Details:
            - (Empty)
            - \REGISTRY\MACHINE\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Image
                File Execution Options
    condition: wow_nt_current_version_base and wow_nt_current_version and not filter
ocsf_mapping:
    class_name: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
