id: 086ae989-9ca6-4fe7-895a-759c5544f247
title: Potential Persistence Via TypedPaths
status: test
level: high
description: Detects modification addition to the 'TypedPaths' key in the user or
    admin registry from a non standard application. Which might indicate persistence
    attempt
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-08-22'
modified: '2023-08-17'
tags:
    - attack.persistence
references:
    - https://twitter.com/dez_/status/1560101453150257154
    - https://forensafe.com/blogs/typedpaths.html
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: \Software\Microsoft\Windows\CurrentVersion\Explorer\TypedPaths\
    filter:
        Image:
            - C:\Windows\explorer.exe
            - C:\Windows\SysWOW64\explorer.exe
    condition: selection and not filter
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: '2025-11-13T20:22:05.884683+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:22:05.884683+00:00'
    detection_fields:
        -   source_field: TargetObject
            target_table: process_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:22:05.884688+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:22:05.884690+00:00'
