title: WINEKEY Registry Modification
id: b98968aa-dbc0-4a9c-ac35-108363cbf8d5
status: test
level: high
author: omkar72
description: Detects potential malicious modification of run keys by winekey or team9
    backdoor
references:
    - https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html
fields:
    - ComputerName
    - Image
    - EventType
    - TargetObject
falsepositives:
    - Unknown
tags:
    - attack.persistence
    - attack.t1547
date: '2020-10-30'
modified: '2021-11-27'
logsource:
    category: registry_event
    product: windows
detection:
    selection:
        TargetObject|endswith: Software\Microsoft\Windows\CurrentVersion\Run\Backup
            Mgr
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_event
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
