id: a5c7a43f-6009-4a8c-80c5-32abf1c53ecc
title: Microsoft Office Protected View Disabled
status: test
level: high
description: Detects changes to Microsoft Office protected view registry keys with
    which the attacker disables this feature.
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: '2021-06-08'
modified: '2023-08-17'
tags:
    - attack.defense-evasion
    - attack.t1562.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
    - https://unit42.paloaltonetworks.com/unit42-gorgon-group-slithering-nation-state-cybercrime/
    - https://yoroi.company/research/cyber-criminal-espionage-operation-insists-on-italian-manufacturing/
    - https://admx.help/HKCU/software/policies/microsoft/office/16.0/excel/security/protectedview
falsepositives:
    - Unlikely
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''7c637634-c95d-4bbf-b26c-a82510874b34''),
    type=<SigmaRelatedType.OBSOLETE: 4>)])'
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection_path:
        TargetObject|contains|all:
            - \SOFTWARE\Microsoft\Office\
            - \Security\ProtectedView\
    selection_values_1:
        Details: DWORD (0x00000001)
        TargetObject|endswith:
            - \DisableAttachementsInPV
            - \DisableInternetFilesInPV
            - \DisableIntranetCheck
            - \DisableUnsafeLocationsInPV
    selection_values_0:
        Details: DWORD (0x00000000)
        TargetObject|endswith:
            - \enabledatabasefileprotectedview
            - \enableforeigntextfileprotectedview
    condition: selection_path and 1 of selection_values_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
