title: Add Debugger Entry To Hangs Key For Persistence
id: 833ef470-fa01-4631-a79b-6f291c9ac498
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects when an attacker adds a new "Debugger" value to the "Hangs" key
    in order to achieve persistence which will get invoked when an application crashes
references:
    - https://persistence-info.github.io/Data/wer_debugger.html
    - https://www.hexacorn.com/blog/2019/09/20/beyond-good-ol-run-key-part-116/
falsepositives:
    - This value is not set by default but could be rarly used by administrators
tags:
    - attack.persistence
date: '2022-07-21'
modified: '2023-08-17'
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: \SOFTWARE\Microsoft\Windows\Windows Error Reporting\Hangs\Debugger
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
