id: b86852fb-4c77-48f9-8519-eb1b2c308b59
title: Potential Persistence Via AppCompat RegisterAppRestart Layer
status: test
level: medium
description: 'Detects the setting of the REGISTERAPPRESTART compatibility layer on
    an application.

    This compatibility layer allows an application to register for restart using the
    "RegisterApplicationRestart" API.

    This can be potentially abused as a persistence mechanism.

    '
author: Nasreddine Bencherchali (Nextron Systems)
date: '2024-01-01'
tags:
    - attack.persistence
    - attack.t1546.011
references:
    - https://github.com/nasbench/Misc-Research/blob/d114d6a5e0a437d3818e492ef9864367152543e7/Other/Persistence-Via-RegisterAppRestart-Shim.md
falsepositives:
    - Legitimate applications making use of this feature for compatibility reasons
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: \SOFTWARE\Microsoft\Windows NT\CurrentVersion\AppCompatFlags\Layers\
        Details|contains: REGISTERAPPRESTART
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
