id: f2485272-a156-4773-82d7-1d178bc4905b
title: Suspicious Service Installed
status: test
level: medium
description: 'Detects installation of NalDrv or PROCEXP152 services via registry-keys
    to non-system32 folders.

    Both services are used in the tool Ghost-In-The-Logs (https://github.com/bats3c/Ghost-In-The-Logs),
    which uses KDU (https://github.com/hfiref0x/KDU)

    '
author: xknow (@xknow_infosec), xorxes (@xor_xes)
date: '2019-04-08'
modified: '2023-08-17'
tags:
    - attack.t1562.001
    - attack.defense-evasion
references:
    - https://web.archive.org/web/20200419024230/https://blog.dylan.codes/evading-sysmon-and-windows-event-logging/
falsepositives:
    - Other legimate tools using this service names and drivers. Note - clever attackers
        may easily bypass this detection by just renaming the services. Therefore
        just Medium-level and don't rely on it.
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject:
            - HKLM\System\CurrentControlSet\Services\NalDrv\ImagePath
            - HKLM\System\CurrentControlSet\Services\PROCEXP152\ImagePath
    filter:
        Image|endswith:
            - \procexp64.exe
            - \procexp.exe
            - \procmon64.exe
            - \procmon.exe
            - \handle.exe
            - \handle64.exe
        Details|contains: \WINDOWS\system32\Drivers\PROCEXP152.SYS
    condition: selection and not filter
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
