title: Potential Persistence Using DebugPath
id: df4dc653-1029-47ba-8231-3c44238cc0ae
status: test
level: medium
author: frack113
description: Detects potential persistence using Appx DebugPath
references:
    - https://oddvar.moe/2018/09/06/persistence-using-universal-windows-platform-apps-appx/
    - https://github.com/rootm0s/WinPwnage
falsepositives:
    - Unknown
tags:
    - attack.persistence
    - attack.t1546.015
date: '2022-07-27'
modified: '2023-08-17'
logsource:
    category: registry_set
    product: windows
detection:
    selection_debug:
        TargetObject|contains: Classes\ActivatableClasses\Package\Microsoft.
        TargetObject|endswith: \DebugPath
    selection_default:
        TargetObject|contains: \Software\Microsoft\Windows\CurrentVersion\PackagedAppXDebug\Microsoft.
        TargetObject|endswith: \(Default)
    condition: 1 of selection_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
