id: baecf8fb-edbf-429f-9ade-31fc3f22b970
title: Office Autorun Keys Modification
status: test
level: medium
description: Detects modification of autostart extensibility point (ASEP) in registry.
author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin,
    oscd.community, Tim Shelton, frack113 (split)
date: '2019-10-25'
modified: '2023-08-17'
tags:
    - attack.persistence
    - attack.t1547.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md
    - https://learn.microsoft.com/en-us/sysinternals/downloads/autoruns
    - https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d
fields:
    - SecurityID
    - ObjectName
    - OldValueType
    - NewValueType
falsepositives:
    - Legitimate software automatically (mostly, during installation) sets up autorun
        keys for legitimate reason
    - Legitimate administrator sets up autorun keys for legitimate reason
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''17f878b8-9968-4578-b814-c4217fc5768c''),
    type=<SigmaRelatedType.OBSOLETE: 4>)])'
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    office:
        TargetObject|contains:
            - \Software\Wow6432Node\Microsoft\Office
            - \Software\Microsoft\Office
    office_details:
        TargetObject|contains:
            - \Word\Addins
            - \PowerPoint\Addins
            - \Outlook\Addins
            - \Onenote\Addins
            - \Excel\Addins
            - \Access\Addins
            - test\Special\Perf
    filter_empty:
        Details: (Empty)
    filter_known_addins:
        Image|startswith:
            - C:\Program Files\Microsoft Office\
            - C:\Program Files (x86)\Microsoft Office\
            - C:\Windows\System32\msiexec.exe
            - C:\Windows\System32\regsvr32.exe
        TargetObject|contains:
            - \Excel\Addins\AdHocReportingExcelClientLib.AdHocReportingExcelClientAddIn.1\
            - \Excel\Addins\ExcelPlugInShell.PowerMapConnect\
            - \Excel\Addins\NativeShim\
            - \Excel\Addins\NativeShim.InquireConnector.1\
            - \Excel\Addins\PowerPivotExcelClientAddIn.NativeEntry.1\
            - \Outlook\AddIns\AccessAddin.DC\
            - \Outlook\AddIns\ColleagueImport.ColleagueImportAddin\
            - \Outlook\AddIns\EvernoteCC.EvernoteContactConnector\
            - \Outlook\AddIns\EvernoteOLRD.Connect\
            - \Outlook\Addins\Microsoft.VbaAddinForOutlook.1\
            - \Outlook\Addins\OcOffice.OcForms\
            - \Outlook\Addins\OneNote.OutlookAddin
            - \Outlook\Addins\OscAddin.Connect\
            - \Outlook\Addins\OutlookChangeNotifier.Connect\
            - \Outlook\Addins\UCAddin.LyncAddin.1
            - \Outlook\Addins\UCAddin.UCAddin.1
            - \Outlook\Addins\UmOutlookAddin.FormRegionAddin\
    filter_officeclicktorun:
        Image|startswith:
            - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\
            - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\Updates\
        Image|endswith: \OfficeClickToRun.exe
    filter_avg:
        Image: C:\Program Files\AVG\Antivirus\RegSvr.exe
        TargetObject|contains: \Microsoft\Office\Outlook\Addins\Antivirus.AsOutExt\
    condition: office and office_details and not 1 of filter_*
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: '2025-11-13T20:22:08.049394+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:22:08.049394+00:00'
    detection_fields:
        -   source_field: TargetObject
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:22:08.049406+00:00'
        -   source_field: Details
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:22:08.049408+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:22:08.049410+00:00'
