id: 5b175490-b652-4b02-b1de-5b5b4083c5f8
title: RedMimicry Winnti Playbook Registry Manipulation
status: test
level: high
description: Detects actions caused by the RedMimicry Winnti playbook
author: Alexander Rausch
date: '2020-06-24'
modified: '2021-11-27'
tags:
    - attack.defense-evasion
    - attack.t1112
references:
    - https://redmimicry.com
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: registry_event
    product: windows
detection:
    selection:
        TargetObject|contains: HKLM\SOFTWARE\Microsoft\HTMLHelp\data
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_event
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
