title: Potential AutoLogger Sessions Tampering
id: f37b4bce-49d0-4087-9f5b-58bffda77316
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects tampering with autologger trace sessions which is a technique
    used by attackers to disable logging
references:
    - https://twitter.com/MichalKoczwara/status/1553634816016498688
    - https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
    - https://i.blackhat.com/EU-21/Wednesday/EU-21-Teodorescu-Veni-No-Vidi-No-Vici-Attacks-On-ETW-Blind-EDRs.pdf
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
date: '2022-08-01'
modified: '2023-08-17'
logsource:
    category: registry_set
    product: windows
detection:
    selection_main:
        TargetObject|contains: \System\CurrentControlSet\Control\WMI\Autologger\
    selection_values:
        TargetObject|contains:
            - \EventLog-
            - \Defender
        TargetObject|endswith:
            - \Enable
            - \Start
        Details: DWORD (0x00000000)
    filter_wevtutil:
        Image: C:\Windows\system32\wevtutil.exe
    condition: all of selection_* and not 1 of filter_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
