title: Winlogon AllowMultipleTSSessions Enable
id: f7997770-92c3-4ec9-b112-774c4ef96f96
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: 'Detects when the ''AllowMultipleTSSessions'' value is enabled.

    Which allows for multiple Remote Desktop connection sessions to be opened at once.

    This is often used by attacker as a way to connect to an RDP session without disconnecting
    the other users

    '
references:
    - http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
falsepositives:
    - Legitimate use of the multi session functionality
tags:
    - attack.persistence
    - attack.defense-evasion
    - attack.t1112
date: '2022-09-09'
modified: '2023-08-17'
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|endswith: \Microsoft\Windows NT\CurrentVersion\Winlogon\AllowMultipleTSSessions
        Details|endswith: DWORD (0x00000001)
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
