id: 509e84b9-a71a-40e0-834f-05470369bd1e
title: Default RDP Port Changed to Non Standard Port
status: test
level: high
description: 'Detects changes to the default RDP port.

    Remote desktop is a common feature in operating systems. It allows a user to log
    into a remote system using an interactive session with a graphical user interface.

    Microsoft refers to its implementation of the Remote Desktop Protocol (RDP) as
    Remote Desktop Services (RDS).

    '
author: frack113
date: '2022-01-01'
modified: '2024-03-25'
tags:
    - attack.persistence
    - attack.t1547.010
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1021.001/T1021.001.md#atomic-test-1---rdp-to-domaincontroller
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|endswith: \Control\Terminal Server\WinStations\RDP-Tcp\PortNumber
    filter_main_port:
        Details: DWORD (0x00000d3d)
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
