title: COM Hijack via Sdclt
id: 07743f65-7ec9-404a-a519-913db7118a8d
status: test
level: high
author: Omkar Gudhate
description: Detects changes to 'HKCU\Software\Classes\Folder\shell\open\command\DelegateExecute'
references:
    - http://blog.sevagas.com/?Yet-another-sdclt-UAC-bypass
    - https://www.exploit-db.com/exploits/47696
falsepositives:
    - Unknown
tags:
    - attack.privilege-escalation
    - attack.t1546
    - attack.t1548
date: '2020-09-27'
modified: '2023-09-28'
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: \Software\Classes\Folder\shell\open\command\DelegateExecute
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
