id: a9b6c011-ab69-4ddb-bc0a-c4f21c80ec47
title: Potential Attachment Manager Settings Associations Tamper
status: test
level: high
description: Detects tampering with attachment manager settings policies associations
    to lower the default file type risks (See reference for more information)
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-08-01'
modified: '2023-08-17'
tags:
    - attack.defense-evasion
references:
    - https://support.microsoft.com/en-us/topic/information-about-the-attachment-manager-in-microsoft-windows-c48a4dcd-8de5-2af5-ee9b-cd795ae42738
    - https://www.virustotal.com/gui/file/2bcd5702a7565952c44075ac6fb946c7780526640d1264f692c7664c02c68465
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection_main:
        TargetObject|contains: \SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Associations\
    selection_value_default_file_type_rsik:
        TargetObject|endswith: \DefaultFileTypeRisk
        Details: DWORD (0x00006152)
    selection_value_low_risk_filetypes:
        TargetObject|endswith: \LowRiskFileTypes
        Details|contains:
            - .zip;
            - .rar;
            - .exe;
            - .bat;
            - .com;
            - .cmd;
            - .reg;
            - .msi;
            - .htm;
            - .html;
    condition: selection_main and 1 of selection_value_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
