id: 966315ef-c5e1-4767-ba25-fce9c8de3660
title: Suspicious Environment Variable Has Been Registered
status: test
level: high
description: Detects the creation of user-specific or system-wide environment variables
    via the registry. Which contains suspicious commands and strings
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-12-20'
modified: '2023-08-17'
tags:
    - attack.defense-evasion
    - attack.persistence
references:
    - https://infosec.exchange/@sbousseaden/109542254124022664
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection_main:
        TargetObject|contains: \Environment\
    selection_details:
        Details:
            - powershell
            - pwsh
        Details|contains:
            - \AppData\Local\Temp\
            - C:\Users\Public\
            - TVqQAAMAAAAEAAAA
            - TVpQAAIAAAAEAA8A
            - TVqAAAEAAAAEABAA
            - TVoAAAAAAAAAAAAA
            - TVpTAQEAAAAEAAAA
            - SW52b2tlL
            - ludm9rZS
            - JbnZva2Ut
            - SQBuAHYAbwBrAGUALQ
            - kAbgB2AG8AawBlAC0A
            - JAG4AdgBvAGsAZQAtA
        Details|startswith:
            - SUVY
            - SQBFAF
            - SQBuAH
            - cwBhA
            - aWV4
            - aQBlA
            - R2V0
            - dmFy
            - dgBhA
            - dXNpbm
            - H4sIA
            - Y21k
            - cABhAH
            - Qzpc
            - Yzpc
    condition: all of selection_*
ocsf_mapping:
    class_name: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
