id: 4f84b697-c9ed-4420-8ab5-e09af5b2345d
title: New DLL Added to AppInit_DLLs Registry Key
status: test
level: medium
description: DLLs that are specified in the AppInit_DLLs value in the Registry key
    HKLM\Software\Microsoft\Windows NT\CurrentVersion\Windows are loaded by user32.dll
    into every process that loads user32.dll
author: Ilyas Ochkov, oscd.community, Tim Shelton
date: '2019-10-25'
modified: '2022-12-25'
tags:
    - attack.persistence
    - attack.t1546.010
references:
    - https://eqllib.readthedocs.io/en/latest/analytics/822dc4c5-b355-4df8-bd37-29c458997b8f.html
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: registry_event
    product: windows
detection:
    selection:
        TargetObject|endswith:
            - \SOFTWARE\Microsoft\Windows NT\CurrentVersion\Windows\AppInit_Dlls
            - \SOFTWARE\Wow6432Node\Microsoft\Windows NT\CurrentVersion\Windows\AppInit_Dlls
        NewName|endswith:
            - \SOFTWARE\Microsoft\Windows NT\CurrentVersion\Windows\AppInit_Dlls
            - \SOFTWARE\Wow6432Node\Microsoft\Windows NT\CurrentVersion\Windows\AppInit_Dlls
    filter:
        Details: (Empty)
    condition: selection and not filter
ocsf_mapping:
    class_name: datastore_activity
    logsource:
        category:
            source_field: category
            source_value: registry_event
            mapped_at: '2025-11-13T20:22:09.942327+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:22:09.942327+00:00'
    detection_fields:
        -   source_field: TargetObject
            target_table: datastore_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:22:10.915343+00:00'
        -   source_field: NewName
            target_table: datastore_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:22:10.915366+00:00'
        -   source_field: Details
            target_table: datastore_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:22:10.915370+00:00'
