id: fdbf0b9d-0182-4c43-893b-a1eaab92d085
title: Potential Persistence Via Custom Protocol Handler
status: test
level: medium
description: Detects potential persistence activity via the registering of a new custom
    protocole handlers. While legitimate applications register protocole handlers
    often times during installation. And attacker can abuse this by setting a custom
    handler to be used as a persistence mechanism.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-05-30'
modified: '2023-05-12'
tags:
    - attack.defense-evasion
    - attack.t1112
references:
    - https://ladydebug.com/blog/2019/06/21/custom-protocol-handler-cph/
falsepositives:
    - Many legitimate applications can register a new custom protocol handler. Additional
        filters needs to applied according to your environment.
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|startswith: HKCR\
        Details|startswith: 'URL:'
    filter_main_ms_trusted:
        Details|startswith: URL:ms-
    filter_main_generic_locations:
        Image|startswith:
            - C:\Program Files (x86)
            - C:\Program Files\
            - C:\Windows\System32\
            - C:\Windows\SysWOW64\
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
