title: RestrictedAdminMode Registry Value Tampering
id: d6ce7ebd-260b-4323-9768-a9631c8d4db2
status: test
level: high
author: frack113
description: 'Detects changes to the "DisableRestrictedAdmin" registry value in order
    to disable or enable RestrictedAdmin mode.

    RestrictedAdmin mode prevents the transmission of reusable credentials to the
    remote system to which you connect using Remote Desktop.

    This prevents your credentials from being harvested during the initial connection
    process if the remote server has been compromise

    '
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/a8e3cf63e97b973a25903d3df9fd55da6252e564/atomics/T1112/T1112.md
    - https://social.technet.microsoft.com/wiki/contents/articles/32905.remote-desktop-services-enable-restricted-admin-mode.aspx
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1112
date: '2023-01-13'
modified: '2024-08-23'
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|endswith: System\CurrentControlSet\Control\Lsa\DisableRestrictedAdmin
    condition: selection
related:
    -   id: 28ac00d6-22d9-4a3c-927f-bbd770104573
        type: similar
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
