id: fecfd1a1-cc78-4313-a1ea-2ee2e8ec27a7
title: PowerShell Logging Disabled Via Registry Key Tampering
status: test
level: high
description: Detects changes to the registry for the currently logged-in user. In
    order to disable PowerShell module logging, script block logging or transcription
    and script execution logging
author: frack113
date: '2022-04-02'
modified: '2023-08-17'
tags:
    - attack.defense-evasion
    - attack.t1564.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-32---windows-powershell-logging-disabled
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains:
            - \Microsoft\Windows\PowerShell\
            - \Microsoft\PowerShellCore\
        TargetObject|endswith:
            - \ModuleLogging\EnableModuleLogging
            - \ScriptBlockLogging\EnableScriptBlockLogging
            - \ScriptBlockLogging\EnableScriptBlockInvocationLogging
            - \Transcription\EnableTranscripting
            - \Transcription\EnableInvocationHeader
            - \EnableScripts
        Details: DWORD (0x00000000)
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
