id: 37b437cf-3fc5-4c8e-9c94-1d7c9aff842b
title: Allow RDP Remote Assistance Feature
status: test
level: medium
description: Detect enable rdp feature to allow specific user to rdp connect on the
    targeted machine
author: frack113
date: '2022-08-19'
modified: '2023-08-17'
tags:
    - attack.defense-evasion
    - attack.t1112
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1112/T1112.md
falsepositives:
    - Legitimate use of the feature (alerts should be investigated either way)
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|endswith: System\CurrentControlSet\Control\Terminal Server\fAllowToGetHelp
        Details: DWORD (0x00000001)
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
