id: 33efc23c-6ea2-4503-8cfe-bdf82ce8f705
title: Potential Persistence Via New AMSI Providers - Registry
status: test
level: high
description: Detects when an attacker registers a new AMSI provider in order to achieve
    persistence
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-07-21'
modified: '2023-02-07'
tags:
    - attack.persistence
references:
    - https://persistence-info.github.io/Data/amsi.html
    - https://github.com/gtworek/PSBits/blob/8d767892f3b17eefa4d0668f5d2df78e844f01d8/FakeAMSI/FakeAMSI.c
falsepositives:
    - Legitimate security products adding their own AMSI providers. Filter these according
        to your environment
taxonomy: sigma
logsource:
    category: registry_add
    product: windows
detection:
    selection:
        EventType: CreateKey
        TargetObject|contains:
            - \SOFTWARE\Microsoft\AMSI\Providers\
            - \SOFTWARE\WOW6432Node\Microsoft\AMSI\Providers\
    filter:
        Image|startswith:
            - C:\Windows\System32\
            - C:\Program Files\
            - C:\Program Files (x86)\
    condition: selection and not filter
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: registry_add
            mapped_at: '2025-11-13T20:22:08.106074+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:22:08.106074+00:00'
    detection_fields:
        -   source_field: EventType
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:22:08.106082+00:00'
        -   source_field: TargetObject
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:22:08.106084+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:22:08.106085+00:00'
