title: UAC Bypass Using Windows Media Player - Registry
id: 5f9db380-ea57-4d1e-beab-8a2d33397e93
status: test
level: high
author: Christian Burkard (Nextron Systems)
description: Detects the pattern of UAC Bypass using Windows Media Player osksupport.dll
    (UACMe 32)
references:
    - https://github.com/hfiref0x/UACME
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
date: '2021-08-23'
modified: '2023-08-17'
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|endswith: \SOFTWARE\Microsoft\Windows NT\CurrentVersion\AppCompatFlags\Compatibility
            Assistant\Store\C:\Program Files\Windows Media Player\osk.exe
        Details: Binary Data
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
