id: f50f3c09-557d-492d-81db-9064a8d4e211
title: Suspicious Execution Of Renamed Sysinternals Tools - Registry
status: test
level: high
description: Detects the creation of the "accepteula" key related to the Sysinternals
    tools being created from executables with the wrong name (e.g. a renamed Sysinternals
    tool)
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-08-24'
modified: '2023-02-07'
tags:
    - attack.resource-development
    - attack.t1588.002
references:
    - Internal Research
falsepositives:
    - Unlikely
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''25ffa65d-76d8-4da5-a832-3f2b0136e133''),
    type=<SigmaRelatedType.DERIVED: 2>), SigmaRelatedItem(id=UUID(''8023f872-3f1d-4301-a384-801889917ab4''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: registry_add
    product: windows
detection:
    selection:
        EventType: CreateKey
        TargetObject|contains:
            - \Active Directory Explorer
            - \Handle
            - \LiveKd
            - \ProcDump
            - \Process Explorer
            - \PsExec
            - \PsLoggedon
            - \PsLoglist
            - \PsPasswd
            - \PsPing
            - \PsService
            - \SDelete
        TargetObject|endswith: \EulaAccepted
    filter:
        Image|endswith:
            - \ADExplorer.exe
            - \ADExplorer64.exe
            - \handle.exe
            - \handle64.exe
            - \livekd.exe
            - \livekd64.exe
            - \procdump.exe
            - \procdump64.exe
            - \procexp.exe
            - \procexp64.exe
            - \PsExec.exe
            - \PsExec64.exe
            - \PsLoggedon.exe
            - \PsLoggedon64.exe
            - \psloglist.exe
            - \psloglist64.exe
            - \pspasswd.exe
            - \pspasswd64.exe
            - \PsPing.exe
            - \PsPing64.exe
            - \PsService.exe
            - \PsService64.exe
            - \sdelete.exe
    condition: selection and not filter
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: registry_add
            mapped_at: '2025-11-13T20:22:08.110747+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:22:08.110747+00:00'
    detection_fields:
        -   source_field: EventType
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:22:08.110755+00:00'
        -   source_field: TargetObject
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:22:08.110757+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:22:08.110758+00:00'
