title: Registry Persistence via Service in Safe Mode
id: 1547e27c-3974-43e2-a7d7-7f484fb928ec
status: experimental
level: high
author: frack113
description: Detects the modification of the registry to allow a driver or service
    to persist in Safe Mode.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-33---windows-add-registry-value-to-load-service-in-safe-mode-without-network
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-34---windows-add-registry-value-to-load-service-in-safe-mode-with-network
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1564.001
date: '2022-04-04'
modified: '2024-03-25'
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains:
            - \Control\SafeBoot\Minimal\
            - \Control\SafeBoot\Network\
        TargetObject|endswith: \(Default)
        Details: Service
    filter_optional_sophos:
        Image: C:\WINDOWS\system32\msiexec.exe
        TargetObject|endswith:
            - \Control\SafeBoot\Minimal\SAVService\(Default)
            - \Control\SafeBoot\Network\SAVService\(Default)
    condition: selection and not 1 of filter_optional_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
