title: Removal Of AMSI Provider Registry Keys
id: 41d1058a-aea7-4952-9293-29eaaf516465
status: test
level: high
author: frack113
description: Detects the deletion of AMSI provider registry key entries in HKLM\Software\Microsoft\AMSI.
    This technique could be used by an attacker in order to disable AMSI inspection.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
    - https://seclists.org/fulldisclosure/2020/Mar/45
falsepositives:
    - Unlikely
tags:
    - attack.defense-evasion
    - attack.t1562.001
date: '2021-06-07'
modified: '2023-02-08'
logsource:
    category: registry_delete
    product: windows
detection:
    selection:
        EventType: DeleteKey
        TargetObject|endswith:
            - '{2781761E-28E0-4109-99FE-B9D127C57AFE}'
            - '{A7C452EF-8E9F-42EB-9F2B-245613CA0DC9}'
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_delete
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: EventType
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
