id: dc5c24af-6995-49b2-86eb-a9ff62199e82
title: COM Hijacking via TreatAs
status: test
level: medium
description: Detect modification of TreatAs key to enable "rundll32.exe -sta" command
author: frack113
date: '2022-08-28'
modified: '2023-08-17'
tags:
    - attack.persistence
    - attack.t1546.015
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1546.015/T1546.015.md
    - https://www.youtube.com/watch?v=3gz1QmiMhss&t=1251s
falsepositives:
    - Legitimate use
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|endswith: TreatAs\(Default)
    filter_office:
        Image|startswith: C:\Program Files\Common Files\Microsoft Shared\ClickToRun\
        Image|endswith: \OfficeClickToRun.exe
    filter_office2:
        Image: C:\Program Files (x86)\Microsoft Office\root\integration\integrator.exe
    filter_svchost:
        Image: C:\Windows\system32\svchost.exe
    filter_misexec:
        Image:
            - C:\Windows\system32\msiexec.exe
            - C:\Windows\SysWOW64\msiexec.exe
    condition: selection and not 1 of filter_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: '2025-11-13T20:22:05.789969+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:22:05.789969+00:00'
    detection_fields:
        -   source_field: TargetObject
            target_table: process_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:22:05.790009+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:22:05.790013+00:00'
