id: 7021255e-5db3-4946-a8b9-0ba7a4644a69
title: Potential Provisioning Registry Key Abuse For Binary Proxy Execution - REG
status: test
level: high
description: Detects potential abuse of the provisioning registry key for indirect
    command execution through "Provlaunch.exe".
author: Swachchhanda Shrawan Poudel
date: '2023-08-02'
modified: '2023-08-17'
tags:
    - attack.defense-evasion
    - attack.t1218
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Provlaunch/
    - https://twitter.com/0gtweet/status/1674399582162153472
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''7f5d1c9a-3e83-48df-95a7-2b98aae6c13c''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''f9999590-1f94-4a34-a91e-951e47bedefd''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''2a4b3e61-9d22-4e4a-b60f-6e8f0cde6f25''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
    definition: 'Requirements: The registry key "\SOFTWARE\Microsoft\Provisioning\Commands\"
        and its subkey must be monitored'
detection:
    selection:
        TargetObject|contains: \SOFTWARE\Microsoft\Provisioning\Commands\
    condition: selection
ocsf_mapping:
    class_name: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
