id: 9577edbb-851f-4243-8c91-1d5b50c1a39b
title: Atbroker Registry Change
status: test
level: medium
description: Detects creation/modification of Assistive Technology applications and
    persistence with usage of 'at'
author: Mateusz Wydra, oscd.community
date: '2020-10-13'
modified: '2023-01-19'
tags:
    - attack.defense-evasion
    - attack.t1218
    - attack.persistence
    - attack.t1547
references:
    - http://www.hexacorn.com/blog/2016/07/22/beyond-good-ol-run-key-part-42/
    - https://lolbas-project.github.io/lolbas/Binaries/Atbroker/
falsepositives:
    - Creation of non-default, legitimate at usage
taxonomy: sigma
logsource:
    category: registry_event
    product: windows
detection:
    selection:
        TargetObject|contains:
            - Software\Microsoft\Windows NT\CurrentVersion\Accessibility\ATs
            - Software\Microsoft\Windows NT\CurrentVersion\Accessibility\Configuration
    filter_atbroker:
        Image: C:\Windows\system32\atbroker.exe
        TargetObject|contains: \Microsoft\Windows NT\CurrentVersion\Accessibility\Configuration
        Details: (Empty)
    filter_uninstallers:
        Image|startswith: C:\Windows\Installer\MSI
        TargetObject|contains: Software\Microsoft\Windows NT\CurrentVersion\Accessibility\ATs
    condition: selection and not 1 of filter_*
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: registry_event
            mapped_at: '2025-11-13T20:22:12.005965+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:22:12.005965+00:00'
    detection_fields:
        -   source_field: TargetObject
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:22:12.005983+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:22:12.005985+00:00'
        -   source_field: Details
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:22:12.005987+00:00'
