title: Blue Mockingbird - Registry
id: 92b0b372-a939-44ed-a11b-5136cf680e27
status: test
level: high
author: Trent Liffick (@tliffick)
description: Attempts to detect system changes made by Blue Mockingbird
references:
    - https://redcanary.com/blog/blue-mockingbird-cryptominer/
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1112
    - attack.t1047
date: '2020-05-14'
modified: '2023-08-17'
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|endswith: \CurrentControlSet\Services\wercplsupport\Parameters\ServiceDll
    condition: selection
related:
    -   id: c3198a27-23a0-4c2c-af19-e5328d49680e
        type: derived
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
