id: 61a7697c-cb79-42a8-a2ff-5f0cdfae0130
title: Potential CobaltStrike Service Installations - Registry
status: test
level: high
description: 'Detects known malicious service installs that appear in cases in which
    a Cobalt Strike beacon elevates privileges or lateral movement.

    '
author: Wojciech Lesicki
date: '2021-06-29'
modified: '2024-03-25'
tags:
    - attack.execution
    - attack.privilege-escalation
    - attack.lateral-movement
    - attack.t1021.002
    - attack.t1543.003
    - attack.t1569.002
references:
    - https://www.sans.org/webcasts/tech-tuesday-workshop-cobalt-strike-detection-log-analysis-119395
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection_key:
        TargetObject|contains: \System\CurrentControlSet\Services
        TargetObject|contains|all:
            - \System\ControlSet
            - \Services
    selection_details:
        Details|contains|all:
            - ADMIN$
            - .exe
            - '%COMSPEC%'
            - start
            - powershell
    condition: all of selection_*
ocsf_mapping:
    class_name: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
