id: 45e112d0-7759-4c2a-aa36-9f8fb79d3393
title: IE Change Domain Zone
status: test
level: medium
description: Hides the file extension through modification of the registry
author: frack113
date: '2022-01-22'
modified: '2023-08-17'
tags:
    - attack.persistence
    - attack.t1137
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-4---add-domain-to-trusted-sites-zone
    - https://learn.microsoft.com/en-us/troubleshoot/developer/browsers/security-privacy/ie-security-zones-registry-entries
falsepositives:
    - Administrative scripts
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''d88d0ab2-e696-4d40-a2ed-9790064e66b3''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection_domains:
        TargetObject|contains: \SOFTWARE\Microsoft\Windows\CurrentVersion\Internet
            Settings\ZoneMap\Domains\
    filter:
        Details:
            - DWORD (0x00000000)
            - DWORD (0x00000001)
            - (Empty)
    condition: selection_domains and not filter
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
