title: Potential Persistence Via Mpnotify
id: 92772523-d9c1-4c93-9547-b0ca500baba3
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects when an attacker register a new SIP provider for persistence
    and defense evasion
references:
    - https://persistence-info.github.io/Data/mpnotify.html
    - https://www.youtube.com/watch?v=ggY3srD9dYs&ab_channel=GrzegorzTworek
falsepositives:
    - Might trigger if a legitimate new SIP provider is registered. But this is not
        a common occurrence in an environment and should be investigated either way
tags:
    - attack.persistence
date: '2022-07-21'
modified: '2023-08-17'
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: \SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon\mpnotify
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
