id: f10ed525-97fe-4fed-be7c-2feecca941b1
title: Persistence Via Hhctrl.ocx
status: test
level: high
description: Detects when an attacker modifies the registry value of the "hhctrl"
    to point to a custom binary
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-07-21'
modified: '2023-08-17'
tags:
    - attack.persistence
references:
    - https://persistence-info.github.io/Data/hhctrl.html
    - https://www.hexacorn.com/blog/2018/04/23/beyond-good-ol-run-key-part-77/
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: \CLSID\{52A2AAAE-085D-4187-97EA-8C30DB990436}\InprocServer32\(Default)
    filter:
        Details: C:\Windows\System32\hhctrl.ocx
    condition: selection and not filter
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
