id: ddd171b5-2cc6-4975-9e78-f0eccd08cc76
title: Potential Persistence Via Outlook Home Page
status: test
level: high
description: 'Detects potential persistence activity via outlook home page.

    An attacker can set a home page to achieve code execution and persistence by editing
    the WebView registry keys.

    '
author: Tobias Michalski (Nextron Systems), David Bertho (@dbertho) & Eirik Sveen
    (@0xSV1), Storebrand
date: '2021-06-09'
modified: '2024-08-07'
tags:
    - attack.persistence
    - attack.t1112
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=70
    - https://support.microsoft.com/en-us/topic/outlook-home-page-feature-is-missing-in-folder-properties-d207edb7-aa02-46c5-b608-5d9dbed9bd04?ui=en-us&rs=en-us&ad=us
    - https://trustedsec.com/blog/specula-turning-outlook-into-a-c2-with-one-registry-change
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''487bb375-12ef-41f6-baae-c6a1572b4dd1''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains|all:
            - \Software\Microsoft\Office\
            - \Outlook\WebView\
        TargetObject|endswith: \URL
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
