title: Terminal Server Client Connection History Cleared - Registry
id: 07bdd2f5-9c58-4f38-aec8-e101bb79ef8d
status: test
level: high
author: Christian Burkard (Nextron Systems)
description: Detects the deletion of registry keys containing the MSTSC connection
    history
references:
    - https://learn.microsoft.com/en-us/troubleshoot/windows-server/remote/remove-entries-from-remote-desktop-connection-computer
    - http://woshub.com/how-to-clear-rdp-connections-history/
    - https://www.trendmicro.com/en_us/research/23/a/vice-society-ransomware-group-targets-manufacturing-companies.html
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1070
    - attack.t1112
date: '2021-10-19'
modified: '2023-02-08'
logsource:
    category: registry_delete
    product: windows
detection:
    selection1:
        EventType: DeleteValue
        TargetObject|contains: \Microsoft\Terminal Server Client\Default\MRU
    selection2:
        EventType: DeleteKey
        TargetObject|contains: \Microsoft\Terminal Server Client\Servers\
    condition: 1 of selection*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_delete
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: EventType
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
