title: RDP Sensitive Settings Changed
id: 3f6b7b62-61aa-45db-96bd-9c31b36b653c
status: test
level: high
author: Samir Bousseaden, David ANDRE, Roberto Rodriguez @Cyb3rWard0g, Nasreddine
    Bencherchali
description: 'Detects tampering of RDP Terminal Service/Server sensitive settings.

    Such as allowing unauthorized users access to a system via the ''fAllowUnsolicited''
    or enabling RDP via ''fDenyTSConnections''...etc

    '
references:
    - https://web.archive.org/web/20200929062532/https://blog.menasec.net/2019/02/threat-hunting-rdp-hijacking-via.html
    - http://woshub.com/rds-shadow-how-to-connect-to-a-user-session-in-windows-server-2012-r2/
    - https://twitter.com/SagieSec/status/1469001618863624194?t=HRf0eA0W1YYzkTSHb-Ky1A&s=03
    - https://threathunterplaybook.com/hunts/windows/190407-RegModEnableRDPConnections/notebook.html
    - https://bazaar.abuse.ch/sample/6f3aa9362d72e806490a8abce245331030d1ab5ac77e400dd475748236a6cc81/
    - http://etutorials.org/Microsoft+Products/microsoft+windows+server+2003+terminal+services/Chapter+6+Registry/Registry+Keys+for+Terminal+Services/
    - https://admx.help/HKLM/SOFTWARE/Policies/Microsoft/Windows%20NT/Terminal%20Services
    - https://blog.sekoia.io/darkgate-internals/
    - https://github.com/redcanaryco/atomic-red-team/blob/02c7d02fe1f1feb0fc7944550408ea8224273994/atomics/T1112/T1112.md#atomic-test-63---disable-remote-desktop-anti-alias-setting-through-registry
    - https://github.com/redcanaryco/atomic-red-team/blob/02c7d02fe1f1feb0fc7944550408ea8224273994/atomics/T1112/T1112.md#atomic-test-64---disable-remote-desktop-security-settings-through-registry
falsepositives:
    - Some of the keys mentioned here could be modified by an administrator while
        setting group policy (it should be investigated either way)
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.t1112
date: '2022-08-06'
modified: '2024-02-08'
logsource:
    category: registry_set
    product: windows
detection:
    selection_shadow:
        TargetObject|contains:
            - \Control\Terminal Server\
            - \Windows NT\Terminal Services\
        TargetObject|endswith: \Shadow
        Details:
            - DWORD (0x00000001)
            - DWORD (0x00000002)
            - DWORD (0x00000003)
            - DWORD (0x00000004)
    selection_terminal_services_key:
        TargetObject|contains:
            - \Control\Terminal Server\
            - \Windows NT\Terminal Services\
        TargetObject|endswith:
            - \DisableRemoteDesktopAntiAlias
            - \DisableSecuritySettings
            - \fAllowUnsolicited
            - \fAllowUnsolicitedFullControl
        Details: DWORD (0x00000001)
    selection_tamper_only:
        TargetObject|contains:
            - \Control\Terminal Server\InitialProgram
            - \Control\Terminal Server\WinStations\RDP-Tcp\InitialProgram
            - \services\TermService\Parameters\ServiceDll
            - \Windows NT\Terminal Services\InitialProgram
    condition: selection_shadow or selection_terminal_services_key or selection_tamper_only
related:
    -   id: 171b67e1-74b4-460e-8d55-b331f3e32d67
        type: obsolete
    -   id: 41904ebe-d56c-4904-b9ad-7a77bdf154b3
        type: obsolete
    -   id: a2863fbc-d5cb-48d5-83fb-d976d4b1743b
        type: similar
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
