title: Bypass UAC Using SilentCleanup Task
id: 724ea201-6514-4f38-9739-e5973c34f49a
status: test
level: high
author: frack113, Nextron Systems
description: 'Detects the setting of the environement variable "windir" to a non default
    value.

    Attackers often abuse this variable in order to trigger a UAC bypass via the "SilentCleanup"
    task.

    The SilentCleanup task located in %windir%\system32\cleanmgr.exe is an auto-elevated
    task that can be abused to elevate any file with administrator privileges without
    prompting UAC.

    '
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1548.002/T1548.002.md#atomic-test-9---bypass-uac-using-silentcleanup-task
    - https://www.reddit.com/r/hacking/comments/ajtrws/bypassing_highest_uac_level_windows_810/
    - https://www.fortinet.com/blog/threat-research/enter-the-darkgate-new-cryptocurrency-mining-and-ransomware-campaign
falsepositives:
    - Unknown
tags:
    - attack.privilege-escalation
    - attack.defense-evasion
    - attack.t1548.002
date: '2022-01-06'
modified: '2024-01-30'
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|endswith: \Environment\windir
    filter_main_default:
        Details: '%SystemRoot%'
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
