id: 1c3121ed-041b-4d97-a075-07f54f20fb4a
title: Registry Explorer Policy Modification
status: test
level: medium
description: Detects registry modifications that disable internal tools or functions
    in explorer (malware like Agent Tesla uses this technique)
author: frack113
date: '2022-03-18'
modified: '2023-08-17'
tags:
    - attack.defense-evasion
    - attack.t1112
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md
falsepositives:
    - Legitimate admin script
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection_set_1:
        TargetObject|endswith:
            - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoLogOff
            - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoDesktop
            - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoRun
            - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoFind
            - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoControlPanel
            - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoFileMenu
            - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoClose
            - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoSetTaskbar
            - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoPropertiesMyDocuments
            - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoTrayContextMenu
        Details: DWORD (0x00000001)
    condition: selection_set_1
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
