id: 487bb375-12ef-41f6-baae-c6a1572b4dd1
title: Potential Persistence Via Outlook Today Page
status: test
level: high
description: 'Detects potential persistence activity via outlook today page.

    An attacker can set a custom page to execute arbitrary code and link to it via
    the registry values "URL" and "UserDefinedUrl".

    '
author: Tobias Michalski (Nextron Systems), David Bertho (@dbertho) & Eirik Sveen
    (@0xSV1), Storebrand
date: '2021-06-10'
modified: '2024-08-07'
tags:
    - attack.persistence
    - attack.t1112
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=74
    - https://trustedsec.com/blog/specula-turning-outlook-into-a-c2-with-one-registry-change
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''ddd171b5-2cc6-4975-9e78-f0eccd08cc76''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection_main:
        TargetObject|contains|all:
            - Software\Microsoft\Office\
            - \Outlook\Today\
    selection_value_stamp:
        TargetObject|endswith: \Stamp
        Details: DWORD (0x00000001)
    selection_value_url:
        TargetObject|endswith:
            - \URL
            - \UserDefinedUrl
    filter_main_office:
        Image|startswith:
            - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\
            - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\Updates\
        Image|endswith: \OfficeClickToRun.exe
    condition: selection_main and 1 of selection_value_* and not 1 of filter_main_*
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: '2025-11-13T20:22:04.277907+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:22:04.277907+00:00'
    detection_fields:
        -   source_field: TargetObject
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:22:04.277919+00:00'
        -   source_field: Details
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:22:04.277921+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:22:04.277922+00:00'
