id: 9c5037d1-c568-49b3-88c7-9846a5bdc2be
title: Suspicious Run Key from Download
status: test
level: high
description: Detects the suspicious RUN keys created by software located in Download
    or temporary Outlook/Internet Explorer directories
author: Florian Roth (Nextron Systems)
date: '2019-10-01'
modified: '2021-11-27'
tags:
    - attack.persistence
    - attack.t1547.001
references:
    - https://app.any.run/tasks/c5bef5b7-f484-4c43-9cf3-d5c5c7839def/
falsepositives:
    - Software installers downloaded and used by users
taxonomy: sigma
logsource:
    category: registry_event
    product: windows
detection:
    selection:
        Image|contains:
            - \Downloads\
            - \Temporary Internet Files\Content.Outlook\
            - \Local Settings\Temporary Internet Files\
        TargetObject|contains: \SOFTWARE\Microsoft\Windows\CurrentVersion\Run\
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_event
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
