title: Potential Persistence Via GlobalFlags
id: 36803969-5421-41ec-b92f-8500f79c23b0
status: test
level: high
author: Karneades, Jonhnathan Ribeiro, Florian Roth
description: Detects registry persistence technique using the GlobalFlags and SilentProcessExit
    keys
references:
    - https://oddvar.moe/2018/04/10/persistence-using-globalflags-in-image-file-execution-options-hidden-from-autoruns-exe/
    - https://www.deepinstinct.com/2021/02/16/lsass-memory-dumps-are-stealthier-than-ever-before-part-2/
falsepositives:
    - Unknown
tags:
    - attack.privilege-escalation
    - attack.persistence
    - attack.defense-evasion
    - attack.t1546.012
    - car.2013-01-002
date: '2018-04-11'
modified: '2023-06-05'
logsource:
    category: registry_set
    product: windows
detection:
    selection_global_flag:
        TargetObject|contains|all:
            - \Microsoft\Windows NT\CurrentVersion\
            - \Image File Execution Options\
            - \GlobalFlag
    selection_silent_process:
        TargetObject|contains|all:
            - \Microsoft\Windows NT\CurrentVersion\
            - \SilentProcessExit\
        TargetObject|contains:
            - \ReportingMode
            - \MonitorProcess
    condition: 1 of selection_*
related:
    -   id: c81fe886-cac0-4913-a511-2822d72ff505
        type: obsolete
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
