id: a6b33c02-8305-488f-8585-03cb2a7763f2
title: Windows Credential Editor Registry
status: test
level: critical
description: Detects the use of Windows Credential Editor (WCE)
author: Florian Roth (Nextron Systems)
date: '2019-12-31'
modified: '2021-11-27'
tags:
    - attack.credential-access
    - attack.t1003.001
    - attack.s0005
references:
    - https://www.ampliasecurity.com/research/windows-credentials-editor/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: registry_event
    product: windows
detection:
    selection:
        TargetObject|contains: Services\WCESERVICE\Start
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_event
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
