title: New ODBC Driver Registered
id: 3390fbef-c98d-4bdd-a863-d65ed7c610dd
status: test
level: low
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects the registration of a new ODBC driver.
references:
    - https://www.hexacorn.com/blog/2020/08/23/odbcconf-lolbin-trifecta/
falsepositives:
    - Likely
tags:
    - attack.persistence
date: '2023-05-23'
modified: '2023-08-17'
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: \SOFTWARE\ODBC\ODBCINST.INI\
        TargetObject|endswith: \Driver
    filter_main_sqlserver:
        TargetObject|contains: \SQL Server\
        Details: '%WINDIR%\System32\SQLSRV32.dll'
    filter_optional_office_access:
        TargetObject|contains: '\Microsoft Access '
        Details|startswith: C:\Progra
        Details|endswith: \ACEODBC.DLL
    filter_optional_office_excel:
        TargetObject|contains: \Microsoft Excel Driver
        Details|startswith: C:\Progra
        Details|endswith: \ACEODBC.DLL
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
