id: 25ffa65d-76d8-4da5-a832-3f2b0136e133
title: PUA - Sysinternal Tool Execution - Registry
status: test
level: low
description: Detects the execution of a Sysinternals Tool via the creation of the
    "accepteula" registry key
author: Markus Neis
date: '2017-08-28'
modified: '2023-02-07'
tags:
    - attack.resource-development
    - attack.t1588.002
references:
    - https://twitter.com/Moti_B/status/1008587936735035392
falsepositives:
    - Legitimate use of SysInternals tools
    - Programs that use the same Registry Key
taxonomy: sigma
logsource:
    category: registry_add
    product: windows
detection:
    selection:
        EventType: CreateKey
        TargetObject|endswith: \EulaAccepted
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_add
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: EventType
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
