id: d6c2ce7e-afb5-4337-9ca4-4b5254ed0565
title: WinSock2 Autorun Keys Modification
status: test
level: medium
description: Detects modification of autostart extensibility point (ASEP) in registry.
author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin,
    oscd.community, Tim Shelton, frack113 (split)
date: '2019-10-25'
modified: '2023-08-17'
tags:
    - attack.persistence
    - attack.t1547.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md
    - https://learn.microsoft.com/en-us/sysinternals/downloads/autoruns
    - https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d
fields:
    - SecurityID
    - ObjectName
    - OldValueType
    - NewValueType
falsepositives:
    - Legitimate software automatically (mostly, during installation) sets up autorun
        keys for legitimate reason
    - Legitimate administrator sets up autorun keys for legitimate reason
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''17f878b8-9968-4578-b814-c4217fc5768c''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    winsock_parameters_base:
        TargetObject|contains: \System\CurrentControlSet\Services\WinSock2\Parameters
    winsock_parameters:
        TargetObject|contains:
            - \Protocol_Catalog9\Catalog_Entries
            - \NameSpace_Catalog5\Catalog_Entries
    filter:
        Details: (Empty)
        Image|all:
            - C:\Windows\System32\MsiExec.exe
            - C:\Windows\syswow64\MsiExec.exe
    condition: winsock_parameters_base and winsock_parameters and not filter
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: '2025-11-13T20:22:05.819469+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:22:05.819469+00:00'
    detection_fields:
        -   source_field: TargetObject
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:22:05.819475+00:00'
        -   source_field: Details
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:22:05.819477+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:22:05.819478+00:00'
