id: fe20dda1-6f37-4379-bbe0-a98d400cae90
title: Potential Persistence Via Scrobj.dll COM Hijacking
status: test
level: medium
description: Detect use of scrobj.dll as this DLL looks for the ScriptletURL key to
    get the location of the script to execute
author: frack113
date: '2022-08-20'
modified: '2023-08-17'
tags:
    - attack.persistence
    - attack.t1546.015
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1546.015/T1546.015.md
falsepositives:
    - Legitimate use of the dll.
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|endswith: InprocServer32\(Default)
        Details: C:\WINDOWS\system32\scrobj.dll
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
