id: f674e36a-4b91-431e-8aef-f8a96c2aca35
title: CurrentControlSet Autorun Keys Modification
status: test
level: medium
description: Detects modification of autostart extensibility point (ASEP) in registry.
author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin,
    oscd.community, Tim Shelton, frack113 (split)
date: '2019-10-25'
modified: '2023-08-17'
tags:
    - attack.persistence
    - attack.t1547.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md
    - https://learn.microsoft.com/en-us/sysinternals/downloads/autoruns
    - https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d
fields:
    - SecurityID
    - ObjectName
    - OldValueType
    - NewValueType
falsepositives:
    - Legitimate software automatically (mostly, during installation) sets up autorun
        keys for legitimate reason
    - Legitimate administrator sets up autorun keys for legitimate reason
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''17f878b8-9968-4578-b814-c4217fc5768c''),
    type=<SigmaRelatedType.OBSOLETE: 4>)])'
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    system_control_base:
        TargetObject|contains: \SYSTEM\CurrentControlSet\Control
    system_control_keys:
        TargetObject|contains:
            - \Terminal Server\WinStations\RDP-Tcp\InitialProgram
            - \Terminal Server\Wds\rdpwd\StartupPrograms
            - \SecurityProviders\SecurityProviders
            - \SafeBoot\AlternateShell
            - \Print\Providers
            - \Print\Monitors
            - \NetworkProvider\Order
            - \Lsa\Notification Packages
            - \Lsa\Authentication Packages
            - \BootVerificationProgram\ImagePath
    filter_empty:
        Details: (Empty)
    filter_cutepdf:
        Image: C:\Windows\System32\spoolsv.exe
        TargetObject|contains: \Print\Monitors\CutePDF Writer Monitor
        Details:
            - cpwmon64_v40.dll
            - CutePDF Writer
    filter_onenote:
        Image: C:\Windows\System32\spoolsv.exe
        TargetObject|contains: Print\Monitors\Appmon\Ports\Microsoft.Office.OneNote_
        User|contains:
            - AUTHORI
            - AUTORI
    filter_poqexec:
        Image: C:\Windows\System32\poqexec.exe
        TargetObject|endswith: \NetworkProvider\Order\ProviderOrder
    filter_realvnc:
        Image: C:\Windows\System32\spoolsv.exe
        TargetObject|endswith: \Print\Monitors\MONVNC\Driver
        Details: VNCpm.dll
    condition: all of system_control_* and not 1 of filter_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: User
            target_table: null
            target_field: null
            mapped_at: null
