id: 973ef012-8f1a-4c40-93b4-7e659a5cd17f
title: Periodic Backup For System Registry Hives Enabled
status: experimental
level: medium
description: 'Detects the enabling of the "EnablePeriodicBackup" registry value. Once
    enabled, The OS will backup System registry hives on restarts to the "C:\Windows\System32\config\RegBack"
    folder. Windows creates a "RegIdleBackup" task to manage subsequent backups.

    Registry backup was a default behavior on Windows and was disabled as of "Windows
    10, version 1803".

    '
author: Nasreddine Bencherchali (Nextron Systems)
date: '2024-07-01'
tags:
    - attack.collection
    - attack.t1113
references:
    - https://learn.microsoft.com/en-us/troubleshoot/windows-client/installing-updates-features-roles/system-registry-no-backed-up-regback-folder
falsepositives:
    - Legitimate need for RegBack feature by administrators.
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|endswith: \Control\Session Manager\Configuration Manager\EnablePeriodicBackup
        Details: DWORD (0x00000001)
    condition: selection
ocsf_mapping:
    class_name: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
