title: UAC Disabled
id: 48437c39-9e5f-47fb-af95-3d663c3f2919
status: stable
level: medium
author: frack113
description: 'Detects when an attacker tries to disable User Account Control (UAC)
    by setting the registry value "EnableLUA" to 0.

    '
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/7e11e9b79583545f208a6dc3fa062f2ed443d999/atomics/T1548.002/T1548.002.md
falsepositives:
    - Unknown
tags:
    - attack.privilege-escalation
    - attack.defense-evasion
    - attack.t1548.002
date: '2022-01-05'
modified: '2024-05-10'
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: \Microsoft\Windows\CurrentVersion\Policies\System\EnableLUA
        Details: DWORD (0x00000000)
    condition: selection
related:
    -   id: c5f6a85d-b647-40f7-bbad-c10b66bab038
        type: similar
    -   id: 0d7ceeef-3539-4392-8953-3dc664912714
        type: similar
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
