id: c7dcacd0-cc59-4004-b0a4-1d6cdebe6f3e
title: Disable Administrative Share Creation at Startup
status: test
level: medium
description: Administrative shares are hidden network shares created by Microsoft
    Windows NT operating systems that grant system administrators remote access to
    every disk volume on a network-connected system
author: frack113
date: '2022-01-16'
modified: '2024-03-25'
tags:
    - attack.defense-evasion
    - attack.t1070.005
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.005/T1070.005.md#atomic-test-4---disable-administrative-share-creation-at-startup
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: \Services\LanmanServer\Parameters\
        TargetObject|endswith:
            - \AutoShareWks
            - \AutoShareServer
        Details: DWORD (0x00000000)
    condition: selection
ocsf_mapping:
    class_name: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
