title: Potential Persistence Via Shim Database Modification
id: dfb5b4e8-91d0-4291-b40a-e3b0d3942c45
status: test
level: medium
author: frack113
description: 'Adversaries may establish persistence and/or elevate privileges by executing
    malicious content triggered by application shims.

    The Microsoft Windows Application Compatibility Infrastructure/Framework (Application
    Shim) was created to allow for backward compatibility of software as the operating
    system codebase changes over time

    '
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.011/T1546.011.md#atomic-test-3---registry-key-creation-andor-modification-events-for-sdb
    - https://www.fireeye.com/blog/threat-research/2017/05/fin7-shim-databases-persistence.html
    - https://andreafortuna.org/2018/11/12/process-injection-and-persistence-using-application-shimming/
falsepositives:
    - Legitimate custom SHIM installations will also trigger this rule
tags:
    - attack.persistence
    - attack.t1546.011
date: '2021-12-30'
modified: '2023-08-17'
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains:
            - \SOFTWARE\Microsoft\Windows NT\CurrentVersion\AppCompatFlags\InstalledSDB\
            - \SOFTWARE\Microsoft\Windows NT\CurrentVersion\AppCompatFlags\Custom\
    filter_main_empty:
        Details: ''
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
