id: 5de03871-5d46-4539-a82d-3aa992a69a83
title: Registry Disable System Restore
status: test
level: high
description: Detects the modification of the registry to disable a system restore
    on the computer
author: frack113
date: '2022-04-04'
modified: '2023-08-17'
tags:
    - attack.impact
    - attack.t1490
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md#atomic-test-9---disable-system-restore-through-registry
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains:
            - \Policies\Microsoft\Windows NT\SystemRestore
            - \Microsoft\Windows NT\CurrentVersion\SystemRestore
        TargetObject|endswith:
            - DisableConfig
            - DisableSR
        Details: DWORD (0x00000001)
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
