title: ClickOnce Trust Prompt Tampering
id: ac9159cc-c364-4304-8f0a-d63fc1a0aabb
status: test
level: medium
author: '@SerkinValery, Nasreddine Bencherchali (Nextron Systems)'
description: Detects changes to the ClickOnce trust prompt registry key in order to
    enable an installation from different locations such as the Internet.
references:
    - https://posts.specterops.io/less-smartscreen-more-caffeine-ab-using-clickonce-for-trusted-code-execution-1446ea8051c5
    - https://learn.microsoft.com/en-us/visualstudio/deployment/how-to-configure-the-clickonce-trust-prompt-behavior
falsepositives:
    - Legitimate internal requirements.
tags:
    - attack.defense-evasion
    - attack.t1112
date: '2023-06-12'
modified: '2023-08-17'
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: \SOFTWARE\MICROSOFT\.NETFramework\Security\TrustManager\PromptingLevel\
        TargetObject|endswith:
            - \Internet
            - \LocalIntranet
            - \MyComputer
            - \TrustedSites
            - \UntrustedSites
        Details: Enabled
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
