id: 63647769-326d-4dde-a419-b925cc0caf42
title: Enable Microsoft Dynamic Data Exchange
status: test
level: medium
description: Enable Dynamic Data Exchange protocol (DDE) in all supported editions
    of Microsoft Word or Excel.
author: frack113
date: '2022-02-26'
modified: '2023-08-17'
tags:
    - attack.execution
    - attack.t1559.002
references:
    - https://msrc.microsoft.com/update-guide/vulnerability/ADV170021
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection_word:
        TargetObject|endswith: \Word\Security\AllowDDE
        Details:
            - DWORD (0x00000001)
            - DWORD (0x00000002)
    selection_excel:
        TargetObject|endswith:
            - \Excel\Security\DisableDDEServerLaunch
            - \Excel\Security\DisableDDEServerLookup
        Details: DWORD (0x00000000)
    condition: 1 of selection_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
