id: e4d22291-f3d5-4b78-9a0c-a1fbaf32a6a4
title: Potentially Suspicious ODBC Driver Registered
status: test
level: high
description: Detects the registration of a new ODBC driver where the driver is located
    in a potentially suspicious location
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-05-23'
modified: '2023-08-17'
tags:
    - attack.persistence
    - attack.t1003
references:
    - https://www.hexacorn.com/blog/2020/08/23/odbcconf-lolbin-trifecta/
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: \SOFTWARE\ODBC\ODBCINST.INI\
        TargetObject|endswith:
            - \Driver
            - \Setup
        Details|contains:
            - :\PerfLogs\
            - :\ProgramData\
            - :\Temp\
            - :\Users\Public\
            - :\Windows\Registration\CRMLog
            - :\Windows\System32\com\dmp\
            - :\Windows\System32\FxsTmp\
            - :\Windows\System32\Microsoft\Crypto\RSA\MachineKeys\
            - :\Windows\System32\spool\drivers\color\
            - :\Windows\System32\spool\PRINTERS\
            - :\Windows\System32\spool\SERVERS\
            - :\Windows\System32\Tasks_Migrated\
            - :\Windows\System32\Tasks\Microsoft\Windows\SyncCenter\
            - :\Windows\SysWOW64\com\dmp\
            - :\Windows\SysWOW64\FxsTmp\
            - :\Windows\SysWOW64\Tasks\Microsoft\Windows\PLA\System\
            - :\Windows\SysWOW64\Tasks\Microsoft\Windows\SyncCenter\
            - :\Windows\Tasks\
            - :\Windows\Temp\
            - :\Windows\Tracing\
            - \AppData\Local\Temp\
            - \AppData\Roaming\
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
