title: ScreenSaver Registry Key Set
id: 40b6e656-4e11-4c0c-8772-c1cc6dae34ce
status: test
level: medium
author: Jose Luis Sanchez Martinez (@Joseliyo_Jstnk)
description: Detects registry key established after masqueraded .scr file execution
    using Rundll32 through desk.cpl
references:
    - https://twitter.com/VakninHai/status/1517027824984547329
    - https://twitter.com/pabraeken/status/998627081360695297
    - https://jstnk9.github.io/jstnk9/research/InstallScreenSaver-SCR-files
falsepositives:
    - Legitimate use of screen saver
tags:
    - attack.defense-evasion
    - attack.t1218.011
date: '2022-05-04'
modified: '2023-08-17'
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        Image|endswith: \rundll32.exe
    registry:
        TargetObject|contains: \Control Panel\Desktop\SCRNSAVE.EXE
        Details|endswith: .scr
    filter:
        Details|contains:
            - C:\Windows\System32\
            - C:\Windows\SysWOW64\
    condition: selection and registry and not filter
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
