id: 1a5c46e9-f32f-42f7-b2bc-6e9084db7fbf
title: Trust Access Disable For VBApplications
status: test
level: high
description: Detects registry changes to Microsoft Office "AccessVBOM" to a value
    of "1" which disables trust access for VBA on the victim machine and lets attackers
    execute malicious macros without any Microsoft Office warnings.
author: Trent Liffick (@tliffick), Nasreddine Bencherchali (Nextron Systems)
date: '2020-05-22'
modified: '2023-08-17'
tags:
    - attack.defense-evasion
    - attack.t1112
references:
    - https://twitter.com/inversecos/status/1494174785621819397
    - https://www.mcafee.com/blogs/other-blogs/mcafee-labs/zloader-with-a-new-infection-technique/
    - https://securelist.com/scarcruft-surveilling-north-korean-defectors-and-human-rights-activists/105074/
falsepositives:
    - Unlikely
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''a166f74e-bf44-409d-b9ba-ea4b2dd8b3cd''),
    type=<SigmaRelatedType.OBSOLETE: 4>)])'
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|endswith: \Security\AccessVBOM
        Details: DWORD (0x00000001)
    condition: selection
ocsf_mapping:
    class_name: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
