id: d67572a0-e2ec-45d6-b8db-c100d14b8ef2
title: NetNTLM Downgrade Attack - Registry
status: test
level: high
description: Detects NetNTLM downgrade attack
author: Florian Roth (Nextron Systems), wagga, Nasreddine Bencherchali (Splunk STRT)
date: '2018-03-20'
modified: '2024-12-03'
tags:
    - attack.defense-evasion
    - attack.t1562.001
    - attack.t1112
references:
    - https://web.archive.org/web/20171113231705/https://www.optiv.com/blog/post-exploitation-using-netntlm-downgrade-attacks
    - https://www.ultimatewindowssecurity.com/wiki/page.aspx?spid=NSrpcservers
falsepositives:
    - Services or tools that set the values to more restrictive values
taxonomy: sigma
logsource:
    category: registry_event
    product: windows
detection:
    selection_regkey:
        TargetObject|contains|all:
            - SYSTEM\
            - ControlSet
            - \Control\Lsa
    selection_value_lmcompatibilitylevel:
        TargetObject|endswith: \lmcompatibilitylevel
        Details:
            - DWORD (0x00000000)
            - DWORD (0x00000001)
            - DWORD (0x00000002)
    selection_value_ntlmminclientsec:
        TargetObject|endswith: \NtlmMinClientSec
        Details:
            - DWORD (0x00000000)
            - DWORD (0x00000010)
            - DWORD (0x00000020)
            - DWORD (0x00000030)
    selection_value_restrictsendingntlmtraffic:
        TargetObject|endswith: \RestrictSendingNTLMTraffic
    condition: selection_regkey and 1 of selection_value_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_event
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
