id: bbf59793-6efb-4fa1-95ca-a7d288e52c88
title: Winlogon Notify Key Logon Persistence
status: test
level: high
description: 'Adversaries may abuse features of Winlogon to execute DLLs and/or executables
    when a user logs in.

    Winlogon.exe is a Windows component responsible for actions at logon/logoff as
    well as the secure attention sequence (SAS) triggered by Ctrl-Alt-Delete.

    '
author: frack113
date: '2021-12-30'
modified: '2023-08-17'
tags:
    - attack.persistence
    - attack.t1547.004
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.004/T1547.004.md#atomic-test-3---winlogon-notify-key-logon-persistence---powershell
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|endswith: \SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon\Notify\logon
        Details|endswith: .dll
    condition: selection
ocsf_mapping:
    class_name: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
