id: 8b9606c9-28be-4a38-b146-0e313cc232c1
title: Potential Ransomware Activity Using LegalNotice Message
status: test
level: high
description: Detect changes to the "LegalNoticeCaption" or "LegalNoticeText" registry
    values where the message set contains keywords often used in ransomware ransom
    messages
author: frack113
date: '2022-12-11'
modified: '2023-08-17'
tags:
    - attack.impact
    - attack.t1491.001
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/5c1e6f1b4fafd01c8d1ece85f510160fc1275fbf/atomics/T1491.001/T1491.001.md
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains:
            - \SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\LegalNoticeCaption
            - \SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\LegalNoticeText
        Details|contains:
            - encrypted
            - Unlock-Password
            - paying
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
