title: Add Port Monitor Persistence in Registry
id: 944e8941-f6f6-4ee8-ac05-1c224e923c0e
status: experimental
level: medium
author: frack113
description: 'Adversaries may use port monitors to run an attacker supplied DLL during
    system boot for persistence or privilege escalation.

    A port monitor can be set through the AddMonitor API call to set a DLL to be loaded
    at startup.

    '
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.010/T1547.010.md
falsepositives:
    - Unknown
tags:
    - attack.persistence
    - attack.t1547.010
date: '2021-12-30'
modified: '2024-03-25'
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: \Control\Print\Monitors\
        Details|endswith: .dll
    filter_optional_cutepdf:
        Image: C:\Windows\System32\spoolsv.exe
        TargetObject|contains: \Control\Print\Monitors\CutePDF Writer Monitor v4.0\Driver
        Details: cpwmon64_v40.dll
        User|contains:
            - AUTHORI
            - AUTORI
    filter_optional_monvnc:
        TargetObject|contains: \Control\Print\Monitors\MONVNC\Driver
    filter_optional_vnc:
        TargetObject|contains|all:
            - Control\Print\Environments\
            - \Drivers\
            - \VNC Printer
    condition: selection and not 1 of filter_optional_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: User
            target_table: null
            target_field: null
            mapped_at: null
