id: 5aad0995-46ab-41bd-a9ff-724f41114971
title: Esentutl Volume Shadow Copy Service Keys
status: test
level: high
description: Detects the volume shadow copy service initialization and processing
    via esentutl. Registry keys such as HKLM\\System\\CurrentControlSet\\Services\\VSS\\Diag\\VolSnap\\Volume
    are captured.
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: '2020-10-20'
modified: '2022-12-25'
tags:
    - attack.credential-access
    - attack.t1003.002
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003.002/T1003.002.md#atomic-test-3---esentutlexe-sam-copy
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: registry_event
    product: windows
detection:
    selection:
        TargetObject|contains: System\CurrentControlSet\Services\VSS
        Image|endswith: esentutl.exe
    filter:
        TargetObject|contains: System\CurrentControlSet\Services\VSS\Start
    condition: selection and not filter
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: registry_event
            mapped_at: '2025-11-13T20:22:12.013692+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:22:12.013692+00:00'
    detection_fields:
        -   source_field: TargetObject
            target_table: process_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:22:12.013700+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:22:12.013701+00:00'
