id: 0442defa-b4a2-41c9-ae2c-ea7042fc4701
title: Potential Credential Dumping Attempt Using New NetworkProvider - REG
status: test
level: medium
description: Detects when an attacker tries to add a new network provider in order
    to dump clear text credentials, similar to how the NPPSpy tool does it
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-08-23'
modified: '2023-08-17'
tags:
    - attack.credential-access
    - attack.t1003
references:
    - https://learn.microsoft.com/en-us/troubleshoot/windows-client/setup-upgrade-and-drivers/network-provider-settings-removed-in-place-upgrade
    - https://github.com/gtworek/PSBits/tree/master/PasswordStealing/NPPSpy
falsepositives:
    - Other legitimate network providers used and not filtred in this rule
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''baef1ec6-2ca9-47a3-97cc-4cf2bda10b77''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains|all:
            - \System\CurrentControlSet\Services\
            - \NetworkProvider
    filter:
        TargetObject|contains:
            - \System\CurrentControlSet\Services\WebClient\NetworkProvider
            - \System\CurrentControlSet\Services\LanmanWorkstation\NetworkProvider
            - \System\CurrentControlSet\Services\RDPNP\NetworkProvider
    filter_valid_procs:
        Image: C:\Windows\System32\poqexec.exe
    condition: selection and not 1 of filter*
ocsf_mapping:
    class_name: process_activity
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: '2025-11-13T20:22:05.906132+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:22:05.906132+00:00'
    detection_fields:
        -   source_field: TargetObject
            target_table: process_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:22:05.906139+00:00'
        -   source_field: Image
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:22:05.906141+00:00'
