id: 2f78da12-f7c7-430b-8b19-a28f269b77a3
title: Disable Windows Event Logging Via Registry
status: experimental
level: high
description: Detects tampering with the "Enabled" registry key in order to disable
    Windows logging of a Windows event channel
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: '2022-07-04'
modified: '2024-03-25'
tags:
    - attack.defense-evasion
    - attack.t1562.002
references:
    - https://twitter.com/WhichbufferArda/status/1543900539280293889
    - https://github.com/DebugPrivilege/CPP/blob/c39d365617dbfbcb01fffad200d52b6239b2918c/Windows%20Defender/RestoreDefenderConfig.cpp
falsepositives:
    - Rare falsepositives may occur from legitimate administrators disabling specific
        event log for troubleshooting
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: \Microsoft\Windows\CurrentVersion\WINEVT\Channels\
        TargetObject|endswith: \Enabled
        Details: DWORD (0x00000000)
    filter_main_wevutil:
        Image: C:\Windows\system32\wevtutil.exe
    filter_main_iis:
        Image|startswith: C:\Windows\winsxs\
        Image|endswith: \TiWorker.exe
    filter_main_svchost:
        Image: C:\Windows\System32\svchost.exe
        TargetObject|contains:
            - \Microsoft\Windows\CurrentVersion\WINEVT\Channels\Microsoft-Windows-FileInfoMinifilter
            - \Microsoft\Windows\CurrentVersion\WINEVT\Channels\Microsoft-Windows-ASN1\
            - \Microsoft\Windows\CurrentVersion\WINEVT\Channels\Microsoft-Windows-Kernel-AppCompat\
            - \Microsoft\Windows\CurrentVersion\WINEVT\Channels\Microsoft-Windows-Runtime\Error\
            - \Microsoft\Windows\CurrentVersion\WINEVT\Channels\Microsoft-Windows-CAPI2/Operational\
    filter_main_trusted_installer:
        Image: C:\Windows\servicing\TrustedInstaller.exe
        TargetObject|contains: \Microsoft\Windows\CurrentVersion\WINEVT\Channels\Microsoft-Windows-Compat-Appraiser
    filter_optional_empty:
        Image: ''
    filter_optional_null:
        Image: null
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: file_activity
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: '2025-11-13T20:22:05.871238+00:00'
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:22:05.871238+00:00'
    detection_fields:
        -   source_field: TargetObject
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-13T20:22:05.871246+00:00'
        -   source_field: Details
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:22:05.871248+00:00'
        -   source_field: Image
            target_table: file_activity
            target_field: process.name
            mapped_at: '2025-11-13T20:22:05.871249+00:00'
