id: 8023f872-3f1d-4301-a384-801889917ab4
title: Usage of Renamed Sysinternals Tools - RegistrySet
status: test
level: high
description: Detects non-sysinternals tools setting the "accepteula" key which normally
    is set on sysinternals tool execution
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-08-24'
modified: '2023-08-17'
tags:
    - attack.resource-development
    - attack.t1588.002
references:
    - Internal Research
falsepositives:
    - Unlikely
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''25ffa65d-76d8-4da5-a832-3f2b0136e133''),
    type=<SigmaRelatedType.DERIVED: 2>), SigmaRelatedItem(id=UUID(''f50f3c09-557d-492d-81db-9064a8d4e211''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains:
            - \PsExec
            - \ProcDump
            - \Handle
            - \LiveKd
            - \Process Explorer
            - \PsLoglist
            - \PsPasswd
            - \Active Directory Explorer
        TargetObject|endswith: \EulaAccepted
    filter_main_image_names:
        Image|endswith:
            - \PsExec.exe
            - \PsExec64.exe
            - \procdump.exe
            - \procdump64.exe
            - \handle.exe
            - \handle64.exe
            - \livekd.exe
            - \livekd64.exe
            - \procexp.exe
            - \procexp64.exe
            - \psloglist.exe
            - \psloglist64.exe
            - \pspasswd.exe
            - \pspasswd64.exe
            - \ADExplorer.exe
            - \ADExplorer64.exe
    filter_optional_null:
        Image: null
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Image
            target_table: null
            target_field: null
            mapped_at: null
