id: c90362e0-2df3-4e61-94fe-b37615814cb1
title: Potential Persistence Via Netsh Helper DLL - Registry
status: test
level: medium
description: 'Detects changes to the Netsh registry key to add a new DLL value. This
    change might be an indication of a potential persistence attempt by adding a malicious
    Netsh helper

    '
author: Anish Bogati
date: '2023-11-28'
tags:
    - attack.persistence
    - attack.t1546.007
references:
    - https://www.ired.team/offensive-security/persistence/t1128-netsh-helper-dll
    - https://pentestlab.blog/2019/10/29/persistence-netsh-helper-dll/
falsepositives:
    - Legitimate helper added by different programs and the OS
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''56321594-9087-49d9-bf10-524fe8479452''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''e7b18879-676e-4a0e-ae18-27039185a8e7''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: \SOFTWARE\Microsoft\NetSh
        Details|contains: .dll
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: registry_set
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: TargetObject
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Details
            target_table: null
            target_field: null
            mapped_at: null
