id: 56fda488-113e-4ce9-8076-afc2457922c3
title: Possible DCSync Attack
status: test
level: high
description: Detects remote RPC calls to MS-DRSR from non DC hosts, which could indicate
    DCSync / DCShadow attacks.
author: Sagie Dulce, Dekel Paz
date: '2022-01-01'
modified: '2022-01-01'
tags:
    - attack.t1033
    - attack.discovery
references:
    - https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-drsr/f977faaa-673e-4f66-b9bf-48c640241d47?redirectedfrom=MSDN
    - https://github.com/jsecurity101/MSRPC-to-ATTACK/blob/ddd4608fe8684fcf2fcf9b48c5f0b3c28097f8a3/documents/MS-DRSR.md
    - https://github.com/zeronetworks/rpcfirewall
    - https://zeronetworks.com/blog/stopping-lateral-movement-via-the-rpc-firewall/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: application
    product: rpc_firewall
    definition: 'Requirements: install and apply the RPC Firewall to all processes,
        enable DRSR UUID (e3514235-4b06-11d1-ab04-00c04fc2dcd2) for "dangerous" opcodes
        (not 0,1 or 12) only from trusted IPs (DCs)'
detection:
    selection:
        EventLog: RPCFW
        EventID: 3
        InterfaceUuid: e3514235-4b06-11d1-ab04-00c04fc2dcd2
    filter:
        OpNum:
            - 0
            - 1
            - 12
    condition: selection and not filter
ocsf_mapping:
    class_name: network_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: application
            mapped_at: '2025-11-26T02:23:20.599354+00:00'
        product:
            source_field: product
            source_value: rpc_firewall
            mapped_at: '2025-11-26T02:23:20.599354+00:00'
    detection_fields:
        -   source_field: EventLog
            target_table: network_activity
            target_field: metadata.log_provider
            mapped_at: '2025-11-26T02:23:20.599370+00:00'
        -   source_field: EventID
            target_table: network_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:23:20.599372+00:00'
        -   source_field: InterfaceUuid
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:23:20.599373+00:00'
        -   source_field: OpNum
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:23:20.599374+00:00'
