id: 7f7c49eb-2977-4ac8-8ab0-ab1bae14730e
title: Remote Schedule Task Recon via ITaskSchedulerService
status: test
level: high
description: Detects remote RPC calls to read information about scheduled tasks
author: Sagie Dulce, Dekel Paz
date: '2022-01-01'
modified: '2022-01-01'
tags:
    - attack.discovery
references:
    - https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-tsch/d1058a28-7e02-4948-8b8d-4a347fa64931
    - https://github.com/jsecurity101/MSRPC-to-ATTACK/blob/ddd4608fe8684fcf2fcf9b48c5f0b3c28097f8a3/documents/MS-TSCH.md
    - https://github.com/zeronetworks/rpcfirewall
    - https://zeronetworks.com/blog/stopping-lateral-movement-via-the-rpc-firewall/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: application
    product: rpc_firewall
    definition: 'Requirements: install and apply the RPC Firewall to all processes
        with "audit:true action:block uuid:86d35949-83c9-4044-b424-db363231fd0c"'
detection:
    selection:
        EventLog: RPCFW
        EventID: 3
        InterfaceUuid: 86d35949-83c9-4044-b424-db363231fd0c
    filter:
        OpNum:
            - 1
            - 3
            - 4
            - 10
            - 11
            - 12
            - 13
            - 14
            - 15
    condition: selection and not filter
ocsf_mapping:
    class_name: network_activity
    activity_id: UNMAPPED
    logsource:
        category:
            source_field: category
            source_value: application
            mapped_at: '2025-11-26T02:23:17.294717+00:00'
        product:
            source_field: product
            source_value: rpc_firewall
            mapped_at: '2025-11-26T02:23:17.294717+00:00'
    detection_fields:
        -   source_field: EventLog
            target_table: network_activity
            target_field: metadata.log_provider
            mapped_at: '2025-11-26T02:23:17.294735+00:00'
        -   source_field: EventID
            target_table: network_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:23:17.294738+00:00'
        -   source_field: InterfaceUuid
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:23:17.294740+00:00'
        -   source_field: OpNum
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:23:17.294742+00:00'
