id: 0a3ff354-93fc-4273-8a03-1078782de5b7
title: Recon Activity via SASec
status: test
level: high
description: Detects remote RPC calls to read information about scheduled tasks via
    SASec
author: Sagie Dulce, Dekel Paz
date: '2022-01-01'
modified: '2022-11-17'
tags:
    - attack.discovery
references:
    - https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-tsch/d1058a28-7e02-4948-8b8d-4a347fa64931
    - https://github.com/jsecurity101/MSRPC-to-ATTACK/blob/ddd4608fe8684fcf2fcf9b48c5f0b3c28097f8a3/documents/MS-TSCH.md
    - https://github.com/zeronetworks/rpcfirewall
    - https://zeronetworks.com/blog/stopping-lateral-movement-via-the-rpc-firewall/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: application
    product: rpc_firewall
    definition: 'Requirements: install and apply the RPC Firewall to all processes
        with "audit:true action:block uuid:378e52b0-c0a9-11cf-822d-00aa0051e40f"'
detection:
    selection:
        EventLog: RPCFW
        EventID: 3
        InterfaceUuid: 378e52b0-c0a9-11cf-822d-00aa0051e40f
    filter:
        OpNum:
            - 0
            - 1
    condition: selection and not filter
ocsf_mapping:
    class_name: null
    logsource:
        category:
            source_field: category
            source_value: application
            mapped_at: null
        product:
            source_field: product
            source_value: rpc_firewall
            mapped_at: null
    detection_fields:
        -   source_field: EventLog
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: InterfaceUuid
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: OpNum
            target_table: null
            target_field: null
            mapped_at: null
