title: Remote Registry Recon
id: d8ffe17e-04be-4886-beb9-c1dd1944b9a8
status: test
level: high
author: Sagie Dulce, Dekel Paz
description: Detects remote RPC calls to collect information
references:
    - https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-rrp/0fa3191d-bb79-490a-81bd-54c2601b7a78
    - https://github.com/jsecurity101/MSRPC-to-ATTACK/blob/ddd4608fe8684fcf2fcf9b48c5f0b3c28097f8a3/documents/MS-RRP.md
    - https://github.com/zeronetworks/rpcfirewall
    - https://zeronetworks.com/blog/stopping-lateral-movement-via-the-rpc-firewall/
falsepositives:
    - Remote administration of registry values
tags:
    - attack.discovery
date: '2022-01-01'
modified: '2022-01-01'
logsource:
    category: application
    product: rpc_firewall
    definition: 'Requirements: install and apply the RPC Firewall to all processes
        with "audit:true action:block uuid:338cd001-2244-31f1-aaaa-900038001003"'
detection:
    selection:
        EventLog: RPCFW
        EventID: 3
        InterfaceUuid: 338cd001-2244-31f1-aaaa-900038001003
    filter:
        OpNum:
            - 6
            - 7
            - 8
            - 13
            - 18
            - 19
            - 21
            - 22
            - 23
            - 35
    condition: selection and not filter
ocsf_mapping:
    class_name: network_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: application
            mapped_at: '2025-12-04T01:39:42.756081+00:00'
        product:
            source_field: product
            source_value: rpc_firewall
            mapped_at: '2025-12-04T01:39:42.756081+00:00'
    detection_fields:
        -   source_field: EventLog
            target_table: network_activity
            target_field: metadata.log_provider
            mapped_at: '2025-12-04T01:39:42.756107+00:00'
        -   source_field: EventID
            target_table: network_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:39:42.756109+00:00'
        -   source_field: InterfaceUuid
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:39:42.756110+00:00'
        -   source_field: OpNum
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:39:42.756112+00:00'
