title: Remote Event Log Recon
id: 2053961f-44c7-4a64-b62d-f6e72800af0d
status: test
level: high
author: Sagie Dulce, Dekel Paz
description: Detects remote RPC calls to get event log information via EVEN or EVEN6
references:
    - https://github.com/zeronetworks/rpcfirewall
    - https://zeronetworks.com/blog/stopping-lateral-movement-via-the-rpc-firewall/
falsepositives:
    - Remote administrative tasks on Windows Events
tags:
    - attack.discovery
date: '2022-01-01'
modified: '2022-01-01'
logsource:
    category: application
    product: rpc_firewall
    definition: 'Requirements: install and apply the RPC Firewall to all processes
        with "audit:true action:block uuid:82273fdc-e32a-18c3-3f78-827929dc23ea and
        uuid:f6beaff7-1e19-4fbb-9f8f-b89e2018337c"'
detection:
    selection:
        EventLog: RPCFW
        EventID: 3
        InterfaceUuid:
            - 82273fdc-e32a-18c3-3f78-827929dc23ea
            - f6beaff7-1e19-4fbb-9f8f-b89e2018337c
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: application
            mapped_at: null
        product:
            source_field: product
            source_value: rpc_firewall
            mapped_at: null
    detection_fields:
        -   source_field: EventLog
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: InterfaceUuid
            target_table: null
            target_field: null
            mapped_at: null
