id: 10018e73-06ec-46ec-8107-9172f1e04ff2
title: Remote Server Service Abuse for Lateral Movement
status: test
level: high
description: Detects remote RPC calls to possibly abuse remote encryption service
    via MS-EFSR
author: Sagie Dulce, Dekel Paz
date: '2022-01-01'
modified: '2022-01-01'
tags:
    - attack.lateral-movement
    - attack.t1569.002
references:
    - https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-srvs/accf23b0-0f57-441c-9185-43041f1b0ee9
    - https://github.com/jsecurity101/MSRPC-to-ATTACK/blob/ddd4608fe8684fcf2fcf9b48c5f0b3c28097f8a3/documents/MS-SCMR.md
    - https://github.com/zeronetworks/rpcfirewall
    - https://zeronetworks.com/blog/stopping-lateral-movement-via-the-rpc-firewall/
falsepositives:
    - Administrative tasks on remote services
taxonomy: sigma
logsource:
    category: application
    product: rpc_firewall
    definition: 'Requirements: install and apply the RPC Firewall to all processes
        with "audit:true action:block uuid:367abb81-9844-35f1-ad32-98f038001003'
detection:
    selection:
        EventLog: RPCFW
        EventID: 3
        InterfaceUuid: 367abb81-9844-35f1-ad32-98f038001003
    condition: selection
ocsf_mapping:
    class_name: network_activity
    logsource:
        category:
            source_field: category
            source_value: application
            mapped_at: '2025-11-13T20:18:22.812229+00:00'
        product:
            source_field: product
            source_value: rpc_firewall
            mapped_at: '2025-11-13T20:18:22.812229+00:00'
    detection_fields:
        -   source_field: EventLog
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:18:22.812239+00:00'
        -   source_field: EventID
            target_table: network_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:18:22.812242+00:00'
        -   source_field: InterfaceUuid
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:18:22.812247+00:00'
