id: f177f2bc-5f3e-4453-b599-57eefce9a59c
title: Remote Schedule Task Recon via AtScv
status: test
level: high
description: Detects remote RPC calls to read information about scheduled tasks via
    AtScv
author: Sagie Dulce, Dekel Paz
date: '2022-01-01'
modified: '2022-01-01'
tags:
    - attack.discovery
references:
    - https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-tsch/d1058a28-7e02-4948-8b8d-4a347fa64931
    - https://github.com/zeronetworks/rpcfirewall
    - https://github.com/jsecurity101/MSRPC-to-ATTACK/blob/ddd4608fe8684fcf2fcf9b48c5f0b3c28097f8a3/documents/MS-TSCH.md
    - https://zeronetworks.com/blog/stopping-lateral-movement-via-the-rpc-firewall/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: application
    product: rpc_firewall
    definition: 'Requirements: install and apply the RPC Firewall to all processes
        with "audit:true action:block uuid:1ff70682-0a51-30e8-076d-740be8cee98b"'
detection:
    selection:
        EventLog: RPCFW
        EventID: 3
        InterfaceUuid: 1ff70682-0a51-30e8-076d-740be8cee98b
    filter:
        OpNum:
            - 0
            - 1
    condition: selection and not filter
ocsf_mapping:
    class_name: network_activity
    activity_id: UNMAPPED
    logsource:
        category:
            source_field: category
            source_value: application
            mapped_at: '2025-11-26T02:23:17.937973+00:00'
        product:
            source_field: product
            source_value: rpc_firewall
            mapped_at: '2025-11-26T02:23:17.937973+00:00'
    detection_fields:
        -   source_field: EventLog
            target_table: network_activity
            target_field: metadata.log_provider
            mapped_at: '2025-11-26T02:23:17.937989+00:00'
        -   source_field: EventID
            target_table: network_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:23:17.937992+00:00'
        -   source_field: InterfaceUuid
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:23:17.937993+00:00'
        -   source_field: OpNum
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:23:17.937995+00:00'
