id: 6d580420-ff3f-4e0e-b6b0-41b90c787e28
title: SharpHound Recon Sessions
status: test
level: high
description: Detects remote RPC calls useb by SharpHound to map remote connections
    and local group membership.
author: Sagie Dulce, Dekel Paz
date: '2022-01-01'
modified: '2022-01-01'
tags:
    - attack.t1033
references:
    - https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-srvs/02b1f559-fda2-4ba3-94c2-806eb2777183
    - https://github.com/jsecurity101/MSRPC-to-ATTACK/blob/ddd4608fe8684fcf2fcf9b48c5f0b3c28097f8a3/documents/MS-SRVS.md
    - https://github.com/zeronetworks/rpcfirewall
    - https://zeronetworks.com/blog/stopping-lateral-movement-via-the-rpc-firewall/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: application
    product: rpc_firewall
    definition: 'Requirements: install and apply the RPC Firewall to all processes
        with "audit:true action:block uuid:4b324fc8-1670-01d3-1278-5a47bf6ee188 opnum:12'
detection:
    selection:
        EventLog: RPCFW
        EventID: 3
        InterfaceUuid: 4b324fc8-1670-01d3-1278-5a47bf6ee188
        OpNum: 12
    condition: selection
ocsf_mapping:
    class_name: network_activity
    activity_id: UNMAPPED
    logsource:
        category:
            source_field: category
            source_value: application
            mapped_at: '2025-11-26T02:23:21.076043+00:00'
        product:
            source_field: product
            source_value: rpc_firewall
            mapped_at: '2025-11-26T02:23:21.076043+00:00'
    detection_fields:
        -   source_field: EventLog
            target_table: network_activity
            target_field: metadata.log_provider
            mapped_at: '2025-11-26T02:23:21.076062+00:00'
        -   source_field: EventID
            target_table: network_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:23:21.076064+00:00'
        -   source_field: InterfaceUuid
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:23:21.076065+00:00'
        -   source_field: OpNum
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:23:21.076066+00:00'
