id: 5f92fff9-82e2-48eb-8fc1-8b133556a551
title: Remote Encrypting File System Abuse
status: test
level: high
description: Detects remote RPC calls to possibly abuse remote encryption service
    via MS-EFSR
author: Sagie Dulce, Dekel Paz
date: '2022-01-01'
modified: '2022-01-01'
tags:
    - attack.lateral-movement
references:
    - https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-36942
    - https://github.com/jsecurity101/MSRPC-to-ATTACK/blob/ddd4608fe8684fcf2fcf9b48c5f0b3c28097f8a3/documents/MS-EFSR.md
    - https://github.com/zeronetworks/rpcfirewall
    - https://zeronetworks.com/blog/stopping-lateral-movement-via-the-rpc-firewall/
falsepositives:
    - Legitimate usage of remote file encryption
taxonomy: sigma
logsource:
    category: application
    product: rpc_firewall
    definition: 'Requirements: install and apply the RPC Firewall to all processes
        with "audit:true action:block uuid:df1941c5-fe89-4e79-bf10-463657acf44d or
        c681d488-d850-11d0-8c52-00c04fd90f7e'
detection:
    selection:
        EventLog: RPCFW
        EventID: 3
        InterfaceUuid:
            - df1941c5-fe89-4e79-bf10-463657acf44d
            - c681d488-d850-11d0-8c52-00c04fd90f7e
    condition: selection
ocsf_mapping:
    class_name: network_activity
    logsource:
        category:
            source_field: category
            source_value: application
            mapped_at: '2025-11-13T20:18:22.799560+00:00'
        product:
            source_field: product
            source_value: rpc_firewall
            mapped_at: '2025-11-13T20:18:22.799560+00:00'
    detection_fields:
        -   source_field: EventLog
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:18:22.799568+00:00'
        -   source_field: EventID
            target_table: network_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:18:22.799571+00:00'
        -   source_field: InterfaceUuid
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:18:22.799573+00:00'
