title: Sysmon File Executable Creation Detected
id: 693a44e9-7f26-4cb6-b787-214867672d3a
status: test
level: medium
author: frack113
description: Triggers on any Sysmon "FileExecutableDetected" event, which triggers
    every time a PE that is monitored by the config is created.
references:
    - https://learn.microsoft.com/en-us/sysinternals/downloads/sysmon
    - https://medium.com/@olafhartong/sysmon-15-0-file-executable-detected-40fd64349f36
falsepositives:
    - Unlikely
tags:
    - attack.defense-evasion
date: '2023-07-20'
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 29
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: sysmon
            mapped_at: null
    detection_fields:
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
