id: 83844185-1c5b-45bc-bcf3-b5bf3084ca5b
title: Suspicious Encoded Scripts in a WMI Consumer
status: test
level: high
description: Detects suspicious encoded payloads in WMI Event Consumers
author: Florian Roth (Nextron Systems)
date: '2021-09-01'
modified: '2022-10-09'
tags:
    - attack.execution
    - attack.t1047
    - attack.persistence
    - attack.t1546.003
references:
    - https://github.com/RiccardoAncarani/LiquidSnake
fields:
    - User
    - Operation
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: wmi_event
    product: windows
detection:
    selection_destination:
        Destination|base64offset|contains:
            - WriteProcessMemory
            - This program cannot be run in DOS mode
            - This program must be run under Win32
    condition: selection_destination
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: wmi_event
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Destination
            target_table: null
            target_field: null
            mapped_at: null
