title: Suspicious Scripting in a WMI Consumer
id: fe21810c-2a8c-478f-8dd3-5a287fb2a0e0
status: test
level: high
author: Florian Roth (Nextron Systems), Jonhnathan Ribeiro
description: Detects suspicious commands that are related to scripting/powershell
    in WMI Event Consumers
references:
    - https://in.security/an-intro-into-abusing-and-identifying-wmi-event-subscriptions-for-persistence/
    - https://github.com/Neo23x0/signature-base/blob/615bf1f6bac3c1bdc417025c40c073e6c2771a76/yara/gen_susp_lnk_files.yar#L19
    - https://github.com/RiccardoAncarani/LiquidSnake
fields:
    - User
    - Operation
falsepositives:
    - Legitimate administrative scripts
tags:
    - attack.execution
    - attack.t1059.005
date: '2019-04-15'
modified: '2023-09-09'
logsource:
    category: wmi_event
    product: windows
detection:
    selection_destination:
        Destination|contains|all:
            - new-object
            - net.webclient
            - .downloadstring
            - new-object
            - net.webclient
            - .downloadfile
        Destination|contains:
            - ' iex('
            - ' -nop '
            - ' -noprofile '
            - ' -decode '
            - ' -enc '
            - WScript.Shell
            - System.Security.Cryptography.FromBase64Transform
    condition: selection_destination
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: wmi_event
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: Destination
            target_table: null
            target_field: null
            mapped_at: null
