id: 0f06a3a5-6a09-413f-8743-e6cf35561297
title: WMI Event Subscription
status: test
level: medium
description: Detects creation of WMI event subscription persistence method
author: Tom Ueltschi (@c_APT_ure)
date: '2019-01-12'
modified: '2021-11-27'
tags:
    - attack.persistence
    - attack.t1546.003
references:
    - https://learn.microsoft.com/en-us/sysinternals/downloads/sysmon#event-id-19-wmievent-wmieventfilter-activity-detected
    - https://learn.microsoft.com/en-us/sysinternals/downloads/sysmon#event-id-20-wmievent-wmieventconsumer-activity-detected
    - https://learn.microsoft.com/en-us/sysinternals/downloads/sysmon#event-id-21-wmievent-wmieventconsumertofilter-activity-detected
falsepositives:
    - Exclude legitimate (vetted) use of WMI event subscription in your network
taxonomy: sigma
logsource:
    category: wmi_event
    product: windows
detection:
    selection:
        EventID:
            - 19
            - 20
            - 21
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        category:
            source_field: category
            source_value: wmi_event
            mapped_at: null
        product:
            source_field: product
            source_value: windows
            mapped_at: null
    detection_fields:
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
