title: Sysmon Blocked File Shredding
id: c3e5c1b1-45e9-4632-b242-27939c170239
status: test
level: high
author: frack113
description: Triggers on any Sysmon "FileBlockShredding" event, which indicates a
    violation of the configured shredding policy.
references:
    - https://learn.microsoft.com/en-us/sysinternals/downloads/sysmon
falsepositives:
    - Unlikely
tags:
    - attack.defense-evasion
date: '2023-07-20'
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 28
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: sysmon
            mapped_at: null
    detection_fields:
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
