id: 65354b83-a2ea-4ea6-8414-3ab38be0d409
title: Cross Site Scripting Strings
status: test
level: high
description: Detects XSS attempts injected via GET requests in access logs
author: Saw Win Naung, Nasreddine Bencherchali
date: '2021-08-15'
modified: '2022-06-14'
tags:
    - attack.initial-access
    - attack.t1189
references:
    - https://github.com/payloadbox/xss-payload-list
    - https://portswigger.net/web-security/cross-site-scripting/contexts
fields:
    - client_ip
    - vhost
    - url
    - response
falsepositives:
    - JavaScripts,CSS Files and PNG files
    - User searches in search boxes of the respective website
    - Internal vulnerability scanners can cause some serious FPs when used, if you
        experience a lot of FPs due to this think of adding more filters such as "User
        Agent" strings and more response codes
taxonomy: sigma
logsource:
    category: webserver
detection:
    select_method:
        cs-method: GET
    keywords:
        - =<script>
        - =%3Cscript%3E
        - =%253Cscript%253E
        - '<iframe '
        - '%3Ciframe '
        - '<svg '
        - '%3Csvg '
        - document.cookie
        - document.domain
        - ' onerror='
        - ' onresize='
        - ' onload="'
        - onmouseover=
        - ${alert
        - javascript:alert
        - javascript%3Aalert
    filter:
        sc-status: 404
    condition: select_method and keywords and not filter
ocsf_mapping:
    class_name: http_activity
    activity_id: 3
    logsource:
        category:
            source_field: category
            source_value: webserver
            mapped_at: '2025-11-26T02:14:35.938183+00:00'
    detection_fields:
        -   source_field: cs-method
            target_table: http_activity
            target_field: http_request.http_method
            mapped_at: '2025-11-26T02:14:35.938203+00:00'
        -   source_field: sc-status
            target_table: http_activity
            target_field: http_response.status
            mapped_at: '2025-11-26T02:14:35.938207+00:00'
