title: F5 BIG-IP iControl Rest API Command Execution - Webserver
id: 85254a62-22be-4239-b79c-2ec17e566c37
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems), Thurein Oo
description: Detects POST requests to the F5 BIG-IP iControl Rest API "bash" endpoint,
    which allows the execution of commands on the BIG-IP
references:
    - https://f5-sdk.readthedocs.io/en/latest/apidoc/f5.bigip.tm.util.html#module-f5.bigip.tm.util.bash
    - https://community.f5.com/t5/technical-forum/icontrolrest-11-5-execute-bash-command/td-p/203029
    - https://community.f5.com/t5/technical-forum/running-bash-commands-via-rest-api/td-p/272516
falsepositives:
    - Legitimate usage of the BIG IP REST API to execute command for administration
        purposes
tags:
    - attack.execution
    - attack.t1190
date: '2023-11-08'
logsource:
    category: webserver
detection:
    selection:
        cs-method: POST
        cs-uri-query|endswith: /mgmt/tm/util/bash
    condition: selection
related:
    -   id: b59c98c6-95e8-4d65-93ee-f594dfb96b17
        type: similar
ocsf_mapping:
    class_name: http_activity
    activity_id: 6
    logsource:
        category:
            source_field: category
            source_value: webserver
            mapped_at: '2025-12-04T01:35:01.832357+00:00'
    detection_fields:
        -   source_field: cs-method
            target_table: http_activity
            target_field: http_request.http_method
            mapped_at: '2025-12-04T01:35:01.832375+00:00'
        -   source_field: cs-uri-query
            target_table: http_activity
            target_field: http_request.args
            mapped_at: '2025-12-04T01:35:01.832377+00:00'
