id: 5513deaf-f49a-46c2-a6c8-3f111b5cb453
title: SQL Injection Strings In URI
status: test
level: high
description: Detects potential SQL injection attempts via GET requests in access logs.
author: Saw Win Naung, Nasreddine Bencherchali (Nextron Systems), Thurein Oo (Yoma
    Bank)
date: '2020-02-22'
modified: '2023-09-04'
tags:
    - attack.initial-access
    - attack.t1190
references:
    - https://www.acunetix.com/blog/articles/exploiting-sql-injection-example/
    - https://www.acunetix.com/blog/articles/using-logs-to-investigate-a-web-application-attack/
    - https://brightsec.com/blog/sql-injection-payloads/
    - https://github.com/payloadbox/sql-injection-payload-list
    - https://book.hacktricks.xyz/pentesting-web/sql-injection/mysql-injection
falsepositives:
    - Java scripts and CSS Files
    - User searches in search boxes of the respective website
    - Internal vulnerability scanners can cause some serious FPs when used, if you
        experience a lot of FPs due to this think of adding more filters such as "User
        Agent" strings and more response codes
taxonomy: sigma
logsource:
    category: webserver
detection:
    selection:
        cs-method: GET
    keywords:
        - '@@version'
        - '%271%27%3D%271'
        - '=select '
        - =select(
        - =select%20
        - concat_ws(
        - CONCAT(0x
        - from mysql.innodb_table_stats
        - from%20mysql.innodb_table_stats
        - group_concat(
        - information_schema.tables
        - json_arrayagg(
        - or 1=1#
        - or%201=1#
        - 'order by '
        - order%20by%20
        - 'select * '
        - select database()
        - select version()
        - select%20*%20
        - select%20database()
        - select%20version()
        - select%28sleep%2810%29
        - SELECTCHAR(
        - table_schema
        - UNION ALL SELECT
        - UNION SELECT
        - UNION%20ALL%20SELECT
        - UNION%20SELECT
        - '''1''=''1'
    filter_main_status:
        sc-status: 404
    condition: selection and keywords and not 1 of filter_main_*
ocsf_mapping:
    class_name: http_activity
    activity_id: 3
    logsource:
        category:
            source_field: category
            source_value: webserver
            mapped_at: '2025-11-26T02:14:34.318969+00:00'
    detection_fields:
        -   source_field: cs-method
            target_table: http_activity
            target_field: http_request.http_method
            mapped_at: '2025-11-26T02:14:34.318981+00:00'
        -   source_field: sc-status
            target_table: http_activity
            target_field: http_response.status
            mapped_at: '2025-11-26T02:14:34.318983+00:00'
