id: 7ff9db12-1b94-4a79-ba68-a2402c5d6729
title: Windows Webshell Strings
status: test
level: high
description: Detects common commands used in Windows webshells
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: '2017-02-19'
modified: '2022-11-18'
tags:
    - attack.persistence
    - attack.t1505.003
references:
    - https://bad-jubies.github.io/RCE-NOW-WHAT/
    - https://m365internals.com/2022/10/07/hunting-in-on-premises-exchange-server-logs/
fields:
    - client_ip
    - vhost
    - url
    - response
falsepositives:
    - Web sites like wikis with articles on os commands and pages that include the
        os commands in the URLs
    - User searches in search boxes of the respective website
taxonomy: sigma
logsource:
    category: webserver
detection:
    selection_method:
        cs-method: GET
    selection_keywords:
        - =whoami
        - =net%20user
        - =net+user
        - =net%2Buser
        - =cmd%20/c%
        - =cmd+/c+
        - =cmd%2B/c%
        - =cmd%20/r%
        - =cmd+/r+
        - =cmd%2B/r%
        - =cmd%20/k%
        - =cmd+/k+
        - =cmd%2B/k%
        - =powershell%
        - =powershell+
        - =tasklist%
        - =tasklist+
        - =wmic%
        - =wmic+
        - =ssh%
        - =ssh+
        - =python%
        - =python+
        - =python3%
        - =python3+
        - =ipconfig
        - =wget%
        - =wget+
        - =curl%
        - =curl+
        - =certutil
        - =copy%20%5C%5C
        - =dsquery%
        - =dsquery+
        - =nltest%
        - =nltest+
    condition: all of selection_*
ocsf_mapping:
    class_name: http_activity
    logsource:
        category:
            source_field: category
            source_value: webserver
            mapped_at: '2025-11-13T20:14:36.928512+00:00'
    detection_fields:
        -   source_field: cs-method
            target_table: http_activity
            target_field: http_request.http_method
            mapped_at: '2025-11-13T20:14:36.928559+00:00'
