title: Suspicious Windows Strings In URI
id: 9f6a34b4-2688-4eb7-a7f5-e39fef573d0e
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects suspicious Windows strings in URI which could indicate possible
    exfiltration or webshell communication
references:
    - https://thedfirreport.com/2022/06/06/will-the-real-msiexec-please-stand-up-exploit-leads-to-data-exfiltration/
falsepositives:
    - Legitimate application and websites that use windows paths in their URL
tags:
    - attack.persistence
    - attack.exfiltration
    - attack.t1505.003
date: '2022-06-06'
modified: '2023-01-02'
logsource:
    category: webserver
detection:
    selection:
        cs-uri-query|contains:
            - =C:/Users
            - =C:/Program%20Files
            - =C:/Windows
            - =C%3A%5CUsers
            - =C%3A%5CProgram%20Files
            - =C%3A%5CWindows
    condition: selection
ocsf_mapping:
    class_name: http_activity
    activity_id: <UNMAPPED>
    logsource:
        category:
            source_field: category
            source_value: webserver
            mapped_at: '2025-12-04T01:35:00.795536+00:00'
    detection_fields:
        -   source_field: cs-uri-query
            target_table: http_activity
            target_field: http_request.args
            mapped_at: '2025-12-04T01:35:00.795548+00:00'
