id: 7cb02516-6d95-4ffc-8eee-162075e111ac
title: Successful IIS Shortname Fuzzing Scan
status: test
level: medium
description: When IIS uses an old .Net Framework it's possible to enumerate folders
    with the symbol "~"
author: frack113
date: '2021-10-06'
modified: '2023-01-02'
tags:
    - attack.initial-access
    - attack.t1190
references:
    - https://github.com/projectdiscovery/nuclei-templates/blob/9d2889356eebba661c8407038e430759dfd4ec31/fuzzing/iis-shortname.yaml
    - https://www.exploit-db.com/exploits/19525
    - https://github.com/lijiejie/IIS_shortname_Scanner
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    category: webserver
detection:
    selection:
        cs-uri-query|contains: ~1
        cs-uri-query|endswith: a.aspx
        cs-method:
            - GET
            - OPTIONS
        sc-status:
            - 200
            - 301
    condition: selection
ocsf_mapping:
    class_name: http_activity
    logsource:
        category:
            source_field: category
            source_value: webserver
            mapped_at: '2025-11-13T20:14:36.404223+00:00'
    detection_fields:
        -   source_field: cs-uri-query
            target_table: http_activity
            target_field: http_request.args
            mapped_at: '2025-11-13T20:14:36.404292+00:00'
        -   source_field: cs-method
            target_table: http_activity
            target_field: http_request.http_method
            mapped_at: '2025-11-13T20:14:36.404297+00:00'
        -   source_field: sc-status
            target_table: http_activity
            target_field: http_response.status
            mapped_at: '2025-11-13T20:14:36.404301+00:00'
