id: 12e6d621-194f-4f59-90cc-1959e21e69f7
title: Register new Logon Process by Rubeus
status: test
level: high
description: Detects potential use of Rubeus via registered new trusted logon process
author: Roberto Rodriguez (source), Ilyas Ochkov (rule), oscd.community
date: '2019-10-24'
modified: '2022-10-09'
tags:
    - attack.lateral-movement
    - attack.privilege-escalation
    - attack.credential-access
    - attack.t1558.003
references:
    - https://posts.specterops.io/hunting-in-active-directory-unconstrained-delegation-forests-trusts-71f2b33688e1
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4611
        LogonProcessName: User32LogonProcesss
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:22:54.479148+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-13T20:22:54.479148+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:22:55.793610+00:00'
        -   source_field: LogonProcessName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:22:55.793631+00:00'
