id: a27e5fa9-c35e-4e3d-b7e0-1ce2af66ad12
title: CSExec Service Installation
status: test
level: medium
description: Detects CSExec service installation and execution events
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-08-07'
tags:
    - attack.execution
    - attack.t1569.002
references:
    - https://github.com/malcomvetter/CSExec
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: windows
    service: system
detection:
    selection_eid:
        Provider_Name: Service Control Manager
        EventID: 7045
    selection_service:
        ServiceName: csexecsvc
        ImagePath|endswith: \csexecsvc.exe
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:48:29.515452+00:00'
        service:
            source_field: service
            source_value: system
            mapped_at: '2025-11-26T02:48:29.515452+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-11-26T02:48:29.515466+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:48:29.515468+00:00'
        -   source_field: ServiceName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:48:29.515470+00:00'
        -   source_field: ImagePath
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-11-26T02:48:29.515471+00:00'
