title: KDC RC4-HMAC Downgrade CVE-2022-37966
id: e6f81941-b1cd-4766-87db-9fc156f658ee
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects the exploitation of a security bypass and elevation of privilege
    vulnerability with Authentication Negotiation by using weak RC4-HMAC negotiation
references:
    - https://support.microsoft.com/en-us/topic/kb5021131-how-to-manage-the-kerberos-protocol-changes-related-to-cve-2022-37966-fd837ac3-cdec-4e76-a6ec-86e67501407d
falsepositives:
    - Unknown
tags:
    - attack.privilege-escalation
date: '2022-11-09'
logsource:
    product: windows
    service: system
detection:
    selection:
        EventID: 42
        Provider_Name: Kerberos-Key-Distribution-Center
        Level: 2
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: system
            mapped_at: null
    detection_fields:
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Provider_Name
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Level
            target_table: null
            target_field: null
            mapped_at: null
