id: 7ac407cc-0f48-4328-aede-de1d2e6fef41
title: Standard User In High Privileged Group
status: test
level: medium
description: Detect standard users login that are part of high privileged groups such
    as the Administrator group
author: frack113
date: '2023-01-13'
modified: '2023-05-05'
tags:
    - attack.credential-access
    - attack.privilege-escalation
references:
    - https://learn.microsoft.com/en-us/windows-server/identity/ad-ds/manage/understand-security-identifiers
    - https://learn.microsoft.com/en-us/windows-server/security/credentials-protection-and-management/configuring-additional-lsa-protection
    - https://github.com/nasbench/EVTX-ETW-Resources/blob/7a806a148b3d9d381193d4a80356016e6e8b1ee8/ETWProvidersManifests/Windows11/22H2/W11_22H2_Pro_20221220_22621.963/WEPExplorer/LsaSrv.xml
falsepositives:
    - Standard domain users who are part of the administrator group. These users shouldn't
        have these right. But in the case where it's necessary. They should be filtered
        out using the "TargetUserName" field
taxonomy: sigma
logsource:
    product: windows
    service: lsa-server
    definition: 'Requirements: Microsoft-Windows-LSA/Operational (199FE037-2B82-40A9-82AC-E1D46C792B99)
        Event Log must be enabled and collected in order to use this rule.'
detection:
    selection:
        EventID: 300
        TargetUserSid|startswith: S-1-5-21-
        SidList|contains:
            - S-1-5-32-544
            - -500}
            - -518}
            - -519}
    filter_main_admin:
        TargetUserSid|endswith:
            - '-500'
            - '-518'
            - '-519'
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: group_management
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:24:54.378052+00:00'
        service:
            source_field: service
            source_value: lsa-server
            mapped_at: '2025-11-13T20:24:54.378052+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: group_management
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:24:55.507464+00:00'
        -   source_field: TargetUserSid
            target_table: group_management
            target_field: actor.user.uid
            mapped_at: '2025-11-13T20:24:55.507479+00:00'
        -   source_field: SidList
            target_table: group_management
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:24:55.507482+00:00'
