id: 7ec15688-fd24-4177-ba43-1a950537ee39
title: The Windows Defender Firewall Service Failed To Load Group Policy
status: test
level: low
description: Detects activity when The Windows Defender Firewall service failed to
    load Group Policy
author: frack113
date: '2022-02-19'
modified: '2023-01-17'
tags:
    - attack.defense-evasion
    - attack.t1562.004
references:
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)
taxonomy: sigma
logsource:
    product: windows
    service: firewall-as
detection:
    selection:
        EventID: 2009
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:22:18.542310+00:00'
        service:
            source_field: service
            source_value: firewall-as
            mapped_at: '2025-11-13T20:22:18.542310+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:22:18.542319+00:00'
