id: 53ad8e36-f573-46bf-97e4-15ba5bf4bb51
title: Password Change on Directory Service Restore Mode (DSRM) Account
status: stable
level: high
description: 'Detects potential attempts made to set the Directory Services Restore
    Mode administrator password.

    The Directory Service Restore Mode (DSRM) account is a local administrator account
    on Domain Controllers.

    Attackers may change the password in order to obtain persistence.

    '
author: Thomas Patzke
date: '2017-02-19'
modified: '2020-08-23'
tags:
    - attack.persistence
    - attack.t1098
references:
    - https://adsecurity.org/?p=1714
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4794
falsepositives:
    - Initial installation of a domain controller.
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''b61e87c0-50db-4b2e-8986-6a2be94b33b0''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4794
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:23:57.941532+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-13T20:23:57.941532+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:23:57.941544+00:00'
