id: aaa5b30d-f418-420b-83a0-299cb6024885
title: Potential RDP Exploit CVE-2019-0708
status: test
level: medium
description: Detect suspicious error on protocol RDP, potential CVE-2019-0708
author: Lionel PRAT, Christophe BROCAS, @atc_project (improvements)
date: '2019-05-24'
modified: '2022-12-25'
tags:
    - attack.lateral-movement
    - attack.t1210
    - car.2013-07-002
references:
    - https://web.archive.org/web/20190710034152/https://github.com/zerosum0x0/CVE-2019-0708
    - https://github.com/Ekultek/BlueKeep
falsepositives:
    - Bad connections or network interruptions
taxonomy: sigma
logsource:
    product: windows
    service: system
detection:
    selection:
        EventID:
            - 56
            - 50
        Provider_Name: TermDD
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: system
            mapped_at: null
    detection_fields:
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Provider_Name
            target_table: null
            target_field: null
            mapped_at: null
