title: MSSQL Server Failed Logon
id: 218d2855-2bba-4f61-9c85-81d0ea63ac71
status: experimental
level: low
author: Nasreddine Bencherchali (Nextron Systems), j4son
description: Detects failed logon attempts from clients to MSSQL server.
references:
    - https://cybersecthreat.com/2020/07/08/enable-mssql-authentication-log-to-eventlog/
    - https://www.experts-exchange.com/questions/27800944/EventID-18456-Failed-to-open-the-explicitly-specified-database.html
falsepositives:
    - This event could stem from users changing an account's password that's used
        to authenticate via a job or an automated process. Investigate the source
        of such events and mitigate them
tags:
    - attack.credential-access
    - attack.t1110
date: '2023-10-11'
modified: '2024-06-26'
logsource:
    product: windows
    service: application
    definition: 'Requirements: Must enable MSSQL authentication.'
detection:
    selection:
        Provider_Name|contains: MSSQL
        EventID: 18456
    condition: selection
related:
    -   id: ebfe73c2-5bc9-4ed9-aaa8-8b54b2b4777d
        type: similar
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: application
            mapped_at: null
    detection_fields:
        -   source_field: Provider_Name
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
