id: 39698b3f-da92-4bc6-bfb5-645a98386e45
title: Win Susp Computer Name Containing Samtheadmin
status: test
level: critical
description: Detects suspicious computer name samtheadmin-{1..100}$ generated by hacktool
author: elhoim
date: '2022-09-09'
modified: '2023-01-04'
tags:
    - cve.2021-42278
    - cve.2021-42287
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1078
references:
    - https://twitter.com/malmoeb/status/1511760068743766026
    - https://github.com/WazeHell/sam-theadmin/blob/main/sam_the_admin.py
    - https://github.com/helloexp/0day/blob/614227a7b9beb0e91e7e2c6a5e532e6f7a8e883c/00-CVE_EXP/CVE-2021-42287/sam-the-admin/sam_the_admin.py
fields:
    - EventID
    - SamAccountName
    - SubjectUserName
    - TargetUserName
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: windows
    service: security
detection:
    selection1:
        SamAccountName|startswith: SAMTHEADMIN-
        SamAccountName|endswith: $
    selection2:
        TargetUserName|startswith: SAMTHEADMIN-
        TargetUserName|endswith: $
    condition: 1 of selection*
ocsf_mapping:
    class_name: authentication
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:44:44.196627+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-26T02:44:44.196627+00:00'
    detection_fields:
        -   source_field: SamAccountName
            target_table: authentication
            target_field: actor.user.name
            mapped_at: '2025-11-26T02:44:45.114742+00:00'
        -   source_field: TargetUserName
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:44:45.114754+00:00'
