title: Invoke-Obfuscation STDIN+ Launcher - System
id: 72862bf2-0eb1-11eb-adc1-0242ac120002
status: test
level: high
author: Jonathan Cheong, oscd.community
description: Detects Obfuscated use of stdin to execute PowerShell
references:
    - https://github.com/SigmaHQ/sigma/issues/1009
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
date: '2020-10-15'
modified: '2022-11-29'
logsource:
    product: windows
    service: system
detection:
    selection_main:
        Provider_Name: Service Control Manager
        EventID: 7045
        ImagePath|contains|all:
            - cmd
            - powershell
        ImagePath|contains:
            - /c
            - /r
    selection_other:
        ImagePath|contains: noexit
        ImagePath|contains|all:
            - input
            - $
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:57:14.807149+00:00'
        service:
            source_field: service
            source_value: system
            mapped_at: '2025-12-04T01:57:14.807149+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-12-04T01:57:14.807176+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:57:14.807179+00:00'
        -   source_field: ImagePath
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-12-04T01:57:14.807181+00:00'
