id: ecbc5e16-58e0-4521-9c60-eb9a7ea4ad34
title: Meterpreter or Cobalt Strike Getsystem Service Installation - Security
status: test
level: high
description: Detects the use of getsystem Meterpreter/Cobalt Strike command by detecting
    a specific service installation
author: Teymur Kheirkhabarov, Ecco, Florian Roth (Nextron Systems)
date: '2019-10-26'
modified: '2023-11-15'
tags:
    - attack.privilege-escalation
    - attack.t1134.001
    - attack.t1134.002
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
    - https://blog.cobaltstrike.com/2014/04/02/what-happens-when-i-type-getsystem/
falsepositives:
    - Unlikely
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''843544a7-56e0-4dcc-a44f-5cc266dd97d6''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    product: windows
    service: security
    definition: The 'System Security Extension' audit subcategory need to be enabled
        to log the EID 4697
detection:
    selection_eid:
        EventID: 4697
    selection_cli_cmd:
        ServiceFileName|contains|all:
            - /c
            - echo
            - \pipe\
        ServiceFileName|contains:
            - cmd
            - '%COMSPEC%'
    selection_cli_rundll:
        ServiceFileName|contains|all:
            - rundll32
            - .dll,a
            - '/p:'
    selection_cli_share:
        ServiceFileName|startswith: \\127.0.0.1\ADMIN$\
    condition: selection_eid and 1 of selection_cli_*
ocsf_mapping:
    class_name: process_activity
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:43:47.614941+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-26T02:43:47.614941+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:43:48.512003+00:00'
        -   source_field: ServiceFileName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:43:48.512028+00:00'
