id: 13acf386-b8c6-4fe0-9a6e-c4756b974698
title: Remote PowerShell Sessions Network Connections (WinRM)
status: test
level: high
description: Detects basic PowerShell Remoting (WinRM) by monitoring for network inbound
    connections to ports 5985 OR 5986
author: Roberto Rodriguez @Cyb3rWard0g
date: '2019-09-12'
modified: '2022-10-09'
tags:
    - attack.execution
    - attack.t1059.001
references:
    - https://threathunterplaybook.com/hunts/windows/190511-RemotePwshExecution/notebook.html
falsepositives:
    - Legitimate use of remote PowerShell execution
taxonomy: sigma
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 5156
        DestPort:
            - 5985
            - 5986
        LayerRTID: 44
    condition: selection
ocsf_mapping:
    class_name: network_activity
    activity_id: 1
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:45:03.499840+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-26T02:45:03.499840+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: network_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:45:06.094652+00:00'
        -   source_field: DestPort
            target_table: network_activity
            target_field: dst_endpoint.port
            mapped_at: '2025-11-26T02:45:06.094673+00:00'
        -   source_field: LayerRTID
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:45:06.094676+00:00'
