title: Password Protected ZIP File Opened (Suspicious Filenames)
id: 54f0434b-726f-48a1-b2aa-067df14516e4
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects the extraction of password protected ZIP archives with suspicious
    file names. See the filename variable for more details on which file has been
    opened.
references:
    - https://twitter.com/sbousseaden/status/1523383197513379841
falsepositives:
    - Legitimate used of encrypted ZIP files
tags:
    - attack.command-and-control
    - attack.defense-evasion
    - attack.t1027
    - attack.t1105
    - attack.t1036
date: '2022-05-09'
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 5379
        TargetName|contains: Microsoft_Windows_Shell_ZipFolder:filename
    selection_filename:
        TargetName|contains:
            - invoice
            - new order
            - rechnung
            - factura
            - delivery
            - purchase
            - order
            - payment
    condition: selection and selection_filename
ocsf_mapping:
    class_name: file_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:55:58.188804+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-12-04T01:55:58.188804+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: file_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:55:58.188829+00:00'
        -   source_field: TargetName
            target_table: file_activity
            target_field: file.name
            mapped_at: '2025-12-04T01:55:58.188833+00:00'
