title: Hidden Local User Creation
id: 7b449a5e-1db5-4dd0-a2dc-4e3a67282538
status: test
level: high
author: Christian Burkard (Nextron Systems)
description: Detects the creation of a local hidden user account which should not
    happen for event ID 4720.
references:
    - https://twitter.com/SBousseaden/status/1387743867663958021
falsepositives:
    - Unknown
tags:
    - attack.persistence
    - attack.t1136.001
date: '2021-05-03'
modified: '2024-01-16'
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4720
        TargetUserName|endswith: $
    filter_main_homegroup:
        TargetUserName: HomeGroupUser$
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: account_change
    activity_id: 1
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:55:15.981541+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-12-04T01:55:15.981541+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: account_change
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:55:15.981566+00:00'
        -   source_field: TargetUserName
            target_table: account_change
            target_field: user_result.name
            mapped_at: '2025-12-04T01:55:15.981570+00:00'
