id: a8f29a7b-b137-4446-80a0-b804272f3da2
title: Persistence and Execution at Scale via GPO Scheduled Task
status: test
level: high
description: Detect lateral movement using GPO scheduled task, usually used to deploy
    ransomware at scale
author: Samir Bousseaden
date: '2019-04-03'
modified: '2024-09-04'
tags:
    - attack.persistence
    - attack.lateral-movement
    - attack.t1053.005
references:
    - https://twitter.com/menasec1/status/1106899890377052160
    - https://www.secureworks.com/blog/ransomware-as-a-distraction
    - https://www.elastic.co/guide/en/security/7.17/prebuilt-rule-0-16-1-scheduled-task-execution-at-scale-via-gpo.html
falsepositives:
    - If the source IP is not localhost then it's super suspicious, better to monitor
        both local and remote changes to GPO scheduled tasks.
taxonomy: sigma
logsource:
    product: windows
    service: security
    definition: The advanced audit policy setting "Object Access > Audit Detailed
        File Share" must be configured for Success/Failure
detection:
    selection_5136:
        EventID: 5136
        AttributeLDAPDisplayName:
            - gPCMachineExtensionNames
            - gPCUserExtensionNames
        AttributeValue|contains:
            - CAB54552-DEEA-4691-817E-ED4A4D1AFC72
            - AADCED64-746C-4633-A97C-D61349046527
    selection_5145:
        EventID: 5145
        ShareName|endswith: \SYSVOL
        RelativeTargetName|endswith: ScheduledTasks.xml
        AccessList|contains:
            - WriteData
            - '%%4417'
    condition: 1 of selection_*
ocsf_mapping:
    class_name: scheduled_job_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:43:55.277932+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-26T02:43:55.277932+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: scheduled_job_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:43:56.922243+00:00'
        -   source_field: AttributeLDAPDisplayName
            target_table: scheduled_job_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:43:56.922251+00:00'
        -   source_field: AttributeValue
            target_table: scheduled_job_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:43:56.922252+00:00'
        -   source_field: ShareName
            target_table: scheduled_job_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:43:56.922253+00:00'
        -   source_field: RelativeTargetName
            target_table: scheduled_job_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:43:56.922254+00:00'
        -   source_field: AccessList
            target_table: scheduled_job_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:43:56.922256+00:00'
