title: RottenPotato Like Attack Pattern
id: 16f5d8ca-44bd-47c8-acbe-6fc95a16c12f
status: test
level: high
author: '@SBousseaden, Florian Roth'
description: Detects logon events that have characteristics of events generated during
    an attack with RottenPotato and the like
references:
    - https://twitter.com/SBousseaden/status/1195284233729777665
falsepositives:
    - Unknown
tags:
    - attack.privilege-escalation
    - attack.credential-access
    - attack.t1557.001
date: '2019-11-15'
modified: '2022-12-22'
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4624
        LogonType: 3
        TargetUserName: ANONYMOUS LOGON
        WorkstationName: '-'
        IpAddress:
            - 127.0.0.1
            - ::1
    condition: selection
ocsf_mapping:
    class_name: network_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:56:48.810995+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-12-04T01:56:48.810995+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: network_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:56:48.811014+00:00'
        -   source_field: LogonType
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:56:48.811017+00:00'
        -   source_field: TargetUserName
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:56:48.811019+00:00'
        -   source_field: WorkstationName
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:56:48.811021+00:00'
        -   source_field: IpAddress
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:56:48.811022+00:00'
