title: Windows Firewall Settings Have Been Changed
id: 00bb5bd5-1379-4fcf-a965-a5b6f7478064
status: test
level: low
author: frack113, Nasreddine Bencherchali (Nextron Systems)
description: Detects activity when the settings of the Windows firewall have been
    changed
references:
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)
tags:
    - attack.defense-evasion
    - attack.t1562.004
date: '2022-02-19'
modified: '2023-04-21'
logsource:
    product: windows
    service: firewall-as
detection:
    selection:
        EventID:
            - 2002
            - 2083
            - 2003
            - 2082
            - 2008
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: firewall-as
            mapped_at: null
    detection_fields:
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
