title: Outgoing Logon with New Credentials
id: def8b624-e08f-4ae1-8612-1ba21190da6b
status: test
level: low
author: Max Altgelt (Nextron Systems)
description: Detects logon events that specify new credentials
references:
    - https://go.recordedfuture.com/hubfs/reports/mtp-2021-0914.pdf
falsepositives:
    - Legitimate remote administration activity
tags:
    - attack.defense-evasion
    - attack.lateral-movement
    - attack.t1550
date: '2022-04-06'
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4624
        LogonType: 9
    condition: selection
ocsf_mapping:
    class_name: authentication
    activity_id: 1
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:56:49.413476+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-12-04T01:56:49.413476+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: authentication
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:56:49.413500+00:00'
        -   source_field: LogonType
            target_table: authentication
            target_field: logon_type
            mapped_at: '2025-12-04T01:56:49.413502+00:00'
