id: 8b48ad89-10d8-4382-a546-50588c410f0d
title: Suspicious Remote AppX Package Locations
status: experimental
level: high
description: 'Detects an appx package added to the pipeline of the "to be processed"
    packages which was downloaded from a suspicious domain.

    '
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-01-11'
modified: '2024-08-22'
tags:
    - attack.defense-evasion
references:
    - Internal Research
    - https://www.sentinelone.com/labs/inside-malicious-windows-apps-for-malware-deployment/
    - https://learn.microsoft.com/en-us/windows/win32/appxpkg/troubleshooting
    - https://news.sophos.com/en-us/2021/11/11/bazarloader-call-me-back-attack-abuses-windows-10-apps-mechanism/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: windows
    service: appxdeployment-server
detection:
    selection:
        EventID: 854
        Path|contains:
            - .githubusercontent.com
            - anonfiles.com
            - cdn.discordapp.com
            - ddns.net
            - dl.dropboxusercontent.com
            - ghostbin.co
            - glitch.me
            - gofile.io
            - hastebin.com
            - mediafire.com
            - mega.nz
            - onrender.com
            - pages.dev
            - paste.ee
            - pastebin.com
            - pastebin.pl
            - pastetext.net
            - privatlab.com
            - privatlab.net
            - send.exploit.in
            - sendspace.com
            - storage.googleapis.com
            - storjshare.io
            - supabase.co
            - temp.sh
            - transfer.sh
            - trycloudflare.com
            - ufile.io
            - w3spaces.com
            - workers.dev
    condition: selection
ocsf_mapping:
    class_name: scheduled_job_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:47:21.760303+00:00'
        service:
            source_field: service
            source_value: appxdeployment-server
            mapped_at: '2025-11-26T02:47:21.760303+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: scheduled_job_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:47:21.760325+00:00'
        -   source_field: Path
            target_table: scheduled_job_activity
            target_field: job.file.path
            mapped_at: '2025-11-26T02:47:21.760327+00:00'
