title: Local Privilege Escalation Indicator TabTip
id: bc2e25ed-b92b-4daa-b074-b502bdd1982b
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects the invocation of TabTip via CLSID as seen when JuicyPotatoNG
    is used on a system in brute force mode
references:
    - https://github.com/antonioCoco/JuicyPotatoNG
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1557.001
date: '2022-10-07'
modified: '2023-04-14'
logsource:
    product: windows
    service: system
detection:
    selection:
        Provider_Name: Microsoft-Windows-DistributedCOM
        EventID: 10001
        param1: C:\Program Files\Common Files\microsoft shared\ink\TabTip.exe
        param2: 2147943140
        param3: '{054AAE20-4BEA-4347-8A35-64A533254A9D}'
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: system
            mapped_at: null
    detection_fields:
        -   source_field: Provider_Name
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: param1
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: param2
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: param3
            target_table: null
            target_field: null
            mapped_at: null
