id: 6ae53108-c3a0-4bee-8f45-c7591a2c337f
title: Deployment AppX Package Was Blocked By AppLocker
status: test
level: medium
description: Detects an appx package deployment that was blocked by AppLocker policy
author: frack113
date: '2023-01-11'
tags:
    - attack.defense-evasion
references:
    - https://learn.microsoft.com/en-us/windows/win32/appxpkg/troubleshooting
    - https://github.com/nasbench/EVTX-ETW-Resources/blob/7a806a148b3d9d381193d4a80356016e6e8b1ee8/ETWEventsList/CSV/Windows11/22H2/W11_22H2_Pro_20220920_22621.382/Providers/Microsoft-Windows-AppXDeployment-Server.csv
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: windows
    service: appxdeployment-server
detection:
    selection:
        EventID: 412
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:24:50.519735+00:00'
        service:
            source_field: service
            source_value: appxdeployment-server
            mapped_at: '2025-11-13T20:24:50.519735+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:24:50.519741+00:00'
