title: SCM Database Privileged Operation
id: dae8171c-5ec6-4396-b210-8466585b53e9
status: test
level: medium
author: Roberto Rodriguez @Cyb3rWard0g, Tim Shelton
description: Detects non-system users performing privileged operation os the SCM database
references:
    - https://threathunterplaybook.com/hunts/windows/190826-RemoteSCMHandle/notebook.html
falsepositives:
    - Unknown
tags:
    - attack.privilege-escalation
    - attack.t1548
date: '2019-08-15'
modified: '2022-09-18'
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4674
        ObjectType: SC_MANAGER OBJECT
        ObjectName: servicesactive
        PrivilegeList: SeTakeOwnershipPrivilege
    filter:
        SubjectLogonId: '0x3e4'
        ProcessName|endswith: :\Windows\System32\services.exe
    condition: selection and not filter
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:56:08.885772+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-12-04T01:56:08.885772+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:56:08.885789+00:00'
        -   source_field: ObjectType
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:56:08.885790+00:00'
        -   source_field: ObjectName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:56:08.885792+00:00'
        -   source_field: PrivilegeList
            target_table: process_activity
            target_field: device.groups.privileges
            mapped_at: '2025-12-04T01:56:08.885793+00:00'
        -   source_field: SubjectLogonId
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:56:08.885795+00:00'
        -   source_field: ProcessName
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:56:08.885796+00:00'
