id: 401e5d00-b944-11ea-8f9a-00163ecd60ae
title: File Was Not Allowed To Run
status: test
level: medium
description: Detect run not allowed files. Applocker is a very useful tool, especially
    on servers where unprivileged users have access. For example terminal servers.
    You need configure applocker and log collect to receive these events.
author: Pushkarev Dmitry
date: '2020-06-28'
modified: '2021-11-27'
tags:
    - attack.execution
    - attack.t1204.002
    - attack.t1059.001
    - attack.t1059.003
    - attack.t1059.005
    - attack.t1059.006
    - attack.t1059.007
references:
    - https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/applocker/what-is-applocker
    - https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/applocker/using-event-viewer-with-applocker
    - https://nxlog.co/documentation/nxlog-user-guide/applocker.html
fields:
    - PolicyName
    - RuleId
    - RuleName
    - TargetUser
    - TargetProcessId
    - FilePath
    - FileHash
    - Fqbn
falsepositives:
    - Need tuning applocker or add exceptions in SIEM
taxonomy: sigma
logsource:
    product: windows
    service: applocker
detection:
    selection:
        EventID:
            - 8004
            - 8007
            - 8022
            - 8025
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:22:12.612015+00:00'
        service:
            source_field: service
            source_value: applocker
            mapped_at: '2025-11-13T20:22:12.612015+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:22:12.612025+00:00'
