id: 218d2855-2bba-4f61-9c85-81d0ea63ac71
title: MSSQL Server Failed Logon
status: experimental
level: low
description: Detects failed logon attempts from clients to MSSQL server.
author: Nasreddine Bencherchali (Nextron Systems), j4son
date: '2023-10-11'
modified: '2024-06-26'
tags:
    - attack.credential-access
    - attack.t1110
references:
    - https://cybersecthreat.com/2020/07/08/enable-mssql-authentication-log-to-eventlog/
    - https://www.experts-exchange.com/questions/27800944/EventID-18456-Failed-to-open-the-explicitly-specified-database.html
falsepositives:
    - This event could stem from users changing an account's password that's used
        to authenticate via a job or an automated process. Investigate the source
        of such events and mitigate them
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''ebfe73c2-5bc9-4ed9-aaa8-8b54b2b4777d''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    product: windows
    service: application
    definition: 'Requirements: Must enable MSSQL authentication.'
detection:
    selection:
        Provider_Name|contains: MSSQL
        EventID: 18456
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:25:47.327186+00:00'
        service:
            source_field: service
            source_value: application
            mapped_at: '2025-11-13T20:25:47.327186+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-11-13T20:25:47.327193+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:25:47.327194+00:00'
