id: 496a0e47-0a33-4dca-b009-9e6ca3591f39
title: Suspicious Kerberos RC4 Ticket Encryption
status: test
level: medium
description: Detects service ticket requests using RC4 encryption type
author: Florian Roth (Nextron Systems)
date: '2017-02-06'
modified: '2022-06-19'
tags:
    - attack.credential-access
    - attack.t1558.003
references:
    - https://adsecurity.org/?p=3458
    - https://www.trimarcsecurity.com/single-post/TrimarcResearch/Detecting-Kerberoasting-Activity
falsepositives:
    - Service accounts used on legacy systems (e.g. NetApp)
    - Windows Domains with DFL 2003 and legacy systems
taxonomy: sigma
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4769
        TicketOptions: '0x40810000'
        TicketEncryptionType: '0x17'
    reduction:
        ServiceName|endswith: $
    condition: selection and not reduction
ocsf_mapping:
    class_name: authentication
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:23:28.968434+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-13T20:23:28.968434+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: authentication
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:23:31.358389+00:00'
        -   source_field: TicketOptions
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:23:31.358415+00:00'
        -   source_field: TicketEncryptionType
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:23:31.358420+00:00'
        -   source_field: ServiceName
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:23:31.358423+00:00'
