id: 00ba9da1-b510-4f6b-b258-8d338836180f
title: Password Protected ZIP File Opened
status: test
level: medium
description: Detects the extraction of password protected ZIP archives. See the filename
    variable for more details on which file has been opened.
author: Florian Roth (Nextron Systems)
date: '2022-05-09'
tags:
    - attack.defense-evasion
    - attack.t1027
references:
    - https://twitter.com/sbousseaden/status/1523383197513379841
falsepositives:
    - Legitimate used of encrypted ZIP files
taxonomy: sigma
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 5379
        TargetName|contains: Microsoft_Windows_Shell_ZipFolder:filename
    filter:
        TargetName|contains: \Temporary Internet Files\Content.Outlook
    condition: selection and not filter
ocsf_mapping:
    class_name: file_activity
    activity_id: 2
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:45:46.200723+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-26T02:45:46.200723+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: file_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:45:46.200740+00:00'
        -   source_field: TargetName
            target_table: file_activity
            target_field: file.name
            mapped_at: '2025-11-26T02:45:46.200743+00:00'
