id: 91c945bc-2ad1-4799-a591-4d00198a1215
title: Suspicious Access to Sensitive File Extensions
status: test
level: medium
description: Detects known sensitive file extensions accessed on a network share
author: Samir Bousseaden
date: '2019-04-03'
modified: '2022-10-09'
tags:
    - attack.collection
    - attack.t1039
references:
    - Internal Research
falsepositives:
    - Help Desk operator doing backup or re-imaging end user machine or backup software
    - Users working with these data types or exchanging message files
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''286b47ed-f6fe-40b3-b3a8-35129acd43bc''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 5145
        RelativeTargetName|endswith:
            - .bak
            - .dmp
            - .edb
            - .kirbi
            - .msg
            - .nsf
            - .nst
            - .oab
            - .ost
            - .pst
            - .rdp
            - \groups.xml
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 2
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:46:07.985016+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-26T02:46:07.985016+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: file_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:46:07.985030+00:00'
        -   source_field: RelativeTargetName
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-26T02:46:07.985032+00:00'
