id: c43c26be-2e87-46c7-8661-284588c5a53e
title: A Member Was Added to a Security-Enabled Global Group
status: stable
level: low
description: Detects activity when a member is added to a security-enabled global
    group
author: Alexandr Yampolskyi, SOC Prime
date: '2023-04-26'
tags:
    - attack.persistence
    - attack.t1098
references:
    - https://www.cisecurity.org/controls/cis-controls-list/
    - https://www.pcisecuritystandards.org/documents/PCI_DSS_v3-2-1.pdf
    - https://nvlpubs.nist.gov/nistpubs/CSWP/NIST.CSWP.04162018.pdf
    - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=4728
    - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=632
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''9cf01b6c-e723-4841-a868-6d7f8245ca6e''),
    type=<SigmaRelatedType.OBSOLETE: 4>)])'
taxonomy: sigma
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID:
            - 4728
            - 632
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:25:11.586671+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-13T20:25:11.586671+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:25:11.586695+00:00'
