title: Remote Utilities Host Service Install
id: 85cce894-dd8b-4427-a958-5cc47a4dc9b9
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects Remote Utilities Host service installation on the target system.
references:
    - https://www.remoteutilities.com/support/kb/host-service-won-t-start/
falsepositives:
    - Legitimate use of the tool
tags:
    - attack.persistence
date: '2022-10-31'
logsource:
    product: windows
    service: system
detection:
    selection_root:
        Provider_Name: Service Control Manager
        EventID: 7045
    selection_service:
        ImagePath|contains|all:
            - \rutserv.exe
            - -service
        ServiceName: Remote Utilities - Host
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:56:57.223243+00:00'
        service:
            source_field: service
            source_value: system
            mapped_at: '2025-12-04T01:56:57.223243+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-12-04T01:56:57.223257+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:56:57.223259+00:00'
        -   source_field: ImagePath
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-12-04T01:56:57.223261+00:00'
        -   source_field: ServiceName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:56:57.223262+00:00'
