id: c187c075-bb3e-4c62-b4fa-beae0ffc211f
title: A Rule Has Been Deleted From The Windows Firewall Exception List
status: test
level: medium
description: Detects when a single rules or all of the rules have been deleted from
    the Windows Defender Firewall
author: frack113
date: '2022-02-19'
modified: '2024-08-29'
tags:
    - attack.defense-evasion
    - attack.t1562.004
references:
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)
taxonomy: sigma
logsource:
    product: windows
    service: firewall-as
detection:
    selection:
        EventID:
            - 2006
            - 2052
    filter_main_generic:
        ModifyingApplication|startswith:
            - C:\Program Files (x86)\
            - C:\Program Files\
            - C:\Windows\WinSxS\
    filter_main_svchost:
        ModifyingApplication: C:\Windows\System32\svchost.exe
    filter_optional_msmpeng:
        ModifyingApplication|startswith: C:\ProgramData\Microsoft\Windows Defender\Platform\
        ModifyingApplication|endswith: \MsMpEng.exe
    filter_main_null:
        ModifyingApplication: null
    filter_main_empty:
        ModifyingApplication: ''
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: network_activity
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:43:20.826702+00:00'
        service:
            source_field: service
            source_value: firewall-as
            mapped_at: '2025-11-26T02:43:20.826702+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: network_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:43:20.826886+00:00'
        -   source_field: ModifyingApplication
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:43:20.826931+00:00'
