title: Suspicious Kerberos RC4 Ticket Encryption
id: 496a0e47-0a33-4dca-b009-9e6ca3591f39
status: test
level: medium
author: Florian Roth (Nextron Systems)
description: Detects service ticket requests using RC4 encryption type
references:
    - https://adsecurity.org/?p=3458
    - https://www.trimarcsecurity.com/single-post/TrimarcResearch/Detecting-Kerberoasting-Activity
falsepositives:
    - Service accounts used on legacy systems (e.g. NetApp)
    - Windows Domains with DFL 2003 and legacy systems
tags:
    - attack.credential-access
    - attack.t1558.003
date: '2017-02-06'
modified: '2022-06-19'
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4769
        TicketOptions: '0x40810000'
        TicketEncryptionType: '0x17'
    reduction:
        ServiceName|endswith: $
    condition: selection and not reduction
ocsf_mapping:
    class_name: authentication
    activity_id: 4
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:55:49.718337+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-12-04T01:55:49.718337+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: authentication
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:55:49.718378+00:00'
        -   source_field: TicketOptions
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:49.718382+00:00'
        -   source_field: TicketEncryptionType
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:49.718385+00:00'
        -   source_field: ServiceName
            target_table: authentication
            target_field: service.name
            mapped_at: '2025-12-04T01:55:49.718388+00:00'
