id: 614cf376-6651-47c4-9dcc-6b9527f749f4
title: Suspicious Scheduled Task Update
status: test
level: high
description: Detects update to a scheduled task event that contain suspicious keywords.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-12-05'
tags:
    - attack.execution
    - attack.privilege-escalation
    - attack.persistence
    - attack.t1053.005
references:
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4698
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''1c0e41cd-21bb-4433-9acc-4a2cd6367b9b''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    product: windows
    service: security
    definition: The Advanced Audit Policy setting Object Access > Audit Other Object
        Access Events has to be configured to allow this detection. We also recommend
        extracting the Command field from the embedded XML in the event data.
detection:
    selection_eid:
        EventID: 4702
    selection_paths:
        TaskContentNew|contains:
            - \AppData\Local\Temp\
            - \AppData\Roaming\
            - \Users\Public\
            - \WINDOWS\Temp\
            - C:\Temp\
            - \Desktop\
            - \Downloads\
            - \Temporary Internet
            - C:\ProgramData\
            - C:\Perflogs\
    selection_commands:
        TaskContentNew|contains:
            - regsvr32
            - rundll32
            - cmd.exe</Command>
            - cmd</Command>
            - '<Arguments>/c '
            - '<Arguments>/k '
            - '<Arguments>/r '
            - powershell
            - pwsh
            - mshta
            - wscript
            - cscript
            - certutil
            - bitsadmin
            - bash.exe
            - 'bash '
            - scrcons
            - 'wmic '
            - wmic.exe
            - forfiles
            - scriptrunner
            - hh.exe
    condition: all of selection_*
ocsf_mapping:
    class_name: scheduled_job_activity
    activity_id: 2
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:46:22.187904+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-26T02:46:22.187904+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: scheduled_job_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:46:22.874228+00:00'
        -   source_field: TaskContentNew
            target_table: scheduled_job_activity
            target_field: job.cmd_line
            mapped_at: '2025-11-26T02:46:22.874243+00:00'
