id: b28e58e4-2a72-4fae-bdee-0fbe904db642
title: Windows Defender Real-time Protection Disabled
status: stable
level: high
description: 'Detects disabling of Windows Defender Real-time Protection. As this
    event doesn''t contain a lot of information on who initiated this action you might
    want to reduce it to a "medium" level if this occurs too many times in your environment

    '
author: Ján Trenčanský, frack113
date: '2020-07-28'
modified: '2023-11-22'
tags:
    - attack.defense-evasion
    - attack.t1562.001
references:
    - https://learn.microsoft.com/en-us/defender-endpoint/troubleshoot-microsoft-defender-antivirus?view=o365-worldwide#event-id-5001
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
    - https://craigclouditpro.wordpress.com/2020/03/04/hunting-malicious-windows-defender-activity/
falsepositives:
    - Administrator actions (should be investigated)
    - Seen being triggered occasionally during Windows 8 Defender Updates
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''fe34868f-6e0e-4882-81f6-c43aa8f15b62''),
    type=<SigmaRelatedType.OBSOLETE: 4>)])'
taxonomy: sigma
logsource:
    product: windows
    service: windefend
detection:
    selection:
        EventID: 5001
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:24:43.947116+00:00'
        service:
            source_field: service
            source_value: windefend
            mapped_at: '2025-11-13T20:24:43.947116+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:24:43.947129+00:00'
