id: 9703792d-fd9a-456d-a672-ff92efe4806a
title: Backup Catalog Deleted
status: test
level: medium
description: Detects backup catalog deletions
author: Florian Roth (Nextron Systems), Tom U. @c_APT_ure (collection)
date: '2017-05-12'
modified: '2022-12-25'
tags:
    - attack.defense-evasion
    - attack.t1070.004
references:
    - https://technet.microsoft.com/en-us/library/cc742154(v=ws.11).aspx
    - https://www.hybrid-analysis.com/sample/ed01ebfbc9eb5bbea545af4d01bf5f1071661840480439c6e5babe8e080e41aa?environmentId=100
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: windows
    service: application
detection:
    selection:
        EventID: 524
        Provider_Name: Microsoft-Windows-Backup
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:25:47.339686+00:00'
        service:
            source_field: service
            source_value: application
            mapped_at: '2025-11-13T20:25:47.339686+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:25:47.339692+00:00'
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-11-13T20:25:47.339693+00:00'
