id: 0d18728b-f5bf-4381-9dcf-915539fff6c2
title: Suspicious Cobalt Strike DNS Beaconing - DNS Client
status: test
level: critical
description: Detects a program that invoked suspicious DNS queries known from Cobalt
    Strike beacons
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-01-16'
tags:
    - attack.command-and-control
    - attack.t1071.004
references:
    - https://www.icebrg.io/blog/footprints-of-fin7-tracking-actor-patterns
    - https://www.sekoia.io/en/hunting-and-detecting-cobalt-strike/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''f356a9c4-effd-4608-bbf8-408afd5cd006''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    product: windows
    service: dns-client
    definition: 'Requirements: Microsoft-Windows-DNS Client Events/Operational Event
        Log must be enabled/collected in order to receive the events.'
detection:
    selection_eid:
        EventID: 3008
    selection_query_1:
        QueryName|startswith:
            - aaa.stage.
            - post.1
    selection_query_2:
        QueryName|contains: .stage.123456.
    condition: selection_eid and 1 of selection_query_*
ocsf_mapping:
    class_name: dns_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:24:50.505312+00:00'
        service:
            source_field: service
            source_value: dns-client
            mapped_at: '2025-11-13T20:24:50.505312+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: dns_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:24:50.505334+00:00'
        -   source_field: QueryName
            target_table: dns_activity
            target_field: query.hostname
            mapped_at: '2025-11-13T20:24:50.505337+00:00'
