id: 1d61f71d-59d2-479e-9562-4ff5f4ead16b
title: Suspicious Service Installation
status: test
level: high
description: Detects suspicious service installation commands
author: pH-T (Nextron Systems), Florian Roth (Nextron Systems)
date: '2022-03-18'
modified: '2023-12-04'
tags:
    - attack.persistence
    - attack.privilege-escalation
    - car.2013-09-005
    - attack.t1543.003
references:
    - Internal Research
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''ca83e9f3-657a-45d0-88d6-c1ac280caf53''),
    type=<SigmaRelatedType.OBSOLETE: 4>), SigmaRelatedItem(id=UUID(''26481afe-db26-4228-b264-25a29fe6efc7''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    product: windows
    service: system
detection:
    selection:
        Provider_Name: Service Control Manager
        EventID: 7045
        ImagePath|contains:
            - ' -nop '
            - ' -sta '
            - ' -w hidden '
            - :\Temp\
            - .downloadfile(
            - .downloadstring(
            - \ADMIN$\
            - \Perflogs\
            - '&&'
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:48:12.277679+00:00'
        service:
            source_field: service
            source_value: system
            mapped_at: '2025-11-26T02:48:12.277679+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-11-26T02:48:12.277693+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:48:12.277695+00:00'
        -   source_field: ImagePath
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-11-26T02:48:12.277696+00:00'
