id: 9e36ed87-4986-482e-8e3b-5c23ffff11bf
title: RemCom Service Installation
status: test
level: medium
description: Detects RemCom service installation and execution events
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-08-07'
tags:
    - attack.execution
    - attack.t1569.002
references:
    - https://github.com/kavika13/RemCom/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: windows
    service: system
detection:
    selection_eid:
        Provider_Name: Service Control Manager
        EventID: 7045
    selection_service:
        ServiceName: RemComSvc
        ImagePath|endswith: \RemComSvc.exe
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:48:02.213120+00:00'
        service:
            source_field: service
            source_value: system
            mapped_at: '2025-11-26T02:48:02.213120+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-11-26T02:48:02.213135+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:48:02.213137+00:00'
        -   source_field: ServiceName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:48:02.213139+00:00'
        -   source_field: ImagePath
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-11-26T02:48:02.213141+00:00'
