title: A New Trust Was Created To A Domain
id: 0255a820-e564-4e40-af2b-6ac61160335c
status: stable
level: medium
author: Thomas Patzke
description: Addition of domains is seldom and should be verified for legitimacy.
references:
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4706
falsepositives:
    - Legitimate extension of domain structure
tags:
    - attack.persistence
    - attack.t1098
date: '2019-12-03'
modified: '2024-01-16'
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4706
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: security
            mapped_at: null
    detection_fields:
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
