title: Local User Creation
id: 66b6be3d-55d0-4f47-9855-d69df21740ea
status: test
level: low
author: Patrick Bareiss
description: 'Detects local user creation on Windows servers, which shouldn''t happen
    in an Active Directory environment. Apply this Sigma Use Case on your Windows
    server logs and not on your DC logs.

    '
references:
    - https://patrick-bareiss.com/detecting-local-user-creation-in-ad-with-sigma/
falsepositives:
    - Domain Controller Logs
    - Local accounts managed by privileged account management tools
tags:
    - attack.persistence
    - attack.t1136.001
date: '2019-04-18'
modified: '2021-01-17'
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4720
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: security
            mapped_at: null
    detection_fields:
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
