id: 2d510d8d-912b-45c5-b1df-36faa3d8c3f4
title: NetSupport Manager Service Install
status: test
level: medium
description: Detects NetSupport Manager service installation on the target system.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-10-31'
tags:
    - attack.persistence
references:
    - http://resources.netsupportsoftware.com/resources/manualpdfs/nsm_manual_uk.pdf
falsepositives:
    - Legitimate use of the tool
taxonomy: sigma
logsource:
    product: windows
    service: system
detection:
    selection_root:
        Provider_Name: Service Control Manager
        EventID: 7045
    selection_service:
        ImagePath|contains: \NetSupport Manager\client32.exe
        ServiceName: Client32
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:48:28.243637+00:00'
        service:
            source_field: service
            source_value: system
            mapped_at: '2025-11-26T02:48:28.243637+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-11-26T02:48:28.243653+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:48:28.243655+00:00'
        -   source_field: ImagePath
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-11-26T02:48:28.243657+00:00'
        -   source_field: ServiceName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:48:28.243658+00:00'
