title: DiagTrackEoP Default Login Username
id: 2111118f-7e46-4fc8-974a-59fd8ec95196
status: test
level: critical
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects the default "UserName" used by the DiagTrackEoP POC
references:
    - https://github.com/Wh04m1001/DiagTrackEoP/blob/3a2fc99c9700623eb7dc7d4b5f314fd9ce5ef51f/main.cpp#L46
falsepositives:
    - Unlikely
tags:
    - attack.privilege-escalation
date: '2022-08-03'
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4624
        LogonType: 9
        TargetOutboundUserName: thisisnotvaliduser
    condition: selection
ocsf_mapping:
    class_name: authentication
    activity_id: 1
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:56:47.178767+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-12-04T01:56:47.178767+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: authentication
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:56:47.178782+00:00'
        -   source_field: LogonType
            target_table: authentication
            target_field: logon_type
            mapped_at: '2025-12-04T01:56:47.178784+00:00'
        -   source_field: TargetOutboundUserName
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:56:47.178912+00:00'
