id: 39a80702-d7ca-4a83-b776-525b1f86a36d
title: Potential Secure Deletion with SDelete
status: test
level: medium
description: Detects files that have extensions commonly seen while SDelete is used
    to wipe files.
author: Thomas Patzke
date: '2017-06-14'
modified: '2024-12-13'
tags:
    - attack.impact
    - attack.defense-evasion
    - attack.t1070.004
    - attack.t1027.005
    - attack.t1485
    - attack.t1553.002
    - attack.s0195
references:
    - https://jpcertcc.github.io/ToolAnalysisResultSheet/details/sdelete.htm
    - https://www.jpcert.or.jp/english/pub/sr/ir_research.html
    - https://learn.microsoft.com/en-gb/sysinternals/downloads/sdelete
falsepositives:
    - Legitimate usage of SDelete
    - Files that are interacted with that have these extensions legitimately
taxonomy: sigma
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID:
            - 4656
            - 4663
            - 4658
        ObjectName|endswith:
            - .AAA
            - .ZZZ
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:45:49.740612+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-26T02:45:49.740612+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:45:49.740629+00:00'
        -   source_field: ObjectName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:45:49.740632+00:00'
