title: Important Scheduled Task Deleted
id: 9e3cb244-bdb8-4632-8c90-6079c8f4f16d
status: test
level: high
author: frack113
description: 'Detects when adversaries try to stop system services or processes by
    deleting their respective scheduled tasks in order to conduct data destructive
    activities

    '
references:
    - https://www.socinvestigation.com/most-common-windows-event-ids-to-hunt-mind-map/
falsepositives:
    - Unknown
tags:
    - attack.impact
    - attack.t1489
date: '2023-01-13'
modified: '2023-02-07'
logsource:
    product: windows
    service: taskscheduler
    definition: 'Requirements: The "Microsoft-Windows-TaskScheduler/Operational" is
        disabled by default and needs to be enabled in order for this detection to
        trigger'
detection:
    selection:
        EventID: 141
        TaskName|contains:
            - \Windows\SystemRestore\SR
            - \Windows\Windows Defender\
            - \Windows\BitLocker
            - \Windows\WindowsBackup\
            - \Windows\WindowsUpdate\
            - \Windows\UpdateOrchestrator\
            - \Windows\ExploitGuard
    filter:
        UserName|contains:
            - AUTHORI
            - AUTORI
    condition: selection and not filter
related:
    -   id: dbc1f800-0fe0-4bc0-9c66-292c2abe3f78
        type: similar
    -   id: 7595ba94-cf3b-4471-aa03-4f6baa9e5fad
        type: similar
ocsf_mapping:
    class_name: scheduled_job_activity
    activity_id: 3
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:55:14.196282+00:00'
        service:
            source_field: service
            source_value: taskscheduler
            mapped_at: '2025-12-04T01:55:14.196282+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: scheduled_job_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:55:14.196301+00:00'
        -   source_field: TaskName
            target_table: scheduled_job_activity
            target_field: job.name
            mapped_at: '2025-12-04T01:55:14.196304+00:00'
        -   source_field: UserName
            target_table: scheduled_job_activity
            target_field: actor.user.name
            mapped_at: '2025-12-04T01:55:14.196307+00:00'
