title: Failed MSExchange Transport Agent Installation
id: c7d16cae-aaf3-42e5-9c1c-fb8553faa6fa
status: test
level: high
author: Tobias Michalski (Nextron Systems)
description: Detects a failed installation of a Exchange Transport Agent
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=8
fields:
    - AssemblyPath
falsepositives:
    - Legitimate installations of exchange TransportAgents. AssemblyPath is a good
        indicator for this.
tags:
    - attack.persistence
    - attack.t1505.002
date: '2021-06-08'
modified: '2022-07-12'
logsource:
    product: windows
    service: msexchange-management
detection:
    selection:
        EventID: 6
        Data|contains: Install-TransportAgent
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:56:29.506005+00:00'
        service:
            source_field: service
            source_value: msexchange-management
            mapped_at: '2025-12-04T01:56:29.506005+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:56:29.506024+00:00'
        -   source_field: Data
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:56:29.506027+00:00'
