id: dae8171c-5ec6-4396-b210-8466585b53e9
title: SCM Database Privileged Operation
status: test
level: medium
description: Detects non-system users performing privileged operation os the SCM database
author: Roberto Rodriguez @Cyb3rWard0g, Tim Shelton
date: '2019-08-15'
modified: '2022-09-18'
tags:
    - attack.privilege-escalation
    - attack.t1548
references:
    - https://threathunterplaybook.com/hunts/windows/190826-RemoteSCMHandle/notebook.html
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4674
        ObjectType: SC_MANAGER OBJECT
        ObjectName: servicesactive
        PrivilegeList: SeTakeOwnershipPrivilege
    filter:
        SubjectLogonId: '0x3e4'
        ProcessName|endswith: :\Windows\System32\services.exe
    condition: selection and not filter
ocsf_mapping:
    class_name: process_activity
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:46:05.775307+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-26T02:46:05.775307+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:46:05.775329+00:00'
        -   source_field: ObjectType
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:46:05.775332+00:00'
        -   source_field: ObjectName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:46:05.775334+00:00'
        -   source_field: PrivilegeList
            target_table: process_activity
            target_field: device.groups.privileges
            mapped_at: '2025-11-26T02:46:05.775335+00:00'
        -   source_field: SubjectLogonId
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:46:05.775337+00:00'
        -   source_field: ProcessName
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:46:05.775338+00:00'
