id: d08dd86f-681e-4a00-a92c-1db218754417
title: MSSQL XPCmdshell Option Change
status: test
level: high
description: 'Detects when the MSSQL "xp_cmdshell" stored procedure setting is changed.

    '
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-07-12'
modified: '2024-06-26'
tags:
    - attack.execution
references:
    - https://www.netspi.com/blog/technical/network-penetration-testing/sql-server-persistence-part-1-startup-stored-procedures/
    - https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
falsepositives:
    - Legitimate enable/disable of the setting
    - Note that since the event contain the change for both values. This means that
        this will trigger on both enable and disable
taxonomy: sigma
logsource:
    product: windows
    service: application
detection:
    selection:
        Provider_Name|contains: MSSQL
        EventID: 15457
        Data|contains: xp_cmdshell
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:48:52.414500+00:00'
        service:
            source_field: service
            source_value: application
            mapped_at: '2025-11-26T02:48:52.414500+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-11-26T02:48:52.414530+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:48:52.414533+00:00'
        -   source_field: Data
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:48:52.414536+00:00'
