id: 2111118f-7e46-4fc8-974a-59fd8ec95196
title: DiagTrackEoP Default Login Username
status: test
level: critical
description: Detects the default "UserName" used by the DiagTrackEoP POC
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-08-03'
tags:
    - attack.privilege-escalation
references:
    - https://github.com/Wh04m1001/DiagTrackEoP/blob/3a2fc99c9700623eb7dc7d4b5f314fd9ce5ef51f/main.cpp#L46
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4624
        LogonType: 9
        TargetOutboundUserName: thisisnotvaliduser
    condition: selection
ocsf_mapping:
    class_name: authentication
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:25:03.243512+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-13T20:25:03.243512+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: authentication
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:25:04.231869+00:00'
        -   source_field: LogonType
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:25:04.231885+00:00'
        -   source_field: TargetOutboundUserName
            target_table: authentication
            target_field: actor.user.name
            mapped_at: '2025-11-13T20:25:04.231889+00:00'
