id: a33f8808-2812-4373-ae95-8cfb82134978
title: Windows Defender Exclusion Deleted
status: test
level: medium
description: 'Detects when a Windows Defender exclusion has been deleted. This could
    indicate an attacker trying to delete their tracks by removing the added exclusions

    '
author: '@BarryShooshooga'
date: '2019-10-26'
modified: '2023-11-11'
tags:
    - attack.defense-evasion
    - attack.t1562.001
references:
    - https://www.bleepingcomputer.com/news/security/gootkit-malware-bypasses-windows-defender-by-setting-path-exclusions/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''e9c8808f-4cfb-4ba9-97d4-e5f3beaa244d''),
    type=<SigmaRelatedType.DERIVED: 2>), SigmaRelatedItem(id=UUID(''46a68649-f218-4f86-aea1-16a759d81820''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    product: windows
    service: security
    definition: 'Requirements: Audit Policy : Security Settings/Local Policies/Audit
        Policy, Registry System Access Control (SACL): Auditing/User'
detection:
    selection:
        EventID: 4660
        ObjectName|contains: \Microsoft\Windows Defender\Exclusions\
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:45:34.693830+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-26T02:45:34.693830+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:45:34.693860+00:00'
        -   source_field: ObjectName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:45:34.693864+00:00'
