id: 11d00fff-5dc3-428c-8184-801f292faec0
title: Service Registry Key Read Access Request
status: test
level: low
description: 'Detects "read access" requests on the services registry key.

    Adversaries may execute their own malicious payloads by hijacking the Registry
    entries used by services.

    Adversaries may use flaws in the permissions for Registry keys related to services
    to redirect from the originally specified executable to one that they control,
    in order to launch their own code when a service starts.

    '
author: Center for Threat Informed Defense (CTID) Summiting the Pyramid Team
date: '2023-09-28'
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1574.011
references:
    - https://center-for-threat-informed-defense.github.io/summiting-the-pyramid/analytics/service_registry_permissions_weakness_check/
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1574.011/T1574.011.md#atomic-test-1---service-registry-permissions-weakness
falsepositives:
    - Likely from legitimate applications reading their key. Requires heavy tuning
taxonomy: sigma
logsource:
    product: windows
    service: security
    definition: 'Requirements: SACLs must be enabled for "READ_CONTROL" on the registry
        keys used in this rule'
detection:
    selection:
        EventID: 4663
        ObjectName|contains|all:
            - \SYSTEM\
            - ControlSet\Services\
        AccessList|contains: '%%1538'
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:43:37.917011+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-26T02:43:37.917011+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:43:38.988277+00:00'
        -   source_field: ObjectName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:43:38.988289+00:00'
        -   source_field: AccessList
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:43:38.988292+00:00'
