id: 530a6faa-ff3d-4022-b315-50828e77eef5
title: Anydesk Remote Access Software Service Installation
status: test
level: medium
description: Detects the installation of the anydesk software service. Which could
    be an indication of anydesk abuse if you the software isn't already used.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-08-11'
tags:
    - attack.persistence
references:
    - https://thedfirreport.com/2022/08/08/bumblebee-roasts-its-way-to-domain-admin/
falsepositives:
    - Legitimate usage of the anydesk tool
taxonomy: sigma
logsource:
    product: windows
    service: system
detection:
    selection:
        Provider_Name: Service Control Manager
        EventID: 7045
        ServiceName: AnyDesk Service
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:47:57.993506+00:00'
        service:
            source_field: service
            source_value: system
            mapped_at: '2025-11-26T02:47:57.993506+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-11-26T02:47:57.993523+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:47:57.993525+00:00'
        -   source_field: ServiceName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:47:57.993526+00:00'
