title: Suspicious Usage of CVE_2021_34484 or CVE 2022_21919
id: 52a85084-6989-40c3-8f32-091e12e17692
status: test
level: low
author: Cybex
description: During exploitation of this vulnerability, two logs (Provider_Name:Microsoft-Windows-User
    Profiles Service) with EventID 1511 and 1515 (maybe lot of false positives with
    this event) are created. Moreover, it appears the directory \Users\TEMP is created
    may be created during the exploitation. Viewed on 2008 Server
references:
    - https://packetstormsecurity.com/files/166692/Windows-User-Profile-Service-Privlege-Escalation.html
falsepositives:
    - Corrupted user profiles - https://social.technet.microsoft.com/wiki/contents/articles/3571.windows-user-profiles-service-event-1511-windows-cannot-find-the-local-profile-and-is-logging-you-on-with-a-temporary-profile.aspx
tags:
    - attack.execution
date: '2022-08-16'
modified: '2023-05-02'
logsource:
    product: windows
    service: application
detection:
    selection:
        EventID: 1511
        Provider_Name: Microsoft-Windows-User Profiles Service
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: application
            mapped_at: null
    detection_fields:
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Provider_Name
            target_table: null
            target_field: null
            mapped_at: null
