id: 686c0b4b-9dd3-4847-9077-d6c1bbe36fcb
title: Windows Defender Virus Scanning Feature Disabled
status: stable
level: high
description: Detects disabling of the Windows Defender virus scanning feature
author: Ján Trenčanský, frack113
date: '2020-07-28'
modified: '2023-11-22'
tags:
    - attack.defense-evasion
    - attack.t1562.001
references:
    - https://learn.microsoft.com/en-us/defender-endpoint/troubleshoot-microsoft-defender-antivirus?view=o365-worldwide#event-id-5012
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
    - https://craigclouditpro.wordpress.com/2020/03/04/hunting-malicious-windows-defender-activity/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''fe34868f-6e0e-4882-81f6-c43aa8f15b62''),
    type=<SigmaRelatedType.OBSOLETE: 4>)])'
taxonomy: sigma
logsource:
    product: windows
    service: windefend
detection:
    selection:
        EventID: 5012
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:24:49.276511+00:00'
        service:
            source_field: service
            source_value: windefend
            mapped_at: '2025-11-13T20:24:49.276511+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:24:49.276521+00:00'
