title: Suspicious Remote Logon with Explicit Credentials
id: 941e5c45-cda7-4864-8cea-bbb7458d194a
status: test
level: medium
author: oscd.community, Teymur Kheirkhabarov @HeirhabarovT, Zach Stanford @svch0st,
    Tim Shelton
description: Detects suspicious processes logging on with explicit credentials
references:
    - https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view
falsepositives:
    - Administrators that use the RunAS command or scheduled tasks
tags:
    - attack.t1078
    - attack.lateral-movement
date: '2020-10-05'
modified: '2022-08-03'
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4648
        ProcessName|endswith:
            - \cmd.exe
            - \powershell.exe
            - \pwsh.exe
            - \winrs.exe
            - \wmic.exe
            - \net.exe
            - \net1.exe
            - \reg.exe
    filter1:
        TargetServerName: localhost
    filter2:
        SubjectUserName|endswith: $
        TargetUserName|endswith: $
    condition: selection and not 1 of filter*
ocsf_mapping:
    class_name: authentication
    activity_id: 1
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:55:47.559493+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-12-04T01:55:47.559493+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: authentication
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:55:47.559517+00:00'
        -   source_field: ProcessName
            target_table: authentication
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:55:47.559519+00:00'
        -   source_field: TargetServerName
            target_table: authentication
            target_field: dst_endpoint.hostname
            mapped_at: '2025-12-04T01:55:47.559521+00:00'
        -   source_field: SubjectUserName
            target_table: authentication
            target_field: actor.user.name
            mapped_at: '2025-12-04T01:55:47.559522+00:00'
        -   source_field: TargetUserName
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:47.559524+00:00'
