id: a5b40a90-baf5-4bf7-a6f7-373494881d22
title: ETW Logging/Processing Option Disabled On IIS Server
status: experimental
level: medium
description: Detects changes to of the IIS server configuration in order to disable/remove
    the ETW logging/processing option.
author: frack113, Nasreddine Bencherchali
date: '2024-10-06'
tags:
    - attack.defense-evasion
    - attack.t1562.002
    - attack.t1505.004
references:
    - https://learn.microsoft.com/en-us/iis/manage/provisioning-and-managing-iis/configure-logging-in-iis
    - https://www.microsoft.com/en-us/security/blog/2022/12/12/iis-modules-the-evolution-of-web-shells-and-how-to-detect-them/
    - https://learn.microsoft.com/en-us/iis/configuration/system.applicationhost/sites/sitedefaults/logfile/
falsepositives:
    - Legitimate administrator activity
taxonomy: sigma
logsource:
    product: windows
    service: iis-configuration
detection:
    selection:
        EventID: 29
        Configuration|endswith: '@logTargetW3C'
        OldValue|contains: ETW
    filter_main_etw_added:
        NewValue|contains: ETW
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: iis-configuration
            mapped_at: null
    detection_fields:
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: Configuration
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: OldValue
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: NewValue
            target_table: null
            target_field: null
            mapped_at: null
