id: b55d23e5-6821-44ff-8a6e-67218891e49f
title: HybridConnectionManager Service Running
status: test
level: high
description: Rule to detect the Hybrid Connection Manager service running on an endpoint.
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: '2021-04-12'
modified: '2024-08-05'
tags:
    - attack.persistence
    - attack.t1554
references:
    - https://twitter.com/Cyb3rWard0g/status/1381642789369286662
falsepositives:
    - Legitimate use of Hybrid Connection Manager via Azure function apps.
taxonomy: sigma
logsource:
    product: windows
    service: microsoft-servicebus-client
detection:
    selection:
        EventID:
            - 40300
            - 40301
            - 40302
    keywords:
        - HybridConnection
        - sb://
        - servicebus.windows.net
        - HybridConnectionManage
    condition: selection and keywords
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: microsoft-servicebus-client
            mapped_at: null
    detection_fields:
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
