title: User Logoff Event
id: 0badd08f-c6a3-4630-90d3-6875cca440be
status: test
level: informational
author: frack113
description: Detects a user log-off activity. Could be used for example to correlate
    information during forensic investigations
references:
    - https://github.com/Yamato-Security/EnableWindowsLogSettings/blob/7f6d755d45ac7cc9fc35b0cbf498e6aa4ef19def/ConfiguringSecurityLogAuditPolicies.md
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4634
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4647
falsepositives:
    - Unknown
tags:
    - attack.impact
    - attack.t1531
date: '2022-10-14'
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID:
            - 4634
            - 4647
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: security
            mapped_at: null
    detection_fields:
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
