id: e9d4ab66-a532-4ef7-a502-66a9e4a34f5d
title: NTLMv1 Logon Between Client and Server
status: test
level: medium
description: Detects the reporting of NTLMv1 being used between a client and server.
    NTLMv1 is insecure as the underlying encryption algorithms can be brute-forced
    by modern hardware.
author: Tim Shelton, Nasreddine Bencherchali (Nextron Systems)
date: '2022-04-26'
modified: '2023-06-06'
tags:
    - attack.defense-evasion
    - attack.lateral-movement
    - attack.t1550.002
references:
    - https://github.com/nasbench/EVTX-ETW-Resources/blob/f1b010ce0ee1b71e3024180de1a3e67f99701fe4/ETWProvidersManifests/Windows10/22H2/W10_22H2_Pro_20230321_19045.2728/WEPExplorer/LsaSrv.xml
falsepositives:
    - Environments that use NTLMv1
taxonomy: sigma
logsource:
    product: windows
    service: system
detection:
    selection:
        Provider_Name: LsaSrv
        EventID:
            - 6038
            - 6039
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:25:33.755747+00:00'
        service:
            source_field: service
            source_value: system
            mapped_at: '2025-11-13T20:25:33.755747+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-11-13T20:25:33.755762+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:25:33.755765+00:00'
