id: 8eef149c-bd26-49f2-9e5a-9b00e3af499b
title: Pass the Hash Activity 2
status: stable
level: medium
description: Detects the attack technique pass the hash which is used to move laterally
    inside the network
author: Dave Kennedy, Jeff Warren (method) / David Vassallo (rule)
date: '2019-06-14'
modified: '2022-10-05'
tags:
    - attack.lateral-movement
    - attack.t1550.002
references:
    - https://github.com/iadgov/Event-Forwarding-Guidance/tree/master/Events
    - https://web.archive.org/web/20170909091934/https://blog.binarydefense.com/reliably-detecting-pass-the-hash-through-event-log-analysis
    - https://blog.stealthbits.com/how-to-detect-pass-the-hash-attacks/
falsepositives:
    - Administrator activity
taxonomy: sigma
logsource:
    product: windows
    service: security
    definition: The successful use of PtH for lateral movement between workstations
        would trigger event ID 4624
detection:
    selection_logon3:
        EventID: 4624
        SubjectUserSid: S-1-0-0
        LogonType: 3
        LogonProcessName: NtLmSsp
        KeyLength: 0
    selection_logon9:
        EventID: 4624
        LogonType: 9
        LogonProcessName: seclogo
    filter:
        TargetUserName: ANONYMOUS LOGON
    condition: 1 of selection_* and not filter
ocsf_mapping:
    class_name: authentication
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:47:45.831385+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-26T02:47:45.831385+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: authentication
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:47:46.630032+00:00'
        -   source_field: SubjectUserSid
            target_table: authentication
            target_field: actor.user.uid
            mapped_at: '2025-11-26T02:47:46.630050+00:00'
        -   source_field: LogonType
            target_table: authentication
            target_field: logon_type
            mapped_at: '2025-11-26T02:47:46.630053+00:00'
        -   source_field: LogonProcessName
            target_table: authentication
            target_field: actor.process.name
            mapped_at: '2025-11-26T02:47:46.630055+00:00'
        -   source_field: KeyLength
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:47:46.630058+00:00'
        -   source_field: TargetUserName
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:47:46.630079+00:00'
