title: Password Change on Directory Service Restore Mode (DSRM) Account
id: 53ad8e36-f573-46bf-97e4-15ba5bf4bb51
status: stable
level: high
author: Thomas Patzke
description: 'Detects potential attempts made to set the Directory Services Restore
    Mode administrator password.

    The Directory Service Restore Mode (DSRM) account is a local administrator account
    on Domain Controllers.

    Attackers may change the password in order to obtain persistence.

    '
references:
    - https://adsecurity.org/?p=1714
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4794
falsepositives:
    - Initial installation of a domain controller.
tags:
    - attack.persistence
    - attack.t1098
date: '2017-02-19'
modified: '2020-08-23'
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4794
    condition: selection
related:
    -   id: b61e87c0-50db-4b2e-8986-6a2be94b33b0
        type: similar
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: security
            mapped_at: null
    detection_fields:
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
