id: 35ba1d85-724d-42a3-889f-2e2362bcaf23
title: AD Privileged Users or Groups Reconnaissance
status: test
level: high
description: Detect priv users or groups recon based on 4661 eventid and known privileged
    users or groups SIDs
author: Samir Bousseaden
date: '2019-04-03'
modified: '2022-07-13'
tags:
    - attack.discovery
    - attack.t1087.002
references:
    - https://web.archive.org/web/20230329163438/https://blog.menasec.net/2019/02/threat-hunting-5-detecting-enumeration.html
falsepositives:
    - If source account name is not an admin then its super suspicious
taxonomy: sigma
logsource:
    product: windows
    service: security
    definition: 'Requirements: enable Object Access SAM on your Domain Controllers'
detection:
    selection:
        EventID: 4661
        ObjectType:
            - SAM_USER
            - SAM_GROUP
    selection_object:
        ObjectName|endswith:
            - '-512'
            - '-502'
            - '-500'
            - '-505'
            - '-519'
            - '-520'
            - '-544'
            - '-551'
            - '-555'
        ObjectName|contains: admin
    filter:
        SubjectUserName|endswith: $
    condition: selection and selection_object and not filter
ocsf_mapping:
    class_name: user_access
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:45:51.320024+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-26T02:45:51.320024+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: user_access
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:45:52.162832+00:00'
        -   source_field: ObjectType
            target_table: user_access
            target_field: observables.type
            mapped_at: '2025-11-26T02:45:52.162854+00:00'
        -   source_field: ObjectName
            target_table: user_access
            target_field: observables.name
            mapped_at: '2025-11-26T02:45:52.162858+00:00'
        -   source_field: SubjectUserName
            target_table: user_access
            target_field: actor.user.name
            mapped_at: '2025-11-26T02:45:52.162861+00:00'
