title: DNS Query for Anonfiles.com Domain - DNS Client
id: 29f171d7-aa47-42c7-9c7b-3c87938164d9
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects DNS queries for anonfiles.com, which is an anonymous file upload
    platform often used for malicious purposes
references:
    - https://www.trendmicro.com/vinfo/us/security/news/ransomware-spotlight/ransomware-spotlight-blackbyte
falsepositives:
    - Rare legitimate access to anonfiles.com
tags:
    - attack.exfiltration
    - attack.t1567.002
date: '2023-01-16'
logsource:
    product: windows
    service: dns-client
    definition: 'Requirements: Microsoft-Windows-DNS Client Events/Operational Event
        Log must be enabled/collected in order to receive the events.'
detection:
    selection:
        EventID: 3008
        QueryName|contains: .anonfiles.com
    condition: selection
related:
    -   id: 065cceea-77ec-4030-9052-fc0affea7110
        type: similar
ocsf_mapping:
    class_name: dns_activity
    activity_id: 1
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:56:36.141956+00:00'
        service:
            source_field: service
            source_value: dns-client
            mapped_at: '2025-12-04T01:56:36.141956+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: dns_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:56:36.141970+00:00'
        -   source_field: QueryName
            target_table: dns_activity
            target_field: query.hostname
            mapped_at: '2025-12-04T01:56:36.141972+00:00'
