title: Transferring Files with Credential Data via Network Shares
id: 910ab938-668b-401b-b08c-b596e80fdca5
status: test
level: medium
author: Teymur Kheirkhabarov, oscd.community
description: Transferring files with well-known filenames (sensitive files with credential
    data) using network shares
references:
    - https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
falsepositives:
    - Transferring sensitive files for legitimate administration work by legitimate
        administrator
tags:
    - attack.credential-access
    - attack.t1003.002
    - attack.t1003.001
    - attack.t1003.003
date: '2019-10-22'
modified: '2021-11-30'
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 5145
        RelativeTargetName|contains:
            - \mimidrv
            - \lsass
            - \windows\minidump\
            - \hiberfil
            - \sqldmpr
            - \sam
            - \ntds.dit
            - \security
    condition: selection
related:
    -   id: 2e69f167-47b5-4ae7-a390-47764529eff5
        type: similar
ocsf_mapping:
    class_name: file_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:56:07.762515+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-12-04T01:56:07.762515+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: file_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:56:07.762532+00:00'
        -   source_field: RelativeTargetName
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:56:07.762534+00:00'
