title: Important Windows Service Terminated With Error
id: d6b5520d-3934-48b4-928c-2aa3f92d6963
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects important or interesting Windows services that got terminated
    for whatever reason
references:
    - https://www.microsoft.com/en-us/security/blog/2023/04/11/guidance-for-investigating-attacks-using-cve-2022-21894-the-blacklotus-campaign/
falsepositives:
    - Rare false positives could occur since service termination could happen due
        to multiple reasons
tags:
    - attack.defense-evasion
date: '2023-04-14'
logsource:
    product: windows
    service: system
detection:
    selection_eid:
        Provider_Name: Service Control Manager
        EventID: 7023
    selection_name:
        param1|contains:
            - ' Antivirus'
            - ' Firewall'
            - Application Guard
            - BitLocker Drive Encryption Service
            - Encrypting File System
            - Microsoft Defender
            - Threat Protection
            - Windows Event Log
        Binary|contains:
            - 770069006e0064006500660065006e006400
            - 4500760065006e0074004c006f006700
            - 6d0070007300730076006300
            - 530065006e0073006500
            - '450046005300'
            - '420044004500530056004300'
    condition: all of selection_*
related:
    -   id: acfa2210-0d71-4eeb-b477-afab494d596c
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: 2
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:57:05.570226+00:00'
        service:
            source_field: service
            source_value: system
            mapped_at: '2025-12-04T01:57:05.570226+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-12-04T01:57:05.570241+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:57:05.570243+00:00'
        -   source_field: param1
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:57:05.570245+00:00'
        -   source_field: Binary
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-12-04T01:57:05.570246+00:00'
