title: Ngrok Usage with Remote Desktop Service
id: 64d51a51-32a6-49f0-9f3d-17e34d640272
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects cases in which ngrok, a reverse proxy tool, forwards events to
    the local RDP port, which could be a sign of malicious behaviour
references:
    - https://twitter.com/tekdefense/status/1519711183162556416?s=12&t=OTsHCBkQOTNs1k3USz65Zg
    - https://ngrok.com/
falsepositives:
    - Unknown
tags:
    - attack.command-and-control
    - attack.t1090
date: '2022-04-29'
logsource:
    product: windows
    service: terminalservices-localsessionmanager
detection:
    selection:
        EventID: 21
        Address|contains: '16777216'
    condition: selection
ocsf_mapping:
    class_name: network_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:56:28.221416+00:00'
        service:
            source_field: service
            source_value: terminalservices-localsessionmanager
            mapped_at: '2025-12-04T01:56:28.221416+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: network_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:56:28.221448+00:00'
        -   source_field: Address
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:56:28.221452+00:00'
