title: Azure AD Health Monitoring Agent Registry Keys Access
id: ff151c33-45fa-475d-af4f-c2f93571f4fe
status: test
level: medium
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research), MSTIC
description: 'This detection uses Windows security events to detect suspicious access
    attempts to the registry key of Azure AD Health monitoring agent.

    This detection requires an access control entry (ACE) on the system access control
    list (SACL) of the following securable object HKLM\SOFTWARE\Microsoft\Microsoft
    Online\Reporting\MonitoringAgent.

    '
references:
    - https://o365blog.com/post/hybridhealthagent/
    - https://github.com/OTRF/Set-AuditRule/blob/c3dec5443414231714d850565d364ca73475ade5/rules/registry/aad_connect_health_monitoring_agent.yml
falsepositives:
    - Unknown
tags:
    - attack.discovery
    - attack.t1012
date: '2021-08-26'
modified: '2022-10-09'
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID:
            - 4656
            - 4663
        ObjectType: Key
        ObjectName: \REGISTRY\MACHINE\SOFTWARE\Microsoft\Microsoft Online\Reporting\MonitoringAgent
    filter:
        ProcessName|contains:
            - Microsoft.Identity.Health.Adfs.DiagnosticsAgent.exe
            - Microsoft.Identity.Health.Adfs.InsightsService.exe
            - Microsoft.Identity.Health.Adfs.MonitoringAgent.Startup.exe
            - Microsoft.Identity.Health.Adfs.PshSurrogate.exe
            - Microsoft.Identity.Health.Common.Clients.ResourceMonitor.exe
    condition: selection and not filter
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:55:26.836375+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-12-04T01:55:26.836375+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:55:26.836392+00:00'
        -   source_field: ObjectType
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:26.836394+00:00'
        -   source_field: ObjectName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:26.836395+00:00'
        -   source_field: ProcessName
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:55:26.836396+00:00'
