id: 7595ba94-cf3b-4471-aa03-4f6baa9e5fad
title: Important Scheduled Task Deleted/Disabled
status: test
level: high
description: Detects when adversaries stop services or processes by deleting or disabling
    their respective scheduled tasks in order to conduct data destructive activities
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-12-05'
modified: '2023-03-13'
tags:
    - attack.execution
    - attack.privilege-escalation
    - attack.persistence
    - attack.t1053.005
references:
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4699
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4701
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''dbc1f800-0fe0-4bc0-9c66-292c2abe3f78''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''9ac94dc8-9042-493c-ba45-3b5e7c86b980''),
    type=<SigmaRelatedType.SIMILAR: 6>), SigmaRelatedItem(id=UUID(''9e3cb244-bdb8-4632-8c90-6079c8f4f16d''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    product: windows
    service: security
    definition: The Advanced Audit Policy setting Object Access > Audit Other Object
        Access Events has to be configured to allow this detection. We also recommend
        extracting the Command field from the embedded XML in the event data.
detection:
    selection:
        EventID:
            - 4699
            - 4701
        TaskName|contains:
            - \Windows\SystemRestore\SR
            - \Windows\Windows Defender\
            - \Windows\BitLocker
            - \Windows\WindowsBackup\
            - \Windows\WindowsUpdate\
            - \Windows\UpdateOrchestrator\Schedule
            - \Windows\ExploitGuard
    filter_sys_username:
        EventID: 4699
        SubjectUserName|endswith: $
        TaskName|contains: \Windows\Windows Defender\
    condition: selection and not 1 of filter_*
ocsf_mapping:
    class_name: scheduled_job_activity
    activity_id: 3
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:46:24.283220+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-26T02:46:24.283220+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: scheduled_job_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:46:24.934206+00:00'
        -   source_field: TaskName
            target_table: scheduled_job_activity
            target_field: job.name
            mapped_at: '2025-11-26T02:46:24.934216+00:00'
        -   source_field: SubjectUserName
            target_table: scheduled_job_activity
            target_field: job.user.name
            mapped_at: '2025-11-26T02:46:24.934217+00:00'
