title: ProcessHacker Privilege Elevation
id: c4ff1eac-84ad-44dd-a6fb-d56a92fc43a9
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects a ProcessHacker tool that elevated privileges to a very high
    level
references:
    - https://twitter.com/1kwpeter/status/1397816101455765504
falsepositives:
    - Unlikely
tags:
    - attack.execution
    - attack.privilege-escalation
    - attack.t1543.003
    - attack.t1569.002
date: '2021-05-27'
modified: '2022-12-25'
logsource:
    product: windows
    service: system
detection:
    selection:
        Provider_Name: Service Control Manager
        EventID: 7045
        ServiceName|startswith: ProcessHacker
        AccountName: LocalSystem
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:57:02.798403+00:00'
        service:
            source_field: service
            source_value: system
            mapped_at: '2025-12-04T01:57:02.798403+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-12-04T01:57:02.798467+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:57:02.798469+00:00'
        -   source_field: ServiceName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:57:02.798470+00:00'
        -   source_field: AccountName
            target_table: process_activity
            target_field: actor.user.name
            mapped_at: '2025-12-04T01:57:02.798472+00:00'
