title: Tap Driver Installation
id: 8e4cf0e5-aa5d-4dc3-beff-dc26917744a9
status: test
level: medium
author: Daniil Yugoslavskiy, Ian Davis, oscd.community
description: Well-known TAP software installation. Possible preparation for data exfiltration
    using tunnelling techniques
references:
    - https://community.openvpn.net/openvpn/wiki/ManagingWindowsTAPDrivers
falsepositives:
    - Legitimate OpenVPN TAP installation
tags:
    - attack.exfiltration
    - attack.t1048
date: '2019-10-24'
modified: '2022-12-25'
logsource:
    product: windows
    service: system
detection:
    selection:
        Provider_Name: Service Control Manager
        EventID: 7045
        ImagePath|contains: tap0901
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:57:12.119275+00:00'
        service:
            source_field: service
            source_value: system
            mapped_at: '2025-12-04T01:57:12.119275+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-12-04T01:57:12.119323+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:57:12.119328+00:00'
        -   source_field: ImagePath
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-12-04T01:57:12.119331+00:00'
