id: 5a105d34-05fc-401e-8553-272b45c1522d
title: CobaltStrike Service Installations - System
status: test
level: critical
description: Detects known malicious service installs that appear in cases in which
    a Cobalt Strike beacon elevates privileges or lateral movement
author: Florian Roth (Nextron Systems), Wojciech Lesicki
date: '2021-05-26'
modified: '2022-11-27'
tags:
    - attack.execution
    - attack.privilege-escalation
    - attack.lateral-movement
    - attack.t1021.002
    - attack.t1543.003
    - attack.t1569.002
references:
    - https://www.sans.org/webcasts/119395
    - https://www.crowdstrike.com/blog/getting-the-bacon-from-cobalt-strike-beacon/
    - https://thedfirreport.com/2021/08/29/cobalt-strike-a-defenders-guide/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: windows
    service: system
detection:
    selection_id:
        Provider_Name: Service Control Manager
        EventID: 7045
    selection1:
        ImagePath|contains|all:
            - ADMIN$
            - .exe
    selection2:
        ImagePath|contains|all:
            - '%COMSPEC%'
            - start
            - powershell
    selection3:
        ImagePath|contains: powershell -nop -w hidden -encodedcommand
    selection4:
        ImagePath|base64offset|contains: 'IEX (New-Object Net.Webclient).DownloadString(''http://127.0.0.1:'
    condition: selection_id and (selection1 or selection2 or selection3 or selection4)
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:47:59.256855+00:00'
        service:
            source_field: service
            source_value: system
            mapped_at: '2025-11-26T02:47:59.256855+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-11-26T02:47:59.256872+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:47:59.256874+00:00'
        -   source_field: ImagePath
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-11-26T02:47:59.256875+00:00'
