id: 1a4bd6e3-4c6e-405d-a9a3-53a116e341d4
title: USB Device Plugged
status: test
level: low
description: Detects plugged/unplugged USB devices
author: Florian Roth (Nextron Systems)
date: '2017-11-09'
modified: '2021-11-30'
tags:
    - attack.initial-access
    - attack.t1200
references:
    - https://df-stream.com/2014/01/the-windows-7-event-log-and-usb-device/
    - https://www.techrepublic.com/article/how-to-track-down-usb-flash-drive-usage-in-windows-10s-event-viewer/
falsepositives:
    - Legitimate administrative activity
taxonomy: sigma
logsource:
    product: windows
    service: driver-framework
    definition: Requires enabling and collection of the Microsoft-Windows-DriverFrameworks-UserMode/Operational
        eventlog
detection:
    selection:
        EventID:
            - 2003
            - 2100
            - 2102
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:24:50.517457+00:00'
        service:
            source_field: service
            source_value: driver-framework
            mapped_at: '2025-11-13T20:24:50.517457+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:24:50.517474+00:00'
