title: CodeIntegrity - Unsigned Image Loaded
id: c92c24e7-f595-493f-9c98-53d5142f5c18
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects loaded unsigned image on the system
references:
    - https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/operations/event-id-explanations
    - https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/operations/event-tag-explanations
    - Internal Research
falsepositives:
    - Unlikely
tags:
    - attack.privilege-escalation
date: '2023-06-06'
logsource:
    product: windows
    service: codeintegrity-operational
detection:
    selection:
        EventID: 3037
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: codeintegrity-operational
            mapped_at: null
    detection_fields:
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
