title: Remote Access Tool - ScreenConnect File Transfer
id: 5d19eb78-5b5b-4ef2-a9f0-4bfa94d58a13
status: test
level: low
author: Ali Alwashali
description: Detects file being transferred via ScreenConnect RMM
references:
    - https://www.huntandhackett.com/blog/revil-the-usage-of-legitimate-remote-admin-tooling
    - https://github.com/SigmaHQ/sigma/pull/4467
falsepositives:
    - Legitimate use of ScreenConnect
tags:
    - attack.execution
    - attack.t1059.003
date: '2023-10-10'
logsource:
    product: windows
    service: application
detection:
    selection:
        Provider_Name: ScreenConnect
        EventID: 201
        Data|contains: Transferred files with action
    condition: selection
related:
    -   id: b1f73849-6329-4069-bc8f-78a604bb8b23
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:57:36.398114+00:00'
        service:
            source_field: service
            source_value: application
            mapped_at: '2025-12-04T01:57:36.398114+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-12-04T01:57:36.398173+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:57:36.398178+00:00'
        -   source_field: Data
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:57:36.398181+00:00'
