title: Suspicious Digital Signature Of AppX Package
id: b5aa7d60-c17e-4538-97de-09029d6cd76b
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects execution of AppX packages with known suspicious or malicious
    signature
references:
    - Internal Research
    - https://www.sentinelone.com/labs/inside-malicious-windows-apps-for-malware-deployment/
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.execution
date: '2023-01-16'
logsource:
    product: windows
    service: appxpackaging-om
detection:
    selection:
        EventID: 157
        subjectName: CN=Foresee Consulting Inc., O=Foresee Consulting Inc., L=North
            York, S=Ontario, C=CA, SERIALNUMBER=1004913-1, OID.1.3.6.1.4.1.311.60.2.1.3=CA,
            OID.2.5.4.15=Private Organization
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: appxpackaging-om
            mapped_at: null
    detection_fields:
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: subjectName
            target_table: null
            target_field: null
            mapped_at: null
