title: USB Device Plugged
id: 1a4bd6e3-4c6e-405d-a9a3-53a116e341d4
status: test
level: low
author: Florian Roth (Nextron Systems)
description: Detects plugged/unplugged USB devices
references:
    - https://df-stream.com/2014/01/the-windows-7-event-log-and-usb-device/
    - https://www.techrepublic.com/article/how-to-track-down-usb-flash-drive-usage-in-windows-10s-event-viewer/
falsepositives:
    - Legitimate administrative activity
tags:
    - attack.initial-access
    - attack.t1200
date: '2017-11-09'
modified: '2021-11-30'
logsource:
    product: windows
    service: driver-framework
    definition: Requires enabling and collection of the Microsoft-Windows-DriverFrameworks-UserMode/Operational
        eventlog
detection:
    selection:
        EventID:
            - 2003
            - 2100
            - 2102
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: driver-framework
            mapped_at: null
    detection_fields:
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
