id: 78d5cab4-557e-454f-9fb9-a222bd0d5edc
title: External Remote SMB Logon from Public IP
status: test
level: high
description: Detects successful logon from public IP address via SMB. This can indicate
    a publicly-exposed SMB port.
author: Micah Babinski (@micahbabinski), Zach Mathis (@yamatosecurity)
date: '2023-01-19'
modified: '2024-03-11'
tags:
    - attack.initial-access
    - attack.credential-access
    - attack.t1133
    - attack.t1078
    - attack.t1110
references:
    - https://www.inversecos.com/2020/04/successful-4624-anonymous-logons-to.html
    - https://twitter.com/Purp1eW0lf/status/1616144561965002752
falsepositives:
    - Legitimate or intentional inbound connections from public IP addresses on the
        SMB port.
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''259a9cdf-c4dd-4fa2-b243-2269e5ab18a2''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4624
        LogonType: 3
    filter_main_local_ranges:
        IpAddress|cidr:
            - ::1/128
            - 10.0.0.0/8
            - 127.0.0.0/8
            - 172.16.0.0/12
            - 192.168.0.0/16
            - 169.254.0.0/16
            - fc00::/7
            - fe80::/10
    filter_main_empty:
        IpAddress: '-'
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: authentication
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:25:04.816981+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-13T20:25:04.816981+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: authentication
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:25:04.816997+00:00'
        -   source_field: LogonType
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:25:04.817001+00:00'
        -   source_field: IpAddress
            target_table: authentication
            target_field: src_endpoint.ip
            mapped_at: '2025-11-13T20:25:04.817004+00:00'
