title: Denied Access To Remote Desktop
id: 8e5c03fa-b7f0-11ea-b242-07e0576828d9
status: test
level: medium
author: Pushkarev Dmitry
description: 'This event is generated when an authenticated user who is not allowed
    to log on remotely attempts to connect to this computer through Remote Desktop.

    Often, this event can be generated by attackers when searching for available windows
    servers in the network.

    '
references:
    - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=4825
fields:
    - EventCode
    - AccountName
    - ClientAddress
falsepositives:
    - Valid user was not added to RDP group
tags:
    - attack.lateral-movement
    - attack.t1021.001
date: '2020-06-27'
modified: '2021-11-27'
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4825
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: security
            mapped_at: null
    detection_fields:
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
