title: SCM Database Handle Failure
id: 13addce7-47b2-4ca0-a98f-1de964d1d669
status: test
level: medium
author: Roberto Rodriguez @Cyb3rWard0g
description: Detects non-system users failing to get a handle of the SCM database.
references:
    - https://threathunterplaybook.com/hunts/windows/190826-RemoteSCMHandle/notebook.html
falsepositives:
    - Unknown
tags:
    - attack.discovery
    - attack.t1010
date: '2019-08-12'
modified: '2022-07-11'
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4656
        ObjectType: SC_MANAGER OBJECT
        ObjectName: ServicesActive
        AccessMask: '0xf003f'
    filter:
        SubjectLogonId: '0x3e4'
    condition: selection and not filter
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:55:29.317346+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-12-04T01:55:29.317346+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:55:29.317389+00:00'
        -   source_field: ObjectType
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:29.317405+00:00'
        -   source_field: ObjectName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:29.317407+00:00'
        -   source_field: AccessMask
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:29.317409+00:00'
        -   source_field: SubjectLogonId
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:29.317410+00:00'
