id: 26481afe-db26-4228-b264-25a29fe6efc7
title: Uncommon Service Installation Image Path
status: test
level: medium
description: 'Detects uncommon service installation commands by looking at suspicious
    or uncommon image path values containing references to encoded powershell commands,
    temporary paths, etc.

    '
author: Florian Roth (Nextron Systems)
date: '2022-03-18'
modified: '2024-02-09'
tags:
    - attack.persistence
    - attack.privilege-escalation
    - car.2013-09-005
    - attack.t1543.003
references:
    - Internal Research
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''ca83e9f3-657a-45d0-88d6-c1ac280caf53''),
    type=<SigmaRelatedType.OBSOLETE: 4>), SigmaRelatedItem(id=UUID(''1d61f71d-59d2-479e-9562-4ff5f4ead16b''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    product: windows
    service: system
detection:
    selection:
        Provider_Name: Service Control Manager
        EventID: 7045
    suspicious_paths:
        ImagePath|contains:
            - \\.\pipe
            - \Users\Public\
            - \Windows\Temp\
    suspicious_encoded_flag:
        ImagePath|contains: ' -e'
    suspicious_encoded_keywords:
        ImagePath|contains:
            - ' aQBlAHgA'
            - ' aWV4I'
            - ' IAB'
            - ' JAB'
            - ' PAA'
            - ' SQBFAFgA'
            - ' SUVYI'
    filter_optional_thor_remote:
        ImagePath|startswith: C:\WINDOWS\TEMP\thor10-remote\thor64.exe
    filter_main_defender_def_updates:
        ImagePath|startswith: C:\ProgramData\Microsoft\Windows Defender\Definition
            Updates\
    condition: selection and ( suspicious_paths or all of suspicious_encoded_* ) and
        not 1 of filter_main_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:47:58.793538+00:00'
        service:
            source_field: service
            source_value: system
            mapped_at: '2025-11-26T02:47:58.793538+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-11-26T02:47:58.793563+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:47:58.793568+00:00'
        -   source_field: ImagePath
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-11-26T02:47:58.793572+00:00'
