title: BITS Transfer Job Download To Potential Suspicious Folder
id: f8a56cb7-a363-44ed-a82f-5926bb44cd05
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects new BITS transfer job where the LocalName/Saved file is stored
    in a potentially suspicious location
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1197/T1197.md
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.t1197
date: '2022-06-28'
modified: '2023-03-27'
logsource:
    product: windows
    service: bits-client
detection:
    selection:
        EventID: 16403
        LocalName|contains:
            - \Desktop\
            - C:\Users\Public\
            - C:\PerfLogs\
    condition: selection
ocsf_mapping:
    class_name: scheduled_job_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:56:19.926842+00:00'
        service:
            source_field: service
            source_value: bits-client
            mapped_at: '2025-12-04T01:56:19.926842+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: scheduled_job_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:56:19.926859+00:00'
        -   source_field: LocalName
            target_table: scheduled_job_activity
            target_field: job.name
            mapped_at: '2025-12-04T01:56:19.926861+00:00'
