id: 12ba6a38-adb3-4d6b-91ba-a7fb248e3199
title: Password Policy Enumerated
status: test
level: medium
description: Detects when the password policy is enumerated.
author: Zach Mathis
date: '2023-05-19'
tags:
    - attack.discovery
    - attack.t1201
references:
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4661
    - https://github.com/jpalanco/alienvault-ossim/blob/f74359c0c027e42560924b5cff25cdf121e5505a/os-sim/agent/src/ParserUtil.py#L951
taxonomy: sigma
logsource:
    product: windows
    service: security
    definition: dfd8c0f4-e6ad-4e07-b91b-f2fca0ddef64
detection:
    selection:
        EventID: 4661
        AccessList|contains: '%%5392'
        ObjectServer: Security Account Manager
    condition: selection
ocsf_mapping:
    class_name: user_access
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:45:00.059334+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-26T02:45:00.059334+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: user_access
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:45:00.837736+00:00'
        -   source_field: AccessList
            target_table: user_access
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:45:00.837760+00:00'
        -   source_field: ObjectServer
            target_table: user_access
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:45:00.837764+00:00'
