id: 8384bd26-bde6-4da9-8e5d-4174a7a47ca2
title: Query Tor Onion Address - DNS Client
status: test
level: high
description: Detects DNS resolution of an .onion address related to Tor routing networks
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-02-20'
tags:
    - attack.command-and-control
    - attack.t1090.003
references:
    - https://www.logpoint.com/en/blog/detecting-tor-use-with-logpoint/
falsepositives:
    - Unlikely
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''b55ca2a3-7cff-4dda-8bdd-c7bfa63bf544''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    product: windows
    service: dns-client
    definition: 'Requirements: Microsoft-Windows-DNS Client Events/Operational Event
        Log must be enabled/collected in order to receive the events.'
detection:
    selection:
        EventID: 3008
        QueryName|contains: .onion
    condition: selection
ocsf_mapping:
    class_name: dns_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:24:50.494672+00:00'
        service:
            source_field: service
            source_value: dns-client
            mapped_at: '2025-11-13T20:24:50.494672+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: dns_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:24:50.494705+00:00'
        -   source_field: QueryName
            target_table: dns_activity
            target_field: query.hostname
            mapped_at: '2025-11-13T20:24:50.494708+00:00'
