title: Query Tor Onion Address - DNS Client
id: 8384bd26-bde6-4da9-8e5d-4174a7a47ca2
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects DNS resolution of an .onion address related to Tor routing networks
references:
    - https://www.logpoint.com/en/blog/detecting-tor-use-with-logpoint/
falsepositives:
    - Unlikely
tags:
    - attack.command-and-control
    - attack.t1090.003
date: '2022-02-20'
logsource:
    product: windows
    service: dns-client
    definition: 'Requirements: Microsoft-Windows-DNS Client Events/Operational Event
        Log must be enabled/collected in order to receive the events.'
detection:
    selection:
        EventID: 3008
        QueryName|contains: .onion
    condition: selection
related:
    -   id: b55ca2a3-7cff-4dda-8bdd-c7bfa63bf544
        type: similar
ocsf_mapping:
    class_name: dns_activity
    activity_id: 1
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:56:34.748266+00:00'
        service:
            source_field: service
            source_value: dns-client
            mapped_at: '2025-12-04T01:56:34.748266+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: dns_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:56:34.748285+00:00'
        -   source_field: QueryName
            target_table: dns_activity
            target_field: query.hostname
            mapped_at: '2025-12-04T01:56:34.748287+00:00'
