title: New BITS Job Created Via PowerShell
id: fe3a2d49-f255-4d10-935c-bda7391108eb
status: test
level: low
author: frack113
description: Detects the creation of a new bits job by PowerShell
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1197/T1197.md
falsepositives:
    - Administrator PowerShell scripts
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.t1197
date: '2022-03-01'
modified: '2023-03-27'
logsource:
    product: windows
    service: bits-client
detection:
    selection:
        EventID: 3
        processPath|endswith:
            - \powershell.exe
            - \pwsh.exe
    condition: selection
ocsf_mapping:
    class_name: scheduled_job_activity
    activity_id: 1
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:56:21.486846+00:00'
        service:
            source_field: service
            source_value: bits-client
            mapped_at: '2025-12-04T01:56:21.486846+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: scheduled_job_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:56:21.486865+00:00'
        -   source_field: processPath
            target_table: scheduled_job_activity
            target_field: actor.process.name
            mapped_at: '2025-12-04T01:56:21.486868+00:00'
