id: f6de6525-4509-495a-8a82-1f8b0ed73a00
title: Remote Task Creation via ATSVC Named Pipe
status: test
level: medium
description: Detects remote task creation via at.exe or API interacting with ATSVC
    namedpipe
author: Samir Bousseaden
date: '2019-04-03'
modified: '2024-08-01'
tags:
    - attack.lateral-movement
    - attack.persistence
    - car.2013-05-004
    - car.2015-04-001
    - attack.t1053.002
references:
    - https://web.archive.org/web/20230409194125/https://blog.menasec.net/2019/03/threat-hunting-25-scheduled-tasks-for.html
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: windows
    service: security
    definition: The advanced audit policy setting "Object Access > Audit Detailed
        File Share" must be configured for Success/Failure
detection:
    selection:
        EventID: 5145
        ShareName: \\\*\IPC$
        RelativeTargetName: atsvc
        AccessList|contains: WriteData
    condition: selection
ocsf_mapping:
    class_name: network_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:45:19.212359+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-26T02:45:19.212359+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: network_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:45:19.212387+00:00'
        -   source_field: ShareName
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:45:19.212390+00:00'
        -   source_field: RelativeTargetName
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:45:19.212393+00:00'
        -   source_field: AccessList
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:45:19.212395+00:00'
