id: 8b69fd42-9dad-4674-abef-7fdef43ef92a
title: DNS Query To Put.io - DNS Client
status: experimental
level: medium
description: Detects DNS queries for subdomains related to "Put.io" sharing website.
author: Omar Khaled (@beacon_exe)
date: '2024-08-23'
tags:
    - attack.command-and-control
references:
    - https://darkatlas.io/blog/medusa-ransomware-group-opsec-failure
falsepositives:
    - Legitimate DNS queries and usage of Put.io
taxonomy: sigma
logsource:
    product: windows
    service: dns-client
    definition: 'Requirements: Microsoft-Windows-DNS Client Events/Operational Event
        Log must be enabled/collected in order to receive the events.'
detection:
    selection:
        EventID: 3008
        QueryName|contains:
            - api.put.io
            - upload.put.io
    condition: selection
ocsf_mapping:
    class_name: dns_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:24:50.498778+00:00'
        service:
            source_field: service
            source_value: dns-client
            mapped_at: '2025-11-13T20:24:50.498778+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: dns_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:24:50.498792+00:00'
        -   source_field: QueryName
            target_table: dns_activity
            target_field: query.hostname
            mapped_at: '2025-11-13T20:24:50.498796+00:00'
