title: All Rules Have Been Deleted From The Windows Firewall Configuration
id: 79609c82-a488-426e-abcf-9f341a39365d
status: test
level: high
author: frack113, Nasreddine Bencherchali (Nextron Systems)
description: Detects when a all the rules have been deleted from the Windows Defender
    Firewall configuration
references:
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)
tags:
    - attack.defense-evasion
    - attack.t1562.004
date: '2023-01-17'
modified: '2024-01-22'
logsource:
    product: windows
    service: firewall-as
detection:
    selection:
        EventID:
            - 2033
            - 2059
    filter_main_svchost:
        ModifyingApplication|endswith: :\Windows\System32\svchost.exe
    filter_optional_msmpeng:
        ModifyingApplication|contains|all:
            - :\ProgramData\Microsoft\Windows Defender\Platform\
            - \MsMpEng.exe
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: network_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:55:12.594307+00:00'
        service:
            source_field: service
            source_value: firewall-as
            mapped_at: '2025-12-04T01:55:12.594307+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: network_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:55:12.594330+00:00'
        -   source_field: ModifyingApplication
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:12.594333+00:00'
