title: CodeIntegrity - Blocked Image/Driver Load For Policy Violation
id: e4be5675-4a53-426a-8c81-a8bb2387e947
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects blocked load events that did not meet the authenticode signing
    level requirements or violated the code integrity policy.
references:
    - https://twitter.com/wdormann/status/1590434950335320065
    - https://github.com/MicrosoftDocs/windows-itpro-docs/blob/40fe118976734578f83e5e839b9c63ae7a4af82d/windows/security/threat-protection/windows-defender-application-control/event-id-explanations.md#windows-codeintegrity-operational-log
    - https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/operations/event-id-explanations
falsepositives:
    - Unknown
tags:
    - attack.privilege-escalation
    - attack.t1543
date: '2022-11-10'
modified: '2023-06-07'
logsource:
    product: windows
    service: codeintegrity-operational
detection:
    selection:
        EventID: 3077
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: codeintegrity-operational
            mapped_at: null
    detection_fields:
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
