id: 18beca67-ab3e-4ee3-ba7a-a46ca8d7d0cc
title: Sysmon Channel Reference Deletion
status: test
level: high
description: Potential threat actor tampering with Sysmon manifest and eventually
    disabling it
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: '2020-07-14'
modified: '2022-10-05'
tags:
    - attack.defense-evasion
    - attack.t1112
references:
    - https://twitter.com/Flangvik/status/1283054508084473861
    - https://twitter.com/SecurityJosh/status/1283027365770276866
    - https://securityjosh.github.io/2020/04/23/Mute-Sysmon.html
    - https://gist.github.com/Cyb3rWard0g/cf08c38c61f7e46e8404b38201ca01c8
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: windows
    service: security
detection:
    selection1:
        EventID: 4657
        ObjectName|contains:
            - WINEVT\Publishers\{5770385f-c22a-43e0-bf4c-06f5698ffbd9}
            - WINEVT\Channels\Microsoft-Windows-Sysmon/Operational
        ObjectValueName: Enabled
        NewValue: 0
    selection2:
        EventID: 4663
        ObjectName|contains:
            - WINEVT\Publishers\{5770385f-c22a-43e0-bf4c-06f5698ffbd9}
            - WINEVT\Channels\Microsoft-Windows-Sysmon/Operational
        AccessMask: 65536
    condition: 1 of selection*
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:46:28.710206+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-26T02:46:28.710206+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:46:28.710267+00:00'
        -   source_field: ObjectName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:46:28.710272+00:00'
        -   source_field: ObjectValueName
            target_table: process_activity
            target_field: observables.value
            mapped_at: '2025-11-26T02:46:28.710276+00:00'
        -   source_field: NewValue
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:46:28.710279+00:00'
        -   source_field: AccessMask
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:46:28.710282+00:00'
