title: RemCom Service Installation
id: 9e36ed87-4986-482e-8e3b-5c23ffff11bf
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects RemCom service installation and execution events
references:
    - https://github.com/kavika13/RemCom/
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1569.002
date: '2023-08-07'
logsource:
    product: windows
    service: system
detection:
    selection_eid:
        Provider_Name: Service Control Manager
        EventID: 7045
    selection_service:
        ServiceName: RemComSvc
        ImagePath|endswith: \RemComSvc.exe
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:56:58.231171+00:00'
        service:
            source_field: service
            source_value: system
            mapped_at: '2025-12-04T01:56:58.231171+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-12-04T01:56:58.231189+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:56:58.231191+00:00'
        -   source_field: ServiceName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:56:58.231193+00:00'
        -   source_field: ImagePath
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-12-04T01:56:58.231194+00:00'
