id: 9b72b82d-f1c5-4632-b589-187159bc6ec1
title: CodeIntegrity - Blocked Driver Load With Revoked Certificate
status: test
level: high
description: Detects blocked load attempts of revoked drivers
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-06-06'
tags:
    - attack.privilege-escalation
    - attack.t1543
references:
    - https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/operations/event-id-explanations
    - https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/operations/event-tag-explanations
    - Internal Research
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: windows
    service: codeintegrity-operational
detection:
    selection:
        EventID: 3023
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:24:55.515138+00:00'
        service:
            source_field: service
            source_value: codeintegrity-operational
            mapped_at: '2025-11-13T20:24:55.515138+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:24:55.515155+00:00'
