title: DPAPI Domain Master Key Backup Attempt
id: 39a94fd1-8c9a-4ff6-bf22-c058762f8014
status: test
level: medium
author: Roberto Rodriguez @Cyb3rWard0g
description: Detects anyone attempting a backup for the DPAPI Master Key. This events
    gets generated at the source and not the Domain Controller.
references:
    - https://threathunterplaybook.com/hunts/windows/190620-DomainDPAPIBackupKeyExtraction/notebook.html
fields:
    - ComputerName
    - SubjectDomainName
    - SubjectUserName
falsepositives:
    - If a computer is a member of a domain, DPAPI has a backup mechanism to allow
        unprotection of the data. Which will trigger this event.
tags:
    - attack.credential-access
    - attack.t1003.004
date: '2019-08-10'
modified: '2023-03-15'
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4692
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: security
            mapped_at: null
    detection_fields:
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
