title: Startup/Logon Script Added to Group Policy Object
id: 123e4e6d-b123-48f8-b261-7214938acaf0
status: experimental
level: medium
author: Elastic, Josh Nickels, Marius Rothenbücher
description: 'Detects the modification of Group Policy Objects (GPO) to add a startup/logon
    script to users or computer objects.

    '
references:
    - https://www.elastic.co/guide/en/security/current/startup-logon-script-added-to-group-policy-object.html
falsepositives:
    - Legitimate execution by system administrators.
tags:
    - attack.privilege-escalation
    - attack.t1484.001
    - attack.t1547
date: '2024-09-06'
logsource:
    product: windows
    service: security
    definition: The advanced audit policy setting "Object Access > Audit Detailed
        File Share" must be configured for Success/Failure
detection:
    selection_eventid:
        EventID:
            - 5136
            - 5145
    selection_attributes_main:
        AttributeLDAPDisplayName:
            - gPCMachineExtensionNames
            - gPCUserExtensionNames
        AttributeValue|contains: 42B5FAAE-6536-11D2-AE5A-0000F87571E3
    selection_attributes_optional:
        AttributeValue|contains:
            - 40B6664F-4972-11D1-A7CA-0000F87571E3
            - 40B66650-4972-11D1-A7CA-0000F87571E3
    selection_share:
        ShareName|endswith: \SYSVOL
        RelativeTargetName|endswith:
            - \scripts.ini
            - \psscripts.ini
        AccessList|contains: '%%4417'
    condition: selection_eventid and (all of selection_attributes_* or selection_share)
ocsf_mapping:
    class_name: scheduled_job_activity
    activity_id: 3
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:55:59.889278+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-12-04T01:55:59.889278+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: scheduled_job_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:55:59.889309+00:00'
        -   source_field: AttributeLDAPDisplayName
            target_table: scheduled_job_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:59.889313+00:00'
        -   source_field: AttributeValue
            target_table: scheduled_job_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:59.889316+00:00'
        -   source_field: ShareName
            target_table: scheduled_job_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:59.889319+00:00'
        -   source_field: RelativeTargetName
            target_table: scheduled_job_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:59.889321+00:00'
        -   source_field: AccessList
            target_table: scheduled_job_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:59.889324+00:00'
