id: a2e5019d-a658-4c6a-92bf-7197b54e2cae
title: PowerShell Scripts Installed as Services
status: test
level: high
description: Detects powershell script installed as a Service
author: oscd.community, Natalia Shornikova
date: '2020-10-06'
modified: '2022-12-25'
tags:
    - attack.execution
    - attack.t1569.002
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: windows
    service: system
detection:
    selection:
        Provider_Name: Service Control Manager
        EventID: 7045
        ImagePath|contains:
            - powershell
            - pwsh
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:48:10.653412+00:00'
        service:
            source_field: service
            source_value: system
            mapped_at: '2025-11-26T02:48:10.653412+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-11-26T02:48:10.653435+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:48:10.653439+00:00'
        -   source_field: ImagePath
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-11-26T02:48:10.653441+00:00'
