id: 300bac00-e041-4ee2-9c36-e262656a6ecc
title: Active Directory User Backdoors
status: test
level: high
description: Detects scenarios where one can control another users or computers account
    without having to use their credentials.
author: '@neu5ron'
date: '2017-04-13'
modified: '2024-02-26'
tags:
    - attack.t1098
    - attack.persistence
references:
    - https://msdn.microsoft.com/en-us/library/cc220234.aspx
    - https://adsecurity.org/?p=3466
    - https://blog.harmj0y.net/redteaming/another-word-on-delegation/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: windows
    service: security
    definition: 'Requirements: Audit Policy : Account Management > Audit User Account
        Management, Group Policy : Computer Configuration\Windows Settings\Security
        Settings\Advanced Audit Policy Configuration\Audit Policies\Account Management\Audit
        User Account Management, DS Access > Audit Directory Service Changes, Group
        Policy : Computer Configuration\Windows Settings\Security Settings\Advanced
        Audit Policy Configuration\Audit Policies\DS Access\Audit Directory Service
        Changes'
detection:
    selection1:
        EventID: 4738
    filter_empty:
        AllowedToDelegateTo:
            - ''
            - '-'
    filter_null:
        AllowedToDelegateTo: null
    selection_5136_1:
        EventID: 5136
        AttributeLDAPDisplayName: msDS-AllowedToDelegateTo
    selection_5136_2:
        EventID: 5136
        ObjectClass: user
        AttributeLDAPDisplayName: servicePrincipalName
    selection_5136_3:
        EventID: 5136
        AttributeLDAPDisplayName: msDS-AllowedToActOnBehalfOfOtherIdentity
    condition: (selection1 and not 1 of filter_*) or 1 of selection_5136_*
ocsf_mapping:
    class_name: account_change
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:45:48.417556+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-26T02:45:48.417556+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: account_change
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:45:49.187146+00:00'
        -   source_field: AllowedToDelegateTo
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:45:49.187163+00:00'
        -   source_field: AttributeLDAPDisplayName
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:45:49.187166+00:00'
        -   source_field: ObjectClass
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:45:49.187168+00:00'
