id: 1bbf25b9-8038-4154-a50b-118f2a32be27
title: Suspicious Windows ANONYMOUS LOGON Local Account Created
status: test
level: high
description: Detects the creation of suspicious accounts similar to ANONYMOUS LOGON,
    such as using additional spaces. Created as an covering detection for exclusion
    of Logon Type 3 from ANONYMOUS LOGON accounts.
author: James Pemberton / @4A616D6573
date: '2019-10-31'
modified: '2022-10-09'
tags:
    - attack.persistence
    - attack.t1136.001
    - attack.t1136.002
references:
    - https://twitter.com/SBousseaden/status/1189469425482829824
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4720
        SamAccountName|contains|all:
            - ANONYMOUS
            - LOGON
    condition: selection
ocsf_mapping:
    class_name: account_change
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:23:24.182685+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-13T20:23:24.182685+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: account_change
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:23:24.182704+00:00'
        -   source_field: SamAccountName
            target_table: account_change
            target_field: actor.user.name
            mapped_at: '2025-11-13T20:23:24.182706+00:00'
