title: PAExec Service Installation
id: de7ce410-b3fb-4e8a-b38c-3b999e2c3420
status: test
level: medium
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects PAExec service installation
references:
    - https://www.poweradmin.com/paexec/
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1569.002
date: '2022-10-26'
logsource:
    product: windows
    service: system
detection:
    selection_eid:
        Provider_Name: Service Control Manager
        EventID: 7045
    selection_image:
        ServiceName|startswith: PAExec-
        ImagePath|startswith: C:\WINDOWS\PAExec-
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:57:10.914845+00:00'
        service:
            source_field: service
            source_value: system
            mapped_at: '2025-12-04T01:57:10.914845+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-12-04T01:57:10.914862+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:57:10.914872+00:00'
        -   source_field: ServiceName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:57:10.914874+00:00'
        -   source_field: ImagePath
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-12-04T01:57:10.914876+00:00'
