id: 962fe167-e48d-4fd6-9974-11e5b9a5d6d1
title: LSASS Access From Non System Account
status: test
level: medium
description: Detects potential mimikatz-like tools accessing LSASS from non system
    account
author: Roberto Rodriguez @Cyb3rWard0g
date: '2019-06-20'
modified: '2023-12-11'
tags:
    - attack.credential-access
    - attack.t1003.001
references:
    - https://threathunterplaybook.com/hunts/windows/170105-LSASSMemoryReadAccess/notebook.html
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID:
            - 4663
            - 4656
        AccessMask:
            - '0x100000'
            - '0x1010'
            - '0x1400'
            - '0x1410'
            - '0x1418'
            - '0x1438'
            - '0x143a'
            - '0x1f0fff'
            - '0x1f1fff'
            - '0x1f2fff'
            - '0x1f3fff'
            - '0x40'
            - 143a
            - 1f0fff
            - 1f1fff
            - 1f2fff
            - 1f3fff
        ObjectType: Process
        ObjectName|endswith: \lsass.exe
    filter_main_service_account:
        SubjectUserName|endswith: $
    filter_main_generic:
        ProcessName|contains:
            - :\Program Files\
            - :\Program Files (x86)\
    filter_main_wmiprvse:
        ProcessName: C:\Windows\System32\wbem\WmiPrvSE.exe
        AccessMask: '0x1410'
    filter_optional_steam:
        ProcessName|contains: \SteamLibrary\steamapps\
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: process_activity
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:46:07.480249+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-26T02:46:07.480249+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:46:07.480304+00:00'
        -   source_field: AccessMask
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:46:07.480309+00:00'
        -   source_field: ObjectType
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:46:07.480312+00:00'
        -   source_field: ObjectName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:46:07.480316+00:00'
        -   source_field: SubjectUserName
            target_table: process_activity
            target_field: actor.user.name
            mapped_at: '2025-11-26T02:46:07.480319+00:00'
        -   source_field: ProcessName
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:46:07.480322+00:00'
