id: 87261fb2-69d0-42fe-b9de-88c6b5f65a43
title: Atera Agent Installation
status: test
level: high
description: Detects successful installation of Atera Remote Monitoring & Management
    (RMM) agent as recently found to be used by Conti operators
author: Bhabesh Raj
date: '2021-09-01'
modified: '2022-12-25'
tags:
    - attack.t1219
references:
    - https://www.advintel.io/post/secret-backdoor-behind-conti-ransomware-operation-introducing-atera-agent
falsepositives:
    - Legitimate Atera agent installation
taxonomy: sigma
logsource:
    product: windows
    service: application
detection:
    selection:
        EventID: 1033
        Provider_Name: MsiInstaller
        Message|contains: AteraAgent
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:25:45.865705+00:00'
        service:
            source_field: service
            source_value: application
            mapped_at: '2025-11-13T20:25:45.865705+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:25:47.314440+00:00'
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-11-13T20:25:47.314447+00:00'
        -   source_field: Message
            target_table: process_activity
            target_field: message
            mapped_at: '2025-11-13T20:25:47.314449+00:00'
