title: DCERPC SMB Spoolss Named Pipe
id: 214e8f95-100a-4e04-bb31-ef6cba8ce07e
status: test
level: medium
author: OTR (Open Threat Research)
description: Detects the use of the spoolss named pipe over SMB. This can be used
    to trigger the authentication via NTLM of any machine that has the spoolservice
    enabled.
references:
    - https://posts.specterops.io/hunting-in-active-directory-unconstrained-delegation-forests-trusts-71f2b33688e1
    - https://dirkjanm.io/a-different-way-of-abusing-zerologon/
    - https://twitter.com/_dirkjan/status/1309214379003588608
falsepositives:
    - Domain Controllers acting as printer servers too? :)
tags:
    - attack.lateral-movement
    - attack.t1021.002
date: '2018-11-28'
modified: '2022-08-11'
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 5145
        ShareName: \\\*\IPC$
        RelativeTargetName: spoolss
    condition: selection
ocsf_mapping:
    class_name: network_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:55:34.972061+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-12-04T01:55:34.972061+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: network_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:55:34.972090+00:00'
        -   source_field: ShareName
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:34.972093+00:00'
        -   source_field: RelativeTargetName
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:34.972096+00:00'
