id: eca81e8d-09e1-4d04-8614-c91f44fd0519
title: New Firewall Rule Added In Windows Firewall Exception List Via WmiPrvSE.EXE
status: experimental
level: medium
description: 'Detects the addition of a new "Allow" firewall rule by the WMI process
    (WmiPrvSE.EXE).

    This can occur if an attacker leverages PowerShell cmdlets such as "New-NetFirewallRule",
    or directly uses WMI CIM classes such as "MSFT_NetFirewallRule".

    '
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: '2024-05-10'
tags:
    - attack.defense-evasion
    - attack.t1562.004
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.004/T1562.004.md#atomic-test-24---set-a-firewall-rule-using-new-netfirewallrule
    - https://malware.news/t/the-rhysida-ransomware-activity-analysis-and-ties-to-vice-society/72170
    - https://cybersecuritynews.com/rhysida-ransomware-attacking-windows/
falsepositives:
    - Administrator scripts or activity.
taxonomy: sigma
logsource:
    product: windows
    service: firewall-as
detection:
    selection:
        EventID:
            - 2004
            - 2071
            - 2097
        Action: 3
        ModifyingApplication|endswith: :\Windows\System32\wbem\WmiPrvSE.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:22:13.563402+00:00'
        service:
            source_field: service
            source_value: firewall-as
            mapped_at: '2025-11-13T20:22:13.563402+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:22:14.782039+00:00'
        -   source_field: Action
            target_table: process_activity
            target_field: action
            mapped_at: '2025-11-13T20:22:14.782066+00:00'
        -   source_field: ModifyingApplication
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:22:14.782070+00:00'
