id: 9c8afa4d-0022-48f0-9456-3712466f9701
title: Tap Driver Installation - Security
status: test
level: low
description: 'Detects the installation of a well-known TAP driver service. This could
    be a sign of potential preparation for data exfiltration using tunnelling techniques.

    '
author: Daniil Yugoslavskiy, Ian Davis, oscd.community
date: '2019-10-24'
modified: '2022-11-29'
tags:
    - attack.exfiltration
    - attack.t1048
references:
    - https://community.openvpn.net/openvpn/wiki/ManagingWindowsTAPDrivers
falsepositives:
    - Legitimate OpenVPN TAP installation
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''8e4cf0e5-aa5d-4dc3-beff-dc26917744a9''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    product: windows
    service: security
    definition: 'Requirements: The System Security Extension audit subcategory need
        to be enabled to log the EID 4697'
detection:
    selection:
        EventID: 4697
        ServiceFileName|contains: tap0901
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:22:48.636285+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-13T20:22:48.636285+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:22:48.636317+00:00'
        -   source_field: ServiceFileName
            target_table: process_activity
            target_field: process.file.name
            mapped_at: '2025-11-13T20:22:48.636321+00:00'
