title: Moriya Rootkit - System
id: 25b9c01c-350d-4b95-bed1-836d04a4f324
status: test
level: critical
author: Bhabesh Raj
description: Detects the use of Moriya rootkit as described in the securelist's Operation
    TunnelSnake report
references:
    - https://securelist.com/operation-tunnelsnake-and-moriya-rootkit/101831
falsepositives:
    - Unknown
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1543.003
date: '2021-05-06'
modified: '2022-11-29'
logsource:
    product: windows
    service: system
detection:
    selection:
        Provider_Name: Service Control Manager
        EventID: 7045
        ServiceName: ZzNetSvc
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:57:11.444413+00:00'
        service:
            source_field: service
            source_value: system
            mapped_at: '2025-12-04T01:57:11.444413+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-12-04T01:57:11.444436+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:57:11.444440+00:00'
        -   source_field: ServiceName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:57:11.444442+00:00'
