id: 076ebe48-cc05-4d8f-9d41-89245cd93a14
title: Remote Access Tool - ScreenConnect Command Execution
status: test
level: low
description: Detects command execution via ScreenConnect RMM
author: Ali Alwashali
date: '2023-10-10'
tags:
    - attack.execution
    - attack.t1059.003
references:
    - https://www.huntandhackett.com/blog/revil-the-usage-of-legitimate-remote-admin-tooling
    - https://github.com/SigmaHQ/sigma/pull/4467
falsepositives:
    - Legitimate use of ScreenConnect
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''b1f73849-6329-4069-bc8f-78a604bb8b23''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    product: windows
    service: application
detection:
    selection:
        Provider_Name: ScreenConnect
        EventID: 200
        Data|contains: Executed command of length
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:48:58.533982+00:00'
        service:
            source_field: service
            source_value: application
            mapped_at: '2025-11-26T02:48:58.533982+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-11-26T02:48:58.533995+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:48:58.533997+00:00'
        -   source_field: Data
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:48:58.533998+00:00'
