id: 098d7118-55bc-4912-a836-dc6483a8d150
title: Access To ADMIN$ Network Share
status: test
level: low
description: Detects access to ADMIN$ network share
author: Florian Roth (Nextron Systems)
date: '2017-03-04'
modified: '2024-01-16'
tags:
    - attack.lateral-movement
    - attack.t1021.002
references:
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-5140
falsepositives:
    - Legitimate administrative activity
taxonomy: sigma
logsource:
    product: windows
    service: security
    definition: 'Requirements: The advanced audit policy setting "Object Access >
        Audit File Share" must be configured for Success/Failure'
detection:
    selection:
        EventID: 5140
        ShareName: Admin$
    filter_main_computer_account:
        SubjectUserName|endswith: $
    condition: selection and not 1 of filter_*
ocsf_mapping:
    class_name: network_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:24:05.599830+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-13T20:24:05.599830+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: network_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:24:05.599845+00:00'
        -   source_field: ShareName
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:24:05.599847+00:00'
        -   source_field: SubjectUserName
            target_table: network_activity
            target_field: actor.user.name
            mapped_at: '2025-11-13T20:24:05.599848+00:00'
