id: f6de9536-0441-4b3f-a646-f4e00f300ffd
title: Weak Encryption Enabled and Kerberoast
status: test
level: high
description: Detects scenario where weak encryption is enabled for a user profile
    which could be used for hash/password cracking.
author: '@neu5ron'
date: '2017-07-30'
modified: '2021-11-27'
tags:
    - attack.defense-evasion
    - attack.t1562.001
references:
    - https://adsecurity.org/?p=2053
    - https://blog.harmj0y.net/redteaming/another-word-on-delegation/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: windows
    service: security
    definition: 'Requirements: Audit Policy : Account Management > Audit User Account
        Management, Group Policy : Computer Configuration\Windows Settings\Security
        Settings\Advanced Audit Policy Configuration\Audit Policies\Account Management\Audit
        User Account Management'
detection:
    selection:
        EventID: 4738
    olduac_des:
        OldUacValue|endswith:
            - 8???
            - 9???
            - A???
            - B???
            - C???
            - D???
            - E???
            - F???
    newuac_des:
        NewUacValue|endswith:
            - 8???
            - 9???
            - A???
            - B???
            - C???
            - D???
            - E???
            - F???
    olduac_preauth:
        OldUacValue|endswith:
            - 1????
            - 3????
            - 5????
            - 7????
            - 9????
            - B????
            - D????
            - F????
    newuac_preauth:
        NewUacValue|endswith:
            - 1????
            - 3????
            - 5????
            - 7????
            - 9????
            - B????
            - D????
            - F????
    olduac_encrypted:
        OldUacValue|endswith:
            - 8??
            - 9??
            - A??
            - B??
            - C??
            - D??
            - E??
            - F??
    newuac_encrypted:
        NewUacValue|endswith:
            - 8??
            - 9??
            - A??
            - B??
            - C??
            - D??
            - E??
            - F??
    condition: selection and ((newuac_des and not olduac_des) or (newuac_preauth and
        not olduac_preauth) or (newuac_encrypted and not olduac_encrypted))
ocsf_mapping:
    class_name: account_change
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:45:53.659597+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-26T02:45:53.659597+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: account_change
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:45:54.628861+00:00'
        -   source_field: OldUacValue
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:45:54.628878+00:00'
        -   source_field: NewUacValue
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:45:54.628881+00:00'
