title: HackTool Service Registration or Execution
id: d26ce60c-2151-403c-9a42-49420d87b5e4
status: test
level: high
author: Florian Roth (Nextron Systems)
description: Detects installation or execution of services
references:
    - Internal Research
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1569.002
    - attack.s0029
date: '2022-03-21'
modified: '2023-08-07'
logsource:
    product: windows
    service: system
detection:
    selection_eid:
        Provider_Name: Service Control Manager
        EventID:
            - 7045
            - 7036
    selection_service_name:
        ServiceName|contains:
            - cachedump
            - DumpSvc
            - gsecdump
            - pwdump
            - UACBypassedService
            - WCE SERVICE
            - WCESERVICE
            - winexesvc
    selection_service_image:
        ImagePath|contains: bypass
    condition: selection_eid and 1 of selection_service_*
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:57:09.622057+00:00'
        service:
            source_field: service
            source_value: system
            mapped_at: '2025-12-04T01:57:09.622057+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-12-04T01:57:09.622073+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:57:09.622075+00:00'
        -   source_field: ServiceName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:57:09.622076+00:00'
        -   source_field: ImagePath
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-12-04T01:57:09.622077+00:00'
