title: Protected Storage Service Access
id: 45545954-4016-43c6-855e-eae8f1c369dc
status: test
level: high
author: Roberto Rodriguez @Cyb3rWard0g
description: Detects access to a protected_storage service over the network. Potential
    abuse of DPAPI to extract domain backup keys from Domain Controllers
references:
    - https://threathunterplaybook.com/hunts/windows/190620-DomainDPAPIBackupKeyExtraction/notebook.html
falsepositives:
    - Unknown
tags:
    - attack.lateral-movement
    - attack.t1021.002
date: '2019-08-10'
modified: '2021-11-27'
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 5145
        ShareName|contains: IPC
        RelativeTargetName: protected_storage
    condition: selection
ocsf_mapping:
    class_name: network_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:55:41.151565+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-12-04T01:55:41.151565+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: network_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:55:41.151590+00:00'
        -   source_field: ShareName
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:41.151593+00:00'
        -   source_field: RelativeTargetName
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:41.151595+00:00'
