id: b237c54b-0f15-4612-a819-44b735e0de27
title: A Security-Enabled Global Group Was Deleted
status: stable
level: low
description: Detects activity when a security-enabled global group is deleted
author: Alexandr Yampolskyi, SOC Prime
date: '2023-04-26'
tags:
    - attack.persistence
    - attack.t1098
references:
    - https://www.cisecurity.org/controls/cis-controls-list/
    - https://www.pcisecuritystandards.org/documents/PCI_DSS_v3-2-1.pdf
    - https://nvlpubs.nist.gov/nistpubs/CSWP/NIST.CSWP.04162018.pdf
    - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=4730
    - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=634
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''9cf01b6c-e723-4841-a868-6d7f8245ca6e''),
    type=<SigmaRelatedType.OBSOLETE: 4>)])'
taxonomy: sigma
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID:
            - 4730
            - 634
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: security
            mapped_at: null
    detection_fields:
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
