title: First Time Seen Remote Named Pipe
id: 52d8b0c6-53d6-439a-9e41-52ad442ad9ad
status: test
level: high
author: Samir Bousseaden
description: This detection excludes known namped pipes accessible remotely and notify
    on newly observed ones, may help to detect lateral movement and remote exec using
    named pipes
references:
    - https://twitter.com/menasec1/status/1104489274387451904
falsepositives:
    - Update the excluded named pipe to filter out any newly observed legit named
        pipe
tags:
    - attack.lateral-movement
    - attack.t1021.002
date: '2019-04-03'
modified: '2023-03-14'
logsource:
    product: windows
    service: security
    definition: The advanced audit policy setting "Object Access > Audit Detailed
        File Share" must be configured for Success/Failure
detection:
    selection1:
        EventID: 5145
        ShareName: \\\*\IPC$
    false_positives:
        RelativeTargetName:
            - atsvc
            - samr
            - lsarpc
            - lsass
            - winreg
            - netlogon
            - srvsvc
            - protected_storage
            - wkssvc
            - browser
            - netdfs
            - svcctl
            - spoolss
            - ntsvcs
            - LSM_API_service
            - HydraLsPipe
            - TermSrv_API_service
            - MsFteWds
            - sql\query
            - eventlog
    condition: selection1 and not false_positives
ocsf_mapping:
    class_name: network_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:55:52.796526+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-12-04T01:55:52.796526+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: network_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:55:52.796543+00:00'
        -   source_field: ShareName
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:52.796589+00:00'
        -   source_field: RelativeTargetName
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:52.796590+00:00'
