id: 090ffaad-c01a-4879-850c-6d57da98452d
title: DNS Query To Ufile.io - DNS Client
status: test
level: low
description: Detects DNS queries to "ufile.io", which was seen abused by malware and
    threat actors as a method for data exfiltration
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-01-16'
modified: '2023-09-18'
tags:
    - attack.exfiltration
    - attack.t1567.002
references:
    - https://thedfirreport.com/2021/12/13/diavol-ransomware/
falsepositives:
    - DNS queries for "ufile" are not malicious by nature necessarily. Investigate
        the source to determine the necessary actions to take
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''1cbbeaaf-3c8c-4e4c-9d72-49485b6a176b''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    product: windows
    service: dns-client
    definition: 'Requirements: Microsoft-Windows-DNS Client Events/Operational Event
        Log must be enabled/collected in order to receive the events.'
detection:
    selection:
        EventID: 3008
        QueryName|contains: ufile.io
    condition: selection
ocsf_mapping:
    class_name: dns_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:24:50.508498+00:00'
        service:
            source_field: service
            source_value: dns-client
            mapped_at: '2025-11-13T20:24:50.508498+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: dns_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:24:50.508507+00:00'
        -   source_field: QueryName
            target_table: dns_activity
            target_field: query.hostname
            mapped_at: '2025-11-13T20:24:50.508510+00:00'
