id: 70f00d10-60b2-4f34-b9a0-dc3df3fe762a
title: Suspicious Service Installation Script
status: test
level: high
description: Detects suspicious service installation scripts
author: pH-T (Nextron Systems)
date: '2022-03-18'
modified: '2024-03-05'
tags:
    - attack.persistence
    - attack.privilege-escalation
    - car.2013-09-005
    - attack.t1543.003
references:
    - Internal Research
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: windows
    service: system
detection:
    selection_eid:
        Provider_Name: Service Control Manager
        EventID: 7045
    selection_cmd_flags:
        ImagePath|contains|windash:
            - ' -c '
            - ' -r '
            - ' -k '
    selection_binaries:
        ImagePath|contains:
            - cscript
            - mshta
            - powershell
            - pwsh
            - regsvr32
            - rundll32
            - wscript
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:25:18.954630+00:00'
        service:
            source_field: service
            source_value: system
            mapped_at: '2025-11-13T20:25:18.954630+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-11-13T20:25:18.954637+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:25:18.954639+00:00'
        -   source_field: ImagePath
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-11-13T20:25:18.954640+00:00'
