title: SAM Registry Hive Handle Request
id: f8748f2c-89dc-4d95-afb0-5a2dfdbad332
status: test
level: high
author: Roberto Rodriguez @Cyb3rWard0g
description: Detects handles requested to SAM registry hive
references:
    - https://threathunterplaybook.com/hunts/windows/190725-SAMRegistryHiveHandleRequest/notebook.html
fields:
    - ComputerName
    - SubjectDomainName
    - SubjectUserName
    - ProcessName
    - ObjectName
falsepositives:
    - Unknown
tags:
    - attack.discovery
    - attack.t1012
    - attack.credential-access
    - attack.t1552.002
date: '2019-08-12'
modified: '2021-11-27'
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4656
        ObjectType: Key
        ObjectName|endswith: \SAM
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:55:54.839612+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-12-04T01:55:54.839612+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:55:54.839627+00:00'
        -   source_field: ObjectType
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:54.839629+00:00'
        -   source_field: ObjectName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:54.839630+00:00'
