id: b3d57a5c-c92e-4b48-9a79-5f124b7cf964
title: MSSQL SPProcoption Set
status: test
level: high
description: Detects when the a stored procedure is set or cleared for automatic execution
    in MSSQL. A stored procedure that is set to automatic execution runs every time
    an instance of SQL Server is started
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-07-13'
modified: '2024-06-26'
tags:
    - attack.persistence
references:
    - https://www.netspi.com/blog/technical/network-penetration-testing/sql-server-persistence-part-1-startup-stored-procedures/
    - https://learn.microsoft.com/en-us/sql/relational-databases/system-stored-procedures/sp-procoption-transact-sql?view=sql-server-ver16
falsepositives:
    - Legitimate use of the feature by administrators (rare)
taxonomy: sigma
logsource:
    product: windows
    service: application
    definition: 'Requirements: MSSQL audit policy to monitor for "sp_procoption" must
        be enabled in order to receive this event in the application log'
detection:
    selection:
        Provider_Name|contains: MSSQL
        EventID: 33205
        Data|contains|all:
            - object_name:sp_procoption
            - statement:EXEC
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:25:47.330626+00:00'
        service:
            source_field: service
            source_value: application
            mapped_at: '2025-11-13T20:25:47.330626+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-11-13T20:25:47.330633+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:25:47.330635+00:00'
        -   source_field: Data
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:25:47.330636+00:00'
