id: bc92ca75-cd42-4d61-9a37-9d5aa259c88b
title: Win Defender Restored Quarantine File
status: test
level: high
description: Detects the restoration of files from the defender quarantine
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-12-06'
tags:
    - attack.defense-evasion
    - attack.t1562.001
references:
    - https://learn.microsoft.com/en-us/defender-endpoint/troubleshoot-microsoft-defender-antivirus?view=o365-worldwide
falsepositives:
    - Legitimate administrator activity restoring a file
taxonomy: sigma
logsource:
    product: windows
    service: windefend
detection:
    selection:
        EventID: 1009
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: windefend
            mapped_at: null
    detection_fields:
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
