title: Replay Attack Detected
id: 5a44727c-3b85-4713-8c44-4401d5499629
status: test
level: high
author: frack113
description: Detects possible Kerberos Replay Attack on the domain controllers when
    "KRB_AP_ERR_REPEAT" Kerberos response is sent to the client
references:
    - https://github.com/Yamato-Security/EnableWindowsLogSettings/blob/7f6d755d45ac7cc9fc35b0cbf498e6aa4ef19def/ConfiguringSecurityLogAuditPolicies.md
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4649
falsepositives:
    - Unknown
tags:
    - attack.credential-access
    - attack.t1558
date: '2022-10-14'
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4649
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: security
            mapped_at: null
    detection_fields:
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
