title: NTLM Brute Force
id: 9c8acf1a-cbf9-4db6-b63c-74baabe03e59
status: test
level: medium
author: Jerry Shockley '@jsh0x'
description: Detects common NTLM brute force device names
references:
    - https://www.varonis.com/blog/investigate-ntlm-brute-force
falsepositives:
    - Systems with names equal to the spoofed ones used by the brute force tools
tags:
    - attack.credential-access
    - attack.t1110
date: '2022-02-02'
logsource:
    product: windows
    service: ntlm
    definition: Requires events from Microsoft-Windows-NTLM/Operational
detection:
    selection:
        EventID: 8004
    devicename:
        WorkstationName:
            - Rdesktop
            - Remmina
            - Freerdp
            - Windows7
            - Windows8
            - Windows2012
            - Windows2016
            - Windows2019
    condition: selection and devicename
ocsf_mapping:
    class_name: authentication
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:56:25.101562+00:00'
        service:
            source_field: service
            source_value: ntlm
            mapped_at: '2025-12-04T01:56:25.101562+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: authentication
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:56:25.101594+00:00'
        -   source_field: WorkstationName
            target_table: authentication
            target_field: dst_endpoint.hostname
            mapped_at: '2025-12-04T01:56:25.101599+00:00'
