id: 9e1a1fdf-ee58-40ce-8e15-b66ca5a80e1f
title: Previously Installed IIS Module Was Removed
status: experimental
level: low
description: Detects the removal of a previously installed IIS module.
author: Nasreddine Bencherchali
date: '2024-10-06'
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.t1562.002
    - attack.t1505.004
references:
    - https://learn.microsoft.com/en-us/iis/manage/provisioning-and-managing-iis/configure-logging-in-iis
    - https://www.microsoft.com/en-us/security/blog/2022/12/12/iis-modules-the-evolution-of-web-shells-and-how-to-detect-them/
    - https://www.microsoft.com/en-us/security/blog/2022/07/26/malicious-iis-extensions-quietly-open-persistent-backdoors-into-servers/
    - https://learn.microsoft.com/en-us/iis/get-started/introduction-to-iis/iis-modules-overview
falsepositives:
    - Legitimate administrator activity
taxonomy: sigma
logsource:
    product: windows
    service: iis-configuration
detection:
    selection:
        EventID: 29
        Configuration|contains: /system.webServer/modules/remove
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:24:21.482953+00:00'
        service:
            source_field: service
            source_value: iis-configuration
            mapped_at: '2025-11-13T20:24:21.482953+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: file_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:24:21.482979+00:00'
        -   source_field: Configuration
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:24:21.482981+00:00'
