title: Group Policy Abuse for Privilege Addition
id: 1c480e10-7ee1-46d4-8ed2-85f9789e3ce4
status: experimental
level: medium
author: Elastic, Josh Nickels, Marius Rothenbücher
description: 'Detects the first occurrence of a modification to Group Policy Object
    Attributes to add privileges to user accounts or use them to add users as local
    admins.

    '
references:
    - https://www.elastic.co/guide/en/security/current/group-policy-abuse-for-privilege-addition.html#_setup_275
falsepositives:
    - Users allowed to perform these modifications (user found in field SubjectUserName)
tags:
    - attack.privilege-escalation
    - attack.t1484.001
date: '2024-09-04'
logsource:
    product: windows
    service: security
    definition: 'Requirements: The "Audit Directory Service Changes" logging policy
        must be configured in order to receive events.'
detection:
    selection:
        EventID: 5136
        AttributeLDAPDisplayName: gPCMachineExtensionNames
        AttributeValue|contains:
            - 827D319E-6EAC-11D2-A4EA-00C04F79F83A
            - 803E14A0-B4FB-11D0-A0D0-00A0C90F574B
    condition: selection
ocsf_mapping:
    class_name: group_management
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:55:33.421860+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-12-04T01:55:33.421860+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: group_management
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:55:33.421899+00:00'
        -   source_field: AttributeLDAPDisplayName
            target_table: group_management
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:33.421902+00:00'
        -   source_field: AttributeValue
            target_table: group_management
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:33.421905+00:00'
