id: 39a94fd1-8c9a-4ff6-bf22-c058762f8014
title: DPAPI Domain Master Key Backup Attempt
status: test
level: medium
description: Detects anyone attempting a backup for the DPAPI Master Key. This events
    gets generated at the source and not the Domain Controller.
author: Roberto Rodriguez @Cyb3rWard0g
date: '2019-08-10'
modified: '2023-03-15'
tags:
    - attack.credential-access
    - attack.t1003.004
references:
    - https://threathunterplaybook.com/hunts/windows/190620-DomainDPAPIBackupKeyExtraction/notebook.html
fields:
    - ComputerName
    - SubjectDomainName
    - SubjectUserName
falsepositives:
    - If a computer is a member of a domain, DPAPI has a backup mechanism to allow
        unprotection of the data. Which will trigger this event.
taxonomy: sigma
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4692
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:24:05.603208+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-13T20:24:05.603208+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:24:05.603213+00:00'
