title: Successful Account Login Via WMI
id: 5af54681-df95-4c26-854f-2565e13cfab0
status: stable
level: low
author: Thomas Patzke
description: Detects successful logon attempts performed with WMI
references:
    - Internal Research
falsepositives:
    - Monitoring tools
    - Legitimate system administration
tags:
    - attack.execution
    - attack.t1047
date: '2019-12-04'
modified: '2024-01-17'
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4624
        ProcessName|endswith: \WmiPrvSE.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:56:51.782445+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-12-04T01:56:51.782445+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:56:51.782466+00:00'
        -   source_field: ProcessName
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:56:51.782468+00:00'
