title: NTLMv1 Logon Between Client and Server
id: e9d4ab66-a532-4ef7-a502-66a9e4a34f5d
status: test
level: medium
author: Tim Shelton, Nasreddine Bencherchali (Nextron Systems)
description: Detects the reporting of NTLMv1 being used between a client and server.
    NTLMv1 is insecure as the underlying encryption algorithms can be brute-forced
    by modern hardware.
references:
    - https://github.com/nasbench/EVTX-ETW-Resources/blob/f1b010ce0ee1b71e3024180de1a3e67f99701fe4/ETWProvidersManifests/Windows10/22H2/W10_22H2_Pro_20230321_19045.2728/WEPExplorer/LsaSrv.xml
falsepositives:
    - Environments that use NTLMv1
tags:
    - attack.defense-evasion
    - attack.lateral-movement
    - attack.t1550.002
date: '2022-04-26'
modified: '2023-06-06'
logsource:
    product: windows
    service: system
detection:
    selection:
        Provider_Name: LsaSrv
        EventID:
            - 6038
            - 6039
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: system
            mapped_at: null
    detection_fields:
        -   source_field: Provider_Name
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
