title: A Member Was Removed From a Security-Enabled Global Group
id: 02c39d30-02b5-45d2-b435-8aebfe5a8629
status: stable
level: low
author: Alexandr Yampolskyi, SOC Prime
description: Detects activity when a member is removed from a security-enabled global
    group
references:
    - https://www.cisecurity.org/controls/cis-controls-list/
    - https://www.pcisecuritystandards.org/documents/PCI_DSS_v3-2-1.pdf
    - https://nvlpubs.nist.gov/nistpubs/CSWP/NIST.CSWP.04162018.pdf
    - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=4729
    - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=633
falsepositives:
    - Unknown
tags:
    - attack.persistence
    - attack.t1098
date: '2023-04-26'
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID:
            - 633
            - 4729
    condition: selection
related:
    -   id: 9cf01b6c-e723-4841-a868-6d7f8245ca6e
        type: obsolete
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: security
            mapped_at: null
    detection_fields:
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
