title: Remote Access Tool - ScreenConnect Command Execution
id: 076ebe48-cc05-4d8f-9d41-89245cd93a14
status: test
level: low
author: Ali Alwashali
description: Detects command execution via ScreenConnect RMM
references:
    - https://www.huntandhackett.com/blog/revil-the-usage-of-legitimate-remote-admin-tooling
    - https://github.com/SigmaHQ/sigma/pull/4467
falsepositives:
    - Legitimate use of ScreenConnect
tags:
    - attack.execution
    - attack.t1059.003
date: '2023-10-10'
logsource:
    product: windows
    service: application
detection:
    selection:
        Provider_Name: ScreenConnect
        EventID: 200
        Data|contains: Executed command of length
    condition: selection
related:
    -   id: b1f73849-6329-4069-bc8f-78a604bb8b23
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:57:36.012460+00:00'
        service:
            source_field: service
            source_value: application
            mapped_at: '2025-12-04T01:57:36.012460+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-12-04T01:57:36.012476+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:57:36.012479+00:00'
        -   source_field: Data
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:57:36.012481+00:00'
