id: 192a0330-c20b-4356-90b6-7b7049ae0b87
title: Successful Overpass the Hash Attempt
status: test
level: high
description: Detects successful logon with logon type 9 (NewCredentials) which matches
    the Overpass the Hash behavior of e.g Mimikatz's sekurlsa::pth module.
author: Roberto Rodriguez (source), Dominik Schaudel (rule)
date: '2018-02-12'
modified: '2021-11-27'
tags:
    - attack.lateral-movement
    - attack.s0002
    - attack.t1550.002
references:
    - https://web.archive.org/web/20220419045003/https://cyberwardog.blogspot.com/2017/04/chronicles-of-threat-hunter-hunting-for.html
falsepositives:
    - Runas command-line tool using /netonly parameter
taxonomy: sigma
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4624
        LogonType: 9
        LogonProcessName: seclogo
        AuthenticationPackageName: Negotiate
    condition: selection
ocsf_mapping:
    class_name: authentication
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:25:12.055305+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-13T20:25:12.055305+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: authentication
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:25:12.055395+00:00'
        -   source_field: LogonType
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:25:12.055399+00:00'
        -   source_field: LogonProcessName
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:25:12.055403+00:00'
        -   source_field: AuthenticationPackageName
            target_table: authentication
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:25:12.055406+00:00'
