id: 910ab938-668b-401b-b08c-b596e80fdca5
title: Transferring Files with Credential Data via Network Shares
status: test
level: medium
description: Transferring files with well-known filenames (sensitive files with credential
    data) using network shares
author: Teymur Kheirkhabarov, oscd.community
date: '2019-10-22'
modified: '2021-11-30'
tags:
    - attack.credential-access
    - attack.t1003.002
    - attack.t1003.001
    - attack.t1003.003
references:
    - https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
falsepositives:
    - Transferring sensitive files for legitimate administration work by legitimate
        administrator
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''2e69f167-47b5-4ae7-a390-47764529eff5''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 5145
        RelativeTargetName|contains:
            - \mimidrv
            - \lsass
            - \windows\minidump\
            - \hiberfil
            - \sqldmpr
            - \sam
            - \ntds.dit
            - \security
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:46:02.808050+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-26T02:46:02.808050+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: file_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:46:02.808083+00:00'
        -   source_field: RelativeTargetName
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-26T02:46:02.808085+00:00'
