id: c92c24e7-f595-493f-9c98-53d5142f5c18
title: CodeIntegrity - Unsigned Image Loaded
status: test
level: high
description: Detects loaded unsigned image on the system
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-06-06'
tags:
    - attack.privilege-escalation
references:
    - https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/operations/event-id-explanations
    - https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/operations/event-tag-explanations
    - Internal Research
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    product: windows
    service: codeintegrity-operational
detection:
    selection:
        EventID: 3037
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:24:58.877201+00:00'
        service:
            source_field: service
            source_value: codeintegrity-operational
            mapped_at: '2025-11-13T20:24:58.877201+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:24:58.877217+00:00'
