id: f0d1feba-4344-4ca9-8121-a6c97bd6df52
title: Credential Dumping Tools Service Execution - Security
status: test
level: high
description: Detects well-known credential dumping tools execution via service execution
    events
author: Florian Roth (Nextron Systems), Teymur Kheirkhabarov, Daniil Yugoslavskiy,
    oscd.community
date: '2017-03-05'
modified: '2022-11-29'
tags:
    - attack.credential-access
    - attack.execution
    - attack.t1003.001
    - attack.t1003.002
    - attack.t1003.004
    - attack.t1003.005
    - attack.t1003.006
    - attack.t1569.002
    - attack.s0005
references:
    - https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
falsepositives:
    - Legitimate Administrator using credential dumping tool for password recovery
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''4976aa50-8f41-45c6-8b15-ab3fc10e79ed''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    product: windows
    service: security
    definition: The 'System Security Extension' audit subcategory need to be enabled
        to log the EID 4697
detection:
    selection:
        EventID: 4697
        ServiceFileName|contains:
            - cachedump
            - dumpsvc
            - fgexec
            - gsecdump
            - mimidrv
            - pwdump
            - servpw
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:45:45.735001+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-26T02:45:45.735001+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:45:45.735028+00:00'
        -   source_field: ServiceFileName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:45:45.735032+00:00'
