id: 2632954e-db1c-49cb-9936-67d1ef1d17d2
title: Addition of SID History to Active Directory Object
status: stable
level: medium
description: An attacker can use the SID history attribute to gain additional privileges.
author: Thomas Patzke, @atc_project (improvements)
date: '2017-02-19'
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1134.005
references:
    - https://adsecurity.org/?p=1772
falsepositives:
    - Migration of an account into a new domain
taxonomy: sigma
logsource:
    product: windows
    service: security
detection:
    selection1:
        EventID:
            - 4765
            - 4766
    selection2:
        EventID: 4738
    selection3:
        SidHistory:
            - '-'
            - '%%1793'
    filter_null:
        SidHistory: null
    condition: selection1 or (selection2 and not selection3 and not filter_null)
ocsf_mapping:
    class_name: account_change
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:45:44.138332+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-26T02:45:44.138332+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: account_change
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:45:44.804907+00:00'
        -   source_field: SidHistory
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:45:44.804922+00:00'
