title: Suspicious Access to Sensitive File Extensions
id: 91c945bc-2ad1-4799-a591-4d00198a1215
status: test
level: medium
author: Samir Bousseaden
description: Detects known sensitive file extensions accessed on a network share
references:
    - Internal Research
falsepositives:
    - Help Desk operator doing backup or re-imaging end user machine or backup software
    - Users working with these data types or exchanging message files
tags:
    - attack.collection
    - attack.t1039
date: '2019-04-03'
modified: '2022-10-09'
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 5145
        RelativeTargetName|endswith:
            - .bak
            - .dmp
            - .edb
            - .kirbi
            - .msg
            - .nsf
            - .nst
            - .oab
            - .ost
            - .pst
            - .rdp
            - \groups.xml
    condition: selection
related:
    -   id: 286b47ed-f6fe-40b3-b3a8-35129acd43bc
        type: similar
ocsf_mapping:
    class_name: file_activity
    activity_id: 2
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:56:10.277979+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-12-04T01:56:10.277979+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: file_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:56:10.277994+00:00'
        -   source_field: RelativeTargetName
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:56:10.277996+00:00'
