id: 85cce894-dd8b-4427-a958-5cc47a4dc9b9
title: Remote Utilities Host Service Install
status: test
level: medium
description: Detects Remote Utilities Host service installation on the target system.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-10-31'
tags:
    - attack.persistence
references:
    - https://www.remoteutilities.com/support/kb/host-service-won-t-start/
falsepositives:
    - Legitimate use of the tool
taxonomy: sigma
logsource:
    product: windows
    service: system
detection:
    selection_root:
        Provider_Name: Service Control Manager
        EventID: 7045
    selection_service:
        ImagePath|contains|all:
            - \rutserv.exe
            - -service
        ServiceName: Remote Utilities - Host
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:48:01.645356+00:00'
        service:
            source_field: service
            source_value: system
            mapped_at: '2025-11-26T02:48:01.645356+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-11-26T02:48:01.645390+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:48:01.645394+00:00'
        -   source_field: ImagePath
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-11-26T02:48:01.645396+00:00'
        -   source_field: ServiceName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:48:01.645399+00:00'
