id: ebfe73c2-5bc9-4ed9-aaa8-8b54b2b4777d
title: MSSQL Server Failed Logon From External Network
status: experimental
level: medium
description: Detects failed logon attempts from clients with external network IP to
    an MSSQL server. This can be a sign of a bruteforce attack.
author: j4son
date: '2023-10-11'
modified: '2024-06-26'
tags:
    - attack.credential-access
    - attack.t1110
references:
    - https://cybersecthreat.com/2020/07/08/enable-mssql-authentication-log-to-eventlog/
    - https://www.experts-exchange.com/questions/27800944/EventID-18456-Failed-to-open-the-explicitly-specified-database.html
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''218d2855-2bba-4f61-9c85-81d0ea63ac71''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    product: windows
    service: application
    definition: 'Requirements: Must enable MSSQL authentication.'
detection:
    selection:
        Provider_Name|contains: MSSQL
        EventID: 18456
    filter_main_local_ips:
        Data|contains:
            - 'CLIENT: 10.'
            - 'CLIENT: 172.16.'
            - 'CLIENT: 172.17.'
            - 'CLIENT: 172.18.'
            - 'CLIENT: 172.19.'
            - 'CLIENT: 172.20.'
            - 'CLIENT: 172.21.'
            - 'CLIENT: 172.22.'
            - 'CLIENT: 172.23.'
            - 'CLIENT: 172.24.'
            - 'CLIENT: 172.25.'
            - 'CLIENT: 172.26.'
            - 'CLIENT: 172.27.'
            - 'CLIENT: 172.28.'
            - 'CLIENT: 172.29.'
            - 'CLIENT: 172.30.'
            - 'CLIENT: 172.31.'
            - 'CLIENT: 192.168.'
            - 'CLIENT: 127.'
            - 'CLIENT: 169.254.'
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: process_activity
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:48:55.893898+00:00'
        service:
            source_field: service
            source_value: application
            mapped_at: '2025-11-26T02:48:55.893898+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-11-26T02:48:55.893910+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:48:55.893912+00:00'
        -   source_field: Data
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:48:55.893913+00:00'
