id: f598ea0c-c25a-4f72-a219-50c44411c791
title: Possible Shadow Credentials Added
status: test
level: high
description: Detects possible addition of shadow credentials to an active directory
    object.
author: Nasreddine Bencherchali (Nextron Systems), Elastic (idea)
date: '2022-10-17'
tags:
    - attack.credential-access
    - attack.t1556
references:
    - https://www.elastic.co/guide/en/security/8.4/potential-shadow-credentials-added-to-ad-object.html
    - https://cyberstoph.org/posts/2022/03/detecting-shadow-credentials/
    - https://twitter.com/SBousseaden/status/1581300963650187264?
falsepositives:
    - Modifications in the msDS-KeyCredentialLink attribute can be done legitimately
        by the Azure AD Connect synchronization account or the ADFS service account.
        These accounts can be added as Exceptions. (From elastic FP section)
taxonomy: sigma
logsource:
    product: windows
    service: security
    definition: The "Audit Directory Service Changes" logging policy must be configured
        in order to receive events. Audit events are generated only for objects with
        configured system access control lists (SACLs). Audit events are generated
        only for objects with configured system access control lists (SACLs) and only
        when accessed in a manner that matches their SACL settings. This policy covers
        the following events ids - 5136, 5137, 5138, 5139, 5141. Note that the default
        policy does not cover User objects. For that a custom AuditRule need to be
        setup (See https://github.com/OTRF/Set-AuditRule)
detection:
    selection:
        EventID: 5136
        AttributeLDAPDisplayName: msDS-KeyCredentialLink
    condition: selection
ocsf_mapping:
    class_name: account_change
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:43:30.052930+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-26T02:43:30.052930+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: account_change
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:43:30.903144+00:00'
        -   source_field: AttributeLDAPDisplayName
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:43:30.903153+00:00'
