title: New Module Module Added To IIS Server
id: dd857d3e-0c6e-457b-9b48-e82ae7f86bd7
status: experimental
level: medium
author: frack113
description: Detects the addition of a new module to an IIS server.
references:
    - https://learn.microsoft.com/en-us/iis/manage/provisioning-and-managing-iis/configure-logging-in-iis
    - https://www.microsoft.com/en-us/security/blog/2022/12/12/iis-modules-the-evolution-of-web-shells-and-how-to-detect-them/
    - https://www.microsoft.com/en-us/security/blog/2022/07/26/malicious-iis-extensions-quietly-open-persistent-backdoors-into-servers/
    - https://learn.microsoft.com/en-us/iis/get-started/introduction-to-iis/iis-modules-overview
falsepositives:
    - Legitimate administrator activity
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.t1562.002
    - attack.t1505.004
date: '2024-10-06'
logsource:
    product: windows
    service: iis-configuration
detection:
    selection:
        EventID: 29
        Configuration|contains: /system.webServer/modules/add
    filter_main_builtin:
        NewValue:
            - AnonymousAuthenticationModule
            - CustomErrorModule
            - DefaultDocumentModule
            - DirectoryListingModule
            - FileCacheModule
            - HttpCacheModule
            - HttpLoggingModule
            - ProtocolSupportModule
            - RequestFilteringModule
            - StaticCompressionModule
            - StaticFileModule
            - TokenCacheModule
            - UriCacheModule
    filter_main_remove:
        NewValue: ''
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: file_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:56:22.864098+00:00'
        service:
            source_field: service
            source_value: iis-configuration
            mapped_at: '2025-12-04T01:56:22.864098+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: file_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:56:22.864111+00:00'
        -   source_field: Configuration
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:56:22.864113+00:00'
        -   source_field: NewValue
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:56:22.864114+00:00'
