id: bc2e25ed-b92b-4daa-b074-b502bdd1982b
title: Local Privilege Escalation Indicator TabTip
status: test
level: high
description: Detects the invocation of TabTip via CLSID as seen when JuicyPotatoNG
    is used on a system in brute force mode
author: Florian Roth (Nextron Systems)
date: '2022-10-07'
modified: '2023-04-14'
tags:
    - attack.execution
    - attack.t1557.001
references:
    - https://github.com/antonioCoco/JuicyPotatoNG
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: windows
    service: system
detection:
    selection:
        Provider_Name: Microsoft-Windows-DistributedCOM
        EventID: 10001
        param1: C:\Program Files\Common Files\microsoft shared\ink\TabTip.exe
        param2: 2147943140
        param3: '{054AAE20-4BEA-4347-8A35-64A533254A9D}'
    condition: selection
ocsf_mapping:
    class_name: network_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:25:30.704113+00:00'
        service:
            source_field: service
            source_value: system
            mapped_at: '2025-11-13T20:25:30.704113+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: network_activity
            target_field: metadata.log_provider
            mapped_at: '2025-11-13T20:25:32.189776+00:00'
        -   source_field: EventID
            target_table: network_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:25:32.189790+00:00'
        -   source_field: param1
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:25:32.189791+00:00'
        -   source_field: param2
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:25:32.189793+00:00'
        -   source_field: param3
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:25:32.189794+00:00'
