id: bc92ca75-cd42-4d61-9a37-9d5aa259c88b
title: Win Defender Restored Quarantine File
status: test
level: high
description: Detects the restoration of files from the defender quarantine
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-12-06'
tags:
    - attack.defense-evasion
    - attack.t1562.001
references:
    - https://learn.microsoft.com/en-us/defender-endpoint/troubleshoot-microsoft-defender-antivirus?view=o365-worldwide
falsepositives:
    - Legitimate administrator activity restoring a file
taxonomy: sigma
logsource:
    product: windows
    service: windefend
detection:
    selection:
        EventID: 1009
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:24:40.084380+00:00'
        service:
            source_field: service
            source_value: windefend
            mapped_at: '2025-11-13T20:24:40.084380+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:24:40.084393+00:00'
