id: 843544a7-56e0-4dcc-a44f-5cc266dd97d6
title: Meterpreter or Cobalt Strike Getsystem Service Installation - System
status: test
level: high
description: Detects the use of getsystem Meterpreter/Cobalt Strike command by detecting
    a specific service installation
author: Teymur Kheirkhabarov, Ecco, Florian Roth (Nextron Systems)
date: '2019-10-26'
modified: '2023-11-15'
tags:
    - attack.privilege-escalation
    - attack.t1134.001
    - attack.t1134.002
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
    - https://blog.cobaltstrike.com/2014/04/02/what-happens-when-i-type-getsystem/
falsepositives:
    - Unlikely
taxonomy: sigma
logsource:
    product: windows
    service: system
detection:
    selection_id:
        Provider_Name: Service Control Manager
        EventID: 7045
    selection_cli_cmd:
        ImagePath|contains|all:
            - /c
            - echo
            - \pipe\
        ImagePath|contains:
            - cmd
            - '%COMSPEC%'
    selection_cli_rundll:
        ImagePath|contains|all:
            - rundll32
            - .dll,a
            - '/p:'
    selection_cli_share:
        ImagePath|startswith: \\127.0.0.1\ADMIN$\
    condition: selection_id and 1 of selection_cli_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:25:21.484938+00:00'
        service:
            source_field: service
            source_value: system
            mapped_at: '2025-11-13T20:25:21.484938+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-11-13T20:25:21.484950+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:25:21.484953+00:00'
        -   source_field: ImagePath
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-11-13T20:25:21.484955+00:00'
