title: Password Dumper Activity on LSASS
id: aa1697b7-d611-4f9a-9cb2-5125b4ccfd5c
status: test
level: high
author: sigma
description: Detects process handle on LSASS process with certain access mask and
    object type SAM_DOMAIN
references:
    - https://twitter.com/jackcr/status/807385668833968128
falsepositives:
    - Unknown
tags:
    - attack.credential-access
    - attack.t1003.001
date: '2017-02-12'
modified: '2022-10-09'
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4656
        ProcessName|endswith: \lsass.exe
        AccessMask: '0x705'
        ObjectType: SAM_DOMAIN
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:55:30.480299+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-12-04T01:55:30.480299+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:55:30.480322+00:00'
        -   source_field: ProcessName
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:55:30.480340+00:00'
        -   source_field: AccessMask
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:30.480343+00:00'
        -   source_field: ObjectType
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:30.480345+00:00'
