id: 50cb47b8-2c33-4b23-a2e9-4600657d9746
title: Loading Diagcab Package From Remote Path
status: test
level: high
description: Detects loading of diagcab packages from a remote path, as seen in DogWalk
    vulnerability
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-08-14'
tags:
    - attack.execution
references:
    - https://twitter.com/nas_bench/status/1539679555908141061
    - https://twitter.com/j00sean/status/1537750439701225472
falsepositives:
    - Legitimate package hosted on a known and authorized remote location
taxonomy: sigma
logsource:
    product: windows
    service: diagnosis-scripted
detection:
    selection:
        EventID: 101
        PackagePath|contains: \\
    condition: selection
ocsf_mapping:
    class_name: script_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:49:01.524195+00:00'
        service:
            source_field: service
            source_value: diagnosis-scripted
            mapped_at: '2025-11-26T02:49:01.524195+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: script_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:49:02.336561+00:00'
        -   source_field: PackagePath
            target_table: script_activity
            target_field: script.file.path
            mapped_at: '2025-11-26T02:49:02.336570+00:00'
