id: 49e5bc24-8b86-49f1-b743-535f332c2856
title: Microsoft Defender Tamper Protection Trigger
status: stable
level: high
description: Detects blocked attempts to change any of Defender's settings such as
    "Real Time Monitoring" and "Behavior Monitoring"
author: Bhabesh Raj, Nasreddine Bencherchali
date: '2021-07-05'
modified: '2022-12-06'
tags:
    - attack.defense-evasion
    - attack.t1562.001
references:
    - https://bhabeshraj.com/post/tampering-with-microsoft-defenders-tamper-protection
    - https://learn.microsoft.com/en-us/defender-endpoint/troubleshoot-microsoft-defender-antivirus?view=o365-worldwide
falsepositives:
    - Administrator might try to disable defender features during testing (must be
        investigated)
taxonomy: sigma
logsource:
    product: windows
    service: windefend
detection:
    selection:
        EventID: 5013
        Value|endswith:
            - \Windows Defender\DisableAntiSpyware
            - \Windows Defender\DisableAntiVirus
            - \Windows Defender\Scan\DisableArchiveScanning
            - \Windows Defender\Scan\DisableScanningNetworkFiles
            - \Real-Time Protection\DisableRealtimeMonitoring
            - \Real-Time Protection\DisableBehaviorMonitoring
            - \Real-Time Protection\DisableIOAVProtection
            - \Real-Time Protection\DisableScriptScanning
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:47:06.626113+00:00'
        service:
            source_field: service
            source_value: windefend
            mapped_at: '2025-11-26T02:47:06.626113+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:47:07.357894+00:00'
        -   source_field: Value
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:47:07.357919+00:00'
