title: Volume Shadow Copy Mount
id: f512acbf-e662-4903-843e-97ce4652b740
status: test
level: low
author: Roberto Rodriguez @Cyb3rWard0g, Open Threat Research (OTR)
description: Detects volume shadow copy mount via Windows event log
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003.002/T1003.002.md#atomic-test-3---esentutlexe-sam-copy
falsepositives:
    - Legitimate use of volume shadow copy mounts (backups maybe).
tags:
    - attack.credential-access
    - attack.t1003.002
date: '2020-10-20'
modified: '2022-12-25'
logsource:
    product: windows
    service: system
detection:
    selection:
        Provider_Name: Microsoft-Windows-Ntfs
        EventID: 98
        DeviceName|contains: HarddiskVolumeShadowCopy
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: 12
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:57:24.019919+00:00'
        service:
            source_field: service
            source_value: system
            mapped_at: '2025-12-04T01:57:24.019919+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: file_activity
            target_field: metadata.log_provider
            mapped_at: '2025-12-04T01:57:24.019931+00:00'
        -   source_field: EventID
            target_table: file_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:57:24.019933+00:00'
        -   source_field: DeviceName
            target_table: file_activity
            target_field: device.name
            mapped_at: '2025-12-04T01:57:24.019938+00:00'
