id: 641a4bfb-c017-44f7-800c-2aee0184ce9b
title: Invoke-Obfuscation Via Use Rundll32 - System
status: test
level: high
description: Detects Obfuscated Powershell via use Rundll32 in Scripts
author: Nikita Nazarov, oscd.community
date: '2020-10-09'
modified: '2022-11-29'
tags:
    - attack.defense-evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
references:
    - https://github.com/SigmaHQ/sigma/issues/1009
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: windows
    service: system
detection:
    selection:
        Provider_Name: Service Control Manager
        EventID: 7045
        ImagePath|contains|all:
            - '&&'
            - rundll32
            - shell32.dll
            - shellexec_rundll
        ImagePath|contains:
            - value
            - invoke
            - comspec
            - iex
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:48:27.589571+00:00'
        service:
            source_field: service
            source_value: system
            mapped_at: '2025-11-26T02:48:27.589571+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-11-26T02:48:27.589598+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:48:27.589600+00:00'
        -   source_field: ImagePath
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-11-26T02:48:27.589601+00:00'
