title: Atera Agent Installation
id: 87261fb2-69d0-42fe-b9de-88c6b5f65a43
status: test
level: high
author: Bhabesh Raj
description: Detects successful installation of Atera Remote Monitoring & Management
    (RMM) agent as recently found to be used by Conti operators
references:
    - https://www.advintel.io/post/secret-backdoor-behind-conti-ransomware-operation-introducing-atera-agent
falsepositives:
    - Legitimate Atera agent installation
tags:
    - attack.t1219
date: '2021-09-01'
modified: '2022-12-25'
logsource:
    product: windows
    service: application
detection:
    selection:
        EventID: 1033
        Provider_Name: MsiInstaller
        Message|contains: AteraAgent
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:57:28.234027+00:00'
        service:
            source_field: service
            source_value: application
            mapped_at: '2025-12-04T01:57:28.234027+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:57:28.234042+00:00'
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-12-04T01:57:28.234044+00:00'
        -   source_field: Message
            target_table: process_activity
            target_field: message
            mapped_at: '2025-12-04T01:57:28.234046+00:00'
