id: 9e2575e7-2cb9-4da1-adc8-ed94221dca5e
title: New Firewall Rule Added In Windows Firewall Exception List For Potential Suspicious
    Application
status: experimental
level: high
description: Detects the addition of a new rule to the Windows Firewall exception
    list for an application located in a potentially suspicious location.
author: frack113
date: '2023-02-26'
modified: '2024-05-10'
tags:
    - attack.defense-evasion
    - attack.t1562.004
references:
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)
    - https://app.any.run/tasks/7123e948-c91e-49e0-a813-00e8d72ab393/#
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''cde0a575-7d3d-4a49-9817-b8004a7bf105''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    product: windows
    service: firewall-as
detection:
    selection:
        EventID:
            - 2004
            - 2071
            - 2097
        ApplicationPath|contains:
            - :\PerfLogs\
            - :\Temp\
            - :\Tmp\
            - :\Users\Public\
            - :\Windows\Tasks\
            - :\Windows\Temp\
            - \AppData\Local\Temp\
    filter_main_block:
        Action: 2
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: network_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:22:15.814415+00:00'
        service:
            source_field: service
            source_value: firewall-as
            mapped_at: '2025-11-13T20:22:15.814415+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: network_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:22:17.221715+00:00'
        -   source_field: ApplicationPath
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:22:17.221726+00:00'
        -   source_field: Action
            target_table: network_activity
            target_field: action
            mapped_at: '2025-11-13T20:22:17.221729+00:00'
