id: a0cb7110-edf0-47a4-9177-541a4083128a
title: Vulnerable Netlogon Secure Channel Connection Allowed
status: test
level: high
description: Detects that a vulnerable Netlogon secure channel connection was allowed,
    which could be an indicator of CVE-2020-1472.
author: NVISO
date: '2020-09-15'
modified: '2022-12-25'
tags:
    - attack.privilege-escalation
    - attack.t1548
references:
    - https://support.microsoft.com/en-us/help/4557222/how-to-manage-the-changes-in-netlogon-secure-channel-connections-assoc
fields:
    - SAMAccountName
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: windows
    service: system
detection:
    selection:
        Provider_Name: NetLogon
        EventID: 5829
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:25:29.493190+00:00'
        service:
            source_field: service
            source_value: system
            mapped_at: '2025-11-13T20:25:29.493190+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-11-13T20:25:29.493196+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:25:29.493198+00:00'
