title: Potential Credential Dumping Via WER - Application
id: a18e0862-127b-43ca-be12-1a542c75c7c5
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects Windows error reporting event where the process that crashed
    is lsass. This could be the cause of an intentional crash by techniques such as
    Lsass-Shtinkering to dump credential
references:
    - https://github.com/deepinstinct/Lsass-Shtinkering
    - https://media.defcon.org/DEF%20CON%2030/DEF%20CON%2030%20presentations/Asaf%20Gilboa%20-%20LSASS%20Shtinkering%20Abusing%20Windows%20Error%20Reporting%20to%20Dump%20LSASS.pdf
    - https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-erref/596a1078-e883-4972-9bbc-49e60bebca55
falsepositives:
    - Rare legitimate crashing of the lsass process
tags:
    - attack.credential-access
    - attack.t1003.001
date: '2022-12-07'
logsource:
    product: windows
    service: application
detection:
    selection:
        Provider_Name: Application Error
        EventID: 1000
        AppName: lsass.exe
        ExceptionCode: c0000001
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:57:27.681090+00:00'
        service:
            source_field: service
            source_value: application
            mapped_at: '2025-12-04T01:57:27.681090+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-12-04T01:57:27.681122+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:57:27.681126+00:00'
        -   source_field: AppName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:57:27.681129+00:00'
        -   source_field: ExceptionCode
            target_table: process_activity
            target_field: exit_code
            mapped_at: '2025-12-04T01:57:27.681132+00:00'
