id: 90f138c1-f578-4ac3-8c49-eecfd847c8b7
title: BITS Transfer Job Download From Direct IP
status: test
level: high
description: Detects a BITS transfer job downloading file(s) from a direct IP address.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-01-11'
modified: '2023-03-27'
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.t1197
references:
    - https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin
    - https://isc.sans.edu/diary/22264
    - https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/
    - https://blog.talosintelligence.com/breaking-the-silence-recent-truebot-activity/
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''99c840f2-2012-46fd-9141-c761987550ef''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    product: windows
    service: bits-client
detection:
    selection:
        EventID: 16403
        RemoteName|contains:
            - http://1
            - http://2
            - http://3
            - http://4
            - http://5
            - http://6
            - http://7
            - http://8
            - http://9
            - https://1
            - https://2
            - https://3
            - https://4
            - https://5
            - https://6
            - https://7
            - https://8
            - https://9
    filter_optional_local_networks:
        RemoteName|contains:
            - ://10.
            - ://192.168.
            - ://172.16.
            - ://172.17.
            - ://172.18.
            - ://172.19.
            - ://172.20.
            - ://172.21.
            - ://172.22.
            - ://172.23.
            - ://172.24.
            - ://172.25.
            - ://172.26.
            - ://172.27.
            - ://172.28.
            - ://172.29.
            - ://172.30.
            - ://172.31.
            - ://127.
            - ://169.254.
    filter_optional_seven_zip:
        RemoteName|contains:
            - https://7-
            - http://7-
    condition: selection and not 1 of filter_optional_*
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:24:16.967060+00:00'
        service:
            source_field: service
            source_value: bits-client
            mapped_at: '2025-11-13T20:24:16.967060+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:24:16.967095+00:00'
        -   source_field: RemoteName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:24:16.967099+00:00'
