title: Important Windows Event Auditing Disabled
id: ab4561b1-6c7e-48a7-ad08-087cfb9ce8f1
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects scenarios where system auditing for important events such as
    "Process Creation" or "Logon" events is disabled.
references:
    - https://docs.google.com/presentation/d/1dkrldTTlN3La-OjWtkWJBb4hVk6vfsSMBFBERs6R8zA/edit
    - https://github.com/SigmaHQ/sigma/blob/master/documentation/logsource-guides/windows/service/security.md
falsepositives:
    - Unlikely
tags:
    - attack.defense-evasion
    - attack.t1562.002
date: '2023-06-20'
modified: '2023-11-17'
logsource:
    product: windows
    service: security
    definition: dfd8c0f4-e6ad-4e07-b91b-f2fca0ddef64
detection:
    selection_state_success_and_failure:
        EventID: 4719
        SubcategoryGuid:
            - '{0CCE9210-69AE-11D9-BED3-505054503030}'
            - '{0CCE9211-69AE-11D9-BED3-505054503030}'
            - '{0CCE9212-69AE-11D9-BED3-505054503030}'
            - '{0CCE9215-69AE-11D9-BED3-505054503030}'
            - '{0CCE921B-69AE-11D9-BED3-505054503030}'
            - '{0CCE922B-69AE-11D9-BED3-505054503030}'
            - '{0CCE922F-69AE-11D9-BED3-505054503030}'
            - '{0CCE9230-69AE-11D9-BED3-505054503030}'
            - '{0CCE9235-69AE-11D9-BED3-505054503030}'
            - '{0CCE9236-69AE-11D9-BED3-505054503030}'
            - '{0CCE9237-69AE-11D9-BED3-505054503030}'
            - '{0CCE923F-69AE-11D9-BED3-505054503030}'
            - '{0CCE9240-69AE-11D9-BED3-505054503030}'
            - '{0CCE9242-69AE-11D9-BED3-505054503030}'
        AuditPolicyChanges|contains:
            - '%%8448'
            - '%%8450'
    selection_state_success_only:
        EventID: 4719
        SubcategoryGuid: '{0CCE9217-69AE-11D9-BED3-505054503030}'
        AuditPolicyChanges|contains: '%%8448'
    condition: 1 of selection_*
related:
    -   id: 69aeb277-f15f-4d2d-b32a-55e883609563
        type: derived
ocsf_mapping:
    class_name: entity_management
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:55:39.934781+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-12-04T01:55:39.934781+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: entity_management
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:55:39.934798+00:00'
        -   source_field: SubcategoryGuid
            target_table: entity_management
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:39.934801+00:00'
        -   source_field: AuditPolicyChanges
            target_table: entity_management
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:39.934803+00:00'
