id: 470ec5fa-7b4e-4071-b200-4c753100f49b
title: Failed Code Integrity Checks
status: stable
level: informational
description: 'Detects code integrity failures such as missing page hashes or corrupted
    drivers due unauthorized modification. This could be a sign of tampered binaries.

    '
author: Thomas Patzke
date: '2019-12-03'
modified: '2023-12-13'
tags:
    - attack.defense-evasion
    - attack.t1027.001
references:
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-5038
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-6281
falsepositives:
    - Disk device errors
taxonomy: sigma
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID:
            - 5038
            - 6281
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:23:16.683650+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-13T20:23:16.683650+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:23:16.683655+00:00'
