id: d6b5520d-3934-48b4-928c-2aa3f92d6963
title: Important Windows Service Terminated With Error
status: test
level: high
description: Detects important or interesting Windows services that got terminated
    for whatever reason
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-04-14'
tags:
    - attack.defense-evasion
references:
    - https://www.microsoft.com/en-us/security/blog/2023/04/11/guidance-for-investigating-attacks-using-cve-2022-21894-the-blacklotus-campaign/
falsepositives:
    - Rare false positives could occur since service termination could happen due
        to multiple reasons
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''acfa2210-0d71-4eeb-b477-afab494d596c''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    product: windows
    service: system
detection:
    selection_eid:
        Provider_Name: Service Control Manager
        EventID: 7023
    selection_name:
        param1|contains:
            - ' Antivirus'
            - ' Firewall'
            - Application Guard
            - BitLocker Drive Encryption Service
            - Encrypting File System
            - Microsoft Defender
            - Threat Protection
            - Windows Event Log
        Binary|contains:
            - 770069006e0064006500660065006e006400
            - 4500760065006e0074004c006f006700
            - 6d0070007300730076006300
            - 530065006e0073006500
            - '450046005300'
            - '420044004500530056004300'
    condition: all of selection_*
ocsf_mapping:
    class_name: process_activity
    activity_id: 2
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:48:09.229202+00:00'
        service:
            source_field: service
            source_value: system
            mapped_at: '2025-11-26T02:48:09.229202+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-11-26T02:48:10.041187+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:48:10.041198+00:00'
        -   source_field: param1
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:48:10.041200+00:00'
        -   source_field: Binary
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-11-26T02:48:10.041202+00:00'
