title: T1047 Wmiprvse Wbemcomn DLL Hijack
id: f6c68d5f-e101-4b86-8c84-7d96851fd65c
status: test
level: high
author: Roberto Rodriguez @Cyb3rWard0g, Open Threat Research (OTR)
description: Detects a threat actor creating a file named `wbemcomn.dll` in the `C:\Windows\System32\wbem\`
    directory over the network for a WMI DLL Hijack scenario.
references:
    - https://threathunterplaybook.com/hunts/windows/201009-RemoteWMIWbemcomnDLLHijack/notebook.html
falsepositives:
    - Unknown
tags:
    - attack.execution
    - attack.t1047
    - attack.lateral-movement
    - attack.t1021.002
date: '2020-10-12'
modified: '2022-02-24'
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 5145
        RelativeTargetName|endswith: \wbem\wbemcomn.dll
    filter:
        SubjectUserName|endswith: $
    condition: selection and not filter
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:55:24.336591+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-12-04T01:55:24.336591+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:55:24.336611+00:00'
        -   source_field: RelativeTargetName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:24.336614+00:00'
        -   source_field: SubjectUserName
            target_table: process_activity
            target_field: actor.user.name
            mapped_at: '2025-12-04T01:55:24.336616+00:00'
