title: Windows Defender Malware Detection History Deletion
id: 2afe6582-e149-11ea-87d0-0242ac130003
status: test
level: informational
author: Cian Heasley
description: Windows Defender logs when the history of detected infections is deleted.
references:
    - https://learn.microsoft.com/en-us/defender-endpoint/troubleshoot-microsoft-defender-antivirus
    - https://web.archive.org/web/20160727113019/https://answers.microsoft.com/en-us/protect/forum/mse-protect_scanning/microsoft-antimalware-has-removed-history-of/f15af6c9-01a9-4065-8c6c-3f2bdc7de45e
falsepositives:
    - Deletion of Defender malware detections history for legitimate reasons
tags:
    - attack.defense-evasion
date: '2020-08-13'
modified: '2023-11-24'
logsource:
    product: windows
    service: windefend
detection:
    selection:
        EventID: 1013
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: windefend
            mapped_at: null
    detection_fields:
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
