id: f69a87ea-955e-4fb4-adb2-bb9fd6685632
title: External Disk Drive Or USB Storage Device Was Recognized By The System
status: test
level: low
description: Detects external disk drives or plugged-in USB devices.
author: Keith Wright
date: '2019-11-20'
modified: '2024-02-09'
tags:
    - attack.t1091
    - attack.t1200
    - attack.lateral-movement
    - attack.initial-access
references:
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-6416
falsepositives:
    - Likely
taxonomy: sigma
logsource:
    product: windows
    service: security
detection:
    selection_eid:
        EventID: 6416
    selection_field:
        ClassName: DiskDrive
        DeviceDescription: USB Mass Storage Device
    condition: all of selection_*
ocsf_mapping:
    class_name: file_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:23:40.260074+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-13T20:23:40.260074+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: file_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:23:41.769677+00:00'
        -   source_field: ClassName
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:23:41.769705+00:00'
        -   source_field: DeviceDescription
            target_table: file_activity
            target_field: device.desc
            mapped_at: '2025-11-13T20:23:41.769708+00:00'
