id: c9eb55c3-b468-40ab-9089-db2862e42137
title: Device Installation Blocked
status: test
level: medium
description: Detects an installation of a device that is forbidden by the system policy
author: frack113
date: '2022-10-14'
tags:
    - attack.initial-access
    - attack.t1200
references:
    - https://github.com/Yamato-Security/EnableWindowsLogSettings/blob/7f6d755d45ac7cc9fc35b0cbf498e6aa4ef19def/ConfiguringSecurityLogAuditPolicies.md
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-6423
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 6423
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:23:59.234609+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-13T20:23:59.234609+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:23:59.234618+00:00'
