id: def8b624-e08f-4ae1-8612-1ba21190da6b
title: Outgoing Logon with New Credentials
status: test
level: low
description: Detects logon events that specify new credentials
author: Max Altgelt (Nextron Systems)
date: '2022-04-06'
tags:
    - attack.defense-evasion
    - attack.lateral-movement
    - attack.t1550
references:
    - https://go.recordedfuture.com/hubfs/reports/mtp-2021-0914.pdf
falsepositives:
    - Legitimate remote administration activity
taxonomy: sigma
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4624
        LogonType: 9
    condition: selection
ocsf_mapping:
    class_name: authentication
    activity_id: 1
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:47:40.933752+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-26T02:47:40.933752+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: authentication
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:47:40.933792+00:00'
        -   source_field: LogonType
            target_table: authentication
            target_field: logon_type
            mapped_at: '2025-11-26T02:47:40.933796+00:00'
