title: RDP over Reverse SSH Tunnel WFP
id: 5bed80b6-b3e8-428e-a3ae-d3c757589e41
status: test
level: high
author: Samir Bousseaden
description: Detects svchost hosting RDP termsvcs communicating with the loopback
    address
references:
    - https://twitter.com/SBousseaden/status/1096148422984384514
    - https://github.com/sbousseaden/EVTX-ATTACK-SAMPLES/blob/44fbe85f72ee91582876b49678f9a26292a155fb/Command%20and%20Control/DE_RDP_Tunnel_5156.evtx
falsepositives:
    - Programs that connect locally to the RDP port
tags:
    - attack.defense-evasion
    - attack.command-and-control
    - attack.lateral-movement
    - attack.t1090.001
    - attack.t1090.002
    - attack.t1021.001
    - car.2013-07-002
date: '2019-02-16'
modified: '2022-09-02'
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 5156
    sourceRDP:
        SourcePort: 3389
        DestAddress:
            - 127.*
            - ::1
    destinationRDP:
        DestPort: 3389
        SourceAddress:
            - 127.*
            - ::1
    filter_app_container:
        FilterOrigin: AppContainer Loopback
    filter_thor:
        Application|endswith:
            - \thor.exe
            - \thor64.exe
    condition: selection and ( sourceRDP or destinationRDP ) and not 1 of filter*
ocsf_mapping:
    class_name: network_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:56:08.256962+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-12-04T01:56:08.256962+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: network_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:56:08.256991+00:00'
        -   source_field: SourcePort
            target_table: network_activity
            target_field: src_endpoint.port
            mapped_at: '2025-12-04T01:56:08.256993+00:00'
        -   source_field: DestAddress
            target_table: network_activity
            target_field: dst_endpoint.ip
            mapped_at: '2025-12-04T01:56:08.256994+00:00'
        -   source_field: DestPort
            target_table: network_activity
            target_field: dst_endpoint.port
            mapped_at: '2025-12-04T01:56:08.256996+00:00'
        -   source_field: SourceAddress
            target_table: network_activity
            target_field: src_endpoint.ip
            mapped_at: '2025-12-04T01:56:08.256997+00:00'
        -   source_field: FilterOrigin
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:56:08.256998+00:00'
        -   source_field: Application
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:56:08.256999+00:00'
