id: 994bfd6d-0a2e-481e-a861-934069fcf5f5
title: Active Directory Certificate Services Denied Certificate Enrollment Request
status: test
level: low
description: 'Detects denied requests by Active Directory Certificate Services.

    Example of these requests denial include issues with permissions on the certificate
    template or invalid signatures.

    '
author: '@SerkinValery'
date: '2024-03-07'
tags:
    - attack.credential-access
    - attack.t1553.004
references:
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-R2-and-2008/dd299871(v=ws.10)
    - https://www.gradenegger.eu/en/details-of-the-event-with-id-53-of-the-source-microsoft-windows-certificationauthority/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: windows
    service: system
detection:
    selection:
        Provider_Name: Microsoft-Windows-CertificationAuthority
        EventID: 53
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: system
            mapped_at: null
    detection_fields:
        -   source_field: Provider_Name
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
