title: Windows Update Error
id: 13cfeb75-9e33-4d04-b0f7-ab8faaa95a59
status: stable
level: informational
author: frack113
description: 'Detects Windows update errors including installation failures and connection
    issues. Defenders should observe this in case critical update KBs aren''t installed.

    '
references:
    - https://github.com/nasbench/EVTX-ETW-Resources/blob/f1b010ce0ee1b71e3024180de1a3e67f99701fe4/ETWProvidersManifests/Windows10/1903/W10_1903_Pro_20200714_18362.959/WEPExplorer/Microsoft-Windows-WindowsUpdateClient.xml
falsepositives:
    - Unknown
tags:
    - attack.impact
    - attack.resource-development
    - attack.t1584
date: '2021-12-04'
modified: '2023-09-07'
logsource:
    product: windows
    service: system
detection:
    selection:
        Provider_Name: Microsoft-Windows-WindowsUpdateClient
        EventID:
            - 16
            - 20
            - 24
            - 213
            - 217
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: system
            mapped_at: null
    detection_fields:
        -   source_field: Provider_Name
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
