title: KrbRelayUp Service Installation
id: e97d9903-53b2-41fc-8cb9-889ed4093e80
status: test
level: high
author: Sittikorn S, Tim Shelton
description: Detects service creation from KrbRelayUp tool used for privilege escalation
    in Windows domain environments where LDAP signing is not enforced (the default
    settings)
references:
    - https://github.com/Dec0ne/KrbRelayUp
falsepositives:
    - Unknown
tags:
    - attack.privilege-escalation
    - attack.t1543
date: '2022-05-11'
modified: '2022-10-05'
logsource:
    product: windows
    service: system
detection:
    selection:
        EventID: 7045
        ServiceName: KrbSCM
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:57:15.792369+00:00'
        service:
            source_field: service
            source_value: system
            mapped_at: '2025-12-04T01:57:15.792369+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:57:15.792382+00:00'
        -   source_field: ServiceName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:57:15.792384+00:00'
