id: 52a85084-6989-40c3-8f32-091e12e13f09
title: smbexec.py Service Installation
status: test
level: high
description: Detects the use of smbexec.py tool by detecting a specific service installation
author: Omer Faruk Celik
date: '2018-03-20'
modified: '2023-11-09'
tags:
    - attack.lateral-movement
    - attack.execution
    - attack.t1021.002
    - attack.t1569.002
references:
    - https://blog.ropnop.com/using-credentials-to-own-windows-boxes-part-2-psexec-and-services/
    - https://github.com/fortra/impacket/blob/33058eb2fde6976ea62e04bc7d6b629d64d44712/examples/smbexec.py#L286-L296
    - https://github.com/fortra/impacket/blob/edef71f17bc1240f9f8c957bbda98662951ac3ec/examples/smbexec.py#L60
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: windows
    service: system
detection:
    selection_eid:
        Provider_Name: Service Control Manager
        EventID: 7045
    selection_service_name:
        ServiceName: BTOBTO
    selection_service_image:
        ImagePath|contains:
            - '.bat & del '
            - __output 2^>^&1 >
    condition: selection_eid and 1 of selection_service_*
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:48:23.241900+00:00'
        service:
            source_field: service
            source_value: system
            mapped_at: '2025-11-26T02:48:23.241900+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-11-26T02:48:23.241913+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:48:23.241915+00:00'
        -   source_field: ServiceName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:48:23.241916+00:00'
        -   source_field: ImagePath
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-11-26T02:48:23.241918+00:00'
