title: MSSQL Add Account To Sysadmin Role
id: 08200f85-2678-463e-9c32-88dce2f073d1
status: test
level: high
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects when an attacker tries to backdoor the MSSQL server by adding
    a backdoor account to the sysadmin fixed server role
references:
    - https://www.netspi.com/blog/technical/network-penetration-testing/sql-server-persistence-part-1-startup-stored-procedures/
falsepositives:
    - Rare legitimate administrative activity
tags:
    - attack.persistence
date: '2022-07-13'
modified: '2024-06-26'
logsource:
    product: windows
    service: application
    definition: 'Requirements: MSSQL audit policy must be enabled in order to receive
        this event in the application log'
detection:
    selection:
        Provider_Name|contains: MSSQL
        EventID: 33205
        Data|contains|all:
            - object_name:sysadmin
            - 'statement:alter server role [sysadmin] add member '
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:57:31.066873+00:00'
        service:
            source_field: service
            source_value: application
            mapped_at: '2025-12-04T01:57:31.066873+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-12-04T01:57:31.066893+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:57:31.066896+00:00'
        -   source_field: Data
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:57:31.066898+00:00'
