id: 0248a7bc-8a9a-4cd8-a57e-3ae8e073a073
title: ISO Image Mounted
status: test
level: medium
description: Detects the mount of an ISO image on an endpoint
author: Syed Hasan (@syedhasan009)
date: '2021-05-29'
modified: '2023-11-09'
tags:
    - attack.initial-access
    - attack.t1566.001
references:
    - https://www.trendmicro.com/vinfo/hk-en/security/news/cybercrime-and-digital-threats/malicious-spam-campaign-uses-iso-image-files-to-deliver-lokibot-and-nanocore
    - https://www.proofpoint.com/us/blog/threat-insight/threat-actor-profile-ta2719-uses-colorful-lures-deliver-rats-local-languages
    - https://twitter.com/MsftSecIntel/status/1257324139515269121
    - https://github.com/redcanaryco/atomic-red-team/blob/0f229c0e42bfe7ca736a14023836d65baa941ed2/atomics/T1553.005/T1553.005.md#atomic-test-1---mount-iso-image
falsepositives:
    - Software installation ISO files
taxonomy: sigma
logsource:
    product: windows
    service: security
    definition: The advanced audit policy setting "Object Access > Audit Removable
        Storage" must be configured for Success/Failure
detection:
    selection:
        EventID: 4663
        ObjectServer: Security
        ObjectType: File
        ObjectName|startswith: \Device\CdRom
    filter_main_generic:
        ObjectName:
            - \Device\CdRom0\autorun.ico
            - \Device\CdRom0\setup.exe
            - \Device\CdRom0\setup64.exe
    condition: selection and not 1 of filter_main_*
ocsf_mapping:
    class_name: file_activity
    activity_id: 12
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:45:21.109139+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-26T02:45:21.109139+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: file_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:45:21.913937+00:00'
        -   source_field: ObjectServer
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:45:21.913951+00:00'
        -   source_field: ObjectType
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:45:21.913953+00:00'
        -   source_field: ObjectName
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-11-26T02:45:21.913954+00:00'
