title: Tap Driver Installation - Security
id: 9c8afa4d-0022-48f0-9456-3712466f9701
status: test
level: low
author: Daniil Yugoslavskiy, Ian Davis, oscd.community
description: 'Detects the installation of a well-known TAP driver service. This could
    be a sign of potential preparation for data exfiltration using tunnelling techniques.

    '
references:
    - https://community.openvpn.net/openvpn/wiki/ManagingWindowsTAPDrivers
falsepositives:
    - Legitimate OpenVPN TAP installation
tags:
    - attack.exfiltration
    - attack.t1048
date: '2019-10-24'
modified: '2022-11-29'
logsource:
    product: windows
    service: security
    definition: 'Requirements: The System Security Extension audit subcategory need
        to be enabled to log the EID 4697'
detection:
    selection:
        EventID: 4697
        ServiceFileName|contains: tap0901
    condition: selection
related:
    -   id: 8e4cf0e5-aa5d-4dc3-beff-dc26917744a9
        type: derived
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:55:21.789149+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-12-04T01:55:21.789149+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:55:21.789185+00:00'
        -   source_field: ServiceFileName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:21.789190+00:00'
