id: faa031b5-21ed-4e02-8881-2591f98d82ed
title: Unauthorized System Time Modification
status: test
level: low
description: Detect scenarios where a potentially unauthorized application or user
    is modifying the system time.
author: '@neu5ron'
date: '2019-02-05'
modified: '2022-08-03'
tags:
    - attack.defense-evasion
    - attack.t1070.006
references:
    - Private Cuckoo Sandbox (from many years ago, no longer have hash, NDA as well)
    - Live environment caused by malware
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4616
falsepositives:
    - HyperV or other virtualization technologies with binary not listed in filter
        portion of detection
taxonomy: sigma
logsource:
    product: windows
    service: security
    definition: 'Requirements: Audit Policy : System > Audit Security State Change,
        Group Policy : Computer Configuration\Windows Settings\Security Settings\Advanced
        Audit Policy Configuration\Audit Policies\System\Audit Security State Change'
detection:
    selection:
        EventID: 4616
    filter1:
        ProcessName:
            - C:\Program Files\VMware\VMware Tools\vmtoolsd.exe
            - C:\Windows\System32\VBoxService.exe
            - C:\Windows\System32\oobe\msoobe.exe
    filter2:
        ProcessName: C:\Windows\System32\svchost.exe
        SubjectUserSid: S-1-5-19
    condition: selection and not 1 of filter*
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:44:02.975370+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-26T02:44:02.975370+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:44:03.805448+00:00'
        -   source_field: ProcessName
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:44:03.805463+00:00'
        -   source_field: SubjectUserSid
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:44:03.805466+00:00'
