id: 424273ea-7cf8-43a6-b712-375f925e481f
title: Scheduled Task Executed From A Suspicious Location
status: test
level: medium
description: Detects the execution of Scheduled Tasks where the Program being run
    is located in a suspicious location or it's an unusale program to be run from
    a Scheduled Task
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-12-05'
modified: '2023-02-07'
tags:
    - attack.persistence
    - attack.t1053.005
references:
    - Internal Research
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: windows
    service: taskscheduler
    definition: 'Requirements: The "Microsoft-Windows-TaskScheduler/Operational" is
        disabled by default and needs to be enabled in order for this detection to
        trigger'
detection:
    selection:
        EventID: 129
        Path|contains:
            - C:\Windows\Temp\
            - \AppData\Local\Temp\
            - \Desktop\
            - \Downloads\
            - \Users\Public\
            - C:\Temp\
    condition: selection
ocsf_mapping:
    class_name: scheduled_job_activity
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:43:26.180933+00:00'
        service:
            source_field: service
            source_value: taskscheduler
            mapped_at: '2025-11-26T02:43:26.180933+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: scheduled_job_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:43:26.180973+00:00'
        -   source_field: Path
            target_table: scheduled_job_activity
            target_field: job.file.path
            mapped_at: '2025-11-26T02:43:26.180978+00:00'
