id: 252902e3-5830-4cf6-bf21-c22083dfd5cf
title: Possible Impacket SecretDump Remote Activity
status: test
level: high
description: Detect AD credential dumping using impacket secretdump HKTL
author: Samir Bousseaden, wagga
date: '2019-04-03'
modified: '2022-08-11'
tags:
    - attack.credential-access
    - attack.t1003.002
    - attack.t1003.004
    - attack.t1003.003
references:
    - https://web.archive.org/web/20230329153811/https://blog.menasec.net/2019/02/threat-huting-10-impacketsecretdump.html
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: windows
    service: security
    definition: The advanced audit policy setting "Object Access > Audit Detailed
        File Share" must be configured for Success/Failure
detection:
    selection:
        EventID: 5145
        ShareName: \\\*\ADMIN$
        RelativeTargetName|contains|all:
            - SYSTEM32\
            - .tmp
    condition: selection
ocsf_mapping:
    class_name: network_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:46:06.364028+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-26T02:46:06.364028+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: network_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:46:06.364044+00:00'
        -   source_field: ShareName
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:46:06.364046+00:00'
        -   source_field: RelativeTargetName
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:46:06.364048+00:00'
