id: d3abac66-f11c-4ed0-8acb-50cc29c97eed
title: NetNTLM Downgrade Attack
status: test
level: high
description: Detects NetNTLM downgrade attack
author: Florian Roth (Nextron Systems), wagga
date: '2018-03-20'
modified: '2022-10-09'
tags:
    - attack.defense-evasion
    - attack.t1562.001
    - attack.t1112
references:
    - https://www.optiv.com/blog/post-exploitation-using-netntlm-downgrade-attacks
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''d67572a0-e2ec-45d6-b8db-c100d14b8ef2''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    product: windows
    service: security
    definition: 'Requirements: Audit Policy : Object Access > Audit Registry (Success)'
detection:
    selection:
        EventID: 4657
        ObjectName|contains|all:
            - \REGISTRY\MACHINE\SYSTEM
            - ControlSet
            - \Control\Lsa
        ObjectValueName:
            - LmCompatibilityLevel
            - NtlmMinClientSec
            - RestrictSendingNTLMTraffic
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:23:39.746740+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-13T20:23:39.746740+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:23:39.746763+00:00'
        -   source_field: ObjectName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:23:39.746766+00:00'
        -   source_field: ObjectValueName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:23:39.746768+00:00'
