id: cbe51394-cd93-4473-b555-edf0144952d9
title: DNS Server Error Failed Loading the ServerLevelPluginDLL
status: test
level: high
description: Detects a DNS server error in which a specified plugin DLL (in registry)
    could not be loaded
author: Florian Roth (Nextron Systems)
date: '2017-05-08'
modified: '2023-02-05'
tags:
    - attack.defense-evasion
    - attack.t1574.002
references:
    - https://medium.com/@esnesenon/feature-not-bug-dnsadmin-to-dc-compromise-in-one-line-a0f779b8dc83
    - https://technet.microsoft.com/en-us/library/cc735829(v=ws.10).aspx
    - https://twitter.com/gentilkiwi/status/861641945944391680
falsepositives:
    - Unknown
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''e61e8a88-59a9-451c-874e-70fcc9740d67''),
    type=<SigmaRelatedType.DERIVED: 2>), SigmaRelatedItem(id=UUID(''f63b56ee-3f79-4b8a-97fb-5c48007e8573''),
    type=<SigmaRelatedType.DERIVED: 2>)])'
taxonomy: sigma
logsource:
    product: windows
    service: dns-server
detection:
    selection:
        EventID:
            - 150
            - 770
            - 771
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: dns-server
            mapped_at: null
    detection_fields:
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
