title: NetNTLM Downgrade Attack
id: d3abac66-f11c-4ed0-8acb-50cc29c97eed
status: test
level: high
author: Florian Roth (Nextron Systems), wagga
description: Detects NetNTLM downgrade attack
references:
    - https://www.optiv.com/blog/post-exploitation-using-netntlm-downgrade-attacks
falsepositives:
    - Unknown
tags:
    - attack.defense-evasion
    - attack.t1562.001
    - attack.t1112
date: '2018-03-20'
modified: '2022-10-09'
logsource:
    product: windows
    service: security
    definition: 'Requirements: Audit Policy : Object Access > Audit Registry (Success)'
detection:
    selection:
        EventID: 4657
        ObjectName|contains|all:
            - \REGISTRY\MACHINE\SYSTEM
            - ControlSet
            - \Control\Lsa
        ObjectValueName:
            - LmCompatibilityLevel
            - NtlmMinClientSec
            - RestrictSendingNTLMTraffic
    condition: selection
related:
    -   id: d67572a0-e2ec-45d6-b8db-c100d14b8ef2
        type: derived
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: security
            mapped_at: null
    detection_fields:
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: ObjectName
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: ObjectValueName
            target_table: null
            target_field: null
            mapped_at: null
