id: 311b6ce2-7890-4383-a8c2-663a9f6b43cd
title: Enabled User Right in AD to Control User Objects
status: test
level: high
description: Detects scenario where if a user is assigned the SeEnableDelegationPrivilege
    right in Active Directory it would allow control of other AD user objects.
author: '@neu5ron'
date: '2017-07-30'
modified: '2021-12-02'
tags:
    - attack.persistence
    - attack.t1098
references:
    - https://blog.harmj0y.net/activedirectory/the-most-dangerous-user-right-you-probably-have-never-heard-of/
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: windows
    service: security
    definition: 'Requirements: Audit Policy : Policy Change > Audit Authorization
        Policy Change, Group Policy : Computer Configuration\Windows Settings\Security
        Settings\Advanced Audit Policy Configuration\Audit Policies\Policy Change\Audit
        Authorization Policy Change'
detection:
    selection_base:
        EventID: 4704
    selection_keywords:
        PrivilegeList|contains: SeEnableDelegationPrivilege
    condition: all of selection*
ocsf_mapping:
    class_name: account_change
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:46:08.921771+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-26T02:46:08.921771+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: account_change
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:46:09.662614+00:00'
        -   source_field: PrivilegeList
            target_table: account_change
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:46:09.662621+00:00'
