id: 8cd538a4-62d5-4e83-810b-12d41e428d6e
title: Processes Accessing the Microphone and Webcam
status: test
level: medium
description: Potential adversaries accessing the microphone and webcam in an endpoint.
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: '2020-06-07'
modified: '2021-11-27'
tags:
    - attack.collection
    - attack.t1123
references:
    - https://twitter.com/duzvik/status/1269671601852813320
    - https://medium.com/@7a616368/can-you-track-processes-accessing-the-camera-and-microphone-7e6885b37072
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID:
            - 4657
            - 4656
            - 4663
        ObjectName|contains:
            - \SOFTWARE\Microsoft\Windows\CurrentVersion\CapabilityAccessManager\ConsentStore\microphone\NonPackaged
            - \SOFTWARE\Microsoft\Windows\CurrentVersion\CapabilityAccessManager\ConsentStore\webcam\NonPackaged
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:23:16.676715+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-13T20:23:16.676715+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: file_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:23:16.676722+00:00'
        -   source_field: ObjectName
            target_table: file_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:23:16.676724+00:00'
