id: 63e3365d-4824-42d8-8b82-e56810fefa0c
title: Invoke-Obfuscation Via Use Clip - System
status: test
level: high
description: Detects Obfuscated Powershell via use Clip.exe in Scripts
author: Nikita Nazarov, oscd.community
date: '2020-10-09'
modified: '2022-11-29'
tags:
    - attack.defense-evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
references:
    - https://github.com/SigmaHQ/sigma/issues/1009
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: windows
    service: system
detection:
    selection:
        Provider_Name: Service Control Manager
        EventID: 7045
        ImagePath|contains: (Clipboard|i
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:25:25.431433+00:00'
        service:
            source_field: service
            source_value: system
            mapped_at: '2025-11-13T20:25:25.431433+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-11-13T20:25:25.431441+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:25:25.431443+00:00'
        -   source_field: ImagePath
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-11-13T20:25:25.431444+00:00'
