id: 5af54681-df95-4c26-854f-2565e13cfab0
title: Successful Account Login Via WMI
status: stable
level: low
description: Detects successful logon attempts performed with WMI
author: Thomas Patzke
date: '2019-12-04'
modified: '2024-01-17'
tags:
    - attack.execution
    - attack.t1047
references:
    - Internal Research
falsepositives:
    - Monitoring tools
    - Legitimate system administration
taxonomy: sigma
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4624
        ProcessName|endswith: \WmiPrvSE.exe
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:47:44.093593+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-26T02:47:44.093593+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:47:44.093606+00:00'
        -   source_field: ProcessName
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-11-26T02:47:44.093607+00:00'
