title: Suspicious Service Installation
id: 1d61f71d-59d2-479e-9562-4ff5f4ead16b
status: test
level: high
author: pH-T (Nextron Systems), Florian Roth (Nextron Systems)
description: Detects suspicious service installation commands
references:
    - Internal Research
falsepositives:
    - Unknown
tags:
    - attack.persistence
    - attack.privilege-escalation
    - car.2013-09-005
    - attack.t1543.003
date: '2022-03-18'
modified: '2023-12-04'
logsource:
    product: windows
    service: system
detection:
    selection:
        Provider_Name: Service Control Manager
        EventID: 7045
        ImagePath|contains:
            - ' -nop '
            - ' -sta '
            - ' -w hidden '
            - :\Temp\
            - .downloadfile(
            - .downloadstring(
            - \ADMIN$\
            - \Perflogs\
            - '&&'
    condition: selection
related:
    -   id: ca83e9f3-657a-45d0-88d6-c1ac280caf53
        type: obsolete
    -   id: 26481afe-db26-4228-b264-25a29fe6efc7
        type: similar
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:57:08.010876+00:00'
        service:
            source_field: service
            source_value: system
            mapped_at: '2025-12-04T01:57:08.010876+00:00'
    detection_fields:
        -   source_field: Provider_Name
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-12-04T01:57:08.010893+00:00'
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:57:08.010895+00:00'
        -   source_field: ImagePath
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-12-04T01:57:08.010896+00:00'
