title: External Disk Drive Or USB Storage Device Was Recognized By The System
id: f69a87ea-955e-4fb4-adb2-bb9fd6685632
status: test
level: low
author: Keith Wright
description: Detects external disk drives or plugged-in USB devices.
references:
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-6416
falsepositives:
    - Likely
tags:
    - attack.t1091
    - attack.t1200
    - attack.lateral-movement
    - attack.initial-access
date: '2019-11-20'
modified: '2024-02-09'
logsource:
    product: windows
    service: security
detection:
    selection_eid:
        EventID: 6416
    selection_field:
        ClassName: DiskDrive
        DeviceDescription: USB Mass Storage Device
    condition: all of selection_*
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: security
            mapped_at: null
    detection_fields:
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: ClassName
            target_table: null
            target_field: null
            mapped_at: null
        -   source_field: DeviceDescription
            target_table: null
            target_field: null
            mapped_at: null
