id: cde0a575-7d3d-4a49-9817-b8004a7bf105
title: Uncommon New Firewall Rule Added In Windows Firewall Exception List
status: experimental
level: medium
description: Detects when a rule has been added to the Windows Firewall exception
    list
author: frack113
date: '2022-02-19'
modified: '2024-08-29'
tags:
    - attack.defense-evasion
    - attack.t1562.004
references:
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)
taxonomy: sigma
logsource:
    product: windows
    service: firewall-as
detection:
    selection:
        EventID:
            - 2004
            - 2071
            - 2097
    filter_main_block:
        Action: 2
    filter_main_generic:
        ApplicationPath|startswith:
            - C:\Program Files (x86)\
            - C:\Program Files\
            - C:\Windows\System32\
            - C:\Windows\SysWOW64\
            - C:\Windows\WinSxS\
    filter_optional_msmpeng:
        ModifyingApplication|startswith: C:\ProgramData\Microsoft\Windows Defender\Platform\
        ModifyingApplication|endswith: \MsMpEng.exe
    filter_main_covered_paths:
        ApplicationPath|contains:
            - C:\PerfLogs\
            - C:\Temp\
            - C:\Tmp\
            - C:\Users\Public\
            - C:\Windows\Tasks\
            - C:\Windows\Temp\
            - \AppData\Local\Temp\
    filter_optional_no_path:
        ModifyingApplication:
            - C:\Windows\System32\svchost.exe
            - C:\Windows\System32\dllhost.exe
        ApplicationPath: ''
    filter_main_null:
        ApplicationPath: null
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
ocsf_mapping:
    class_name: network_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:43:22.380469+00:00'
        service:
            source_field: service
            source_value: firewall-as
            mapped_at: '2025-11-26T02:43:22.380469+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: network_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:43:22.380497+00:00'
        -   source_field: Action
            target_table: network_activity
            target_field: action
            mapped_at: '2025-11-26T02:43:22.380500+00:00'
        -   source_field: ApplicationPath
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:43:22.380503+00:00'
        -   source_field: ModifyingApplication
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:43:22.380505+00:00'
