id: 2afe6582-e149-11ea-87d0-0242ac130003
title: Windows Defender Malware Detection History Deletion
status: test
level: informational
description: Windows Defender logs when the history of detected infections is deleted.
author: Cian Heasley
date: '2020-08-13'
modified: '2023-11-24'
tags:
    - attack.defense-evasion
references:
    - https://learn.microsoft.com/en-us/defender-endpoint/troubleshoot-microsoft-defender-antivirus
    - https://web.archive.org/web/20160727113019/https://answers.microsoft.com/en-us/protect/forum/mse-protect_scanning/microsoft-antimalware-has-removed-history-of/f15af6c9-01a9-4065-8c6c-3f2bdc7de45e
falsepositives:
    - Deletion of Defender malware detections history for legitimate reasons
taxonomy: sigma
logsource:
    product: windows
    service: windefend
detection:
    selection:
        EventID: 1013
    condition: selection
ocsf_mapping:
    class_name: process_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:24:48.687335+00:00'
        service:
            source_field: service
            source_value: windefend
            mapped_at: '2025-11-13T20:24:48.687335+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:24:48.687347+00:00'
