id: e2b5163d-7deb-4566-9af3-40afea6858c3
title: Certificate Private Key Acquired
status: test
level: medium
description: Detects when an application acquires a certificate private key
author: Zach Mathis
date: '2023-05-13'
tags:
    - attack.credential-access
    - attack.t1649
references:
    - https://www.splunk.com/en_us/blog/security/breaking-the-chain-defending-against-certificate-services-abuse.html
falsepositives:
    - Legitimate application requesting certificate exports will trigger this. Apply
        additional filters as needed
taxonomy: sigma
logsource:
    product: windows
    service: capi2
    definition: 'Requirements: The CAPI2 Operational log needs to be enabled'
detection:
    selection:
        EventID: 70
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: capi2
            mapped_at: null
    detection_fields:
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
