title: LSASS Access Detected via Attack Surface Reduction
id: a0a278fe-2c0e-4de2-ac3c-c68b08a9ba98
status: test
level: high
author: Markus Neis
description: Detects Access to LSASS Process
references:
    - https://learn.microsoft.com/en-us/defender-endpoint/attack-surface-reduction
falsepositives:
    - Google Chrome GoogleUpdate.exe
    - Some Taskmgr.exe related activity
tags:
    - attack.credential-access
    - attack.t1003.001
date: '2018-08-26'
modified: '2022-08-13'
logsource:
    product: windows
    service: windefend
    definition: 'Requirements:Enabled Block credential stealing from the Windows local
        security authority subsystem (lsass.exe) from Attack Surface Reduction (GUID:
        9e6c4e1f-7d60-472f-ba1a-a39ef669e4b2)'
detection:
    selection:
        EventID: 1121
        Path|endswith: \lsass.exe
    filter_thor:
        ProcessName|startswith: C:\Windows\Temp\asgard2-agent\
        ProcessName|endswith:
            - \thor64.exe
            - \thor.exe
    filter_exact:
        ProcessName:
            - C:\Windows\System32\atiesrxx.exe
            - C:\Windows\System32\CompatTelRunner.exe
            - C:\Windows\System32\msiexec.exe
            - C:\Windows\System32\nvwmi64.exe
            - C:\Windows\System32\svchost.exe
            - C:\Windows\System32\Taskmgr.exe
            - C:\Windows\System32\wbem\WmiPrvSE.exe
            - C:\Windows\SysWOW64\msiexec.exe
    filter_begins:
        ProcessName|startswith:
            - C:\Windows\System32\DriverStore\
            - C:\WINDOWS\Installer\
            - C:\Program Files\
            - C:\Program Files (x86)\
    condition: selection and not 1 of filter_*
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:56:31.502881+00:00'
        service:
            source_field: service
            source_value: windefend
            mapped_at: '2025-12-04T01:56:31.502881+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:56:31.502914+00:00'
        -   source_field: Path
            target_table: process_activity
            target_field: process.file.path
            mapped_at: '2025-12-04T01:56:31.502918+00:00'
        -   source_field: ProcessName
            target_table: process_activity
            target_field: process.name
            mapped_at: '2025-12-04T01:56:31.502921+00:00'
