title: WCE wceaux.dll Access
id: 1de68c67-af5c-4097-9c85-fe5578e09e67
status: test
level: critical
author: Thomas Patzke
description: Detects wceaux.dll access while WCE pass-the-hash remote command execution
    on source host
references:
    - https://www.jpcert.or.jp/english/pub/sr/ir_research.html
    - https://jpcertcc.github.io/ToolAnalysisResultSheet
falsepositives:
    - Unknown
tags:
    - attack.credential-access
    - attack.t1003
    - attack.s0005
date: '2017-06-14'
modified: '2021-11-27'
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID:
            - 4656
            - 4658
            - 4660
            - 4663
        ObjectName|endswith: \wceaux.dll
    condition: selection
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:55:24.816896+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-12-04T01:55:24.816896+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:55:24.816908+00:00'
        -   source_field: ObjectName
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:55:24.816910+00:00'
