title: The Windows Defender Firewall Service Failed To Load Group Policy
id: 7ec15688-fd24-4177-ba43-1a950537ee39
status: test
level: low
author: frack113
description: Detects activity when The Windows Defender Firewall service failed to
    load Group Policy
references:
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)
tags:
    - attack.defense-evasion
    - attack.t1562.004
date: '2022-02-19'
modified: '2023-01-17'
logsource:
    product: windows
    service: firewall-as
detection:
    selection:
        EventID: 2009
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: firewall-as
            mapped_at: null
    detection_fields:
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
