title: Suspicious Cobalt Strike DNS Beaconing - DNS Client
id: 0d18728b-f5bf-4381-9dcf-915539fff6c2
status: test
level: critical
author: Nasreddine Bencherchali (Nextron Systems)
description: Detects a program that invoked suspicious DNS queries known from Cobalt
    Strike beacons
references:
    - https://www.icebrg.io/blog/footprints-of-fin7-tracking-actor-patterns
    - https://www.sekoia.io/en/hunting-and-detecting-cobalt-strike/
falsepositives:
    - Unknown
tags:
    - attack.command-and-control
    - attack.t1071.004
date: '2023-01-16'
logsource:
    product: windows
    service: dns-client
    definition: 'Requirements: Microsoft-Windows-DNS Client Events/Operational Event
        Log must be enabled/collected in order to receive the events.'
detection:
    selection_eid:
        EventID: 3008
    selection_query_1:
        QueryName|startswith:
            - aaa.stage.
            - post.1
    selection_query_2:
        QueryName|contains: .stage.123456.
    condition: selection_eid and 1 of selection_query_*
related:
    -   id: f356a9c4-effd-4608-bbf8-408afd5cd006
        type: similar
ocsf_mapping:
    class_name: dns_activity
    activity_id: 1
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-12-04T01:56:40.210635+00:00'
        service:
            source_field: service
            source_value: dns-client
            mapped_at: '2025-12-04T01:56:40.210635+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: dns_activity
            target_field: metadata.event_code
            mapped_at: '2025-12-04T01:56:40.210656+00:00'
        -   source_field: QueryName
            target_table: dns_activity
            target_field: query.hostname
            mapped_at: '2025-12-04T01:56:40.210658+00:00'
