id: 0b7889b4-5577-4521-a60a-3376ee7f9f7b
title: WMI Persistence
status: test
level: medium
description: Detects suspicious WMI event filter and command line event consumer based
    on WMI and Security Logs.
author: Florian Roth (Nextron Systems), Gleb Sukhodolskiy, Timur Zinniatullin oscd.community
date: '2017-08-22'
modified: '2022-02-10'
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1546.003
references:
    - https://twitter.com/mattifestation/status/899646620148539397
    - https://www.eideon.com/2018-03-02-THL03-WMIBackdoors/
falsepositives:
    - Unknown (data set is too small; further testing needed)
taxonomy: sigma
logsource:
    product: windows
    service: wmi
    definition: WMI Namespaces Auditing and SACL should be configured, EventID 5861
        and 5859 detection requires Windows 10, 2012 and higher
detection:
    wmi_filter_to_consumer_binding:
        EventID: 5861
    consumer_keywords:
        - ActiveScriptEventConsumer
        - CommandLineEventConsumer
        - CommandLineTemplate
    wmi_filter_registration:
        EventID: 5859
    filter_scmevent:
        Provider: SCM Event Provider
        Query: select * from MSFT_SCMEventLogEvent
        User: S-1-5-32-544
        PossibleCause: Permanent
    condition: ( (wmi_filter_to_consumer_binding and consumer_keywords) or (wmi_filter_registration)
        ) and not filter_scmevent
ocsf_mapping:
    class_name: process_activity
    activity_id: UNMAPPED
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-26T02:46:29.706767+00:00'
        service:
            source_field: service
            source_value: wmi
            mapped_at: '2025-11-26T02:46:29.706767+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: process_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-26T02:46:30.648576+00:00'
        -   source_field: Provider
            target_table: process_activity
            target_field: metadata.log_provider
            mapped_at: '2025-11-26T02:46:30.648604+00:00'
        -   source_field: Query
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:46:30.648608+00:00'
        -   source_field: User
            target_table: process_activity
            target_field: actor.user.name
            mapped_at: '2025-11-26T02:46:30.648611+00:00'
        -   source_field: PossibleCause
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:46:30.648614+00:00'
