title: Device Installation Blocked
id: c9eb55c3-b468-40ab-9089-db2862e42137
status: test
level: medium
author: frack113
description: Detects an installation of a device that is forbidden by the system policy
references:
    - https://github.com/Yamato-Security/EnableWindowsLogSettings/blob/7f6d755d45ac7cc9fc35b0cbf498e6aa4ef19def/ConfiguringSecurityLogAuditPolicies.md
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-6423
falsepositives:
    - Unknown
tags:
    - attack.initial-access
    - attack.t1200
date: '2022-10-14'
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 6423
    condition: selection
ocsf_mapping:
    class_name: null
    activity_id: null
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: null
        service:
            source_field: service
            source_value: security
            mapped_at: null
    detection_fields:
        -   source_field: EventID
            target_table: null
            target_field: null
            mapped_at: null
