id: 3a734d25-df5c-4b99-8034-af1ddb5883a4
title: Suspicious Scheduled Task Creation
status: test
level: high
description: Detects suspicious scheduled task creation events. Based on attributes
    such as paths, commands line flags, etc.
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-12-05'
modified: '2022-12-07'
tags:
    - attack.execution
    - attack.privilege-escalation
    - attack.persistence
    - attack.t1053.005
references:
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4698
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: windows
    service: security
    definition: The Advanced Audit Policy setting Object Access > Audit Other Object
        Access Events has to be configured to allow this detection. We also recommend
        extracting the Command field from the embedded XML in the event data.
detection:
    selection_eid:
        EventID: 4698
    selection_paths:
        TaskContent|contains:
            - \AppData\Local\Temp\
            - \AppData\Roaming\
            - \Users\Public\
            - \WINDOWS\Temp\
            - C:\Temp\
            - \Desktop\
            - \Downloads\
            - \Temporary Internet
            - C:\ProgramData\
            - C:\Perflogs\
    selection_commands:
        TaskContent|contains:
            - regsvr32
            - rundll32
            - cmd.exe</Command>
            - cmd</Command>
            - '<Arguments>/c '
            - '<Arguments>/k '
            - '<Arguments>/r '
            - powershell
            - pwsh
            - mshta
            - wscript
            - cscript
            - certutil
            - bitsadmin
            - bash.exe
            - 'bash '
            - scrcons
            - 'wmic '
            - wmic.exe
            - forfiles
            - scriptrunner
            - hh.exe
    condition: all of selection_*
ocsf_mapping:
    class_name: scheduled_job_activity
    logsource:
        product:
            source_field: product
            source_value: windows
            mapped_at: '2025-11-13T20:23:00.556990+00:00'
        service:
            source_field: service
            source_value: security
            mapped_at: '2025-11-13T20:23:00.556990+00:00'
    detection_fields:
        -   source_field: EventID
            target_table: scheduled_job_activity
            target_field: metadata.event_code
            mapped_at: '2025-11-13T20:23:01.424378+00:00'
        -   source_field: TaskContent
            target_table: scheduled_job_activity
            target_field: job.cmd_line
            mapped_at: '2025-11-13T20:23:01.424401+00:00'
