title: Possible PrintNightmare Print Driver Install
id: 7b33baef-2a75-4ca3-9da4-34f9a15382d8
status: stable
level: medium
author: '@neu5ron (Nate Guagenti)'
description: 'Detects the remote installation of a print driver which is possible
    indication of the exploitation of PrintNightmare (CVE-2021-1675).

    The occurrence of print drivers being installed remotely via RPC functions should
    be rare, as print drivers are normally installed locally and or through group
    policy.

    '
references:
    - https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-par/93d1915d-4d9f-4ceb-90a7-e8f2a59adc29
    - https://github.com/zeek/zeek/blob/691b099de13649d6576c7b9d637f8213ff818832/scripts/base/protocols/dce-rpc/consts.zeek
    - https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-34527
    - https://github.com/corelight/CVE-2021-1675
    - https://old.zeek.org/zeekweek2019/slides/bzar.pdf
    - https://www.crowdstrike.com/blog/cve-2021-1678-printer-spooler-relay-security-advisory/
fields:
    - id.orig_h
    - id.resp_h
    - id.resp_p
    - operation
    - endpoint
    - named_pipe
    - uid
falsepositives:
    - Legitimate remote alteration of a printer driver.
tags:
    - attack.execution
    - cve.2021-1678
    - cve.2021-1675
    - cve.2021-34527
date: '2021-08-23'
modified: '2022-07-07'
logsource:
    product: zeek
    service: dce_rpc
detection:
    selection:
        operation:
            - RpcAsyncInstallPrinterDriverFromPackage
            - RpcAsyncAddPrintProcessor
            - RpcAddPrintProcessor
            - RpcAddPrinterDriverEx
            - RpcAddPrinterDriver
            - RpcAsyncAddPrinterDriver
    condition: selection
related:
    -   id: 53389db6-ba46-48e3-a94c-e0f2cefe1583
        type: derived
ocsf_mapping:
    class_name: network_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: zeek
            mapped_at: '2025-12-04T01:35:11.507060+00:00'
        service:
            source_field: service
            source_value: dce_rpc
            mapped_at: '2025-12-04T01:35:11.507060+00:00'
    detection_fields:
        -   source_field: operation
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:35:11.507083+00:00'
