id: 1fc0809e-06bf-4de3-ad52-25e5263b7623
title: Publicly Accessible RDP Service
status: test
level: high
description: 'Detects connections from routable IPs to an RDP listener. Which is indicative
    of a publicly-accessible RDP service.

    '
author: Josh Brower @DefensiveDepth
date: '2020-08-22'
modified: '2024-03-13'
tags:
    - attack.lateral-movement
    - attack.t1021.001
references:
    - https://attack.mitre.org/techniques/T1021/001/
falsepositives:
    - Although it is recommended to NOT have RDP exposed to the internet, verify that
        this is a) allowed b) the server has not already been compromised via some
        brute force or remote exploit since it has been exposed to the internet. Work
        to secure the server if you are unable to remove it from being exposed to
        the internet.
taxonomy: sigma
logsource:
    product: zeek
    service: rdp
detection:
    selection:
        id.orig_h|cidr:
            - ::1/128
            - 10.0.0.0/8
            - 127.0.0.0/8
            - 172.16.0.0/12
            - 192.168.0.0/16
            - 169.254.0.0/16
            - 2620:83:8000::/48
            - fc00::/7
            - fe80::/10
    condition: not selection
ocsf_mapping:
    class_name: network_activity
    activity_id: 7
    logsource:
        product:
            source_field: product
            source_value: zeek
            mapped_at: '2025-11-26T02:14:45.138334+00:00'
        service:
            source_field: service
            source_value: rdp
            mapped_at: '2025-11-26T02:14:45.138334+00:00'
    detection_fields:
        -   source_field: id.orig_h
            target_table: network_activity
            target_field: src_endpoint.ip
            mapped_at: '2025-11-26T02:14:45.929347+00:00'
