id: 2e69f167-47b5-4ae7-a390-47764529eff5
title: Transferring Files with Credential Data via Network Shares - Zeek
status: test
level: medium
description: Transferring files with well-known filenames (sensitive files with credential
    data) using network shares
author: '@neu5ron, Teymur Kheirkhabarov, oscd.community'
date: '2020-04-02'
modified: '2021-11-27'
tags:
    - attack.credential-access
    - attack.t1003.002
    - attack.t1003.001
    - attack.t1003.003
references:
    - https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
falsepositives:
    - Transferring sensitive files for legitimate administration work by legitimate
        administrator
related: 'SigmaRelated(related=[SigmaRelatedItem(id=UUID(''910ab938-668b-401b-b08c-b596e80fdca5''),
    type=<SigmaRelatedType.SIMILAR: 6>)])'
taxonomy: sigma
logsource:
    product: zeek
    service: smb_files
detection:
    selection:
        name:
            - \mimidrv
            - \lsass
            - \windows\minidump\
            - \hiberfil
            - \sqldmpr
            - \sam
            - \ntds.dit
            - \security
    condition: selection
ocsf_mapping:
    class_name: file_activity
    logsource:
        product:
            source_field: product
            source_value: zeek
            mapped_at: '2025-11-13T20:15:07.241775+00:00'
        service:
            source_field: service
            source_value: smb_files
            mapped_at: '2025-11-13T20:15:07.241775+00:00'
    detection_fields:
        -   source_field: name
            target_table: file_activity
            target_field: file.name
            mapped_at: '2025-11-13T20:15:07.241784+00:00'
