title: New Kind of Network (NKN) Detection
id: fa7703d6-0ee8-4949-889c-48c84bc15b6f
status: test
level: low
author: Michael Portera (@mportatoes)
description: NKN is a networking service using blockchain technology to support a
    decentralized network of peers. While there are legitimate uses for it, it can
    also be used as a C2 channel. This rule looks for a DNS request to the ma>
references:
    - https://github.com/nknorg/nkn-sdk-go
    - https://unit42.paloaltonetworks.com/manageengine-godzilla-nglite-kdcsponge/
    - https://github.com/Maka8ka/NGLite
fields:
    - id.orig_h
    - id.resp_h
    - answers
falsepositives:
    - Unknown
tags:
    - attack.command-and-control
date: '2022-04-21'
logsource:
    product: zeek
    service: dns
detection:
    selection:
        query|contains|all:
            - seed
            - .nkn.org
    condition: selection
ocsf_mapping:
    class_name: dns_activity
    activity_id: 1
    logsource:
        product:
            source_field: product
            source_value: zeek
            mapped_at: '2025-12-04T01:35:10.492407+00:00'
        service:
            source_field: service
            source_value: dns
            mapped_at: '2025-12-04T01:35:10.492407+00:00'
    detection_fields:
        -   source_field: query
            target_table: dns_activity
            target_field: query.hostname
            mapped_at: '2025-12-04T01:35:10.492421+00:00'
