id: 705072a5-bb6f-4ced-95b6-ecfa6602090b
title: WebDav Put Request
status: test
level: low
description: A General detection for WebDav user-agent being used to PUT files on
    a WebDav network share. This could be an indicator of exfiltration.
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: '2020-05-02'
modified: '2024-03-13'
tags:
    - attack.exfiltration
    - attack.t1048.003
references:
    - https://github.com/OTRF/detection-hackathon-apt29/issues/17
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: zeek
    service: http
detection:
    selection:
        user_agent|contains: WebDAV
        method: PUT
    filter:
        id.resp_h|cidr:
            - 10.0.0.0/8
            - 127.0.0.0/8
            - 172.16.0.0/12
            - 192.168.0.0/16
            - 169.254.0.0/16
    condition: selection and not filter
ocsf_mapping:
    class_name: http_activity
    logsource:
        product:
            source_field: product
            source_value: zeek
            mapped_at: '2025-11-13T20:15:03.261537+00:00'
        service:
            source_field: service
            source_value: http
            mapped_at: '2025-11-13T20:15:03.261537+00:00'
    detection_fields:
        -   source_field: user_agent
            target_table: http_activity
            target_field: http_request.user_agent
            mapped_at: '2025-11-13T20:15:04.470856+00:00'
        -   source_field: method
            target_table: http_activity
            target_field: http_request.http_method
            mapped_at: '2025-11-13T20:15:04.470892+00:00'
        -   source_field: id.resp_h
            target_table: http_activity
            target_field: dst_endpoint.ip
            mapped_at: '2025-11-13T20:15:04.470897+00:00'
