title: Kerberos Network Traffic RC4 Ticket Encryption
id: 503fe26e-b5f2-4944-a126-eab405cc06e5
status: test
level: medium
author: sigma
description: Detects kerberos TGS request using RC4 encryption which may be indicative
    of kerberoasting
references:
    - https://adsecurity.org/?p=3458
falsepositives:
    - Normal enterprise SPN requests activity
tags:
    - attack.credential-access
    - attack.t1558.003
date: '2020-02-12'
modified: '2021-11-27'
logsource:
    product: zeek
    service: kerberos
detection:
    selection:
        request_type: TGS
        cipher: rc4-hmac
    computer_acct:
        service|startswith: $
    condition: selection and not computer_acct
ocsf_mapping:
    class_name: network_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: zeek
            mapped_at: '2025-12-04T01:35:11.972109+00:00'
        service:
            source_field: service
            source_value: kerberos
            mapped_at: '2025-12-04T01:35:11.972109+00:00'
    detection_fields:
        -   source_field: request_type
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:35:11.972131+00:00'
        -   source_field: cipher
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:35:11.972134+00:00'
        -   source_field: service
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-12-04T01:35:11.972136+00:00'
