id: 4096842a-8f9f-4d36-92b4-d0b2a62f9b2a
title: Potential PetitPotam Attack Via EFS RPC Calls
status: test
level: medium
description: "Detects usage of the windows RPC library Encrypting File System Remote\
    \ Protocol (MS-EFSRPC). Variations of this RPC are used within the attack refereed\
    \ to as PetitPotam.\nThe usage of this RPC function should be rare if ever used\
    \ at all.\nThus usage of this function is uncommon enough that any usage of this\
    \ RPC function should warrant further investigation to determine if it is legitimate.\n\
    \ View surrounding logs (within a few minutes before and after) from the Source\
    \ IP to. Logs from from the Source IP would include dce_rpc, smb_mapping, smb_files,\
    \ rdp, ntlm, kerberos, etc..'\n"
author: '@neu5ron, @Antonlovesdnb, Mike Remen'
date: '2021-08-17'
modified: '2022-11-28'
tags:
    - attack.t1557.001
    - attack.t1187
references:
    - https://github.com/topotam/PetitPotam/blob/d83ac8f2dd34654628c17490f99106eb128e7d1e/PetitPotam/PetitPotam.cpp
    - https://msrc.microsoft.com/update-guide/vulnerability/ADV210003
    - https://vx-underground.org/archive/Symantec/windows-vista-network-attack-07-en.pdf
    - https://threatpost.com/microsoft-petitpotam-poc/168163/
fields:
    - id.orig_h
    - id.resp_h
    - id.resp_p
    - operation
    - endpoint
    - named_pipe
    - uid
falsepositives:
    - Uncommon but legitimate windows administrator or software tasks that make use
        of the Encrypting File System RPC Calls. Verify if this is common activity
        (see description).
taxonomy: sigma
logsource:
    product: zeek
    service: dce_rpc
detection:
    selection:
        operation|startswith: efs
    condition: selection
ocsf_mapping:
    class_name: network_activity
    logsource:
        product:
            source_field: product
            source_value: zeek
            mapped_at: '2025-11-13T20:14:49.614598+00:00'
        service:
            source_field: service
            source_value: dce_rpc
            mapped_at: '2025-11-13T20:14:49.614598+00:00'
    detection_fields:
        -   source_field: operation
            target_table: network_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-13T20:14:50.397286+00:00'
