id: 53389db6-ba46-48e3-a94c-e0f2cefe1583
title: MITRE BZAR Indicators for Persistence
status: test
level: medium
description: Windows DCE-RPC functions which indicate a persistence techniques on
    the remote system. All credit for the Zeek mapping of the suspicious endpoint/operation
    field goes to MITRE.
author: '@neu5ron, SOC Prime'
date: '2020-03-19'
modified: '2021-11-27'
tags:
    - attack.persistence
    - attack.t1547.004
references:
    - https://github.com/mitre-attack/bzar#indicators-for-attck-persistence
falsepositives:
    - Windows administrator tasks or troubleshooting
    - Windows management scripts or software
taxonomy: sigma
logsource:
    product: zeek
    service: dce_rpc
detection:
    op1:
        endpoint: spoolss
        operation: RpcAddMonitor
    op2:
        endpoint: spoolss
        operation: RpcAddPrintProcessor
    op3:
        endpoint: IRemoteWinspool
        operation: RpcAsyncAddMonitor
    op4:
        endpoint: IRemoteWinspool
        operation: RpcAsyncAddPrintProcessor
    op5:
        endpoint: ISecLogon
        operation: SeclCreateProcessWithLogonW
    op6:
        endpoint: ISecLogon
        operation: SeclCreateProcessWithLogonExW
    condition: 1 of op*
ocsf_mapping:
    class_name: process_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: zeek
            mapped_at: '2025-11-26T02:15:12.948072+00:00'
        service:
            source_field: service
            source_value: dce_rpc
            mapped_at: '2025-11-26T02:15:12.948072+00:00'
    detection_fields:
        -   source_field: endpoint
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:15:14.305297+00:00'
        -   source_field: operation
            target_table: process_activity
            target_field: <UNMAPPED>
            mapped_at: '2025-11-26T02:15:14.305336+00:00'
