title: Transferring Files with Credential Data via Network Shares - Zeek
id: 2e69f167-47b5-4ae7-a390-47764529eff5
status: test
level: medium
author: '@neu5ron, Teymur Kheirkhabarov, oscd.community'
description: Transferring files with well-known filenames (sensitive files with credential
    data) using network shares
references:
    - https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
falsepositives:
    - Transferring sensitive files for legitimate administration work by legitimate
        administrator
tags:
    - attack.credential-access
    - attack.t1003.002
    - attack.t1003.001
    - attack.t1003.003
date: '2020-04-02'
modified: '2021-11-27'
logsource:
    product: zeek
    service: smb_files
detection:
    selection:
        name:
            - \mimidrv
            - \lsass
            - \windows\minidump\
            - \hiberfil
            - \sqldmpr
            - \sam
            - \ntds.dit
            - \security
    condition: selection
related:
    -   id: 910ab938-668b-401b-b08c-b596e80fdca5
        type: similar
ocsf_mapping:
    class_name: file_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: zeek
            mapped_at: '2025-12-04T01:35:16.880885+00:00'
        service:
            source_field: service
            source_value: smb_files
            mapped_at: '2025-12-04T01:35:16.880885+00:00'
    detection_fields:
        -   source_field: name
            target_table: file_activity
            target_field: file.name
            mapped_at: '2025-12-04T01:35:16.880900+00:00'
