title: OMIGOD HTTP No Authentication RCE
id: ab6b1a39-a9ee-4ab4-b075-e83acf6e346b
status: stable
level: high
author: Nate Guagenti (neu5ron)
description: 'Detects the exploitation of OMIGOD (CVE-2021-38647) which allows remote
    execute (RCE) commands as root with just a single unauthenticated HTTP request.

    Verify, successful, exploitation by viewing the HTTP client (request) body to
    see what was passed to the server (using PCAP).

    Within the client body is where the code execution would occur. Additionally,
    check the endpoint logs to see if suspicious commands or activity occurred within
    the timeframe of this HTTP request.

    '
references:
    - https://www.wiz.io/blog/omigod-critical-vulnerabilities-in-omi-azure
    - https://twitter.com/neu5ron/status/1438987292971053057?s=20
fields:
    - id.orig_h
    - id.resp_h
    - id.resp_p
    - status_code
    - method
    - uri
    - request_body_len
    - response_body_len
    - user_agent
falsepositives:
    - Exploits that were attempted but unsuccessful.
    - Scanning attempts with the abnormal use of the HTTP POST method with no indication
        of code execution within the HTTP Client (Request) body. An example would
        be vulnerability scanners trying to identify unpatched versions while not
        actually exploiting the vulnerability. See description for investigation tips.
tags:
    - attack.privilege-escalation
    - attack.initial-access
    - attack.execution
    - attack.lateral-movement
    - attack.t1068
    - attack.t1190
    - attack.t1203
    - attack.t1021.006
    - attack.t1210
date: '2021-09-20'
modified: '2019-09-20'
logsource:
    product: zeek
    service: http
    definition: Enable the builtin Zeek script that logs all HTTP header names by
        adding "@load policy/protocols/http/header-names" to your local.zeek config
        file. The script can be seen here for reference https://github.com/zeek/zeek/blob/d957f883df242ef159cfd846884e673addeea7a5/scripts/policy/protocols/http/header-names.zeek
detection:
    selection:
        status_code: 200
        uri: /wsman
        method: POST
    auth_header:
        client_header_names|contains: AUTHORIZATION
    too_small_http_client_body:
        request_body_len: 0
    condition: selection and not auth_header and not too_small_http_client_body
ocsf_mapping:
    class_name: http_activity
    activity_id: 6
    logsource:
        product:
            source_field: product
            source_value: zeek
            mapped_at: '2025-12-04T01:35:08.797147+00:00'
        service:
            source_field: service
            source_value: http
            mapped_at: '2025-12-04T01:35:08.797147+00:00'
    detection_fields:
        -   source_field: status_code
            target_table: http_activity
            target_field: http_response.code
            mapped_at: '2025-12-04T01:35:08.797163+00:00'
        -   source_field: uri
            target_table: http_activity
            target_field: http_request.url
            mapped_at: '2025-12-04T01:35:08.797165+00:00'
        -   source_field: method
            target_table: http_activity
            target_field: http_request.http_method
            mapped_at: '2025-12-04T01:35:08.797166+00:00'
        -   source_field: client_header_names
            target_table: http_activity
            target_field: http_request.http_headers.name
            mapped_at: '2025-12-04T01:35:08.797167+00:00'
        -   source_field: request_body_len
            target_table: http_activity
            target_field: http_request.body_length
            mapped_at: '2025-12-04T01:35:08.797168+00:00'
