title: Executable from Webdav
id: aac2fd97-bcba-491b-ad66-a6edf89c71bf
status: test
level: medium
author: SOC Prime, Adam Swan
description: Detects executable access via webdav6. Can be seen in APT 29 such as
    from the emulated APT 29 hackathon https://github.com/OTRF/detection-hackathon-apt29/
references:
    - http://carnal0wnage.attackresearch.com/2012/06/webdav-server-to-download-custom.html
    - https://github.com/OTRF/detection-hackathon-apt29
falsepositives:
    - Unknown
tags:
    - attack.command-and-control
    - attack.t1105
date: '2020-05-01'
modified: '2021-11-27'
logsource:
    product: zeek
    service: http
detection:
    selection_webdav:
        c-useragent|contains: WebDAV
        c-uri|contains: webdav
    selection_executable:
        resp_mime_types|contains: dosexec
        c-uri|endswith: .exe
    condition: selection_webdav and selection_executable
ocsf_mapping:
    class_name: http_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: zeek
            mapped_at: '2025-12-04T01:35:12.426621+00:00'
        service:
            source_field: service
            source_value: http
            mapped_at: '2025-12-04T01:35:12.426621+00:00'
    detection_fields:
        -   source_field: c-useragent
            target_table: http_activity
            target_field: http_request.user_agent
            mapped_at: '2025-12-04T01:35:12.426634+00:00'
        -   source_field: c-uri
            target_table: http_activity
            target_field: http_request.url
            mapped_at: '2025-12-04T01:35:12.426636+00:00'
        -   source_field: resp_mime_types
            target_table: http_activity
            target_field: http_response.content_type
            mapped_at: '2025-12-04T01:35:12.426637+00:00'
