title: Suspicious Access to Sensitive File Extensions - Zeek
id: 286b47ed-f6fe-40b3-b3a8-35129acd43bc
status: test
level: medium
author: Samir Bousseaden, @neu5ron
description: Detects known sensitive file extensions via Zeek
references:
    - Internal Research
falsepositives:
    - Help Desk operator doing backup or re-imaging end user machine or backup software
    - Users working with these data types or exchanging message files
tags:
    - attack.collection
date: '2020-04-02'
modified: '2021-11-27'
logsource:
    product: zeek
    service: smb_files
detection:
    selection:
        name|endswith:
            - .pst
            - .ost
            - .msg
            - .nst
            - .oab
            - .edb
            - .nsf
            - .bak
            - .dmp
            - .kirbi
            - \groups.xml
            - .rdp
    condition: selection
related:
    -   id: 91c945bc-2ad1-4799-a591-4d00198a1215
        type: derived
ocsf_mapping:
    class_name: file_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: zeek
            mapped_at: '2025-12-04T01:35:09.465515+00:00'
        service:
            source_field: service
            source_value: smb_files
            mapped_at: '2025-12-04T01:35:09.465515+00:00'
    detection_fields:
        -   source_field: name
            target_table: file_activity
            target_field: file.name
            mapped_at: '2025-12-04T01:35:09.465542+00:00'
