id: a8322756-015c-42e7-afb1-436e85ed3ff5
title: DNS TOR Proxies
status: test
level: medium
description: Identifies IPs performing DNS lookups associated with common Tor proxies.
author: Saw Winn Naung , Azure-Sentinel
date: '2021-08-15'
modified: '2022-10-09'
tags:
    - attack.exfiltration
    - attack.t1048
references:
    - https://github.com/Azure/Azure-Sentinel/blob/f99542b94afe0ad2f19a82cc08262e7ac8e1428e/Detections/ASimDNS/imDNS_TorProxies.yaml
fields:
    - clientip
falsepositives:
    - Unknown
taxonomy: sigma
logsource:
    product: zeek
    service: dns
detection:
    selection:
        query:
            - tor2web.org
            - tor2web.com
            - torlink.co
            - onion.to
            - onion.ink
            - onion.cab
            - onion.nu
            - onion.link
            - onion.it
            - onion.city
            - onion.direct
            - onion.top
            - onion.casa
            - onion.plus
            - onion.rip
            - onion.dog
            - tor2web.fi
            - tor2web.blutmagie.de
            - onion.sh
            - onion.lu
            - onion.pet
            - t2w.pw
            - tor2web.ae.org
            - tor2web.io
            - tor2web.xyz
            - onion.lt
            - s1.tor-gateways.de
            - s2.tor-gateways.de
            - s3.tor-gateways.de
            - s4.tor-gateways.de
            - s5.tor-gateways.de
            - hiddenservice.net
    condition: selection
ocsf_mapping:
    class_name: dns_activity
    activity_id: 1
    logsource:
        product:
            source_field: product
            source_value: zeek
            mapped_at: '2025-11-26T02:15:06.386396+00:00'
        service:
            source_field: service
            source_value: dns
            mapped_at: '2025-11-26T02:15:06.386396+00:00'
    detection_fields:
        -   source_field: query
            target_table: dns_activity
            target_field: query.hostname
            mapped_at: '2025-11-26T02:15:06.386412+00:00'
