title: Possible Impacket SecretDump Remote Activity - Zeek
id: 92dae1ed-1c9d-4eff-a567-33acbd95b00e
status: test
level: high
author: Samir Bousseaden, @neu5ron
description: Detect AD credential dumping using impacket secretdump HKTL. Based on
    the SIGMA rules/windows/builtin/win_impacket_secretdump.yml
references:
    - https://web.archive.org/web/20230329153811/https://blog.menasec.net/2019/02/threat-huting-10-impacketsecretdump.html
falsepositives:
    - Unknown
tags:
    - attack.credential-access
    - attack.t1003.002
    - attack.t1003.004
    - attack.t1003.003
date: '2020-03-19'
modified: '2021-11-27'
logsource:
    product: zeek
    service: smb_files
detection:
    selection:
        path|contains|all:
            - \
            - ADMIN$
        name|contains: SYSTEM32\
        name|endswith: .tmp
    condition: selection
ocsf_mapping:
    class_name: file_activity
    activity_id: <UNMAPPED>
    logsource:
        product:
            source_field: product
            source_value: zeek
            mapped_at: '2025-12-04T01:35:14.115824+00:00'
        service:
            source_field: service
            source_value: smb_files
            mapped_at: '2025-12-04T01:35:14.115824+00:00'
    detection_fields:
        -   source_field: path
            target_table: file_activity
            target_field: file.path
            mapped_at: '2025-12-04T01:35:14.115845+00:00'
        -   source_field: name
            target_table: file_activity
            target_field: file.name
            mapped_at: '2025-12-04T01:35:14.115847+00:00'
